[{"date": "2018-10-17", "url": "http://defenseone.com/technology/2018/10/chinas-moon-missions-could-threaten-us-satellites-pentagon/152084/?oref=d-dontmiss", "content": "China's Moon Missions Could Threaten US Satellites: Pentagon By Patrick Tucker Technology Editor Read bio October 16, 2018 Topics China Space BOEING A A Font size + Print A concept of an orbital moon station from Boeing. Facebook Twitter LinkedIn Email this article By Patrick Tucker Technology Editor Read bio October 16, 2018 A satellite on the far side of the moon might not be quite what the Chinese say, Air Force official warns. China's lunar probes may one day threaten critical U.S. satellites, said one of the military's top experts on space threats. \"We've seen [reports] in open press...that say the Chinese have a relay satellite flying around...the flipside of the moon. That's very telling to us,\" Jeff Gossel, the senior intelligence engineer in the Space and Missile Analysis Group at the Air Force's National Air and Space Intelligence Center, said at an Air Force Association event on Friday. In May, China launched the Chang' e 4 lunar relay satellite on an unusual trajectory: a lunar swing-by that pulled the satellite in a wide arc before settling it into a \"parking orbit\" at Lagrangian 2 on the moon's far side. The Chinese government has said the mission is part of a four-stage plan to build a moon base. \"We hope to start the construction of the [robot-manned] lunar base around 2025 and realize a manned landing on the moon around 2030,\" Zhao Xiaojin of the China Aerospace Science and Technology Group told Xinhuanet in March. Subscribe Receive daily email updates: Subscribe to the Defense One daily. Be the first to receive updates. But Gossel said putting a satellite at L2 could also enable Chinese attack spacecraft to zoom past the moon--about a quarter-million miles away--and then sneak up on critical U.S. intelligence and communications satellites in geosynchronous orbit, just 28,300 miles up--as occurred in the 2011 apocalypse-themed film \"Melancholia .\" A dipiction of a lunar swing-by trajectory, courtesy of NASA \"You could fly some sort of a weapon around the moon and it comes back--it could literally come at [objects] in GEO...and we would never know because there is nothing watching in that direction,\" he said. \"Why do you need a relay satellite flying around L2? So you can communicate with something that's going to land on the other side of the moon--or so you can fly around the other side of the moon? And what would that mean for our assets at GEO?\" <mark>Michael Griffin</mark>, defense undersecretary for research and engineering, has been pushing for a more robust response to threats against U.S. assets in space. It's one reason he and others want to move away from big, easily targetable satellites in GEO toward large constellations of small, cheap ones in low-earth orbit. \"China and Russia now have the capability to go after\" intelligence and communications satellites in GEO, <mark>Griffin</mark> told reporters in August. \"Those assets are what we use for communication and reconnaissance and missile warning and position, timing and navigation, a whole bunch of features that we use for war fighting .\" Gossel said that the actual threat from lunar satellites like the Chang' e 4 is very small--but that it's his job to be a bit \"paranoid\" and seriously think about even highly unlikely threat scenarios. Brian Weeden, who directs program planning at the Secure World Foundation, argued that the possibility was too low to constitute a significant threat. \"I think speculating about military applications for China's lunar program is akin to Soviet concerns about the Space Shuttle being a potential weapon,\" Weeden said. \"There is a grain of truth behind the Shuttle being a space weapon and the Chinese lunar program having possible military applications. Doesn't mean either is reality, though .\" Still, Gossel said, the national-security community's interest in China's lunar activities is \"building steam .\" Stephen Kitay, deputy assistant defense secretary for space policy, as well as the office of the Director of National Intelligence have \"an interest in it,\" he said. \"That's where I come into play .\" Paulina Glass contributed to this post. Patrick Tucker is technology editor for Defense One. He's also the author of The Naked Future: What Happens in a World That Anticipates Your Every Move? (Current, 2014). Previously, Tucker was deputy editor for The Futurist for nine years. Tucker has written about emerging technology in Slate,...Full bio Facebook Twitter LinkedIn Email this article", "articleID": "2018111420_00099448_W", "names": {"Michael Griffin": ["Q16223638", "Q25352626", "Q42245847"]}}, {"date": "2018-11-18", "url": "http://www.redditchadvertiser.co.uk/sport/national/17231556.josh-van-der-flier-ireland-showed-new-zealand-they-will-not-be-bullied/", "content": "Ireland v New Zealand--Autumn International--Aviva Stadium 0 comments Ireland laid down a unique challenge to New Zealand's Haka to warn the All Blacks they could not be bullied, Josh Van Der Flier has revealed. <mark>Joe Schmidt</mark>'s Ireland toppled back-to-back world champions New Zealand 16-9 at the Aviva Stadium on Saturday, for just their second-ever win over the All Blacks. Ireland's players linked arms, and as New Zealand started their Haka, took one solitary step forward. Rory Best, left, and <mark>Joe Schmidt</mark>, right, have inspired Ireland's two triumphs over New Zealand (Brian Lawless/PA) Leinster flanker Van Der Flier admitted the symbolism of that move geed Ireland up, helping the hosts stop New Zealand scoring against a Test nation for the first time since facing France in 1995. Asked about the idea behind stepping towards the Haka, Van Der Flier replied: \"I think it just represented the fact we weren't going to take a backward step the whole game .\" That's what Rory Best said to us, we wanted to go after them, not step away, not accept being bullied by them. \"That was part of it and then I suppose it's a pretty special moment as a team all being together and watching something as historic as the Haka. So it's quite cool .\" You watch any game New Zealand play, they are incredibly physical, so we knew we had to come out and go after them. \"We knew we couldn't sit back, we went out to go after them and really put pressure on them .\" WOW! What support. What Supporters. What Noise! Thank You! #TeamOfUs #IREvNZL #GuinnessSeries #ShoulderToShoulder pic.twitter.com/dQMldCRKEe--Irish Rugby (@ IrishRugby) November 17, 2018 Jacob Stockdale bagged his 12th try in 14 Tests as Ireland backed up their maiden win over New Zealand, the 40-29 victory in Chicago in 2016. The Ulster powerhouse capped a stunning <mark>Joe Schmidt</mark> ruse, collecting his own punt to dot down after Johnny Sexton's cute switch with Bundee Aki. Rory Best produced a much-improved showing at hooker to sit alongside his Haka ruse, with Van Der Flier hailing the Ireland captain's all-round leadership qualities. \"Rory understands players very well; he'll put his arm around you, but will also know if you need a good talking to,\" said Van Der Flier. Rory Best shone against New Zealand (Paul Harding/PA) \"But mostly he's very softly spoken, but says exactly what needs to be said .\" He won't over-talk and he knows what's best for the team, and always gives his all for the team. \"When you see the performances he puts out and how much effort he puts in every week, and how he trains and everything, he's someone it's a privilege to follow .\" He's a massive competitor, incredibly competitive. And you see his work at the breakdown every week, he's brilliant. He puts in a shift every time and does his all. \"0 comments", "articleID": "2018111810_00164522_W", "names": {"Joe Schmidt": ["Q284169", "Q6280152"]}}, {"date": "2018-11-18", "url": "https://www.brecorder.com/2018/11/18/453421/govt-to-fulfill-all-promises-made-by-pti-fawad/", "content": "JHELUM: Minister for Information and Broadcasting Chaudhry Fawad Hussain Sunday said equal distribution of resources was crucial to make the country a welfare state and the incumbent PTI government would fulfill all the promises which the party had made with the people. Addressing a public gathering at Fatehpur (Jhelum), the minister said the Pakistan Tehreek-e-Insaf (PTI) government would provide all basic facilities to the masses as per the party's election manifesto. Lamenting over the attitude of previous governments, he said the common people were deprived of basic health and education facilities in the country while the children of former rulers used to study abroad and get medical treatment there. The schoolchildren in Pakistan, he said, did not have chairs to sit in classrooms with no English teachers, but those of the former rulers were studying in London. The rich even went abroad for treatment of minor diseases, he added. The minister said the farmers and common people of Jhelum and Domeli, which had historical significance, were struggling for their basic rights. Provision of clean drinking water and employment opportunities were their due rights like those of the main cities. The previous governments instead of giving priority to the basic issues, spent huge amounts on unnecessary projects like Orange Train and Metro Bus services, he added. Fawad said the people of Jhelum contributed billions of rupees to the national exchequer each year but the city was not getting its due right in development and welfare projects. He said funds of Rs 1,500 billion had been given to Balochistan in the past but there was not even a single well-equipped hospital in the province. Its people had to go to cities of other provinces to get treatment, he added. The minister said the attitude of opposition parties was not serious as they walked out of the parliament over the government's demand of accountability into corrupt practices committed during the last 10 years. \"They (opposition) claim that democracy is in danger when we stress for accountability into corruption of billions of rupees,\" he added. The government, he said, would, however, ensure accountability into embezzlement of billions of rupees--the money that actually belonged to the people of the country. \"Those having bikes before starting their political career are now owners of precious vehicles and they will be held accountable,\" he added. The minister said Prime Minister <mark>Imran Khan</mark> had always talked to strengthen the local government system in the country so that the public money could be spent for the welfare of common people and on improving the infrastructure at the grassroots level. Fawad said the government was committed to introduce such a local government system where the public funds would be utilized for the welfare and betterment of the masses. It was the government's responsibility to take steps for the uplift of remote areas, which was only possible through a vibrant local government system, he added. Member of the National Assembly Chaudhry Farrukh Altaf, members of the Punjab Assembly Raja Yawar Kamal and Sameera Javed, and notables of the area, including Raja Muhammad Munawer, were also present on the occasion. They briefed the minister about the issues being faced by the people of the area. The minister assured to resolve the problems on priority basis as the government would spend each and every penny from the public exchequer on the welfare of people. Copyright APP (Associated Press of Pakistan), 2018 Post Views: 20 Share on Facebook Share Share on Twitter Tweet Share on Google Plus Share Share on Pinterest Share Share on LinkedIn Share Share on Digg Share Chaudhry Fawad Hussain PTI Related Articles Politics & Policy November 15, 2018 Govt to take assassination of SP Dawar to logical conclusion: Afridi Politics & Policy November 12, 2018 Senate chairman refers private members bills to committees Politics & Policy November 10, 2018 Senate bye-election on two seats to be held on Nov 15", "articleID": "2018111816_00445853_W", "names": {"Imran Khan": ["Q155164", "Q15987686", "Q1660487", "Q17306146", "Q18351186", "Q18619306", "Q18637473", "Q18637525", "Q18637527", "Q18649030", "Q18687912", "Q18687913", "Q18687915", "Q18687916", "Q21061850", "Q27951129", "Q312781", "Q42560214", "Q43384689", "Q50064378", "Q51161844", "Q57064458", "Q59198528", "Q6008185", "Q6008187"]}}, {"date": "2018-11-19", "url": "https://www.knoe.com/content/news/Estimate-Nearly-50-of-cellphone-calls-in-2019-will-be-robocalls-500837212.html", "content": "(CBS NEWS) - It is estimated that by early next year, nearly 50 percent of all the calls you get on your cellphone will be robocalls. Last month alone, more than five billion robocalls were made. Lawmakers last week proposed bipartisan legislation to fine scam robocallers up to $10,000 per call; and the FCC is demanding telecommunications companies lay out their plans to meet new standards, so that scam calls can be identified and stopped. CBS News asked major companies what they're doing to stop illegal robocallers and one, T-Mobile, offered to show us. As FCC demands telecom companies to meet new standards, T-Mobile introduces new technologies to screen and block robocalls. CBS NEWS T-Mobile's programs to stop robocalls begin in a lab packed with computer servers. \"This is where we test everything that we put into our network,\" said company vice president Grant Castle. From that noisy room came T-Mobile's Scam ID program. It alerts customers to problem calls they won't want to pick up. \"Although the caller is going to use a phone number close to mine, I'm still going to know it's a scam,\" Castle told correspondent Anna Werner. \"I knew the phone number, I could see it was a scam, so I can send it away .\" Castle believes T-Mobile is ahead of its competitors, and the robocallers. \"Every time we make an improvement, the scammers make a change. So, it's an arms race to see who can trick who,\" he said. And the arms race is escalating: \"The scammers are trying new technologies, new ways to scam people. So, we're upping our technology to keep up with them .\" Customers can use the Scam ID feature to screen unfamiliar calls, or block them completely. And this week, T-Mobile is launching a new app, Name ID, that will allow users to choose the type of call they want to block--everything from nuisance calls, to political or charity calls, even prison calls. \"With this new app, customers have better control over what they would like to see, and what they don't want to see,\" said Castle. But the FCC is also pushing companies to meet new standards known by the acronym SHAKEN/STIR. (SHAKEN = Signature-based Handling of Asserted information using toKENs. STIR = Secure Telephone Identity Revisited .) They would allow carriers to verify calls with a digital fingerprint, to show that the person making the call and the person receiving the call are who they say they are, not a scammer trying to \"spoof\" or imitate a phone number. Castle said, \"The standard is essentially, two operators have certificates or tokens that they exchange with each other in each call, and more or less it just says I am who I am .\" T-Mobile says it's ready, and other major carriers say they're working on it. But others apparently are not: in letters the FCC asked them why not, and gave all 14 companies until today to detail their plans to the agency. As FCC chairman <mark>Ajit Pai</mark> told \"CBS This Morning\" in March, \"For those things that are within our authority, we're pursuing them very aggressively .\" But in order for that plan to work, all carriers have to get on board. And industry expert Aaron Foss said, even if that happens, \"scammers are going to go where they can find victims .\" Foss founded Nomorobo, a robocall-blocking app for phones. He says those new SHAKEN/STIR standards are good, up to a point. \"But what it doesn't do is, it doesn't say if that call is legal,\" said Foss. \"It doesn't say anything about the content. It just says that that number is allowed to be called. So, it will stop what is called\" neighbor spoofing,' but it's absolutely not going to solve the whole robocall problem. \"Which is why Foss says Nomorobo takes an\" editorial \"approach to robocalls--blocking them entirely .\" A lot of the other competitors are labeling it or saying things like \"spam likely,'\" scam likely,' \"telemarketer .' We know that consumers just don't want the phone to even ring, and that's what we're doing,\" said Foss. Nomorobo and T-Mobile's Name ID app both have a small monthly fee. CBS News reached out to all 14 phone carriers that received a letter from the FCC. The majority responded and said they will tell the FCC today what they are preparing to do to adopt the new call authentication system in 2019. Whether the carriers will all be able to deploy the system in 2019 remains to be seen. © 2018 CBS Interactive Inc.. All Rights Reserved.", "articleID": "2018111916_00273944_W", "names": {"Ajit Pai": ["Q3528364", "Q4699790"]}}, {"date": "2018-11-20", "url": "https://hiphopwired.com/784409/snoop-dogg-thinks-deez-nuts-should-be-next-to-get-hollywood-walk-of-fame-star/", "content": "Source: Albert L. Ortega / Getty Snoop Dogg is now one of over 2,000 stars to have their names immortalized by way of the Hollywood Walk Of Fame. After the ceremony, the D-O Double G informed the masses of who he believes should be the next recipient of a Walk Of Fame star. TMZ reports: The rapper was joined by Dr. Dre, <mark>Jimmy Kimmel</mark> and record producer <mark>Quincy Jones</mark> for the ceremony in front of the El Capitan Theater on Hollywood Boulevard. The Doggfather's star is No. 2,651 in the history of the Walk, which has been around since 1960. We got Snoop after the ceremony and he didn't have a whole lot to say about getting the plaque...but had an interesting suggestion on who should get a star next...and they come in a pair. Without a doubt, Snoop Dogg has enjoyed one of Hip-Hop's most interesting career arcs. With 16 studio albums, over two dozen mixtapes, and a handful of collaborative projects, Uncle Snoop has cemented his place in the annals of Hip-Hop and music in general. Beyond his usual fare, he's also become something of a media and content maverick by way of hosting game shows, his cookbook, and hosting a show alongside his unlikely co-host, <mark>Martha Stewart</mark>. Snoop also returned to the charts as a featured artist on Lil Duval's smash hit \"Smile (Living My Best Life)\" as well. Check out the clip below where Snoop Dogg hits TMZ with one of the oldest hood jokes in the world .--Photo: Getty Hollywood Walk of Fame, newsletter, snoop dogg", "articleID": "2018112015_00009244_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"], "Martha Stewart": ["Q234606", "Q523013"], "Quincy Jones": ["Q193645", "Q25190073"]}}, {"date": "2018-11-20", "url": "http://www.croydonguardian.co.uk/sport/national/17236387.jonny-bairstow-still-playing-for-keeps-but-willing-to-do-what-is-asked-of-him/", "content": "Jonny Bairstow is hoping to get back in England's Test team 0 comments Jonny Bairstow is not ready to give up his wicketkeeping aspirations but will throw himself into any role that gets him back in England's Test team. Bairstow arrived in Sri Lanka as undisputed first-choice gloveman only for an untimely ankle injury to open the door for Ben Foakes in Galle. The Surrey man took it in style, scoring a debut century and producing an effortlessly smooth performance behind the stumps which saw Bairstow overlooked for the series-clinching win in Kandy despite being passed fit. Could watch Ben Foakes keep all day! #SLvENG @ SkyCricket--<mark>Sarah Taylor</mark> (@ Sarah_Taylor30) November 15, 2018 Head coach Trevor Bayliss has already suggested Foakes can expect an extended run in the team but Bairstow, having worked tirelessly to improve his keeping in recent years, is not going to meekly stand aside from a role he treasures. \"You don't want to accept that, do you? You don't know what's round the corner, so I'm working on both my primary skills, like I have done over the last three years,\" he said. \"It was only three Tests ago I was in the top 10 batters in the world and then you're not playing. But if we want to push each other, and push other teams around the world, then that competition is really good for us, because we're going to be striving to be better, striving to score more runs, striving to be a better keeper, to take better catches. Jonny Bairstow was not picked in the second Test (Steven Paston/PA)\" Naturally, you're going to be disappointed, but it's about how you manage that disappointment. That's part and parcel of touring, of professional sport. \"You react by going away, working hard, training hard and doing the right things around the guys, because you don't want to be going around sulking, not helping the lads out .\" In the short term, Bairstow's best chance of returning to the team is as a top-order specialist. He already plays a similar role in the one-day side and has played 18 of his 59 Tests as a non-keeping batsman. Boy can bat. #SRIvENG #BenFoakes pic.twitter.com/9VnKuyt1Fo--Gray-Nicolls?? (@ graynics) November 16, 2018 There has been speculation he could find a home in the problem position of number three, which has already been filled by Joe Root, Moeen Ali and Ben Stokes this year. Bairstow does not appear to covet the spot but is a flexible cricketer who has answered several different calls over the years. \"We've got to cross that bridge when we come to it. But in all of the challenges that have been out in front of me, I'd like to think I've recognised them and hopefully combated them in many ways,\" he said. Bairstow has established himself as a big-hitter in one-day cricket (David Davies/PA) \"People said about opening the batting in one-day cricket--can you do it?--let's give it a whirl and see how you go. Can you bat at five? Can you bat at five and keep wicket? Can you bat at seven and keep wicket? It's still going now .\" Whatever the circumstances, it's not something I've done a massive amount of, but coming in against the second new ball, you're doing the same thing there. I might just have to leave a few more balls. \"That he is debating how and where he might slot back into the team on Friday in Colombo is something of a triumph in itself. He is already considerably ahead of schedule in terms of fitness, and admits he briefly feared an even more serious lay-off .\" I thought I'd broken my ankle, \"he admitted .\" I've not told everyone how bad I did it. Everything goes through your mind in those two or three minutes. You don't know the extent of things when you do them straightaway. To be back fit ahead of the second Test, and to be available for that game, was good going. \"0 comments", "articleID": "2018112018_00129721_W", "names": {"Sarah Taylor": ["Q21456568", "Q27050698", "Q3527116", "Q44741854", "Q52644620", "Q57414123", "Q7422821", "Q9333844"]}}, {"date": "2018-11-20", "url": "https://www.adweek.com/tvnewser/chris-wallace-shares-his-thanksgiving-moderating-tips-in-a-funny-segment-for-the-late-show/385204", "content": "We have published a good deal of <mark>Chris Wallace</mark> - related content on this site recently, and here's a worthy addition. The Fox News anchor--who appeared on The Late Show with Stephen Colbert earlier this month--taped a segment released yesterday on YouTube titled, \"Thanksgiving Moderating Tips with <mark>Chris Wallace</mark>.\" In it, the 2016 presidential debate moderator shares his tips on how to properly moderate a Thanksgiving dinner. <mark>Wallace</mark> introduces himself by saying, \"You may know me from your parents' TV when you go home to do laundry,\" and then proceeds to deliver his tips without breaking. Nothing like a little mid-afternoon humor on a Tuesday! WATCH: Comments", "articleID": "2018112020_00068179_W", "names": {"Chris Wallace": ["Q21256789", "Q2964884", "Q2964885", "Q37624906", "Q5108402", "Q5108404"]}}, {"date": "2018-11-21", "url": "http://willandgrace.wikia.com/wiki/Will_Works_Out?diff=15150&oldid=13602", "content": "Revision as of 11:39, August 9, 2018 (view source) NeverInNeverland (wall | contribs) ← Older edit Latest revision as of 04:08, November 21, 2018 (view source) Eddvaldez (wall | contribs) (→ Cultural references) (2 intermediate revisions by one user not shown) Line 1: Line 1: {{Episode_Infobox | title1 = Will Works Out | episode = 1.19 | written_by = [[Michael Patrick King]] & [[Tracy Poust]] & [[Jon Kinnally]] | directed_by = [[James Burrows]] | original_network = NBC | original_airdate = April 22, 1999 | previous = [[Grace, Replaced]] | next = [[Saving Grace]] | image1 = Vlcsnap-2017-04-11-10h19m47s210. png}} {{Episode_Infobox | title1 = Will Works Out | episode = 1.19 | written_by = [[Michael Patrick King]] & [[Tracy Poust]] & [[Jon Kinnally]] | directed_by = [[James Burrows]] | original_network = NBC | original_airdate = April 22, 1999 | previous = [[Grace, Replaced]] | next = [[Saving Grace]] | image1 = Vlcsnap-2017-04-11-10h19m47s210. png}} \"\"Will Works Out\" ' is the 19th episode of the [[Season 1 | first season]]. \"\"Will Works Out\" ' is the 19th episode of the [[Season 1 | first season]]. + + [[Jack]] overhears [[Will]] describe him as a \"[https: //en.wikipedia.org/wiki/Faggot_ (slang) fag]\". [[<mark>Karen</mark>]] and [[Grace]] spend a girls night for the first time. = = Synopsis = = = = Synopsis = = − [[Will]] invites [[Jack]] to his gym on a \"buddy pass,\" but when he expresses his embarrassment to [[Grace]] over his buddy's gay behavior, Jack overhears the comments and looks to set him straight about prejudice. Meanwhile, Grace continues to lend her ear when <mark>Karen</mark>'s marriage hits rocky ground and she and [[<mark>Karen</mark>]] share an evening of girl talk. = = Cast = = = = Cast = = Line 18: Line 19: = = Notes = = = = Notes = = − * \"[[Alley Cats]]\" was originally scheduled to be shown, but was swapped at the last minute with \"Will Works Out .\" + * The episode [[Alley Cats]] was originally scheduled to be shown, but was swapped at the last minute with this episode. − * The slur Will uses to describe Jack has a polarizing effect, although the same word is reused numerous times throughout the rest of the series. + * In this episode, Will implies that he came out in 1982. Jack also mentions that he first had a gay experience \"at sleep-away camp\" in 1978. However, it is shown in the flashback in the episode [[Lows in the Mid-Eighties]] that Will actually came out in 1985 during his freshman year in college. + * At the start of their girls night, Grace mentions that she has a copy of the 1998 film [https: //en.wikipedia.org/wiki/Hope_Floats Hope Floats] which stars [[Harry Connick, Jr.]] Connick eventually appears as Grace's future husband [[Leo Markus | Leo]]. + + = = Cultural references = = + * Will and Grace are \"shocked\" to see an episode of [https: //en.wikipedia.org/wiki/Intimate_Portrait Intimate Portrait] featuring former teen actress [https: //en.wikipedia.org/wiki/Molly_Ringwald Molly Ringwald]. + * At the gym, Will refers to Jack as \"swish-burger\" , a play on Swiss burger and the term \"swish\" , a slang for an effeminate man. + * The Mikado + * When Will first hears of the jock block, he claims he does not speak \"pidgin homo\" + * While making a point to Will, Jack mentions the sayings \"a rolling\" stone \"gathers no moss\" and \"you can lead a horse to water but you can't make him drink\" , but replaced \"stone\" and \"horse\" with \"fag\". + * In affirming his pride in who he is, Jack says, \"I am what I am\" and Will rhetorically asks if that makes him the gay [https: //en.wikipedia.org/wiki/Popeye Popeye]. This is a reference to Popeye's catchphrase (and song) \"I yam what I yam, and that's all what I yam\". + * Princess of Tides after the 1991 film [https: //en.wikipedia.org/wiki/The_Prince_of_Tides The Prince of Tides]. + * While trying to explain how they switched clothes, <mark>Karen</mark> says \"bibbity-bobbity-boob\" , a reference to [https: //en.wikipedia.org/wiki/Cinderella_ (2015_Disney_film) Cinderella's] fairy godmother who says something similar thing when she magically fixes Cinderella's dress. + * Sufferin' sappho = = Quotes = = = = Quotes = = − {{Multi-line Quote | Character 1 = Jack | Line 1 = I got busted at the gym. | Character 2 = Will | Line 2 = For what? Feeling something other than the burn? | Character 3 = | Line 3 = | Character 4 = | Line 4 = | Episode =}} + {{Multi-line Quote | Character 1 = Jack | Line 1 = I got busted at the gym. | Character 2 = Will | Line 2 = For what? Feeling something <i> other </ i> than the burn? | Character 3 = | Line 3 = | Character 4 = | Line 4 = | Episode =}} {{Single-line Quote | Quote = I have to work out. I come from a very fat family. We store more fat than otters. | Character = Jack}} {{Single-line Quote | Quote = Let's work out during the day, buddy. Unemployed guys are so much hotter. | Character = Jack}} {{Multi-line Quote | Character 1 = Will | Line 1 = This is not like your old gym. Look around. Nary a nipple ring in sight. No men in Flashdance collars. And behold: women! | Character 2 = Jack | Line 2 = There were women at my old gym. | Character 3 = Will | Line 3 = Not on their birth certificate .}} {{Single-line Quote | Quote = Somebody's sports bra's a little snug. | Character = Jack}} {{Multi-line Quote | Character 1 = Jack | Line 1 = Shielding a desirable carcass from a much hotter vulture. | Character 2 = Will | Line 2 = See, this is what happens when you watch Wild Kingdom and gay porn with picture in picture. | Context = discussing the jock block}} {{Single-line Quote | Quote = It can't be National Butch Day, 'cause the banks are still open. | Character = Will}} {{Single-line Quote | Quote = I'd rather be a fag than afraid. | Character = Jack}} {{Single-line Quote | Quote = Sometimes the things we don't like in others are the things we really don't like in ourselves. | Character = Grace}} {{Multi-line Quote | Character 1 = <mark>Karen</mark> | Line 1 = My mother told me never to show up empty-handed, but I didn't have time to shop, so...Here's a dozen shares of G.E. | Character 2 = Grace | Line 2 = Great. I'll go put them in water .}} [[Category: Episodes]] − [[Category: Episodes]] [[Category: Season 1]] [[Category: Season 1]] Latest revision as of 04:08, November 21, 2018 Will Works Out Episode 1.19 Written by Michael Patrick King & Tracy Poust & Jon Kinnally Directed by James Burrows Will Works Out is the 19th episode of the first season. Jack overhears Will describe him as a \"fag\". <mark>Karen</mark> and Grace spend a girls night for the first time. Contents [show] Synopsis Edit Cast Edit Main Edit <mark>Eric McCormack</mark> (Will Truman) Debra Messing (Grace Adler) <mark>Sean Hayes</mark> (Jack McFarland) Megan Mullally (<mark>Karen Walker</mark>) Guest Edit <mark>Ben Reed</mark> (Richard Keller) Vanessa Giorgio (Woman) Notes Edit The episode Alley Cats was originally scheduled to be shown, but was swapped at the last minute with this episode. In this episode, Will implies that he came out in 1982. Jack also mentions that he first had a gay experience \"at sleep-away camp\" in 1978. However, it is shown in the flashback in the episode Lows in the Mid-Eighties that Will actually came out in 1985 during his freshman year in college. At the start of their girls night, Grace mentions that she has a copy of the 1998 film Hope Floats which stars Harry Connick, Jr.. Connick eventually appears as Grace's future husband Leo. Cultural references Edit Will and Grace are \"shocked\" to see an episode of Intimate Portrait featuring former teen actress Molly Ringwald. At the gym, Will refers to Jack as \"swish-burger\" , a play on Swiss burger and the term \"swish\" , a slang for an effeminate man. The Mikado When Will first hears of the jock block, he claims he does not speak \"pidgin homo\" While making a point to Will, Jack mentions the sayings \"a rolling stone gathers no moss\" and \"you can lead a horse to water but you can't make him drink\" , but replaced \"stone\" and \"horse\" with \"fag\". In affirming his pride in who he is, Jack says, \"I am what I am\" and Will rhetorically asks if that makes him the gay Popeye. This is a reference to Popeye's catchphrase (and song) \"I yam what I yam, and that's all what I yam\". Princess of Tides after the 1991 film The Prince of Tides. While trying to explain how they switched clothes, <mark>Karen</mark> says \"bibbity-bobbity-boob\" , a reference to Cinderella's fairy godmother who says something similar thing when she magically fixes Cinderella's dress. Sufferin' sappho Quotes Edit Jack: I got busted at the gym. Will: For what? Feeling something other than the burn? I have to work out. I come from a very fat family. We store more fat than otters .--Jack Let's work out during the day, buddy. Unemployed guys are so much hotter .--Jack Will: This is not like your old gym. Look around. Nary a nipple ring in sight. No men in Flashdance collars. And behold: women! Jack: There were women at my old gym. Will: Not on their birth certificate. Somebody's sports bra's a little snug .--Jack Jack: Shielding a desirable carcass from a much hotter vulture. Will: See, this is what happens when you watch Wild Kingdom and gay porn with picture in picture .--discussing the jock block It can't be National Butch Day, 'cause the banks are still open .--Will I'd rather be a fag than afraid .--Jack Sometimes the things we don't like in others are the things we really don't like in ourselves .--Grace <mark>Karen</mark>: My mother told me never to show up empty-handed, but I didn't have time to shop, so...Here's a dozen shares of G.E. Grace: Great. I'll go put them in water. Retrieved from \"http: //willandgrace.wikia.com/wiki/Will_Works_Out? oldid=15150\" Categories: Episodes Season 1", "articleID": "2018112104_00367417_W", "names": {"Ben Reed": ["Q50093923", "Q9653992"]}}]