[{"date": "2018-11-21", "url": "http://willandgrace.wikia.com/wiki/Will_Works_Out?diff=15150&oldid=13602", "content": "Revision as of 11:39, August 9, 2018 (view source) NeverInNeverland (wall | contribs) ← Older edit Latest revision as of 04:08, November 21, 2018 (view source) Eddvaldez (wall | contribs) (→ Cultural references) (2 intermediate revisions by one user not shown) Line 1: Line 1: {{Episode_Infobox | title1 = Will Works Out | episode = 1.19 | written_by = [[Michael Patrick King]] & [[Tracy Poust]] & [[Jon Kinnally]] | directed_by = [[James Burrows]] | original_network = NBC | original_airdate = April 22, 1999 | previous = [[Grace, Replaced]] | next = [[Saving Grace]] | image1 = Vlcsnap-2017-04-11-10h19m47s210. png}} {{Episode_Infobox | title1 = Will Works Out | episode = 1.19 | written_by = [[Michael Patrick King]] & [[Tracy Poust]] & [[Jon Kinnally]] | directed_by = [[James Burrows]] | original_network = NBC | original_airdate = April 22, 1999 | previous = [[Grace, Replaced]] | next = [[Saving Grace]] | image1 = Vlcsnap-2017-04-11-10h19m47s210. png}} \"\"Will Works Out\" ' is the 19th episode of the [[Season 1 | first season]]. \"\"Will Works Out\" ' is the 19th episode of the [[Season 1 | first season]]. + + [[Jack]] overhears [[Will]] describe him as a \"[https: //en.wikipedia.org/wiki/Faggot_ (slang) fag]\". [[<mark>Karen</mark>]] and [[Grace]] spend a girls night for the first time. = = Synopsis = = = = Synopsis = = − [[Will]] invites [[Jack]] to his gym on a \"buddy pass,\" but when he expresses his embarrassment to [[Grace]] over his buddy's gay behavior, Jack overhears the comments and looks to set him straight about prejudice. Meanwhile, Grace continues to lend her ear when <mark>Karen</mark>'s marriage hits rocky ground and she and [[<mark>Karen</mark>]] share an evening of girl talk. = = Cast = = = = Cast = = Line 18: Line 19: = = Notes = = = = Notes = = − * \"[[Alley Cats]]\" was originally scheduled to be shown, but was swapped at the last minute with \"Will Works Out .\" + * The episode [[Alley Cats]] was originally scheduled to be shown, but was swapped at the last minute with this episode. − * The slur Will uses to describe Jack has a polarizing effect, although the same word is reused numerous times throughout the rest of the series. + * In this episode, Will implies that he came out in 1982. Jack also mentions that he first had a gay experience \"at sleep-away camp\" in 1978. However, it is shown in the flashback in the episode [[Lows in the Mid-Eighties]] that Will actually came out in 1985 during his freshman year in college. + * At the start of their girls night, Grace mentions that she has a copy of the 1998 film [https: //en.wikipedia.org/wiki/Hope_Floats Hope Floats] which stars [[Harry Connick, Jr.]] Connick eventually appears as Grace's future husband [[Leo Markus | Leo]]. + + = = Cultural references = = + * Will and Grace are \"shocked\" to see an episode of [https: //en.wikipedia.org/wiki/Intimate_Portrait Intimate Portrait] featuring former teen actress [https: //en.wikipedia.org/wiki/Molly_Ringwald Molly Ringwald]. + * At the gym, Will refers to Jack as \"swish-burger\" , a play on Swiss burger and the term \"swish\" , a slang for an effeminate man. + * The Mikado + * When Will first hears of the jock block, he claims he does not speak \"pidgin homo\" + * While making a point to Will, Jack mentions the sayings \"a rolling\" stone \"gathers no moss\" and \"you can lead a horse to water but you can't make him drink\" , but replaced \"stone\" and \"horse\" with \"fag\". + * In affirming his pride in who he is, Jack says, \"I am what I am\" and Will rhetorically asks if that makes him the gay [https: //en.wikipedia.org/wiki/Popeye Popeye]. This is a reference to Popeye's catchphrase (and song) \"I yam what I yam, and that's all what I yam\". + * Princess of Tides after the 1991 film [https: //en.wikipedia.org/wiki/The_Prince_of_Tides The Prince of Tides]. + * While trying to explain how they switched clothes, <mark>Karen</mark> says \"bibbity-bobbity-boob\" , a reference to [https: //en.wikipedia.org/wiki/Cinderella_ (2015_Disney_film) Cinderella's] fairy godmother who says something similar thing when she magically fixes Cinderella's dress. + * Sufferin' sappho = = Quotes = = = = Quotes = = − {{Multi-line Quote | Character 1 = Jack | Line 1 = I got busted at the gym. | Character 2 = Will | Line 2 = For what? Feeling something other than the burn? | Character 3 = | Line 3 = | Character 4 = | Line 4 = | Episode =}} + {{Multi-line Quote | Character 1 = Jack | Line 1 = I got busted at the gym. | Character 2 = Will | Line 2 = For what? Feeling something <i> other </ i> than the burn? | Character 3 = | Line 3 = | Character 4 = | Line 4 = | Episode =}} {{Single-line Quote | Quote = I have to work out. I come from a very fat family. We store more fat than otters. | Character = Jack}} {{Single-line Quote | Quote = Let's work out during the day, buddy. Unemployed guys are so much hotter. | Character = Jack}} {{Multi-line Quote | Character 1 = Will | Line 1 = This is not like your old gym. Look around. Nary a nipple ring in sight. No men in Flashdance collars. And behold: women! | Character 2 = Jack | Line 2 = There were women at my old gym. | Character 3 = Will | Line 3 = Not on their birth certificate .}} {{Single-line Quote | Quote = Somebody's sports bra's a little snug. | Character = Jack}} {{Multi-line Quote | Character 1 = Jack | Line 1 = Shielding a desirable carcass from a much hotter vulture. | Character 2 = Will | Line 2 = See, this is what happens when you watch Wild Kingdom and gay porn with picture in picture. | Context = discussing the jock block}} {{Single-line Quote | Quote = It can't be National Butch Day, 'cause the banks are still open. | Character = Will}} {{Single-line Quote | Quote = I'd rather be a fag than afraid. | Character = Jack}} {{Single-line Quote | Quote = Sometimes the things we don't like in others are the things we really don't like in ourselves. | Character = Grace}} {{Multi-line Quote | Character 1 = <mark>Karen</mark> | Line 1 = My mother told me never to show up empty-handed, but I didn't have time to shop, so...Here's a dozen shares of G.E. | Character 2 = Grace | Line 2 = Great. I'll go put them in water .}} [[Category: Episodes]] − [[Category: Episodes]] [[Category: Season 1]] [[Category: Season 1]] Latest revision as of 04:08, November 21, 2018 Will Works Out Episode 1.19 Written by Michael Patrick King & Tracy Poust & Jon Kinnally Directed by James Burrows Will Works Out is the 19th episode of the first season. Jack overhears Will describe him as a \"fag\". <mark>Karen</mark> and Grace spend a girls night for the first time. Contents [show] Synopsis Edit Cast Edit Main Edit <mark>Eric McCormack</mark> (Will Truman) Debra Messing (Grace Adler) <mark>Sean Hayes</mark> (Jack McFarland) Megan Mullally (<mark>Karen Walker</mark>) Guest Edit <mark>Ben Reed</mark> (Richard Keller) Vanessa Giorgio (Woman) Notes Edit The episode Alley Cats was originally scheduled to be shown, but was swapped at the last minute with this episode. In this episode, Will implies that he came out in 1982. Jack also mentions that he first had a gay experience \"at sleep-away camp\" in 1978. However, it is shown in the flashback in the episode Lows in the Mid-Eighties that Will actually came out in 1985 during his freshman year in college. At the start of their girls night, Grace mentions that she has a copy of the 1998 film Hope Floats which stars Harry Connick, Jr.. Connick eventually appears as Grace's future husband Leo. Cultural references Edit Will and Grace are \"shocked\" to see an episode of Intimate Portrait featuring former teen actress Molly Ringwald. At the gym, Will refers to Jack as \"swish-burger\" , a play on Swiss burger and the term \"swish\" , a slang for an effeminate man. The Mikado When Will first hears of the jock block, he claims he does not speak \"pidgin homo\" While making a point to Will, Jack mentions the sayings \"a rolling stone gathers no moss\" and \"you can lead a horse to water but you can't make him drink\" , but replaced \"stone\" and \"horse\" with \"fag\". In affirming his pride in who he is, Jack says, \"I am what I am\" and Will rhetorically asks if that makes him the gay Popeye. This is a reference to Popeye's catchphrase (and song) \"I yam what I yam, and that's all what I yam\". Princess of Tides after the 1991 film The Prince of Tides. While trying to explain how they switched clothes, <mark>Karen</mark> says \"bibbity-bobbity-boob\" , a reference to Cinderella's fairy godmother who says something similar thing when she magically fixes Cinderella's dress. Sufferin' sappho Quotes Edit Jack: I got busted at the gym. Will: For what? Feeling something other than the burn? I have to work out. I come from a very fat family. We store more fat than otters .--Jack Let's work out during the day, buddy. Unemployed guys are so much hotter .--Jack Will: This is not like your old gym. Look around. Nary a nipple ring in sight. No men in Flashdance collars. And behold: women! Jack: There were women at my old gym. Will: Not on their birth certificate. Somebody's sports bra's a little snug .--Jack Jack: Shielding a desirable carcass from a much hotter vulture. Will: See, this is what happens when you watch Wild Kingdom and gay porn with picture in picture .--discussing the jock block It can't be National Butch Day, 'cause the banks are still open .--Will I'd rather be a fag than afraid .--Jack Sometimes the things we don't like in others are the things we really don't like in ourselves .--Grace <mark>Karen</mark>: My mother told me never to show up empty-handed, but I didn't have time to shop, so...Here's a dozen shares of G.E. Grace: Great. I'll go put them in water. Retrieved from \"http: //willandgrace.wikia.com/wiki/Will_Works_Out? oldid=15150\" Categories: Episodes Season 1", "articleID": "2018112104_00367417_W", "names": {"Eric Mccormack": ["Q15653760", "Q436686"], "Karen Walker": ["Q6370114", "Q6370115"], "Sean Hayes": ["Q223033", "Q7441065"]}}, {"date": "2018-11-21", "url": "http://www.fox13memphis.com/news/trending-now/lfo-singer-devin-lima-dead-at-41-reports-say/876524903?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "LFO singer Devin Lima dead at 41, reports say Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link LFO singer Devin Lima dead at 41, reports say By: Kelcie Willis, Cox Media Group National Content Desk Updated: Nov 21, 2018 - 9:44 AM Loading...LFO singer Devin Lima dead at 41, reports say LFO singer Devin Lima has died, according to a report. TMZ reported that the singer died of cancer at age 41. He was battling stage 4 cancer for a year, according to the tabloid site. Us Weekly confirmed the news. Lima was a member of the three-man boy band LFO, well known for its 1999 single \"Summer Girls .\" >> Read more trending news People reported that the singer had surgery to remove a tumor in October 2017. A week after the surgery, LFO bandmate Brad Fischetti said Lima had stage 4 adrenal cancer. \"Devin asked me to give you this update without him because, frankly, he's not feeling very well, but he asked me to send you his love and gratitude for all the love and prayers you've sent his way,\" Fischetti said in an Oct. 30, 2017 video. \"He's had a tough recovery and a few really difficult days in the hospital, but thankfully he's home now resting and healing. The pathology report came back and unfortunately it confirmed cancer .\" This is the second death in the band. Singer <mark>Rich Cronin</mark> died of leukemia at age 35 in 2010. © 2018 Cox Media Group.", "articleID": "2018112116_00187422_W", "names": {"Rich Cronin": ["Q466751", "Q7323227"]}}, {"date": "2018-11-22", "url": "http://www.bigcountryhomepage.com/news/national/authorities-probe-mansion-fire-that-killed-4-family-members/1611030145", "content": "Posted: Nov 21, 2018 09:39 PM CST Updated: Nov 21, 2018 09:39 PM CST COLTS NECK, N.J. (AP) - A family of four whose remains were found at the burned-down ruins of their New Jersey mansion was slain before the home was set ablaze, authorities said Wednesday, hours after the mansion owner's brother was arrested on suspicion of arson at his own house. Prosecutors sought to reassure the public that a random killer was not on the loose in the affluent community of Colts Neck, which is also home to some celebrities. \"We believe that this family in some form or fashion was targeted,\" Monmouth County Prosecutor Christopher Gramiccioni said. Paul Caneiro, 51, was charged with setting fire to his home Tuesday in Ocean Township. Less than eight hours later, the fire that destroyed his brother's home was reported about 80 miles (129 kilometers) away in Colts Neck, authorities said. Gramiccioni said he could neither confirm nor deny that Paul Caniero was a suspect in the slayings. At the mansion, Keith Caniero, 50, was found shot to death on the lawn. Inside, authorities found the remains of his 45-year-old wife, Jennifer Caniero, and their children, 11-year-old son Jesse and 8-year-old daughter Sophia. The bodies of the mother and children were badly burned. Medical examiners had not determined causes of death for them as of Wednesday afternoon. It was not immediately known if Paul Caniero had retained an attorney. He was charged with aggravated arson and was scheduled to make a first appearance in court next Wednesday. Paul Caneiro was accused of using gasoline to set his home on fire while his wife and two daughters were inside. No one was hurt in that blaze, which was reported at 5 a.m. Tuesday, about 7 1/2 hours before the Colts Neck fire was reported. Keith and Paul Caneiro were partners at a technology firm in Asbury Park called Square One. All four members of Keith Caniero's family were \"victims of homicidal violence,\" the prosecutor said, adding that there was no indication of suicide. The community held a vigil for the family Wednesday night. Colts Neck Mayor J.P. Bartolomeo said the Caneiros were well known in town and often seen at local shops or school sporting events. Colts Neck, about 50 miles (80 kilometers) south of New York City, is home to a number of celebrities, including Bruce Springsteen. Former \"Daily Show\" host <mark>Jon Stewart</mark> and his wife operate an animal sanctuary there. Queen Latifah sold her mansion there in 2015. Current and former members of the band Bon Jovi have also called it home. ___ Follow Wayne Parry at http: //twitter.com/WayneParryAC Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. More Stories CHICO, Calif. (AP) - Amy Sheppard packs her belongings into a plastic...21 hours ago LOS ANGELES (AP) - Ray Chavez, the oldest U.S. military survivor of...2 hours ago SEATTLE (AP) - John Allen Chau spent summers alone in a California...4 hours ago", "articleID": "2018112203_00293038_W", "names": {"Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}}, {"date": "2018-11-22", "url": "http://nwemail.co.uk/news/national/17240706.uk-putting-uae-relations-above-jailed-academics-freedom-wife-says/", "content": "<mark>Matthew Hedges</mark> with his wife Daniela Tejada 0 comments The wife of a British academic jailed for life in the United Arab Emirates on an allegation of spying has accused the UK Government of putting relations with the Gulf state before her husband. Daniela Tejada condemned the Foreign Office over the handling of the case of 31-year-old PhD student <mark>Matthew Hedges</mark>, ahead of her meeting with Foreign Secretary <mark>Jeremy Hunt</mark> on Thursday. Mr <mark>Hunt</mark> has threatened the UAE with \"serious diplomatic consequences\" if Mr <mark>Hedges</mark> is not freed, saying he has seen \"absolutely no evidence\" to support the charge. The Cabinet minister is understood to have met with the UAE ambassador in London on Thursday morning and had a \"very frank\" conversation with him. But Ms Tejada, having landed back at Heathrow Airport, said the UK had \"failed\" to take a firm stance over the Durham University student from the start of his ordeal. \"I was under the impression they were putting their interests with the UAE above a British citizen's rightful freedom and his welfare,\" she told BBC Radio 4's Today programme. \"They were stepping on eggshells instead of taking a firm stance .\" Health Secretary Matt Hancock defended the Foreign Office on the show for working \"behind the scenes\" to support Mr <mark>Hedges</mark>, with Mr <mark>Hunt</mark> appealing personally to the Crown Prince on November 12. Ms Tejeda, who was at the Abu Dhabi court when Mr <mark>Hedges</mark> was sentenced during a five-minute hearing on Wednesday, is expected to quiz Mr <mark>Hunt</mark> over what efforts the Government will make to secure Mr <mark>Hedges</mark>'s release. She has made it clear she believes the UK should stop at nothing to free the \"innocent\" Briton, who was jailed after the UAE presented \"completely fabricated\" evidence. Her calls for immediate action were echoed by Tory MP Johnny Mercer, who condemned the academic's jailing and called for the Government to be resilient. He wrote on Twitter: \"This is ridiculous. Our Defence assistance, mentoring and intelligence relationships alone with this country should preclude absurd things like this happening. From a friend and partner, simply unacceptable .\" Consequences must be immediate until he is released. \"This is ridiculous. Our Defence assistance, mentoring and intelligence relationships alone with this country should preclude absurd things like this happening. From a friend and partner, simply unacceptable. Consequences must be immediate until he is released. Resilience required pic.twitter.com/ouvxfjJIBH--Johnny Mercer MP (@ JohnnyMercerUK) November 21, 2018 Mr <mark>Hunt</mark> said the UK\" will do everything we can to get him home \"over the charges he has seen\" absolutely no evidence for \". He told Sky News:\" The UAE is supposed to be a friend and ally of Britain's. We've given them repeated assurances about <mark>Matthew</mark>. \"If we can't resolve this there are going to be serious diplomatic consequences, because this is totally unacceptable .\" Mr <mark>Hedges</mark>, a Middle Eastern studies specialist, was arrested at Dubai Airport on <mark>May</mark> 5. A family representative said he had since been held in solitary confinement for more than five-and-a - half months, during which his \"mental and physical health seriously deteriorated\". <mark>Matthew Hedges</mark> with his wife Daniela Tejada (Daniela Tejada/PA) Lawyer and human rights campaigner David Haigh said he was encouraged by Mr <mark>Hunt</mark>'s public stance, but warned that securing Mr <mark>Hedges</mark>'s release quickly was important. He told the BBC's World Tonight: \"It's urgent. I know what he will be going through. He'll be in some form of national security jail and it's horrific there .\" Mr Haigh, a former managing director of Leeds United, said he was tortured and raped while he was held in a Dubai jail over a fraud conviction that was later overturned. David Haigh (Martin Rickett/PA) <mark>Theresa May</mark> said she was \"deeply disappointed and concerned\" by Mr <mark>Hedges</mark>'s jailing and told MPs the UK \"will continue to press this matter at the highest level with the Emiratis\". Professor Stuart Corbridge, vice-chancellor of Durham University, said there is \"no reason to believe that Matt was conducting anything other than legitimate academic research\". A Foreign Office spokesman did not say what form any possible diplomatic consequences could take, but said a number of options are available. Mr <mark>Hedges</mark> has 30 days to challenge the court ruling. 0 comments", "articleID": "2018112212_00252048_W", "names": {"Jeremy Hunt": ["Q333533", "Q929730"], "Matthew Hedges": ["Q57833991", "Q58987432"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2018-11-22", "url": "http://learningenglish.voanews.com/a/are-forests-an-answer-to-carbon-pollution-/4662153.html", "content": "Are Forests an Answer to Carbon Pollution? 2 minutes ago The code has been copied to your clipboard. width The URL has been copied to your clipboard No media source currently available 0:00 0:03:03 Experts Turn Old Coal Mines into Carbon-Sucking Forests Share Are Forests an Answer to Carbon Pollution? share The code has been copied to your clipboard. The URL has been copied to your clipboard No media source currently available 0:00 0:06:12 64 kbps | MP3 Pop-out player Burning coal for energy adds planet-warming carbon dioxide, or CO2, to Earth's atmosphere. As the planet heats up, experts warn that simply cutting greenhouse gas emissions will not be enough to avoid possibly disastrous levels of global warming. CO2 must also be removed from the atmosphere, they say. Existing experimental machines that pull CO2 directly from the air are too costly to be widely used. But a new report from the U.S. National Academy of Sciences, Engineering and Medicine says effective carbon-removal technology already exists. It is not costly, or even complex science. It is forests. The report explains that planting trees and overseeing forests are cost-effective ways to clean the air. They also work well across large areas. Forests used to cover large areas of the Appalachian Mountains in the eastern United States. In the state of West Virginia, a kind of mining known as strip mining left the land there bare, without trees. Now experts are working to bring back the forests that once covered much of the state. West Virginia's Monongahela National Forest is home to a rare group of trees. They are called virgin woods; they have never been touched by humans. <mark>Shane Jones</mark> is a biologist with the U.S. Forest Service. \"Living in the East, there's not many places you can go and be untouched by Man .\" <mark>Jones</mark> says the trees there were missed by mistake when the surrounding forest was cut down for wood many years ago. That mistake turned out to be a good thing; red spruce forests such as those in the Monongahela are great at taking CO2 out of the atmosphere and locking it into the soil. <mark>Jones</mark> explains as he runs his hand through the dark black earth beside a tree. \"See all that organic material? It's black because it's incredibly high in carbon .\" Over the years, coal mining and cutting forests took over 90 percent of the red spruce forests from the Appalachian Mountains. Now, as the planet warms, the need for forests to remove coal's CO2 is increasingly urgent. <mark>Chris Barton</mark> works for the University of Kentucky. As he walks along the Appalachian land, he says the needs of warm-weather rainforests get most of the world's attention. \"But here in the temperate region of the world, in Appalachia, four hours away from Washington, D.C., we have billions of trees that potentially we could be planting .\" So, <mark>Barton</mark> started a group called Green Forests Work. Its members aim to put trees back on the roughly 400,000 hectares of land that was cleared away by strip mining. However, <mark>Barton</mark> explains, the land has problems. \"If you went out and planted trees on these sites, they just didn't grow. The ground was way too compacted. Water didn't infiltrate. Roots can't penetrate. Oxygen can't circulate in those environments .\" The solution? Using heavy equipment, workers tear up the ground. The process lets the trees they plant put down roots. <mark>Barton</mark> says not everyone believes the solution is a good idea. \"We've had a lot of people kinda look at us twice. But the really interesting thing about it is, after we do it, there's no question that that was the right thing to do .\" And it has worked. Forests are coming back to the grounds. Scientists say that, in West Virginia alone, restoring red spruce forests to the area could send what is equal to 56 million barrels of oil into the ground. But it will take time. A long time. Around the world, experts say, nature offers powerful tools to fight climate change. But patience is needed, <mark>Jones</mark> says. \"It's really awesome to see a tree planted eight years ago that's now waist high. But at the end of the day, at the end of my day, we're barely getting started. Because our main goal with the restoration work that we do here is to basically take actions to then let nature take over .\" Nature works, but slowly, in its own time. I'm Anne Ball. Steve Baragona reported on this story for VOANews.com. Anne Ball adapted this story for Learning English. <mark>Ashley Thompson</mark> was the editor. We want to hear from you. Write to us in the Comments Section. _______________________________________________________________ Words in This Story greenhouse gas emissions--n. gases that come out of cars and factories, etc. that trap heat in the atmosphere and great a warming of the planet global--adj. of, relating to or involving the entire world temperate--adj. moderate climate that lacks extremes compacted--adj. having a dense structure or parts closely packed together infiltrate--v. to pass through penetrate--v. to gain entrance to, or pass into awesome--adj. causing feeling of fear and wonderful, extremely good", "articleID": "2018112222_00392484_W", "names": {"Ashley Thompson": ["Q4805607", "Q9632941"], "Chris Barton": ["Q5105836", "Q5105837", "Q846359"]}}]