[{"date": "2018-11-22", "url": "http://learningenglish.voanews.com/a/are-forests-an-answer-to-carbon-pollution-/4662153.html", "content": "Are Forests an Answer to Carbon Pollution? 2 minutes ago The code has been copied to your clipboard. width The URL has been copied to your clipboard No media source currently available 0:00 0:03:03 Experts Turn Old Coal Mines into Carbon-Sucking Forests Share Are Forests an Answer to Carbon Pollution? share The code has been copied to your clipboard. The URL has been copied to your clipboard No media source currently available 0:00 0:06:12 64 kbps | MP3 Pop-out player Burning coal for energy adds planet-warming carbon dioxide, or CO2, to Earth's atmosphere. As the planet heats up, experts warn that simply cutting greenhouse gas emissions will not be enough to avoid possibly disastrous levels of global warming. CO2 must also be removed from the atmosphere, they say. Existing experimental machines that pull CO2 directly from the air are too costly to be widely used. But a new report from the U.S. National Academy of Sciences, Engineering and Medicine says effective carbon-removal technology already exists. It is not costly, or even complex science. It is forests. The report explains that planting trees and overseeing forests are cost-effective ways to clean the air. They also work well across large areas. Forests used to cover large areas of the Appalachian Mountains in the eastern United States. In the state of West Virginia, a kind of mining known as strip mining left the land there bare, without trees. Now experts are working to bring back the forests that once covered much of the state. West Virginia's Monongahela National Forest is home to a rare group of trees. They are called virgin woods; they have never been touched by humans. <mark>Shane Jones</mark> is a biologist with the U.S. Forest Service. \"Living in the East, there's not many places you can go and be untouched by Man .\" <mark>Jones</mark> says the trees there were missed by mistake when the surrounding forest was cut down for wood many years ago. That mistake turned out to be a good thing; red spruce forests such as those in the Monongahela are great at taking CO2 out of the atmosphere and locking it into the soil. <mark>Jones</mark> explains as he runs his hand through the dark black earth beside a tree. \"See all that organic material? It's black because it's incredibly high in carbon .\" Over the years, coal mining and cutting forests took over 90 percent of the red spruce forests from the Appalachian Mountains. Now, as the planet warms, the need for forests to remove coal's CO2 is increasingly urgent. <mark>Chris Barton</mark> works for the University of Kentucky. As he walks along the Appalachian land, he says the needs of warm-weather rainforests get most of the world's attention. \"But here in the temperate region of the world, in Appalachia, four hours away from Washington, D.C., we have billions of trees that potentially we could be planting .\" So, <mark>Barton</mark> started a group called Green Forests Work. Its members aim to put trees back on the roughly 400,000 hectares of land that was cleared away by strip mining. However, <mark>Barton</mark> explains, the land has problems. \"If you went out and planted trees on these sites, they just didn't grow. The ground was way too compacted. Water didn't infiltrate. Roots can't penetrate. Oxygen can't circulate in those environments .\" The solution? Using heavy equipment, workers tear up the ground. The process lets the trees they plant put down roots. <mark>Barton</mark> says not everyone believes the solution is a good idea. \"We've had a lot of people kinda look at us twice. But the really interesting thing about it is, after we do it, there's no question that that was the right thing to do .\" And it has worked. Forests are coming back to the grounds. Scientists say that, in West Virginia alone, restoring red spruce forests to the area could send what is equal to 56 million barrels of oil into the ground. But it will take time. A long time. Around the world, experts say, nature offers powerful tools to fight climate change. But patience is needed, <mark>Jones</mark> says. \"It's really awesome to see a tree planted eight years ago that's now waist high. But at the end of the day, at the end of my day, we're barely getting started. Because our main goal with the restoration work that we do here is to basically take actions to then let nature take over .\" Nature works, but slowly, in its own time. I'm Anne Ball. Steve Baragona reported on this story for VOANews.com. Anne Ball adapted this story for Learning English. <mark>Ashley Thompson</mark> was the editor. We want to hear from you. Write to us in the Comments Section. _______________________________________________________________ Words in This Story greenhouse gas emissions--n. gases that come out of cars and factories, etc. that trap heat in the atmosphere and great a warming of the planet global--adj. of, relating to or involving the entire world temperate--adj. moderate climate that lacks extremes compacted--adj. having a dense structure or parts closely packed together infiltrate--v. to pass through penetrate--v. to gain entrance to, or pass into awesome--adj. causing feeling of fear and wonderful, extremely good", "articleID": "2018112222_00392484_W", "names": {"Shane Jones": ["Q3959109", "Q7488117"]}}, {"date": "2018-11-23", "url": "http://leaderlive.co.uk/sport/national/17251992.maurizio-sarri-chelsea-would-not-accept-four-years-without-silverware/", "content": "Maurizio Sarri doubts he would be permitted four trophyless years as Chelsea boss 0 comments Maurizio Sarri doubts Chelsea would tolerate four years without a trophy, like Tottenham have under Mauricio Pochettino. Sarri and Pochettino have attracted plaudits, despite sharing the unwanted distinction of not having won any silverware in their managerial careers. Sarri admits Chelsea's history suggests he must end his drought to remain as boss. Asked if he would be afforded four years at Chelsea without a trophy, Sarri said: \"I don't think so, but I don't know. It's up to the club--if it's more important to win, or more important to improve the players .\" Tottenham boss Mauricio Pochettino is yet to win a trophy in his managerial career (Adam Davy/PA Images) Sarri takes his Blues side to Tottenham's temporary Wembley \"home' on Saturday seeking to extend a 12-match unbeaten start to the Premier League season. The expense of the construction of Tottenham's new stadium at White Hart Lane and the continued uncertainty over when they will play there may have contributed to Pochettino being unable to end Spurs' 10-year wait for a trophy. Pochettino signed a contract extension until 2023 last summer and Sarri has sympathy with his lack of silverware .\" I want to win something just to avoid this question, \"the 59-year-old Italian added .\" Sometimes there are the conditions for winning. Sometimes not. \"It's clear he's a very important coach, with a trophy or without a trophy .\" Maurizio Sarri is a fan of Tottenham playmaker Christian Eriksen (Adam Davy/PA Images) <mark>Antonio Conte</mark>, Sarri's predecessor, was sacked in July despite winning the Premier League in his first season and the FA Cup in his second. <mark>Conte</mark> spoke of his admiration for Tottenham striker <mark>Harry Kane</mark>. Sarri was asked which Spurs player he would like if he could sign one and was happy to declare his appreciation of Christian Eriksen. But when the subject of the Denmark player's contract expiring came up, Sarri interjected. He said: \"No, no, no. . I like him very much, but I don't want to talk about a player of Tottenham for the (transfer) market, of course. I only answered a question .\" Just a reminder...#PL pic.twitter.com/XWS6o507nW--Premier League (@ premierleague) November 17, 2018 Sarri on Friday used his pre-match media conference to again play down his side's title chances and promote Manchester City's. Liverpool are the only side likely to challenge City, Sarri says, and Chelsea are battling it out for the remaining Champions League qualification spots. Pochettino claimed Chelsea and Arsenal have an advantage domestically due to playing in the second-tier Europa League, rather than the Champions League. Sarri admits the quality of the competition may be advantageous, but the proximity of the fixtures is a distinct disadvantage, as he cited playing PAOK next Thursday and Fulham in the Premier League next Sunday. Sarri added: \"From a mental point of view, maybe we do have an advantage. From a physical point of view, no .\" Sarri says we have some difficulties at the start of games, which he thinks is a mental problem for his players, and not a tactical one. \"Our opponents were more aggressive, more determined than us. We have to approach the match in a different way .' #TOTCHE--Chelsea FC (@ ChelseaFC) November 23, 2018 Sarri hopes his side start more aggressively against Spurs after being dissatisfied by a\" mental problem \"in the last three games .\" The problem was that the opponents were more aggressive, more determined than us, \"he added .\" It's not a tactical problem, it's not a physical problem. We have to approach the match in a different way, for application and determination. \"We have to be careful. We have to be focused on this problem .\" Chelsea have some undisclosed doubts, with Mateo Kovacic (ankle) expected to be in contention. 0 comments", "articleID": "2018112322_00383360_W", "names": {"Antonio Conte": ["Q18621047", "Q26580", "Q30039019", "Q3700446"], "Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}}, {"date": "2018-11-24", "url": "https://www.washingtonexaminer.com/news/us-soldier-dies-in-afghanistan", "content": "US soldier dies in Afghanistan Print this article A U.S. service member was killed in Afghanistan Saturday, according to the NATO-led Resolute Support mission, the second soldier to die in the country in November and the 10th in 2018. The identity of the service member and details about how they were killed would be shared \"at a later stage,\" Sgt. 1st Class Debra Richardson, a spokeswoman for Resolute Support, said in a brief statement. The soldier's death follows that of Maj. <mark>Brent Taylor</mark>, a member of the U.S. Army National Guard and mayor of the Utah city of North Ogden, who was killed earlier this month in an apparent \"insider attack\" in Kabul, Afghanistan. The NATO-led mission in Afghanistan began in 2015 and involves about 14,000 U.S. troops advising and supporting Afghan security forces in their efforts against the Taliban, which was toppled in 2001. More than 2,400 service members have died in the country over the course of the 17-year conflict, making it America's longest. In 2018, the Pentagon has announced the deaths of 25 soldiers, including seven in \"non-combat incidents,\" including nine American troops who have died in Iraq, and one each in Syria, Somalia, Kosovo, Djibouti, United Arab Emirates, and Germany. Share your thoughts with friends. More Washington Examiner Associated Press Saturday November 24, 2018 DUBAI, United Arab Emirates (AP)--A prominent Saudi royal said Saturday that whether or not heads of state gathered in Argentina next week for the Group of 20 summit warmly engage with Crown Prince Mohammed bin Salman, he is someone \"that they have to deal with .\" Susan Ferrechio Saturday November 24, 2018 Senate Republicans next week will kick off an end-of-year push to confirm President Trump's judicial nominations, one that could be thwarted by outgoing Sen. Jeff Flake, R-Ariz. Daniel Chaitin Friday November 23, 2018 Rep. Adam Schiff, D-Calif ., has some big plans next year when he takes the chairmanship of the House Intelligence Committee from Devin Nunes. Naomi Lim Friday November 23, 2018 President Trump shot down a report that indicated Treasury Secretary Steven Mnuchin's time in his administration may be coming to an end over his role in the appointment of Federal Reserve Chairman Jerome Powell. Naomi Lim Friday November 23, 2018 New York's highest court has refused to dismiss the state attorney general's lawsuit against the Trump Foundation alleging President Trump and his three eldest children illegally used the charitable organization for their own private and political benefit. Naomi Lim Friday November 23, 2018 White House deputy chief of staff for communications Bill Shine reportedly received $8.4 million in severance pay from 21st Century Fox when he resigned from Fox News in May 2017 amid criticism over how he handled sexual misconduct complaints leveled at some of the cable news network's top talent. Vaishnavee Sharma Friday November 23, 2018 The Trump administration made a move to bypass the appeals court system Friday by asking the Supreme Court to take up three lawsuits challenging restrictions on transgender military service. Naomi Lim Friday November 23, 2018 A handful of House Democrats signaled Friday that they will withhold their support for House Minority Leader Nancy Pelosi's speakership bid in a pressure effort to convince the California Democrat to agree to a rules reform package that would weaken her control on the lower chamber. Daniel Chaitin Friday November 23, 2018 Former Vice President Al Gore accused President Trump of trying to \"hide the truth\" of a government climate report by having it released during a holiday weekend. Associated Press Friday November 23, 2018 As California's catastrophic wildfires recede and people rebuild after two hurricanes, a massive new federal report warns that these types of extreme weather disasters are worsening in the United States. The White House report quietly issued Friday also frequently contradicts President Donald Trump. Naomi Lim Friday November 23, 2018 Hillary Clinton has blasted Fox News for becoming a \"superb propaganda\" tool for President Trump and the GOP, arguing that the cable news network distorts reality for its viewers in a way that is politically helpful for the White House and administration. Naomi Lim Friday November 23, 2018 <mark>Michael Hayden</mark>, a former CIA and National Security Agency director, was rushed to hospital this week after suffering from a stroke, according to his namesake think tank. Naomi Lim Friday November 23, 2018 Jerome Corsi, a far-right writer linked to President Trump and <mark>Roger Stone</mark>, is in talks with special counsel Robert Mueller over a possible plea deal. Daniel Chaitin Friday November 23, 2018 Former FBI Director James Comey is taking some heat after announcing on Thanksgiving that he would \"resist\" a subpoena to appear for a closed-door deposition with a joint congressional task force for fear of Republicans selectively leaking his testimony to the public. Naomi Lim Friday November 23, 2018 The mayor of Tijuana, Mexico, declared an international humanitarian crisis Thursday for his city after about 5,000 Central American migrants traveling in a caravan descended on the U.S. border. Daniel Chaitin Friday November 23, 2018 The Food and Drug Administration said Friday that efforts are underway to remove romaine lettuce from California from the supply chain, as they believe an E. coli outbreak likely originated from the Golden State.", "articleID": "2018112414_00428919_W", "names": {"Brent Taylor": ["Q4961560", "Q4961561", "Q4961563"], "Michael Hayden": ["Q1226020", "Q449604", "Q6831016"], "Roger Stone": ["Q19653753", "Q7358961"]}}, {"date": "2018-11-25", "url": "http://business.scoop.co.nz/2018/11/26/metro-performance-glass-lowers-fy-guidance/", "content": "Metro Performance Glass lowers FY guidance November 26, 2018 Article Article--BusinessDesk Nov. 26 (BusinessDesk)--Metro Performance Glass reported a 22 percent drop in half-year net profit, lowered its full-year guidance and said it won't be paying any dividends as it struggles to turn around its Australian business. Metro Performance Glass lowers FY guidance, suspends dividends to bring down debt By Rebecca Howard Nov. 26 (BusinessDesk)--Metro Performance Glass reported a 22 percent drop in half-year net profit, lowered its full-year guidance and said it won't be paying any dividends as it struggles to turn around its Australian business. The company provided no further details of a new competitor looking to build a new glass processing plant near Hamilton that it alerted the market of earlier this month. New Zealand's biggest glass processor said its half-year net profit in the six months to Sept. 30 was $9.1 million versus $11.8 million a year earlier. Revenue was down 1 percent at $140.5 million while earnings before interest and taxation were down 18 percent at $15.5 million. The result was impacted by poor trading results in Australia, it said. Metro Glass said its New Zealand business--with the exception of Canterbury--remains supported by elevated levels of residential and non-residential construction and revenue was 1 percent higher at $113 million. The Australian business, Australian Glass Group, remains challenging, it said. Revenue was down 7.1 percent and ebit was a loss of $1.3 million versus earnings of $2.6 million a year earlier. \"The market is supportive and the recent capital investment programme is showing promise on lifting production capacity and improving manufacturing efficiency. However, it is taking longer than originally planned to reset AGG's operations, people and culture. This has impacted its year-to-date financial performance and highlighted further capability gaps we are working to address,\" said chairman <mark>Peter Griffiths</mark>. \"We are focused on stabilising AGG's performance in the second half of the year and returning the business to profitable growth in FY20,\" said <mark>Griffiths</mark>. Given the challenges in Australia, it now expects group ebit of around $28 million, down from the guidance it gave at its annual general meeting when it said ebit would be at the lower end of its target range of $30million - $33 million. The board has also reviewed the group's leverage and dividend policy against its current operating performance, its longterm strategy, the uncertain future competitive landscape, and expectations of how the Australasian building cycles could evolve in the coming years, said <mark>Griffiths</mark>. \"As a result, it will declare no further dividends until the group's leverage ratio, as measured by net debt to rolling 12month ebitda, is reduced to approximately 1.5 times. At 30 September 2018, this ratio was 2.3 times,\" it said. Net debt stood at $95.2 million. The stock last traded at 53 cents and is down 44 percent over the past 12 months. The shares plunged 24 percent earlier this month after it reported on its expected new rival's plans to have its new Hamilton plant coming on stream in mid-2020. (BusinessDesk)", "articleID": "2018112601_00024703_W", "names": {"Peter Griffiths": ["Q337895", "Q47832786", "Q7174388"]}}, {"date": "2018-11-27", "url": "https://windsorstar.com/news/world/trump-demanding-5b-for-border-wall-in-spending-bill-republican-says-amid-fears-of-government-shutdown/wcm/8c649e67-21d6-4f16-9eb6-051508bd57c0", "content": "5 / 5 Trump demanding $5B for border wall in spending bill, Republican says, amid fears of government shutdown Trump's position in the spending debate could harden further after his recent actions over the U.S. border with Mexico Bloomberg News Updated: November 27, 2018 Donald Trump delivers remarks at a Make America Great Again rally in Biloxi, Mississippi, on November 26, 2018. JIM WATSON/AFP/Getty Images Share Adjust Comment Print The head of the Senate Appropriations panel says that President Donald Trump is holding firm in his insistence on $5 billion for a border wall in a year-end spending package, a demand that risks blowing up negotiations and triggering a partial government shutdown. Committee Chairman Richard Shelby, an Alabama Republican, has been working to find some middle ground between the House version of the spending bill that includes $5 billion for the wall and the $1.6 billion Republicans and Democrats on the Senate panel have proposed. Asked whether the $5 billion is a red line in the negotiations, Shelby said, \"for the president .\" He said he can't predict what will happen or whether Trump is looking at a confrontation with Democrats over the wall that leads to a partial shutdown as a political benefit. \"The president has to speak for himself,\" Shelby said. \"I'll just say that I don't think it's a good idea to shut the government down, period. But people are going to posture. And it could happen, it's happened before. But all the government won't be shut down, even if it is. I hope none of it shuts down .\" A pigeon flies near the border wall that separates Mexico, left, from the U.S., where the wall ends in the Pacific Ocean, seen from Tijuana, Mexico, Wednesday, Nov. 21, 2018. Ramon Espinosa/AP If lawmakers can't complete a handful of remaining spending bills by Dec. 7, funding will expire for several government departments, including Homeland Security and Justice. House Speaker <mark>Paul Ryan</mark> and other members of the Republican leadership are scheduled to meet Tuesday with Trump at the White House to plan out the rest of the congressional term. Trump's position in the spending debate could harden further after his recent actions over the U.S. border with Mexico. They have included threatening to close it permanently in the wake of a confrontation between Central American migrants and Customs and Border Patrol agents at the busy San Ysidro port of entry between Tijuana and San Diego. The wall was clearly on the president's mind Monday when he appeared at a campaign rally in Tupelo, Mississippi, to support the candidacy of GOP Senator Cindy Hyde-Smith, who faces a runoff in her re-election bid Tuesday. \"We want to finish the wall. We've got to get funding from Congress,\" Trump said the rally. \"And if this isn't the right time to get funding, when you look at what's happening at the border, there will never be a right time. So we're going very strongly for funding for the wall .\" With assistance from <mark>Jack Fitzpatrick</mark>.", "articleID": "2018112713_00221022_W", "names": {"Jack Fitzpatrick": ["Q6112506", "Q6112508"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2018-11-28", "url": "https://www.businessinsider.in/ebay-says-that-cyber-monday-and-black-friday-set-sales-records-for-the-site/articleshow/66836646.cms", "content": "Ebay says that Cyber Monday and Black Friday set sales records for the site <mark>Dennis Green</mark> Nov 28, 2018, 04.29 AM Facebook Linkedin WhatsApp Twitter Google + Reddit Read full story Getty/Ki Price Ebay has hit another milestone in its bid to become a big online player. Auction-site-turned-online-marketplace Ebay says it had record-setting Black Friday and Cyber Monday events this year. The site also revealed some of the items that customers purchased the most. The days from Thanksgiving to Cyber Monday - which Ebay refers to as the \"Cyber 5\" - have been good for online retailers this year, the data shows. Ebay had a blockbuster Black Friday and Cyber Monday, the company said on Tuesday. Both Black Friday and Cyber Monday marked records for the site. Cyber Monday beat Black Friday in terms of dollar sales, meaning it was likely the company's biggest day in history, though an Ebay spokesperson would not confirm that. Cyber Monday was Ebay's largest sales day ever in 2017, according to TechCrunch. \"Ebay drove record sales on Black Friday and Cyber Monday,\" <mark>Scott Cutler</mark>, SVP of the Americas for Ebay, said in a statement. \"We're delivering what customers want - the best prices with guaranteed delivery .\" Ebay also released some top sellers for Cyber Monday and Black Friday. It said it sold a Nintendo Switch console every 13 seconds and an Apple Watch every 26, while deals on the Apple iPhone X, Apple MacBook Air, and Adidas Yeezy 350 Boost V2 Cream Triple White shoes sold quickly. Read more: Amazon reveals the best-selling items that it says helped Cyber Monday become its biggest shopping day in history The website did not say how much its sales increased over last year in either hard numbers or by percentage. According to Adobe Analytics, which takes data from 80 of the top 100 online retailers, Cyber Monday saw an estimated $7.9 billion in online sales, representing about 19% growth over last year. It's still a record, but it didn't match the pace of growth seen on Black Friday this year, when online sales grew by 23.6% to reach $6.2 billion. In recent years, Ebay has pivoted from its auction-style roots to become a marketplace for brands to sell to consumers, much like Amazon. Now, about 80% of its sales are non-auction, buy-it-now offerings. It often offers deals on shopping holidays in the hopes of becoming a holiday-shopping destination like Amazon, Target, Best Buy, and others. More on Cyber Monday 2018: More people shopped online than in stores as the holiday shopping season kicked off, signaling the end of Black Friday as we know it Amazon's emphasis on \"the Turkey 5' reveals Black Friday and Cyber Monday as we know them are dying Walmart and Amazon are offering massive deals to keep Cyber Monday from getting killed Amazon's best late-night Cyber Monday deals you don't want to miss - here's your cheat sheet NOW WATCH: 7 things you shouldn't buy on Black Friday {{}} Facebook Linkedin WhatsApp Twitter Google + Reddit Next Story Salesforce delivers\" beat and raise' despite rocky few months on the market More from this author Amazon's emphasis on the \"Turkey 5' revea...Amazon reveals the best-selling items tha...Amazon may have just had its best Black F.. . Walmart and Amazon are offering massive d.. . Amazon reveals top-selling Black Friday i.. . Related Stories Moody's is signaling that the retail apocalypse is...Target's CEO just signaled the end of the retail a.. . Business Insider is hiring a paid retail reporting...Promoted Stories When you travel to India, you travel within Incredible India Sign Up & Refer 10 friends to get an iPhone XR InstaReM Travel to India, discover an evolved self Incredible India", "articleID": "2018112723_00078089_W", "names": {"Dennis Green": ["Q26986595", "Q464128", "Q5258464"]}}]