[{"date": "2018-11-28", "url": "https://www.businessinsider.in/ebay-says-that-cyber-monday-and-black-friday-set-sales-records-for-the-site/articleshow/66836646.cms", "content": "Ebay says that Cyber Monday and Black Friday set sales records for the site <mark>Dennis Green</mark> Nov 28, 2018, 04.29 AM Facebook Linkedin WhatsApp Twitter Google + Reddit Read full story Getty/Ki Price Ebay has hit another milestone in its bid to become a big online player. Auction-site-turned-online-marketplace Ebay says it had record-setting Black Friday and Cyber Monday events this year. The site also revealed some of the items that customers purchased the most. The days from Thanksgiving to Cyber Monday - which Ebay refers to as the \"Cyber 5\" - have been good for online retailers this year, the data shows. Ebay had a blockbuster Black Friday and Cyber Monday, the company said on Tuesday. Both Black Friday and Cyber Monday marked records for the site. Cyber Monday beat Black Friday in terms of dollar sales, meaning it was likely the company's biggest day in history, though an Ebay spokesperson would not confirm that. Cyber Monday was Ebay's largest sales day ever in 2017, according to TechCrunch. \"Ebay drove record sales on Black Friday and Cyber Monday,\" <mark>Scott Cutler</mark>, SVP of the Americas for Ebay, said in a statement. \"We're delivering what customers want - the best prices with guaranteed delivery .\" Ebay also released some top sellers for Cyber Monday and Black Friday. It said it sold a Nintendo Switch console every 13 seconds and an Apple Watch every 26, while deals on the Apple iPhone X, Apple MacBook Air, and Adidas Yeezy 350 Boost V2 Cream Triple White shoes sold quickly. Read more: Amazon reveals the best-selling items that it says helped Cyber Monday become its biggest shopping day in history The website did not say how much its sales increased over last year in either hard numbers or by percentage. According to Adobe Analytics, which takes data from 80 of the top 100 online retailers, Cyber Monday saw an estimated $7.9 billion in online sales, representing about 19% growth over last year. It's still a record, but it didn't match the pace of growth seen on Black Friday this year, when online sales grew by 23.6% to reach $6.2 billion. In recent years, Ebay has pivoted from its auction-style roots to become a marketplace for brands to sell to consumers, much like Amazon. Now, about 80% of its sales are non-auction, buy-it-now offerings. It often offers deals on shopping holidays in the hopes of becoming a holiday-shopping destination like Amazon, Target, Best Buy, and others. More on Cyber Monday 2018: More people shopped online than in stores as the holiday shopping season kicked off, signaling the end of Black Friday as we know it Amazon's emphasis on \"the Turkey 5' reveals Black Friday and Cyber Monday as we know them are dying Walmart and Amazon are offering massive deals to keep Cyber Monday from getting killed Amazon's best late-night Cyber Monday deals you don't want to miss - here's your cheat sheet NOW WATCH: 7 things you shouldn't buy on Black Friday {{}} Facebook Linkedin WhatsApp Twitter Google + Reddit Next Story Salesforce delivers\" beat and raise' despite rocky few months on the market More from this author Amazon's emphasis on the \"Turkey 5' revea...Amazon reveals the best-selling items tha...Amazon may have just had its best Black F.. . Walmart and Amazon are offering massive d.. . Amazon reveals top-selling Black Friday i.. . Related Stories Moody's is signaling that the retail apocalypse is...Target's CEO just signaled the end of the retail a.. . Business Insider is hiring a paid retail reporting...Promoted Stories When you travel to India, you travel within Incredible India Sign Up & Refer 10 friends to get an iPhone XR InstaReM Travel to India, discover an evolved self Incredible India", "articleID": "2018112723_00078089_W", "names": {"Scott Cutler": ["Q21005492", "Q7436203"]}}, {"date": "2018-11-29", "url": "http://www.exchangerates.org.uk/news/23740/exchange-rates-update-today-british-pound-crash-warnings-euro-soft-dollar-mixed-to-soft-vs-g10-currencies.html", "content": "Exchange Rates Update Today: British Pound Brexit Predictions, Euro Soft, Dollar Mixed To Soft Vs G10...Exchange Rates Update Today: British Pound Brexit Predictions, Euro Soft, Dollar Mixed To Soft Vs G10 Currencies Stumbleupon The British Pound (GBP) started the day poorly on Wednesday but later got a boost as the US Dollar (USD) weakened and brightened the outlook for stock markets as the Dow Jones roared higher by more than 600 points. The Bank of England released their Financial Stability report for Brexit, indicating their belief Sterling could fall as much as 25% <more from the initial 9% of losses which have been seen since the May 2016 Inflation Report. Pound Sterling Special Forecast: Bank of England predicts cumulative GBP Brexit losses of 34% It was a monster day for US stock markets as one of the most important people in global finance, whether it be Equity markets or Forex markets, Governor <mark>Jay Powell</mark> of the US Federal Reserve indicated that the period of FOMC tightening did possibly have an end in sight. The statement that got the reaction was as follows, \"Interest rates are still low by historical standards, and they remain just below the broad range of estimates of the level that would be neutral for the economy ‑ ‑ that is, neither speeding up nor slowing down growth,\" This is what markets have been waiting for, and whether due to the Presidential pressure or some indications of waning inflation it appears that <mark>Powell</mark> is now taking his foot off the accelerator. The British Pound to Dollar exchange rate (GBP/USD) which was falling initially on the day was buoyed by the weakness in the Dollar Index (DXY), and thus EUR/GBP was able to finish the day flat. The initial weakness in Sterling was largely due to a devastating report from the Bank of England. Governor Carney's team which are officially impartial but have often been accused of being overtly pro-remain for their often dark take on the state of the UK after Brexit. They have also been criticised by Remain at times so it has been a rough go for the UK's Central bank, however, financial traders around the world are likely to respect their figures to some degree and their dire warning on Wednesday of a collapsing British Pound, soaring inflation and higher interest rates is pause for thought. The Government's figures on GDP, while negative were not nearly so bad as the 8% GDP collapse and the soaring unemployment rate. Typically the Pound would probably have swung aggressively lower on this news but investors appeared to brush it off, signs of exhaustion in the bears? It is worth considering that the UK housing market is probably quite reliant on lower interest rates for stability, and so stagflation would be particularly devastating to the UK. Stability Report reveals stark reality of Brexit on Sterling We will have a look at the full report from the Bank of England in more detail as it relates specifically to the British Pound. The first mention of Sterling is the BoE addressing the fact that talking about future effects from Brexit is slightly missing the point, as the UK economy is already dealing with the damage that the decision to leave the EU has undeniably had on sentiment, \"EU withdrawal has already had consequences for the economy, providing some evidence of the nature of the Brexit adjustment. Productivity growth has slowed, sterling has depreciated and the increase in inflation has squeezed real incomes...Sterling fell sharply immediately following the referendum, and remains 18% below its 2015 peak before the referendum was called .\" The most damaging disorderly no-deal Brexit is addressed in the report and it makes explicitly clear what this scenario is, focusing on a pretty bleak view of having no trade deals with any of the EU nations, \"In the disorderly scenario, on which the FPC has focussed given its remit for financial stability, the UK loses existing trade arrangements that it currently has with non-EU countries through membership of the EU. The UK's border infrastructure is assumed to be unable to cope smoothly with customs requirements .\" For the British Pound this scenario would leave it undesirable, and hence we get the first indication for the Bank of England that they would be keen to raise interest rates (or at least they attempt to justify the hawkish mindset they are trying to sell to support GBP exchange rates during this period, \"There is a pronounced increase in the return investors demand for holding sterling assets. There are spillovers across asset classes .\" Brexit Forecast: 25% more downside possible in British Pound (GBP) Exchange Rates Now to the actual forecast for Sterling in such an eventuality. And it is a big one. The Bank of England believes that a rapid increase in the risk premium priced into Pound exchange rates could be seen and ultimately crush Sterling a total of 34% lower since the 2016 inflation report, \"In the disorderly Brexit scenario, the term premium on UK government bond yields rises by 100bp. And as the sterling risk premium increases, sterling falls by 25%, in addition to the 9% it has already fallen since the May 2016 Inflation Report .\" Perhaps in an attempt to not sound too gloomy, the BoE has included a caveat that this is the worst case scenario, and hence they are even pricing in a little overshoot into the prediction in what is very much intended to be a \"covered all bases\" take and therefore not something that Brexiteers should get too hot under the collar about as it states, \"Consistent with the worst case assumptions underpinning the scenario, this reflects a combination of a shift in the equilibrium level of the sterling exchange rate and some overshooting beyond that new lower level\" Hence we see that since 2016 the British People have essentially voted that their country could be worth as much as 34% less than it was worth before if the bearish stars align. If the bullish dominos were to fall Is the maximum upside of Brexit 34% or higher in some people's eyes? Probably not, and this is just one example of why the markets are quicker to position for more weakness rather than more upside. Advertisement Save money on your currency transfers with TorFX, voted International Money Transfer Provider of the Year 2016, 2017 and 2018. Their goal is to connect clients with ultra competitive exchange rates and a uniquely dedicated service whether they choose to trade online or over the telephone. Find out more here. Advertisement François Auré Traded Forex for 6 years. Trading consultant for Private Sports Betting Fund out of Edinburgh. Background in ...", "articleID": "2018112907_00200051_W", "names": {"Jay Powell": ["Q20640929", "Q6167053"]}}, {"date": "2018-11-29", "url": "http://www.bcdemocrat.com/2018/11/29/us-sexual-misconduct-weinstein-2/", "content": "\"Stop this chaos:' Weinstein lawyer urges sex case dismissal By MICHAEL R. SISAK and JENNIFER PELTZ - 11/29/18 9:39 PM Tweet on Twitter NEW YORK--In the latest push to have Harvey Weinstein's sexual assault case thrown out, the movie producer's lawyer said Thursday that a woman accusing him of a 2013 rape pressured a friend to corroborate her account, but that the friend wouldn't\" make up a story. \"The friend told defense investigators that Weinstein and the rape accuser had been\" hooking up \"consensually for a long time and that she never heard the accuser say anything bad about him until last year, lawyer Benjamin Brafman said in a court filing. The friend was not identified in court papers. Weinstein's side also believes police set up a phone call between the film producer and one of his accusers shortly before his arrest, but the operation failed to produce incriminating evidence .\" The only reasonably prudent decision would be to stop this chaos now, \"Brafman wrote, urging Judge <mark>James Burke</mark> to dismiss the case at a Dec. 20 court hearing. The Manhattan District Attorney's office declined to comment. In a filing last week, prosecutors said there was\" ample evidence \"to move forward and that Brafman was trying to create a\" public circus \"with an earlier demand that police investigators be questioned in court about alleged misconduct that has roiled the case. Prosecutors dropped part of the case in October after evidence surfaced that a detective coached a witness. Three of the five remaining charges stem from the allegations at the heart of Brafman's latest filing, that Weinstein raped a woman in a hotel room in March 2013. The two other charges allege that Weinstein forcibly performed oral sex on another woman in 2006 at his Manhattan apartment. Brafman said the rape accuser called the friend out of the blue after they hadn't spoken since a falling-out two years before. She discussed the alleged assault and asked for the friend's help,\" presumably so as to serve as a prompt outcry witness, \"Brafman wrote. An\" outcry witness \"is a term for the first person or people who were told about an alleged attack. Such testimony can be powerful in a sexual assault case. The friend responded that she'd never been told about the allegation and didn't want to get involved, according to the filing. But sometime after, a New York City police detective approached her about the matter. She told the detective that the accuser, who has never been publicly identified, and Weinstein had an intimate relationship and that she'd never heard the assault allegation at the time, according to the court papers. Brafman blasted authorities for not passing the information to the defense. Weinstein, 66, denies all allegations of nonconsensual sex. What first appeared to be a strong case against Weinstein, brought in the glow of the #MeToo movement as dozens of women came forward to accuse him of wrongdoing, has been dinged by back-to-back allegations of police misconduct. First, prosecutors dropped a criminal charge involving a third woman after evidence surfaced that Det. Nicholas DiGaudio coached a witness to keep quiet when she raised doubts about the veracity of the allegation. Days later, prosecutors revealed that DiGaudio allegedly urged the rape accuser to delete material from her cellphones before she handed them over to prosecutors. The woman didn't delete any information and instead asked a lawyer for advice, prosecutors said. DiGaudio's union has said he\" was simply trying to get to the truth \"and wasn't trying to influence the investigation. He is no longer involved in the Weinstein case. Brafman, in the filing, said Weinstein was caught in the middle of a public feud between the New York Police Department and the district attorney's office. He said that police had pressured prosecutors into charging Weinstein by publicly demanding an arrest and indictment and talking openly to reporters about witnesses and purported evidence. After the flood of sex misconduct claims against Weinstein last year, District Attorney Cyrus Vance Jr. came under heavy scrutiny for declining to charge him over an Italian model's allegation that he groped her in 2015. Police also set up a sting in that investigation, and the model later recorded an in-person encounter in which she confronted Weinstein. He alternated between apologizing and trying to persuade her to go to his hotel room. The New York Police Department on Thursday reiterated its statement that\" the evidence against Mr. Weinstein is compelling and strong \"and that it will continue to work with prosecutors\" to deliver justice for the courageous survivors who have bravely come forward. \"Earlier this week, a Delaware bankruptcy court judge granted Weinstein's lawyers access to thousands of emails on his former movie studio's servers that they say discredit his accusers. Brafman said he's preparing for the possibility that prosecutors will try and bolster their flagging case by portraying Weinstein as a serial predator and telling jurors about allegations against him that didn't lead to criminal charges. Brafman referred to that step as a\" Cosby motion, \"after the disgraced comedian who was convicted in April of drugging and assaulting a woman in 2004 after prosecutors were allowed to call five witnesses who said he had victimized them in similar fashion. Brafman said in Thursday's court filing that the emails\" demonstrate that these women who now allege sexual assault by Mr. Weinstein have for years engaged in loving and often intimate conversations with him before and after the date of the alleged assault. \"Follow Sisak at twitter.com/mikesisak and Peltz at twitter.com/JennPeltz TAGS", "articleID": "2018113006_00324230_W", "names": {"James Burke": ["Q16206040", "Q16229909", "Q6130497", "Q6130509", "Q6130510", "Q778787"]}}, {"date": "2018-12-01", "url": "https://www.sacbee.com/sports/nfl/article222485050.html#storylink=rss", "content": "Matt Calkins: <mark>Richard Sherman</mark> would have created a mess if Seahawks had kept him | The Sacramento Bee Matt Calkins: <mark>Richard Sherman</mark> would have created a mess if Seahawks had kept him By MATT CALKINS The Seattle Times December 01, 2018 12:00 AM SEATTLE Sorry, but did you expect something different? Did you think you were going to hear a list of pleasantries and well-wishes? Was there a chance in Hades he was going to wax poetic about fond memories and locker-room bonds? Not likely. A leopard can't change its spots, and a <mark>Sherman</mark> must take his shots. That's as clear as it's ever been. Thursday, 49ers cornerback <mark>Richard Sherman</mark> reminded me how quickly he could put himself on Page 1. He reminded me how his candor was always compelling even if it was cringeworthy. He reminded me how you could never step away when he was at the podium. And he reminded me how the Seahawks were right to part ways with him when they did. Premium content for only $0.99 For the most comprehensive local coverage, subscribe today. SUBSCRIBE NOW Here's the highlight reel from Thursday's news conference with <mark>Sherman</mark>, who will return to CenturyLink Field for the first time Sunday .--On his relationship with <mark>Russell Wilson</mark>: \"I don't have a relationship with <mark>Russell</mark>. We were teammates. We played through a very special time for the franchise .\" --On seeing all the things <mark>Wilson</mark> is capable of: \"I've also seen him throw five picks in a game, so you see what he's capable of on both sides of it. You understand that he can be defended .\" --On how good the Seahawks (6-5) are: \"They're a middle of the road team .\" --On how things ended in Seattle: \"You just expect that once you've done so much for a franchise that they wouldn't cut you when you're hurt. It's kind of a respect thing more than anything .\" There's a double standard in sports media where we loathe the cliches spewed by someone such as <mark>Wilson</mark>, then condemn the barbs spewed by someone such as <mark>Sherman</mark>. I don't think that's right. I also think one could mount a defense that his comments about <mark>Russell</mark> weren't as inflammatory as some are making them out to be. There are a lot of fine people I've worked with that I don't keep in touch with. And <mark>Sherman</mark> has never been afraid to smack-talk opponents--whether it be <mark>Tom Brady</mark> postgame or rival cornerbacks on Twitter. But there was also something about Thursday that seemed particularly resentful. And I can't help but think that resentment would have come to a head had the Seahawks kept <mark>Richard</mark> around. Vicious as <mark>Sherman</mark> has been--whether it be laying into Skip Bayless, Michael Crabtree or Darrelle Revis--he's always contended that they were the ones to start the beef. <mark>Wilson</mark>, on the other hand, has never publicly dissed <mark>Sherman</mark>, and praised him throughout his own news conference Thursday. I don't think <mark>Sherman</mark> would be disrespecting Doug Baldwin if asked about route-running. I don't think he'd point out previous dropped balls if asked about Tyler Lockett's touchdown total. As has been indicated in past stories, this thing with <mark>Wilson</mark> seems personal. As far as the Seahawks cutting him while he was recovering from his Achilles injury this offseason? Can you really blame them? <mark>Sherman</mark> doesn't think a team should release you when you're hurt. Truth is, that's usually the optimal time to do it--especially if you're nearing 30 and playing a speed-based position. That may sound brutal, but that's the NFL. I'll take the ice-cold general manager over the sentimental one every time. Thank-you money is a nice gesture in March, but it won't help get you to February. Considering <mark>Sherman</mark>'s contributions during Seattle's Super Bowl days, the Seahawks owe him all the accolades and honors they can bestow. But after paying him nearly $45 million, they didn't owe him any more cash. Seahawk fans have every right to ignore <mark>Sherman</mark>'s faults and concentrate on his feats. There were the 34 interceptions, the NFC title game tip and a swagger that helped make him the most feared cornerback in the league. But the 12s grounded in reality are also acutely aware of the sideline blowups, the insubordination and a compulsion for conflict. This year's Seahawks are unlike anything <mark>Sherman</mark> was a part of. The offseason turnover was intense, and the early struggles--particularly from <mark>Wilson</mark>--were immense. Throw in <mark>Earl Thomas</mark>' contract situation, and I can't help but wonder if <mark>Richard</mark>'s voice would have been more of a hindrance than a help. Asked about <mark>Sherman</mark>'s exit from Seattle Thursday, Baldwin wasn't cryptic. \"It was really (crappy),\" he said. Maybe so. But also necessary. The Seahawks needed to change. And <mark>Sherman</mark>, well, I'm not sure he can.", "articleID": "2018120109_00269666_W", "names": {"Earl Thomas": ["Q2051514", "Q23304639", "Q5326117"], "Richard Sherman": ["Q16205086", "Q2947411"], "Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"]}}, {"date": "2018-12-02", "url": "http://www.southburnetttimes.com.au/news/update-tropical-cyclone-owen-is-on-its-way/3591096/#comments", "content": "A satellite image showing the location of the tropical low forming off the coast of the Solomon Islands that is expected to track towards the Queensland coast. Brisbane Storm Chasers Breaking UPDATE: Tropical Cyclone Owen is on its way by Maddelin McCosker Maddelin McCosker Full Profile Login to follow 2nd Dec 2018 4:42 PM | Updated: 5:02 PM 0 2 5PM: THE Bureau of Meteorology has just confirmed that Tropical Cyclone Owen is tracking southeast over the Coral Sea. The category one cyclone is currently situated which is about 545 km east northeast of Willis Is and 990 km east northeast of Cairns. According to the Bureau, TC Owen has recently slowed down but is expected to deepen in the coming hours. \"The system has been moving to the south southeast through today, but has recently slowed to around 8 kilometres per hour,\" the bulletin read. \"Owen is expected to deepen further overnight and is likely to reach Category 2 on Monday .\" The system is likely to drift slowly south until Monday afternoon or evening, and is then expected to turn and move slowly to the west and commence a weakening trend. \"This system poses no immediate threat to the Queensland coast, and should remain well off the coast until it weakens later in the week .\" 4.45 PM: A TROPICAL cyclone has formed approximately 500kms northeast of Cairns, according to the Joint Typhoon Warning Centre. The Hawaiian based JTWC said the cyclone has been tracking south-south-westward over the past few hours. The Bureau of Meteorology said it would be making an announcement on the cyclone status within the hour. It said the system had continued to intensify meaning there was a good chance it will be upgraded to a tropical cyclone which would be named Owen. <mark>Harry Clark</mark> a Meteorologist from the Bureau said the cyclone could reach a category two system in the next 48 hours, but the coast of Queensland will remain out of the cyclones reach for at least a few days. \"The only real risk to the coast is if the remnant low meanders towards the coast in the latter part of this week,\" he said. \"That would increase the rainfall and winds if anything and it certainly wouldn't be cyclone strength, mostly just some increased shower activity along the coast .\" The Bureau is still yet to confirm if the system has developed into a tropical cyclone. The Bureau of Meteorology 8.25 am: THE Bureau of Meteorology has issued a cyclone tracking map for the tropical low which is moving towards the Queensland coast. The bureau said that at 4 am, a tropical low was located over the northern Coral Sea about 610 km north east of Willis Island and 1030 km east north east of Cairns. Tropical cyclone forecast tracking map for a tropical low system of the Queensland coast issued at 4:45 am, Sunday 2, December 2. BOM The low was moving south at 9 kilometres per hour and expected to deepen further, most likely developing into a tropical cyclone during the next 24 hours. \"The system will continue drifting south until Monday afternoon or evening, and is then expected to turn and move slowly west,\" the bureau said. \"It is expected to intensify further during this time. However, this system poses no immediate threat to the Queensland coast, and should remain well off the coast until it weakens later in the week .\" The Joint Typhoon Warning Centre this morning said the system would continue tracking to the south over the next several days, and then \"model guidance diverges to go either south east or south west\". \"The models agree that the system will continue to intensify to warning criteria within the next day,\" it said. \"Maximum sustained surface winds are estimated at 25 to 30 knots. The potential for the development of a significant tropical cyclone within the next 24 hours remains high .\" 3pm: According to the Joint Typhoon Warning Centre (JTWC), based in Pearl Harbor, there is now a high chance a tropical cyclone will develop on Sunday between the Australian coast and the Solomon Islands. The JTWC said today the \"low level circulation centre' was moving in a south-westerly direction at 13 knots. The cyclone was located approximately 333 nautical miles west of Honiara on the Solomon Islands, over 1000 kilometres off the coast of Cairns. The Joint Typhoon Warning Centre, based in Pearl Harbor, has put out a notice advising there is a high chance of a tropical cyclone developing off the coast of Queensland in the next 24 hours. Joint Typhoon Warning Centre At 2.30 pm the BOM said a developing tropical low was currently located southeast of the Papua New Guinea mainland, near Sudest Island .\" The low is forecast to develop into a tropical cyclone during Sunday afternoon or evening while shifting south to southwest. It is expected to enter the Eastern Region later this evening or early Sunday morning and stay well offshore of the Queensland Coast in the northern Coral Sea, \"the outlook report read .\" Uncertainty does exist with the systems movement and development from Tuesday. \"Janine Yuafa, Meteorologist with The Bureau of Meteorology confirmed they were closely monitoring the situation, however he said it should remain well off the coast of Queensland for the time being. The tropical low was detected over 300 nautical miles from Honiara on the Solomon Island. It is predicted to turn into a tropical cyclone in the coming days. Joint Typhoon Warning Centre\" At the moment it is south east of Papua New Ginuea, \"she said .\" It is expected to move south-westwards into the Coral Sea over the next few days. \"Ms Yuafa said the tropical low was expected to remain well off the Queensland coast until early next week, saying after that it was not clear where it would go .\" There's a great deal of uncertainty surrounding its movements over coming days, beyond Sunday and Monday, \"she said .\" At this stage there's a moderate to high chance of development, but what it does after that once it reached tropical cyclone strength, if it does, is extremely uncertain. \"0 2 burea of meteorology Read More Login to follow cyclone Read More Login to follow joint typhoon warning centre Read More Login to follow tmbweather Read More Login to follow burea of meteorology cyclone joint typhoon warning centre tmbweather", "articleID": "2018120207_00023518_W", "names": {"Harry Clark": ["Q20685783", "Q27950254", "Q47546735"]}}, {"date": "2018-12-02", "url": "http://www.businesswire.com/portal/site/home/template.PAGE/welcome/?javax.portlet.tpst=9ee47ea3678ece48256bb762f04eca4a&javax.portlet.prp_9ee47ea3678ece48256bb762f04eca4a_viewID=MY_PORTAL_VIEW&javax.portlet.prp_9ee47ea3678ece48256bb762f04eca4a_ndmHsc=v2*A1541156400000*B1543803566976*DgroupByDate*G5*N1010492&javax.portlet.begCacheTok=com.vignette.cachetoken&javax.portlet.endCacheTok=com.vignette.cachetoken", "content": "11/30/2018 - 10:50 PM NEW ORLEANS--()--ClaimsFiler, a FREE shareholder information service, reminds investors that they have until December 26, 2018 to file lead plaintiff applications in a securities class...\"BUSINESS WIRE more 11/30/2018 - 10:50 PM NEW ORLEANS--()--Former Attorney General of Louisiana, Charles C. Foti, Jr., Esq., a partner at the law firm of Kahn Swick & Foti, LLC (\"KSF\" ), announces that KSF has commenced an...\"BUSINESS WIRE more 11/30/2018 - 10:50 PM NEW ORLEANS--()--Former Attorney General of Louisiana, Charles C. Foti, Jr., Esq., a partner at the law firm of Kahn Swick & Foti, LLC (\"KSF\" ), announces that KSF has commenced an...\"BUSINESS WIRE more 11/30/2018 - 09:09 PM LOS ANGELES--()--Glancy Prongay & Murray LLP Announces the Filing of a Securities Class Action on Behalf of PPDAI Group Inc.. Investors (PPDF)\" BUSINESS WIRE more 11/30/2018 - 08:16 PM BOSTON--()--\"Uma visão comum para a economia digital árabe\" é um plano ousado conduzido pelo Council of Arab Economic Unity (CAEU) na Liga dos Estados Árabes para impulsionar a estabil...\"BUSINESS WIRE more 11/30/2018 - 08:15 PM BOSTON--()--\"Una visión común para la economía digital árabe\" es el plan audaz impulsado por el Consejo de la Unidad Económica Árabe (Council of Arab Economic Unity, CAEU) en la Liga d.. . \"BUSINESS WIRE more 11/30/2018 - 08:07 PM BENSALEM, Pa.--()--Deadline Alert: The Law Offices of Howard <mark>G. Smith</mark> Reminds Investors of Looming Deadline in the Class Action Lawsuit Against GreenSky, Inc. .\" BUSINESS WIRE more 11/30/2018 - 08:00 PM LOS ANGELES--()--Glancy Prongay & Murray LLP Announces Investigation on Behalf of Marriott International, Inc.. Investors (MAR) \"BUSINESS WIRE more 11/30/2018 - 07:30 PM LOS ANGELES--()--Glancy Prongay & Murray LLP Announces the Filing of a Securities Class Action on Behalf of McKesson Corporation Investors (MCK)\" BUSINESS WIRE more 11/30/2018 - 07:23 PM WASHINGTON--()--CDC Once Again Completely Ignores Safer Sex Promotion in World AIDS Day Message, Says AHF \"BUSINESS WIRE more 11/30/2018 - 07:05 PM NEW YORK--()--Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of the securities of The Boeing Company (NYSE: BA...\"BUSINESS WIRE more 11/30/2018 - 07:00 PM SASKATOON, Saskatchewan--()--Gensource Potash Corporation (\"Gensource\" or the \"Company\" ) (TSX. V: GSP) is pleased to announce a proposed best efforts non-brokered private placement for...\"BUSINESS WIRE more 11/30/2018 - 06:56 PM NEW YORK--()--Rosen Law Firm, a global investor rights law firm, announces the filing of a securities class action lawsuit on behalf of purchasers of the securities of Synchrony Financ...\"BUSINESS WIRE more 11/30/2018 - 06:42 PM SAN FRANCISCO--()--Vaquero Capital received the Technology Investment Bank of the Year Award from the Global M & A Network at the 10th Annual Americas M & A Atlas Awards held in Ne...\"BUSINESS WIRE more 11/30/2018 - 06:38 PM WASHINGTON--()--PSB, un servizio di consulenza globale basato sulla ricerca, ha annunciato oggi che Char Popp è entrata a far parte della società con l'incarico di vicepresidente senio...\"BUSINESS WIRE more", "articleID": "2018120302_00167437_W", "names": {"G. Smith": ["Q51589268", "Q5593252"]}}, {"date": "2018-12-03", "url": "http://www.runnersworld.com/gear/a25368752/best-shoes-2019-the-running-event/", "content": "How to Dress for Running This Winter The Best New Shoes for 2019 Launched at The Running Event From insanely light cross-country models to supremely soft marathon trainers, these shoes promise a lot of fun miles in the coming year. Dec 3, 2018 Jeff Dengate For running gear geeks, Austin, Texas, is the place to be in the final days of November. Each year, the industry descends on the city for The Running Event--part retail workshop where stores can share best practices, and part gear expo where brands can show off the latest in shoe tech and stylish apparel. Advertisement - Continue Reading Below At this year's show, the theme in general was shoe fit and comfort. While previous years have brought us a foam war--with each brand trying to deliver a bouncy, soft midsole--the companies really turned their focus to the shoes' uppers and how they interact with your foot. We haven't heard the last about foams, to be sure, but next year's shoes promise to better wrap your foot with less risk for blisters and hot spots. Here are 17 of the most exciting shoes launching in 2019. New Balance Fuel Cell Rebel Price: $130 Available: July 1, 2019 The Fuel Cell Rebel's curved shape and lateral fin is a novel design that caught the eye of expo attendees. Jeff Dengate One of the shoes that got the most attention at the show is the Fuel Cell Rebel (pictured here and at the top of this article). If you know anything about any Fuel Cell models NB has previously built, forget it. The company is keeping the name, but scrapping the nitrogen-infused foam it had used before. Instead, the name will live on in a speed-based series of shoes. The Rebel is rooted in the company's \"miler project,\" given the company's success at the mid-distance with runners like. This shoe has a bold fin sticking off the lateral (outer) edge of the shoe, to smooth the landing for runners who make ground contact out on the side of their foot. We were told \"this shoe is not for jogging .\" No, it looks clearly built for speed. It'll have a 6mm drop. Jenny Simpson Saucony Mad River TR Available: June 1, 2019 Jeff Dengate I absolutely love the concept of this trail shoe. I've often said that a running shoe is just a tool, and we should tweak it as needed to make it work the way we want. By that I mean you shouldn't be afraid to punch an extra eyelet in the upper to change how you lace the shoe, or even take a knife to the mesh to relieve pressure or irritation. Saucony has taken that concept here and actually suggested where you might customize it. The sole shows you recommended places to customize the shoe to your needs. Jeff Dengate Do you run a course with lots of stream crossings? Break out the Milwaukee drill and poke holes in the outsole--obviously do so when the shoe is not on your foot. Labels on the rubber even tell you what size drill bit to use. Or maybe you want to wear the shoe in the winter on slippery roads? More markings show you not only where to place the screws but also what size to use. There are also multiple options--ghillies and eyelets--for lacing the shoe up tight. Altra Vanish-XC Advertisement - Continue Reading Below Advertisement - Continue Reading Below This shoe is about as minimal as it gets these days. A fishnet upper straps a thin, 14mm foam and rubber sole to your foot--and that's about it. But the shoe has a purpose. Initially, it's intended to give young cross-country runners a tool to build foot strength and run fast in training over grass courses. Its X-shaped tread delivers grip on mild terrain. But it can also be used for much the same purposes for the rest of us. In introducing the shoe to us, Altra cofounder Golden Harper said \"stronger feet equals less shoe needed,\" and that's wise advice to heed. If you build foot strength, you can more comfortably run in thinner, lightweight shoes. So, while many of us might use it as a training tool, more advanced runners will take it out for long speed sessions. Altra athlete Zach Bitter wore it in November when he set the 100-mile trail world record, running 12:08:36--that's 7:17 per mile, by the way. If you're the type to lace this one up, you'll also like how you can loop the laces through nearly any hole in the upper to customize the fit to your foot. Hoka One One Clifton 6 Price: $130 Available: June 1, 2019 Jeff Dengate I'm a fan of the Clifton, and still of the franchise. But the 6 continues the shoe's legacy, positioning it right in the territory of a or--a do-it-all trainer that's going to work for an awful lot of runners. This version has been overhauled under and around the foot. The midsole has been softened just a bit from version 5, and rubber patches on the sole have been repositioned to improve durability. Meanwhile, the upper has been redesigned to add structure. To do so, Hoka is using embroidery through the midfoot--a series of six stitches extend from the eyerow to the midsole down near your heel to provide some lateral support to the engineered mesh upper. hold v1 as the pinnacle Brooks Ghost Nike Pegasus Advertisement - Continue Reading Below Available: June 1, 2019 Brooks Running A big overhaul that caught our attention is the Cascadia--a trail titan that typically doesn't see major changes. But the new version has been reworked top to bottom. Under the foot, a new trail rubber has a wet-grip formulation for more secure footing. Brooks says it took the rebound out of the rubber, so when you hit rocks on the trail, the rubber sticks better, rather than deflecting off it. The company has also retooled the lugs underfoot for more secure footing and changed up the pivots--those triangle wedges of firm foam at the four corners that deliver extra stability on uneven ground. Perhaps the biggest change, however, is the new knit upper. It's a sleek execution for a shoe that's. The knit material is lightweight but secure thanks to its no-stretch design. To give extra protection, Brooks is using a Cordura mesh just above the midsole, where you're likely to snag rocks and sticks on technical trail. The changes are reported to bring the shoe down an astonishing 1.2 ounces. typically had a burly construction Advertisement - Continue Reading Below Available: June 1, 2019 Jeff Dengate The Liberty won our thanks to its versatile mix of comfort and support for long runs. But how will its successor fare? Since it's an off-year update, very little changed under the foot--manufacturers are largely on a two-year cycle for foam and rubber updates. So this shoe still gets the full-length layer of Everun as a midsole, making for a bouncy, cushioned ride. Saucony beefed up the plastic post under the heel and arch a bit. It did so by making it slightly longer and extending a few plastic ribs of the post farther into the midsole, basically firming up that region. It also bolstered support by adding a genuine heel counter inside the shoe to lock the back half of your foot in place. The previous model had a simple plastic strap that wrapped around the heel but didn't really offer much in the way of structure. Saucony also added a \"high tensile polyester fiber\" to the heel and midfoot. It's a thread that winds around the shoe's upper and is stitched in place to add even more structure and support, much like traditional overlays would have but in a lighter execution. Best Debut award in early 2018 Reebok Forever Floatride Energy Jeff Dengate Advertisement - Continue Reading Below We've really loved the direction of Reebok the last couple years, and the team there has been cranking out some great shoes using a new Floatride midsole foam. But, to reach more runners with a lower price, they've come up with a slightly different kind of foam they're calling Floatride Energy. It's a lightweight expanded TPE--essentially, small plastic beads are steam molded together. Reebok says it's 30 percent lighter than traditional EVA and delivers better energy return, but it's not as soft as the midsole material used in other Floatride shoes like the. Add to that a simple full-length rubber outsole that will give good durability and value. I've been in the shoe a while now, and it's currently on the feet of our wear-testers. The early results are exactly as Reebok describes: It's a lightweight training shoe that feels quick when you want to run fast. It doesn't have the premium construction and plush build of pricier shoes, but it should be a real bargain for younger runners and those on a budget. Run Fast Asics Gel-DS Trainer 24 Price: $120 Jeff Dengate The DS Trainer has a bold new look. It's the first Asics shoe to get a knit upper. And our early indications are that this change alone has greatly improved the long-time tempo shoe. I've been running in this one as well, and our wear-test team is piling miles on it now, but I find myself reaching for it on quick days more often than I did recent versions. That's likely also due to the full-length layer of FlyteFoam Lyte. It's a lighter version of the foam the brand has been rolling out to its cushioned titans like the Nimbus and Kayano. Although it reduces weight, it still offers excellent cushioning power and responsiveness. Asics added a new heel counter into the knit upper so you don't get any slippage on heel lift. Don't like the mottled design? No worry. Our test samples came in a slick blacked-out option. Advertisement - Continue Reading Below Available: November 1, 2019 Brooks Running You're forgiven if you looked at this picture and thought you were seeing a Ghost. That's exactly what Brooks has in mind here with the Adrenaline. It's the stability brother to the Ghost, with a similar design and fit. The difference between the two going forward is the level of support. The GTS 20 will continue using guide rails for support, just like those found on the GTS 19 that's hitting stores right now. Those rails are in place of the traditional medial post--a firm wedge of foam under the arch for stability. But, while the shoe still delivers support for those who need it, it doesn't scream \"stability shoe .\" The new engineered mesh upper has a sleek design that any runner will be proud to lace up. The tread isn't overly aggressive, which is perfect for \"western technical\" trails--on the East Coast we call them rail trails. Saucony Switchback ISO Available: February 1, 2019 Jeff Dengate Saucony used to make a Kinvara for the trails, but it was a Kinvara in name only, really, and went extinct. The Switchback, however, is a lot like the Freedom ISO. The shoe came about because runners in northern California were taking that shoe on trails but wanted more traction. Enter the Switchback. It has a 4mm drop and full-length Everun midsole like the Freedom. One notable difference is the Boa closure for a quick, secure lock down. The dial lets you make tiny adjustments in tension--something you can't do with laces--and won't stretch or get loose over the duration of your run. Advertisement - Continue Reading Below Available: February 1, 2019 Jeff Dengate Though most brands focused on fit and materials at the show, many were talking about Skechers. Truth. Getting all that attention is Hyper Burst, a new form of EVA that's created differently. Instead of being blown with chemicals, it's made when CO2 is heated under pressure and becomes a supercritical fluid. There's a load of science behind it, but what it means for runners is the foam has a different cellular structure that allows it to be durable and springy, without being heavy. This is another shoe that we've been testing here at Runner's World already. The feeling underfoot is an odd sensation of firm but protective. There's plenty enough cushioning even when running down steep hills, but it's light and responsive. The same foam is being used in the GOrun Razor 3. But, the GOrun 7 has a stretchy knit upper mated to the midsole. The outsole has pods on the bottom of the foot--think way back to the, the pods are back. These boost the shoe's cushioning power a bit, as each compresses individually when you load them with weight, making the shoe feel smoother and softer. It's expected to weigh just 7.8 ounces and have a 4mm drop. original GOrun Advertisement - Continue Reading Below Available: July 1, 2019 Jeff Dengate In the past, I've bemoaned how much weight the Clifton gained over its five years, mostly because that first Clifton was so darn light and soft. My displeasure is eased a good bit now. No, the Clifton isn't going on a diet, as we saw above, but it has a new sibling that is lighter and suitable for race day. In fact, that's exactly why Hoka built this version. It has the same stack heights as the Clifton--29mm in the heel, 24mm in the forefoot, according to Hoka--and should fit like that everyday trainer. To help the shoe check in at 7.7 ounces, it uses a lightweight reinforced mesh that locks your foot in place. Under Armour Hovr Infinite Available: February 1, 2019 Jeff Dengate Under Armour is still in the high-energy return foam wars with its Hovr platform. And new to the line for 2019 are three shoes--the Infinite, a neutral trainer; the Guardian, a stability model, and the Velociti, a performance trainer or race day model. The most approachable of the three is the Infinite, though, and it's clearly shooting for shoes like the Asics Gel-Nimbus--a plush model built for high comfort over long miles. The key to the shoe, of course, is the Hovr foam, a squishy material that's so soft is has to be wrapped in a web to keep it from squeezing out of the shoe and encased in a more durable carrier foam. Women get their own gender-specific fit from this shoe, with the patterning of the upper adjusted to better fit the instep and volume of the toebox. They also get a different sockliner that boosts cushioning in the rear half of the shoe. It's spec'd to have an 8mm drop and every pair will come with the stride-tracking sensor in the midsole, which sends your run data to the MapMyRun app. Advertisement - Continue Reading Below Price: $155 361 Degrees The Strata continues as 361's top-of-the-line stability shoe. It delivers not only support for runners who need it but also loads of cushioning and plush comfort. If there's a comparison to make, it's the brand's take on the. This version has been re-engineered, but still features a full slab of the brand's Quickfoam directly under your foot. That's the company's bouncy, durable foam that really amps comfort and helps the shoe feel just as soft at mile 20 as it did on the first few steps out the door. The all-new upper has a jacquard mesh that really boosts the shoe's style, and a \"Morphit\" lacing system--fabric straps loop through the eyelets and tie directly into the laces, pulling across the top and helping the upper wrap up and around your foot for a snug fit. Kayano Advertisement - Continue Reading Below Available: Now Jeff Dengate You have to be a little bit crazy to launch a running shoe company nowadays. And you have to be out of your mind to do it outside of Asia, where the skilled laborers and manufacturing infrastructure already exist. But, that's just what Kenya-based Enda has done. Its first model, the Iten, is named after the small town in the Rift Valley that's loaded with distance-running talent. Cofounder Weldon Kennedy tells us that Enda set up shop in a flip-flop factory, one capable of churning out 200,000 pairs of the summer's shoes. As expected for a debut shoe from a small company--especially one in a flip-flop factory--the Iten has a compression-molded midsole and really basic construction. It's a shoe with a rich backstory and full of good will, if not loaded with technical features. As for performance, the Iten is designed to be a low-volume, go-fast shoe. That means it fits snug and is meant for fast running. It's not something you'll grab for an easy jog or a long run. That could prove a challenge for the company as it tries to grow, but it's already eyeing its second shoe, a midweight cushioned model. For now, the only place you can buy the Iten is from Enda directly at. endasportswear.com Merrell MTL Cirrus Jeff Dengate Advertisement - Continue Reading Below For a while, Merrell sponsored <mark>Joe Gray</mark>, currently the top mountain runner in the United States, and world mountain running champ in 2016. Although <mark>Gray</mark> now runs for Hoka One One, it was with his input previously that Merrell designed this shoe, suitable for running straight uphill. Dubbed the Cirrus, this skyrunner model is meant to deliver grip and protection for running up mountains. The shoe is really stripped of protective features you'd need for running back down, though it does have a rock plate to give you some relief. The sole is made from Vibram Megagrip and has lugs designed to give you great grip on steep terrain, while the upper is a nearly see-through nylon that won't rip easily. Diadora Mythos Blueshield 3 Available: Now Diadora Diadora is another name you may be unfamiliar with or associate with other sports. But the Italian brand is making a move into the performance running space again. It's working channels and getting into specialty run shops, so you may see its shoes on the wall of your local running store soon. The shoe leading the charge is the Mythos Blueshield 3. It's a neutral trainer that uses a gel-like layer in the midsole which has a series of nubs protruding from it to help cushion and stabilize the foot. Jeff Dengate Runner-in-Chief Jeff is Runner-in-Chief for Runner's World, guiding the brand's shoes and gear coverage. Advertisement - Continue Reading Below", "articleID": "2018120319_00197128_W", "names": {"Joe Gray": ["Q26883429", "Q54867362", "Q6210101"]}}]