[{"articleID": "2018011422_00112923_W", "names": {"Dan Johnson": ["Q16193666", "Q16730344", "Q27917138", "Q3013125", "Q45409991", "Q5213759", "Q5213760", "Q5213762"]}, "date": "2018-01-14", "url": "http://www.kxlf.com/story/37263271/ex-idaho-lawmaker-kills-himself-amid-sex-abuse-investigation", "content": "Ex-Idaho lawmaker kills himself amid sex abuse investigation - KXLF.com | Continuous News | Butte, Montana Ex-Idaho lawmaker kills himself amid sex abuse investigation - KXLF.com | Continuous News | Butte, Montana Member Center: Ex-Idaho lawmaker kills himself amid sex abuse investigation Posted: Updated: By CNN A former Idaho state representative who resigned last fall amid sexual abuse accusations has killed himself, officials said. Former Republican state Rep. Brandon Hixon, 36, died Tuesday of a self-inflicted gunshot wound to the head, Canyon County Coroner Vicki DeGeus-Morris told CNN. Hixon's death follows the December death of Kentucky state Rep. <mark>Dan Johnson</mark>, also a Republican, who had been accused of sexually assaulting a teenage girl in 2013. <mark>Johnson</mark> died a day after denying the allegations, and the Bullitt County, Kentucky, coroner ruled the death a suicide. Hixon, who was in his third term, resigned from the Idaho legislature in late October. Shortly after the resignation, reports in local media said Hixon was under investigation for sexual abuse, with the Idaho Statesman citing the state attorney general's office in its news report. Idaho Speaker of the House Rep. Scott Bedke announced Hixon's death Tuesday on the chamber floor. \"Our thoughts go to his family and friends who are suffering from his loss,\" said Bedke, who did not respond to CNN's request for further comment. Sex abuse case rises to state level The Canyon County prosecutor's office initially handled the complaint against Hixon, county spokesman Joe Decker told CNN. The investigation was transferred to the state attorney general \"due to a conflict of interest,\" according to a document provided to CNN by Scott Graf, director of constituent affairs for the Idaho Office of the Attorney General. The document notes that the case relates to \"Brandon Hixon, Sexual Abuse Allegations.\" The attorney general's office would not comment further on the sexual abuse accusations against Hixon. Hixon's legal troubles continued after he resigned from the legislature. He was arrested on December 9 and charged with two misdemeanors: driving under the influence and resisting arrest, Ada County Sheriff's Office spokesman Patrick Orr told CNN. Hixon was arrested again later in December for \"suspicion of driving under the influence,\" Capt. Devin Riley of the Caldwell Police Department told CNN. Alleged victims were minors, ex-wife says Hixon's ex-wife, Danielle Eirvin Hixon, told CNN that the alleged victims in the sexual abuse case against her former husband were two underage girls. She said one of the alleged victims told her about the suspected sexual abuse in October. Eirvin Hixon, who was married to Hixon for 10 years before they divorced in May 2016, said it was the first she'd learned of abuse allegations against Hixon. Eirvin Hixon told CNN she's speaking out because she wants to help the alleged victims. \"It isn't fair for his victims that they be silenced because he's no longer here,\" Eirvin Hixon told CNN. Eirvin Hixon told CNN she was due to testify before a grand jury considering the allegations against Hixon on Wednesday morning, the day after he killed himself. The Idaho attorney general's office would not comment on Eirvin Hixon's assertions. WEATHER Updated: Saturday, January 13 2018 11:30 PM EST 2018-01-14 04:30:14 GMT The Blaine County Sheriff has identified the teen whose body was found in a field along US Highway 2. The Blaine County Sheriff has identified the teen whose body was found in a field along US Highway 2. Saturday, January 13 2018 5:30 PM EST 2018-01-13 22:30:10 GMT A government watchdog is expressing concern over the dangerous misuse of a laundry detergent. A government watchdog is expressing concern over the dangerous misuse of a laundry detergent. Updated: Sunday, January 14 2018 10:30 AM EST 2018-01-14 15:30:10 GMT MILES CITY - A Miles City woman is dead after she was ejected during a multi-vehicle crash west of Forsyth on Saturday morning. MILES CITY - A Miles City woman is dead after she was ejected during a multi-vehicle crash west of Forsyth on Saturday morning. Updated: Saturday, January 13 2018 9:30 PM EST 2018-01-14 02:30:09 GMT John Clune and Lauren Groth, of the Denver law firm Hutchinson Black and Cook, will be joining the case against the Frenchtown School District and Superintendent Randy Cline. John Clune and Lauren Groth, of the Denver law firm Hutchinson Black and Cook, will be joining the case against the Frenchtown School District and Superintendent Randy Cline."}, {"articleID": "2011110715_00039343_W", "names": {"Linda Johnson": ["Q3832607", "Q6551688"]}, "date": "2011-11-07", "url": "http://livetradingnews.com/china-confident-in-europe-58375.htm", "content": "china is confident that europe will overcome its debt crisis, foreign minister yang jiechi said, adding stability in the eurozone was crucial for the global economic recovery. yang did not directly mention increasing china's investment in europe in his statement late saturday on president hu jintao's trip to the g-20 leaders' meeting in southern france. \"we believe that europe has the complete wisdom and ability to solve the debt problem,\" yang said in remarks published on the foreign ministry's website. \"china has always supported europe's response to the international financial crisis and its economic recovery efforts,\" he said. the eurozone has been looking to china play a role in supporting its rescue fund by investing some of its us $3.2-t in foreign exchange reserves; the world's largest. leaders of the world's major economies, meeting on the french riviera, told europe to sort out its own problems and deferred until next year any move to provide more crisis-fighting resources to the international monetary fund (imf). yang said that hu emphasized during his trip \"the development and the recovery of the european economy is necessary to achieve recovery\" of the global economy. paul a. ebeling, jnr. paul a. ebeling, jnr paul a. ebeling, jnr. writes and publishes the red roadmaster's technical report on the us major market indices, a weekly, highly-regarded financial market letter, read by opinion makers, business leaders and organizations around the world. paul a. ebeling, jnr has studied the global financial and stock markets since 1984, following a successful business career that included investment banking, and market and business analysis. he is a specialist in equities/commodities, and an accomplished chart reader who advises technicians with regard to major indices resistance/support levels. <mark>linda johnson</mark>, business development director - private client group, sales @ heffcap.com bangkok suite 53 athenee tower 63 wireless road, lumpini, pathumwan, bangkok 10330 thailand tel: +66 8 0700 7900 fax: +6682 2079301 email: info @ heffcap.com new york 347 5th avenue, suite 1402-508 ny, ny 10016 tel: +1 212-252-2129 fax: +1 212-898-1209 email: info @ heffcap.com singapore 3 raffles place #07-01 managed trading account with integrity and stability eliminate concerns about stock market downturn, real estate downturn, bernie madoff's, current events and diversify at the same time; now is the time to get professional portfolio management services with hcm. reap the benefits of proper international diversification and positioning in the global market place, with a high degree of customer service. our managed account program accommodates those investors who wish to allocate a portion of their risk capital to managed hedge funds. find out why we are at the top, select the right investment for inclusion in your portfolio, to receive information and/or get started lower the exposure of your portfolio to the risks of the global marketplace. did you know? major banks around the globe are weighing heavier on relatively shorter term trading speculation than the traditional lending-borrowing business. profits can be made on a falling market (by selling short) just as easily as buying a rising market, in addition, derivatives and cfd trading allows profits to be compounded monthly. let us put the world's most liquid, but least understood market, in your financial arsenal. global portfolio and world events do you have your portfolio directly linked to the economy? real-estate which investment benefits are you lacking? full transparency and audit trail select the right investment for inclusion in your portfolio, to receive information and or get started click here managed trading account you have a choice. there is no need to own \"companies\" . there is no need to own illiquid company stock, funds or real estate \". do you have your portfolio directly linked to the economy? or worse just the stock market or real estate? get a liquid, transparent/separately managed liquid, alternative investment account in your name, where money management, along with capital preservation and liquidity are most important. features: professionally supervised by traders risk/money management (very important to us) trades only occur with the most liquid spot markets high degree of liquidity excellent risk-to-reward ratio profits possible regardless of direction of the market portfolio diversification: currencies, commodities, stocks, bonds, mutual funds, adrs benefits: no one can withdraw funds other than the client the clients deposit direct to custodian the trader can only trade the investor's funds remain in the client's own name. the investor's funds are held by an independent institution. clients have direct access to their account, 24 hours a day capital preservation income generation security quality service planning for the future select the right investments for inclusion in your portfolio, to receive information and or get started click here your use of any of the websites or any of the services (defined below) constitutes your agreement to be bound by and comply with the website terms and conditions and your consent to the collection, use and disclosure of personal information as described in the privacy policy. if you do not so agree and consent, you are not authorized to visit or use our websites or the services. paul ebeling.you can follow any responses to this entry through the how to list your company in singapore. why list on catalist catalist is the first sponsor-supervised listing platform in asia for local and wheat market recap dec wheat finished up .075 at 636.75, 3.25 off the high and 13.50 up from the low."}, {"articleID": "2017081013_00983558_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-08-10", "url": "http://www.businessinsider.in/The-UK-is-now-home-to-hundreds-of-human-traffickers-and-business-is-booming/articleshow/60006366.cms#commentHash", "content": "The UK is now home to hundreds of human traffickers - and business is booming Kieran Corcoran Aug 10, 2017, 07.09 PM Facebook Linkedin WhatsApp Twitter Google + Reddit Continue reading The National Crime Agency said the slave trade in the UK is \"far more prevalent\" than expected. Gangs are making up to £ 600 a day forcing victims into work, including prostitution. Children as young as 12 have been forced into domestic servitude. Senior officer said criminals are shifting their business models towards slavery to maximise profits. LONDON - Britain is home to hundreds of gangsters who have trapped more than 10,000 people in domestic servitude, forced labour, and sex work, senior police officials have said. The gangs make up to £ 600 ($780) from forcing women into sex work, according to the UK's National Crime Agency (NCA), which deals with the most serious cases, and are moving into other types of business as well. Police and border officials have found children as young as 12 forced into domestic servitude. The problem of trafficked labour is also prevalent in the fishing industry, agriculture, construction, and food processing, the NCA said at a press conference on Thursday. It shared footage of a recent raid in the north-east of England, which showed officers breaking down the door of a house and arresting several men. It also showed the inside of a room where women were forced to have sex with the gang's clients. Will Kerr, who is leading the NCA's anti-trafficking operations, said the phenomenon was being driven by criminal organisations changing their business model to focus on human exploitation over other crimes. At the media briefing on Thursday, he said: \"A growing number of crime gangs have realised that, while you can sell drugs once and make a profit once from drugs, you can repeatedly exploit people including the most vulnerable and continue to make money from them on a regular basis.\" Kerr said several gangs were making £ 600 a day from women they forced into prostitution but emphasised that sex crime was not the only type of modern slavery. Twelve-year-old girl sold into domestic servitude He described one case of a 12-year-old Roma girl, who was found by border officials in a recent investigation. The girl, whom he couldn't name or give a location for, had been sold by her father to the criminal gangs and was sold into domestic servitude. Her host family made her take their children to school and clean the house during the day, effectively enslaving her. Kerr described how people are lured from other countries - and to a lesser extent within the UK - by adverts for jobs which later turn out not to exist, often on social media. When they arrive, victims are typically forced into whatever type of work the gang deems them suited for. Gang leaders then take most or all of the money they would be paid. Kerr said it is difficult to spot trafficking victims at the border (they typically arrive on budget flights or a ferry) because they have not yet realised they have been tricked. Slavery is \"far more prevalent than previously thought\" The scale of the problem was emphasised on Thursday at a press event where the NCA admitted that the scale of modern slavery in the UK is \"far more prevalent than previously thought.\" Kerr said the phenomenon was not restricted to any particular area of the country, and is taking place \"every large town and city in the UK.\" The various British police forces currently have 300 separate investigations into human trafficking and slavery, after senior officers decided the scale of the problem demanded a more robust response. An NCA spokesman declined to specify how many gangs are under investigation, but said that at least 300 separate suspects would be involved. Kerr said his agency is now running \"significantly more\" investigations than this time last year, and that \"the more we look for modern slavery, the more we find.\" There are more than 13,000 trafficking victims in the UK The NCA did not provide precise figures, but said that a previous estimate that the UK is home to between 10,000 and 13,000 victims would by now have been superseded. The agency urged people to be aware that people around them could be victims of modern-day slavery. In a statement, it said: \"This is a crime which affects all types of communities across every part of the United Kingdom. It is difficult to spot because often victims don't even know they are being exploited. Nevertheless, we need those communities to be our eyes and ears.\" There will be people living and working where victims come into contact with everyone else's so-called normal lives. \"They may see something they feel is not quite right. That might be someone seeming afraid, vulnerable or being controlled, moved around or forced to work against their will. If they do, we need the public to speak to us.\" The NCA said anyone with suspicions can call their local police force on 101 or the Modern Slavery Helpline, 08000 121 700. We are sharing #SilviasStory today. Here's why - https: //t.co/IndyigM6gL. #ForcedProstitution could be happening on your street @ MSHelpline pic.twitter.com/wlAIsbiMd6 - NationalCrimeAgency (@ NCA_UK) August 10, 2017 Facebook Linkedin WhatsApp Twitter Google + Reddit Follow Business Insider on facebook Like twitter Follow gplus Follow Next Story There is a looming threat to the stock market's calm that's not even on investors' radars More from this author 7 Welsh priests walked into a bar...and...London firefighters defeat massive fire a.. . Several deaths confirmed in horrific Germ...Iraq's prime minister has declared the \"e.. . Video shows gunshots and explosions from...Related Stories Ad tech firm Rubicon Project's stock plummeted aft...The ad fraud issue could be more than twice as big...Tatas might start funding social enterprises Are you making these mistakes in your first job? I.. . India is becoming a hot auto market; Toyota, Volks...Wait is over! One day to\" Baahubali 2' trailer SDMC to make restrooms in South Delhi hotels and r.. . <mark>Trump</mark>'s team and his supporters are taking a victo...More: Promoted Stories 4-year-old needs an urgent Heart Transplant Milaap Help 3-year-old undergo a liver transplant! Milaap Ever Wonder Why <mark>Donald Trump</mark> Doesn't Talk About His Daught. . LifeDaily.com A Solution That Puts Snoring to Bed My Snoring Solution Cop Finds Baby In Dumpster: But 25 Years Later, This Happe. . LifeDaily.com Megahype: The World ´ s first wiperblade cutter ECOCUT pro"}, {"articleID": "2017062205_00169995_W", "names": {"Stephen Thomas": ["Q21030620", "Q7610671", "Q7610672"]}, "date": "2017-06-22", "url": "http://triblive.com/local/westmoreland/12427416-74/greensburg-salem-increases-property-tax-1-mill-for-2017-18", "content": "Greensburg Salem increases property tax 1 mill for 2017-18 Jacob Tierney | Thursday, June 22, 2017, 12:15 a.m. Email Newsletters Sign up for one of our email newsletters. Updated 49 minutes ago At first a divided Greensburg Salem School Board rejected the district's 16th tax increase in 17 years Wednesday night, but eventually reversed its decision after failing to agree on another plan. Property taxes will go up one mill as originally proposed. That will cost the median taxpayer an additional $16.49 a year and bring the total millage to 88.22. Board member Richard Payha was the swing vote. He initially joined board president Ron Mellinger, Jeffrey Metrosky, Robin Savage and Barbara Vernail to vote against the tax increase. However, unlike them, he believed taxes should be higher, not lower, although he also supported spending cuts to balance the budget. \"We have to invest in the children,\" he said. After a lengthy discussion and several failed alternative proposals, Payha decided to vote for the originally proposed increase, joining Frank Gazze, Charlotte Kemerer, Nick Rullo and <mark>Stephen Thomas</mark>. After passing the tax increase, the board approved a $44.7 million 2017-18 budget, 5-4. Payha voted against the budget, saying it did not cut spending enough. Vernail, who voted against the tax increase, voted for the budget, allowing its passage. Although day-to-day expenses are covered by the tax increase, the budget had a $300,000 deficit because the district plans to use money from its reserves to pay for major renovations. After rejecting the first attempt to raise taxes, board members suggested several alternatives. \"How long are we going to keep tapping the well and taking it out on the taxpayers?\" Savage said. Payha recommended cutting supplemental money paid to teachers who take on duties outside their contract, like monitoring buses or supervising students at lunch. Mellinger proposed a half-mill tax increase instead of a full mill. Gazze suggested cutting a proposed new human resources administrator. Board members also aired longstanding budgetary grievances, against the state for mandating high payments to pension funds and charter schools, and Westmoreland County for not reassessing property values in the last 44 years. No proposal won the consensus of a majority of the board, and after a long discussion and a brief break members returned with no suggestions but to vote again on the original budget. In 2001, a Greensburg Salem taxpayer with a property worth the current median value of $16,460 paid $87.44 in school taxes. In 2017-18, that same property owner will pay $145.21--a 66 percent increase. The median household income in Westmoreland County has gone up about 44 percent over the same period, according to census data. District officials say state-mandated pension contributions are to blame for spiralling costs. If these contributions were removed, the 2017-18 budget would be $244,645 smaller than the 2009-10 budget. Mellinger said he was disappointed with the results. The board began this year's budget negotiations facing a deficit of over $600,000. It managed to reduce most of that deficit, and Mellinger believes more could have been done. \"There just has to be more,\" he said. \"If we dropped $400,000 in a month, how could we not find another $200,000? We could have had a balanced budget.\" Jacob Tierney is a Tribune-Review staff writer. Reach him at 724-836-6646 or jtierney @ tribweb.com."}, {"articleID": "2019102118_00069697_W", "names": {"Matthew Brown": ["Q16205624", "Q22323679", "Q3852260", "Q38801557", "Q48869864"]}, "date": "2019-10-21", "url": "http://stamfordadvocate.com/local/article/Stamford-high-schools-host-haunted-houses-14550499.php?src=sthpln", "content": "https: //www.stamfordadvocate.com/local/article/Stamford-high-schools-host-haunted-houses-14550499.php Stamford high schools host haunted houses By Sophie Vaughan Updated 1:33 pm EDT, Monday, October 21, 2019 Geetha Weerakoon, a senior at Stamford High School, adjusts an animatronic Halloween figure that is part of the annual haunted scare house at the school in Stamford, Connecticut ., Friday, Oct. 19, 2018. Stamford High School student council host the haunted attraction, which runs thru Saturday, Oct. 20, from 7 p.m. to 11 p.m. Funds from the event will go to support the senior class. Tickets are $10 for a single run or $15 for unlimited runs. less Geetha Weerakoon, a senior at Stamford High School, adjusts an animatronic Halloween figure that is part of the annual haunted scare house at the school in Stamford, Connecticut ., Friday, Oct. 19, 2018 ....more Photo: <mark>Matthew Brown</mark> / Hearst Connecticut Media Photo: <mark>Matthew Brown</mark> / Hearst Connecticut Media Image 1 of / 1 Caption Close Image 1 of 1 Geetha Weerakoon, a senior at Stamford High School, adjusts an animatronic Halloween figure that is part of the annual haunted scare house at the school in Stamford, Connecticut ., Friday, Oct. 19, 2018. Stamford High School student council host the haunted attraction, which runs thru Saturday, Oct. 20, from 7 p.m. to 11 p.m. Funds from the event will go to support the senior class. Tickets are $10 for a single run or $15 for unlimited runs. less Geetha Weerakoon, a senior at Stamford High School, adjusts an animatronic Halloween figure that is part of the annual haunted scare house at the school in Stamford, Connecticut ., Friday, Oct. 19, 2018 ....more Photo: <mark>Matthew Brown</mark> / Hearst Connecticut Media Stamford high schools host haunted houses 1 / 1 Back to Gallery STAMFORD--Haunted houses are coming to both Westhill High School and Stamford High School just in time for Halloween. Westhill will host its third annual \"Fall Festival and Haunted Halloween Bash\" this Saturday, Oct. 26 in school's Agriscience building. The Fall Festival will run from 2 to 4 p.m. followed by the Haunted House from 4 to 8 p.m. Stamford High School will host its fifth annual Haunted House both this coming Friday and Saturday, Oct. 25 and 26, from 7 p.m. to 11 p.m. in the high school's auxiliary gymnasium. Admission is $10 for access to each event and and the haunted houses are recommended for those ages 12 or 13 or older, or with guardian consent. svaughan @ hearstmediact.com; 203-964-2265; @ SophieCVaughan1 Most Popular 1 As Trump reels, Democrats wonder which of their candidates can beat him 2 Body found at SCSU 3 Stamford Police give child \"ride of a lifetime\" 4 Woman fled accident in Cos Cob with kids: GPD 5 MLB umpire Eric Cooper dies at 52; did playoffs 2 weeks ago 6 Attorney: Troconis \"abused' her Fifth Amendment rights 7 Stamford man charged with selling anti-anxiety pills View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2013090208_00023563_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2013-09-02", "url": "http://www.smartcompany.com.au/politics/057275-labor-pledges-to-raise-asset-write-off-threshold-to-10-000-for-small-business-in-last-effort-campaign-launch.html", "content": "Business groups react to Coalition's decision to cut $5 billion in tax breaks Labor announces GST lodgement relief for small business, but tax experts aren't convinced Coalition unveils small business policy: Superannuation increases deferred for two years Small business divided on Coalition's $5.5 billion parental leave policy - where's the money coming from? The business community has won again. Just days before the federal election, Labor has announced it will increase the instant asset write-off threshold to $10,000 if it returns to government, in a last-minute pledge to business. The announcement caps what has been a lucrative campaign for small businesses, with both sides of politics announcing tax and budget policies which cater to the small end of town. Coalition's announcement it will scrap the increased write-off threshold if it wins government. Peter Strong, executive director at the Council of Small Business of Australia, told SmartCompany the announcement adds \"momentum\" to the economy. \"This is another example of what's happened during the past few weeks with that focus on small business,\" he says. \"Given Joe Hockey wants to remove the tax benefits that have been announced over the past couple of years, the policies are coming much closer together with regard to small business.\" At the Labor launch yesterday, Kevin Rudd said the Coalition was in for a fight as it heads to the polls this coming Saturday - maintaining a defiant stance although polls continue to drift in <mark>Tony Abbott</mark>'s favour. \"And for those who say the fight is up, I say they haven't seen anything yet,\" he said. \"Because we have something worth fighting for.\" Among other promises announced yesterday were a promise to keep investment projects tied to local suppliers and jobs, while Rudd also said the federal government would make states pledge to raise TAFE funding - or face a takeover by Canberra. Several other announcements were made regarding skills and apprentices, including lifting the current apprenticeship completion payment to $2000. The effort may be futile. The latest Australian-Newspoll survey shows support for the government has dropped to 33%. On a two-party preferred basis, the Coalition wins 54% to Labor's 46%. But that hasn't stopped Rudd from trying. This campaign has been mostly focused on small business issues, and the instant asset write-off is a prime example. When the threshold was last increased, small businesses welcomed the move as a boost to confidence. Tax experts are less convinced this time around. Deepti Paton, tax counsel at the Tax Institute, told SmartCompany while the figure is welcome, it doesn't go far enough - the benefit only lasts for less than two years. The higher threshold will last until July 2015, after which it will return to the $6500 rate. \"It's a high number and certainly would be a boost to give the tax system's capability to give an extra bump for additional investments, but you need to bear in mind this only lasts for 22 months.\" \"It's welcome, but we would prefer an affordable long-term change to the tax system such as an accelerated deprecation scheme, rather than constant, short-term boosts.\" Domain names are king: What SMEs need to know and learn from the Melbourne IT-New York Times debacle Domain names are king: What SMEs need to know and learn from the Melbourne IT-New York Times debacle Apple iPhone 5C low-end smartphone photos leak as Steve Wozniak warns of tough fight ahead"}, {"articleID": "2018031922_00216397_W", "names": {"Christopher Jones": ["Q1086779", "Q1086781", "Q16221807", "Q16541128", "Q22005681", "Q26706864", "Q2964754", "Q2966607", "Q2966611", "Q42877769", "Q44375922", "Q49587584", "Q5107029", "Q5112648", "Q5112649", "Q5112650", "Q58485818"], "John Anderson": ["Q13461960", "Q15994265", "Q16146059", "Q16146064", "Q1699148", "Q18576365", "Q18580618", "Q21460175", "Q22003139", "Q2399086", "Q25352589", "Q28232869", "Q3180912", "Q369857", "Q42431836", "Q43126740", "Q43394002", "Q43911342", "Q56650048", "Q56726476", "Q6218937", "Q6218947", "Q6218954", "Q6218975", "Q6218977", "Q6218982", "Q6218984", "Q6219000", "Q6219005", "Q93374", "Q936548"]}, "date": "2018-03-19", "url": "http://kjzz.org/content/623431/overdose-deaths-native-american-communities-skyrocket", "content": "Listen to JazzPHX NPR News: 03-19-2018 5PM ET We are experiencing temporary interruptions to our phone service. Please visit our contact page, send an e-mail to member_services @ rioradio.org or call 480-834-5627 to reach us. Thanks for your patience. Overdose Deaths In Native American Communities Skyrocket (Photo by Johanna Huckeba - Cronkite News) Native Americans and Alaska Natives saw a fivefold increase in overdose deaths between 1999 and 2015, according to recent data from the Centers for Disease Control and Prevention. The increase in that period was higher for Native Americans than any other group, jumping to roughly 22 deaths for every 100,000 people in metropolitan areas and nearly 20 for every 100,000 people in rural areas. But the statistics, while staggering, may represent an undercount for Native Americans and Alaska Natives by as much as 35 percent, because death certificates often list them as belonging to another race, said Dr. Michael Toedt, the Indian Health Services' chief medical officer. As a growing number of tribes file lawsuits against drug manufacturers and distributors, saying they misrepresented addiction risks, the U.S. Senate Committee on Indian Affairs held a hearing focused on the crisis. Federal officials said the opioid epidemic is straining tribal resources. \"I have heard from tribes that there are not enough resources out there certainly any funding that congress can provide would be appreciated,\" Toedt said. Congress is scheduled to vote on a $1.4 trillion dollar budget later this week, and about $10 billion has been earmarked to tackle the opioid crisis nation-wide. Its unclear how much of that will be designated for tribes. <mark>Christopher Jones</mark>, policy director of the Substance Abuse and Mental Health Services Administration, told the committee he's more concerned about man power. \"We can have multiple billions of dollars that could be spent on treatment...but if we don't have providers who can provide the care, whether you're in Indian county or not, you're not going to be able to get access to evidence-based care,\" he said. Officials highlighted the success of expanded telehealth services for remote communities, training law enforcement officers on overdose procedures and providing naloxone, an overdose reversal drug, to tribal first responders. U.S. Attorney <mark>John Anderson</mark>, of New Mexico, said tribal leaders in a northern stretch of the state had called for solutions. One pueblo police chief described losing a brother and sister to overdoses, he said. \"The opioid epidemic knows no boundaries,\" he said. In August, state and tribal officials will come together for a policy academy with the goal of developing develop specific and actionable plans to address opioid crisis with available tribal, state and federal funds. The Associated Press contributed to this report. KJZZ on Twitter"}, {"articleID": "2010112912_00084349_W", "names": {"Jim Bennett": ["Q15486064", "Q18581247", "Q40057201", "Q6193623", "Q6193627", "Q6193628"]}, "date": "2010-11-29", "url": "http://newarkadvocate.com/article/20101129/SPORTS/11290313/1002/Legislation-may-increase-child-support-payments/?odyssey=nav|head", "content": "freedom years director enjoys perks of traveling through her job newark--imagine your job provided the opportunity to travel, domestically and abroad, every month. newark--as the first wave of nationwide health insurance reform begins to take effect, local...granville senior <mark>jim bennett</mark> back on basketball court after injuries granville--one couldn't blame granville's <mark>jim bennett</mark> for asking: \"why me?\" local martial artists honored george annarino and his martial arts students traveled to columbus on nov. for budget-minded holiday shoppers, debit cards seem to offer an ideal combination of convenience...neighbors news meghan huston written by rusty miller associated press columbus--it figures in this bowl championship series era that no. 6 ohio state won't know exactly what it's accomplished this season until the dust clears. the buckeyes captured a share of a record-tying sixth consecutive big ten title, battered rival michigan to extend a record seven-game winning streak in the series and most likely also captured a berth in a bcs bowl game. \"(we were) not good enough to be the outright big ten champions and (get the) automatic bid to the rose bowl and all those things that you shoot for,\" coach jim tressel said after the 37-7 rout of the wolverines. \"but we're pretty fair. and i believe we're a top-10 football team and we're probably going to get to play a top-10 football team.\" the victory against michigan on saturday left the buckeyes in a dead heat atop the big ten standings with michigan state and wisconsin, all at 11-1 overall and 7-1 in the conference. in the case of a tie for the championship involving three or more teams, after other tiebreakers are considered and discarded because they don't apply, the final bcs rankings determine which team draws the conference's automatic spot in the rose bowl. those final bcs rankings don't come out until next sunday, after several conference championship games are played. based on the latest rankings, wisconsin--which beat the buckeyes 31-18 head-to-head--would be smelling roses. but again, until the final rankings come out, nothing in the bcs is final. if they do not pass wisconsin in the bcs, the buckeyes most likely would draw a spot in the sugar bowl against arkansas, or maybe the orange against virginia tech. all of that, of course, could change during the next week. ohio state president gordon gee recently contended big ten and sec teams' schedules are like \"murderer's row,\" and they don't play any \"little sisters of the poor\" teams. he was taking a shot at non-automatic qualifying teams like tcu and boise state, which he said don't deserve to play in the bcs title game because they don't play anybody. critics will point out the buckeyes aren't exactly loading up on powerhouse opponents. their strength-of-schedule ratings put them at or perhaps a little bit below teams such as tcu and boise state. on top of that, ohio state beat only one team all season that had fewer than five losses--and that was ohio (8-4) of the mid-american conference. still, there's no dispute whatsoever ohio state has had a fine season. it won a piece of a bcs conference title, is among only a handful of teams with one or fewer losses and made some history by adding to its string of big ten titles and wins against michigan. \"it's unbelievable how blessed i am to play with these guys,\" said defensive end cameron heyward, a senior who returned despite being projected as a high nfl draft pick. \"i'm surrounded by my friends and i'll always cherish the memories.\" where we go next doesn't matter to me. wherever we go, we'll go and play our hardest. \"junior quarterback terrelle pryor also talked about what he learned and how close he was to his teammates:\" i think i grew up as a person, \"he said.\" i'm more of a patient person. and it was great to get victories with these guys. \"tressel said the season was an unqualified success. newark inmate kristopher willey escapes again; 3 schools locked down mcclain gives peek into plans for multi-use development in newark nov 29: dawes arboretum dawes arboretum open dawn to dusk. visitors center open 8 a.m. to 5 p.m. monday through saturday, and 1 to 5 p.m. sundays and holidays."}, {"articleID": "2018061416_00113309_W", "names": {"Steven Porter": ["Q20985660", "Q7615158"]}, "date": "2018-06-14", "url": "https://www.out-law.com/en/articles/2018/june/gross-payment-cancelled-without-considering-taxpayer/", "content": "Europe \"This will be an extremely disappointing decision for many in the construction industry where the removal of gross payment status can result in the loss of business or failure to win business in the first place,\" said <mark>Steven Porter</mark>, a tax disputes expert at Pinsent Masons, the law firm behind Out-Law. com. JP Whitter (Water Well Engineers) Limited, a family-run business of water well engineers, had its gross payment registration cancelled by HMRC after failing to comply with the CIS by making late payments of taxes. It appealed HMRC's decision, arguing that HMRC should have taken into account the detrimental effect the revocation would have on the company's business. The company said that major customers would be likely to withdraw work if it lost its gross payment status. At the time of HMRC's decision, the company said cancellation would have been likely to lead to the loss of around 60% of the company's turnover and the dismissal of about 80% of its employees. It estimated that recovery would take about ten years. CIS is a tax deduction scheme which involves tax being deducted at source from payments which relate to construction work. It was introduced in order to counter widespread tax evasion amongst subcontractors in the construction industry. Contractors must deduct tax from payments to subcontractors and pay the tax to HMRC. The amount deducted and paid over is allowed as a credit against the subcontractor's liability to HMRC. Subcontractors fulfilling certain conditions can register with HMRC to be able to receive payments gross. This makes a sub-contractor with gross payment status a more attractive party for a contractor to deal with and improves the sub-contractor's cash flow by enabling the sub-contractor to receive the contract price without deduction. The legislation provides that HMRC \"may\" cancel a person's registration for gross payment \"if it appears to them\" that various conditions are satisfied. The company argued that in exercising its discretion to cancel the registration HMRC should take into account the likely impact on the company's business. The First-tier Tribunal agreed with the company but the Upper Tribunal and the Court of Appeal decided that HMRC had no duty to take into account matters outside the CIS regime. Giving the decision of the Supreme Court, Lord Carnwarth said that HMRC did not have an unfettered discretion as to whether to cancel the registration as \"any statutory discretion must be exercised consistently with the objects and scope of the statutory scheme\" . Agreeing with, and quoting from Henderson LJ's decision in the Court of Appeal, he said that HMRC's power did not extend to matters \"which do not relate, directly or indirectly, to the requirements for registration for gross payment, and to the objective of securing compliance with those requirements\" . Lord Carnwarth said that the Court of Appeal had \"rightly emphasised the highly prescriptive nature of the [CIS] scheme\" . \"The mere fact that the cancellation power is not itself mandatory is unsurprising. Some element of flexibility may be desirable in any enforcement regime to allow for cases where the failure is limited and temporary (even if not within the prescribed classes) and poses no practical threat to the objectives of the scheme. It is wholly inconsistent with that tightly drawn scheme for there to be implied a general dispensing power such as implied by the company's submissions.\" \"The goal going forward when a business's status is removed will be seeking to persuade HMRC that the circumstances are within the narrower margin of discretion that the Supreme Court confirmed HMRC has to not remove gross payment status,\" said <mark>Steven Porter</mark>. The Supreme Court also dismissed the Company's arguments that HMRC had breached Article 1 of the First Protocol to the European Convention on Human Rights (A1P1), which entitles a person to \"the peaceful enjoyment of his possessions\" : \"Once it is accepted that the statute does not in itself require the consideration of the impact on the individual taxpayer, there is nothing in A1/P1 which would justify the court in reading in such a requirement. Registration is a privilege conferred by the legislation, which has significant economic advantages, but it is subject to stringent conditions and the risk of cancellation. The impact on the company is no different in kind from that which is inherent in the legislation. I agree entirely with Henderson LJ that the exercise of the power within the scope of the statutory framework comes well within the wide margin of appreciation allowed to the state for the enforcement of tax,\" said Lord Carnwarth."}, {"articleID": "2009072407_00028537_W", "names": {"Eric Hill": ["Q12714522", "Q21458196", "Q2901293", "Q5386728", "Q5386729"]}, "date": "2009-07-24", "url": "http://greeleytribune.com/article/20090724/NEWS/907239954/-1/rss07", "content": "search local dealer inventory and private seller listings what's next? the rape trial of joseph mcclendon, 27, of greeley will resume this morning with closing arguments in weld district court. the final day of an emotional rape trial almost ended in mistrial thursday morning when weld county sheriff's deputies arrested a woman in court after learning she was wanted in arizona for failing to appear to testify in a murder trial. the rape trial of joseph mcclendon, 27, was near its end thursday in weld district court when deputies moved to quietly arrest a woman who was there with mcclendon's family and who also was directly involved in the case. deputies arrested felicia simmons, a key witness against a man accused of murder in arizona. simmons failed to show up to testify in june. \"she is an essential witness as to this murder,\" said mark diebolt, a deputy pima county attorney in arizona who is prosecuting the case of simmons' ex-boyfriend. he is accused of murdering another woman in january 2008. diebolt said his office is trying to extradite simmons back to arizona. simmons' arrest, however, was preceded by an outburst from mcclendon's brother-in-law when mcclendon's sister was mistaken for simmons. the outburst, which included expletives, the appearance of four sheriff deputies and a family member of the alleged rape victim crying and saying she was afraid before being escorted out of the courtroom, all occurred in front of the 13-person jury that has been hearing the case against mcclendon. several jury members said they were concerned that mcclendon's family knew their names. mcclendon has been accused of entering an 18-year-old woman's apartment in the middle of the night in january and raping her three times before she stabbed him with scissors and fled. mcclendon has said the sex between them was consensual, and he testified to that effect thursday afternoon. simmons, the woman arrested in court thursday, was initially contacted by greeley police after they discovered a trail of blood leading to her apartment from the alleged victim's apartment. she initially refused to let investigators in, and they got a warrant to search. inside, they found mcclendon hiding under a pile of clothes in a closet. simmons' reluctance may have been explained by her involvement in the arizona case. initially not cooperative, she had been granted limited immunity in the case against the murder of a romantic rival, angela gayden. <mark>eric hill</mark> is awaiting trial in pima county, where he's been charged with first-degree murder. diebolt said he granted simmons limited immunity if she would lead them to the body. \"we had to grant her limited immunity as to her burying the body. she participated in that part. she rolled up the body in carpet, helped transport the body and drove with the murderer to the desert,\" diebolt said. \"we granted her limited immunity as to that aspect if she would tell us where the body was.\" she left town before divulging the body's location, which police found anyway, diebolt said. \"right before the trial started, her rights were severed as to the children, and she took off,\" diebolt said. without her testimony, diebolt said he didn't have a trial. \"she's been a real thorn in my side.\" the morning outburst in the mcclendon trial in greeley, though, prompted public defender stephanie stout to ask for a mistrial because it would have been prejudicial to mcclendon, especially if jurors were afraid of his family. she indicated there would be strong grounds for an appeal if the jury came back with a conviction because they had witnessed the outburst. chief deputy district attorney steve wrenn said it's not uncommon for jurors to worry about their roles. \"that's the nature of the beast,\" wrenn said. \"the remedy is not to start over from scratch and do it all over again.\" "}]