[{"date": "2018-12-03", "url": "https://www.mercurynews.com/2018/12/03/rubin-saudi-women-activists-jailed-and-tortured-still-trump-supports-mohammed-bin-salman/", "content": "In this Nov. 15, 2018 photo, President Donald Trump speaks during a conference at the Eisenhower Executive Office Building on the White House complex in Washington. Trump said in a statement Tuesday that the U.S. does not condone the killing of the U.S-based Saudi columnist, but that \"foolishly\" canceling $110 billion in arms sales _ as some in Congress have suggested _ would only mean that Saudi Arabia would go to other countries to acquire them. (AP Photo/Manuel Balce Ceneta) By Trudy Rubin | Philadelphia Inquirer PUBLISHED: December 3, 2018 at 12:45 pm | UPDATED: December 3, 2018 at 12:59 pm By Trudy Rubin Philadelphia Inquirer Saudi Crown Prince Mohammed bin Salman (known as MBS) is eager to restore his reformer image after the CIA, and most of the world, has concluded he ordered the killing of Saudi journalist Jamal Khashoggi. President Trump is eagerly trying to aid the prince, disputing the CIA's conclusion and refusing to let CIA Director Gina Haspel testify to the Senate on this revolting affair. But if you need any more warnings about the reckless temperament of the Saudi to whom Trump has hitched his entire Mideast policy, consider this: As part of his campaign to squash any dissent, even from moderates who support the monarchy, MBS has presided over the jailing of 18 women's rights activists this year. They include the best-known campaigners for Saudi women's right to drive, such as the courageous Loujain al-Hathloul. Several of the women have allegedly been tortured, according to Human Rights Watch and the Wall Street Journal, with electric shocks and lashings. At least one has been sexually assaulted, says the Journal, and one has attempted suicide. \"Under MBS, the crackdown has been unprecedented in modern Saudi society,\" says <mark>Michael Page</mark>, deputy Middle East director at Human Rights Watch. \"This treatment of women tells us this image we've been sold in the West of MBS as a reformer is a fraud .\" Yet MBS is receiving unstinting White House support. The crown prince waltzed around the Group of 20 industrial nations meeting in Buenos Aires, grinning and high-fived by Vladimir Putin, and schmoozed on the sidelines by President Trump and Ivanka, that famous women's rights champion. No word from this supposed women's rights champion about the Saudi assault on jailed female activists, nor from her husband, Jared Kushner, a big MBS booster and buddy. Of course, MBS has already become renowned in his short tenure for his determination to silence perceived critics, targeting any businessmen, relatively moderate clerics, intellectuals, and even members of the royal family. The prince's pursuit of Khashoggi typified his paranoia: The journalist had long worked for and supported the royal family and went into exile only when he realized that MBS could not tolerate the slightest criticism. But MBS's crackdown on these women activists is especially bizarre, given that, in June, he finally lifted the Saudi ban on women driving--the only such ban in the world. To better understand the prince's mind-set, I turned to a column written by Khashoggi in May for the Washington Post. \"It is appalling to see icons of reform branded as\" traitors' on the front pages of Saudi newspapers, \"he wrote, in reference to the crackdown on women (and men) who had long championed many of the same social freedoms--including women's right to drive--that the prince supposedly endorsed. Khashoggi concluded:\" These arrests are about controlling the narrative. No independent voice or counter opinion will be allowed. \"MBS could not tolerate the idea that these women might take credit for the lifting of the driving ban, or push for further freedoms for women. So it labeled the women traitors for speaking to foreign media about social change. Who are some of these\" traitors \"? Iman al-Nafjan is a mother of three and former blogger for Amnesty International who was one of the leading campaigners for women's right to drive. Aziza al-Yousef is a 60-year-old professor at Riyadh's King Saud University. And then there is Hathloul, 29, who became the face of the driving movement in 2014 when she drove from the United Arab Emirates toward Saudi Arabia, live-streaming her journey. She was arrested at the Saudi border and spent 73 days in jail. The indomitable Hathloul was kidnapped in March while driving in Abu Dhabi, where she had been studying, forcibly returned to Saudi Arabia, and banned from posting on social media. In May, she was arrested and branded a\" traitor. \"Her husband was kidnapped from a hotel room in Jordan and returned to Saudi Arabia, according to the Washington Post. According to the Wall Street Journal, the central official in the campaign vs. women's - rights activists is none other than MBS's right-hand man, Saud al-Qahtani, the same man accused by U.S. officials of playing a key role in the operation that killed Khashoggi. The U.S. Treasury has sanctioned Qahtani, and he has supposedly been fired, but he is still continuing as a key adviser to MBS. The issue here is not the U.S.-Saudi alliance. but rather Trump's reliance on a reckless prince, which will continue to backfire. Every aspect of American foreign interests that MBS has touched has failed, from his kidnapping of the Lebanese prime minister, to his failure to godfather an Israeli-Palestinian peace, to the misbegotten Yemen war into which he dragged the United States. Related Articles Rubin: China's future weapon vs. the U.S.: Its growing middle class Rubin: View from China: Will Trump and Xi avoid a new Cold War? Rubin: There's something very wrong with Trump's careless adoration of that n-word. Rubin: Trump has made it kosher for anti-Semitism to reenter the American mainstream The White House is clearly eager to whitewash the CIA's conclusions about the murder of Khashoggi. But the reports of torture of jailed Saudi women send warning signals so blinding, they must not be ignored. Trudy Rubin is a Philadelphia Inquirer columnist. © 2018, Chicago Tribune. Distributed by Tribune Content Agency. Report an error Policies and Standards Contact Us Get Morning Report and other email newsletters Sign Up Follow Us Facebook Twitter Instagram RSS", "articleID": "2018120321_00107980_W", "names": {"Michael Page": ["Q16104944", "Q18635469", "Q6833333", "Q6833334"]}}, {"date": "2018-12-03", "url": "http://wjtv.com/news/national/trump-praises-witness-who-refuses-to-testify-against-him/1637396094", "content": "Trump praises witness who refuses to testify against him By: Posted: Dec 03, 2018 04:29 PM CST Updated: Dec 03, 2018 04:29 PM CST WASHINGTON (AP) - President Donald Trump praised a key witness in the Russia investigation Monday for having the \"guts\" not to testify against him, and said his former lawyer - who cut a deal with prosecutors - should head straight to prison. In a pair of politically charged tweets, Trump made clear that he is closely watching those who turn on him in the special counsel's probe, which has ensnared some of the president's closest advisers. So far, five people in Trump's orbit have pleaded guilty to federal charges. The tweets add to mounting questions about whether Trump is taking steps to improperly influence witnesses in an investigation that has enraged him and shadowed his administration. Some legal experts, though, say they may not amount to witness tampering if Trump didn't directly tell others what to say or not say. Trump already has come under scrutiny from critics who fear he may use his executive power to protect himself as well as friends and supporters. Last week, Trump told the New York Post that a pardon for his former campaign chairman Paul Manafort was not off the table. Prosecutors say Manafort torpedoed his plea deal with special counsel Robert Mueller by repeatedly lying to them, although Manafort denies that he lied. In one of Monday's tweets, Trump took aim at <mark>Michael Cohen</mark>, his former personal attorney who once grandly declared he would \"take a bullet\" for the president but ultimately took a plea deal. <mark>Cohen</mark> pleaded guilty last week to lying to Congress about negotiations he had on Trump's behalf for a real estate deal in Moscow. Though he told lawmakers the talks were done by January 2016, he admitted they actually lasted as late as June - after Trump had clinched the Republican nomination and after Russians had penetrated Democratic email accounts for communications later released through WikiLeaks. <mark>Cohen</mark> said he lied out of loyalty to Trump, who insisted throughout the campaign that he had no business dealings in Russia, and to be consistent with his political messaging. On Monday, Trump ripped into <mark>Cohen</mark> on Twitter. \"You mean he can do all of the TERRIBLE, unrelated to Trump, things having to do with fraud, big loans, Taxis, etc., and not serve a long prison term?\" Trump added that <mark>Cohen</mark> \"makes up stories to get a GREAT & ALREADY reduced deal for himself .\" Trump added: \"He lied for this outcome and should, in my opinion, serve a full and complete sentence .\" Minutes later, Trump lavished praise on his former campaign adviser <mark>Roger Stone</mark>. Mueller's prosecutors are investigating <mark>Stone</mark> to learn whether he had advance knowledge of WikiLeaks' plans to release hacked material damaging to Hillary Clinton's presidential effort. Trump lauded <mark>Stone</mark> for saying he'd never testify against the president. \"This statement was recently made by <mark>Roger Stone</mark>, essentially stating that he will not be forced by a rogue and out of control prosecutor to make up lies and stories about\" President Trump,' \"he tweeted .\" Nice to know that some people still have \"guts!'\" <mark>Stone</mark> then posted a screenshot of Trump's tweet with a caption that said he was proud of their 40-year relationship and \"prouder still of the amazing job he is doing making America Great Again!\" Sen. <mark>Mark Warner</mark>, the top Democrat on the Senate intelligence committee, said Trump's tweet was inappropriate. \"The President of the United States should not be using his platform to influence potential witnesses in a federal investigation involving his campaign,\" <mark>Warner</mark> said in a tweet. <mark>Stone</mark> said the idea that Trump's tweet amount to witness tampering is \"hysterical .\" \"I'm not a witness to any proceeding,\" he said. <mark>David Weinstein</mark>, a former Justice Department prosecutor in Florida, said he was surprised by Trump's comments Monday, but didn't believe the tweets alone rose to the level of obstruction or witness tampering because Trump did not explicitly tell anyone what to say or not to say. Subjects of an investigation can still communicate to others entangled in a probe, and though they can encourage them to tell the truth, they cannot coach them to lie, he said. \"What he seems to be saying is that people who continue to show support for him, in some way, may be rewarded for that support,\" <mark>Weinstein</mark> said. \"I don't think it rises to the level of obstruction yet, but it certainly would cause people who are conducting the investigation to start asking questions about whether or not the target has reached out to them .\" Trump's message had an immediate effect on supporters. His remarks prompted Michael Caputo, the president's former campaign aide and a longtime <mark>Stone</mark> friend, to launch a \"GoFundMe\" account to help pay <mark>Stone</mark>'s mounting legal fees. <mark>Stone</mark> said he's paid about half a million in legal fees already and is projecting that total to reach $2 million. \"I require a small platoon of excellent lawyers and they're not inexpensive,\" he said. A conservative author, who is an associate of <mark>Stone</mark> and in the crosshairs of Mueller's investigation, filed a complaint Monday with the Justice Department, alleging prosecutors tried to coerce him to give false testimony and threatened to indict him. Investigators are looking into whether Jerome Corsi had contact with WikiLeaks or knew about their plans to release emails damaging to Clinton. Corsi has released documents showing Mueller's prosecutors offered him a deal to plead guilty to a false statements charge but he's rejected the offer. Corsi says he didn't knowingly mislead investigators and wasn't in contact with WikiLeaks. The Justice Department declined to comment on his complaint. The Russia investigation has dogged Trump for two years. In recent weeks, Trump has sharpened his criticism, accusing Mueller's prosecutors of dirty tactics and pressuring witnesses to lie. <mark>Cohen</mark>'s decision to turn on his former boss was a particularly striking blow for the president. <mark>Cohen</mark> pleaded guilty in August to eight criminal counts, including campaign-finance violations, in a separate case unrelated to Mueller's investigation. He said Trump directed him to arrange the payment of hush money to porn star Stormy Daniels and a former Playboy model in the run-up to the 2016 campaign. <mark>Cohen</mark>'s admission during that court appearance marked the first time that a Trump associate had gone to court and implicated Trump in a crime. Whether - or when - a president can be prosecuted remains a matter of legal dispute. Trump has denied any wrongdoing as well as the extramarital affairs. ___", "articleID": "2018120322_00308811_W", "names": {"David Weinstein": ["Q1177127", "Q1177128"], "Mark Warner": ["Q14949474", "Q1617921", "Q21166633", "Q453893", "Q51299121", "Q6770231"], "Michael Cohen": ["Q16728129", "Q18038631", "Q1930523", "Q22277395", "Q28868110", "Q6829330", "Q6829331", "Q6829332", "Q6829335", "Q6829336"], "Roger Stone": ["Q19653753", "Q7358961"]}}, {"date": "2018-12-05", "url": "http://www.theday.com/national-politics/20181204/maryland-dc-seek-trumpx2019s-trust-business-tax-returns", "content": "Maryland, D.C. seek Trump's trust, business tax returns Published December 04. 2018 8:10 PM By Andrew M. Harris and Shahien Nasiripour, Bloomberg News WASHINGTON--Maryland and Washington, D.C., officials unleashed a burst of subpoenas seeking financial records that would penetrate <mark>Donald Trump</mark>'s closely guarded trust and business and reveal whether the president is profiting off foreign governments. Among the investigative demands issued Tuesday to more than 30 business entities, competitors and government agencies is a request for state and federal tax returns of Trump's personal trust and the Trump Organization. The officials are seeking information about spending by foreign and domestic governments at Trump's D.C. hotel as part of a lawsuit accusing the president of enriching himself through the White House. Unless the specific requests are blocked by a court, the records could allow attorneys general in Maryland and the District of Columbia to pierce a layer of secrecy that Trump and his company have zealously guarded--namely, which governments the company is pitching for business and how much revenue Trump has generated from overseas officials while in public office. The subpoenas, many of which the attorneys general publicly disclosed, come a day after a federal judge approved a schedule for the two sides to exchange documents as part of the attorneys general's lawsuit. The suits claim Trump's ownership of the luxury hotel violates the U.S. Constitution's emoluments clauses because visiting government officials may be spending money there to curry favor with the president. Along with the Trump Organization, the attorneys general seek documents from the Donald J. Trump Revocable Trust, Trump International Hotels Management LLC and related entities. The officials also want records from the hotel's competitors and the U.S. departments of Defense, Commerce and the Treasury, as well as the state of Maine. The case is among a number of legal and political challenges to Trump's ownership of a sprawling empire, spurring criticism from Democrats and some Republicans that Trump is seeking to profit off the presidency. In winning the court's approval to delve into Trump's records, the D.C. and Maryland attorneys general are now entering a realm of the president's life he once declared off-limits to those probing him. But that hasn't stopped investigators. Last week, special counsel Robert Mueller won a guilty plea from Trump's longtime personal lawyer, <mark>Michael Cohen</mark>, who told a judge that the then-candidate secretly sought to develop a Moscow Trump Tower until well after the 2016 Iowa primary. And last month New York Attorney General Barbara Underwood won a court ruling allowing the state to move forward with a lawsuit accusing the president and his three oldest children of engaging in a decadelong pattern of self-dealing and using his nonprofit's funds for political purposes. Trump and his children have denied the allegations. The attorneys general lawsuit is taking a different tack, searching for proof that Trump's luxury hotel--just blocks from the White House--is enriching him in violation of the U.S. Constitution. The lawsuit names just Trump as a defendant. But included among the many targets of the broad subpoenas are documents related to the flow of money from the hotel to the president's pocket, the extent of foreign and domestic government business at his hotel, and steps taken to attract their dollars. In addition to the tax returns, the attorneys general are seeking organizational charts, communications between the U.S. government and Trump companies, a list of hotel guests and restaurant customers employed by foreign or domestic governments, and insight into how the company calculated a $151,470 payment to the U.S. Treasury, ostensibly from foreign sources. \"On Feb. 22, 2018, the Trump Organization voluntarily donated to the U.S. Treasury all profits identified as being from foreign government patronage at our hotels and similar businesses,\" company spokeswoman <mark>Amanda Miller</mark> said. \"We intend to make a similar contribution in 2019 .\" The attorneys general also want records about \"the anticipated and actual impact of the 2016 presidential election\" on the hotel's finances, according to the subpoenas. The attorneys general will review competing hotels, restaurants and event spaces in Maryland and the District for evidence they're losing customers to the president. Some foreign governments have been open about spending money at Trump's Pennsylvania Avenue hotel. The Philippines hosted an event at the hotel in June to mark the 120th anniversary of its independence. Lobbyists representing Saudi Arabia spent some $270,000 at the hotel last year as part of an effort to derail terrorism legislation, according to filings with the U.S. Justice Department. Sen. Bob Menendez, the top Democrat on the Senate Foreign Relations Committee, has requested information from the embassies of Kuwait, Bahrain and Azerbaijan regarding events they've held at Trump's hotel since his 2016 election. Justice Department lawyers last week told U.S. District Judge Peter Messitte that they'll seek permission from an appeals court in Richmond, Va., to appeal and to freeze the evidence-gathering process while that review plays out .---- --", "articleID": "2018120501_00227597_W", "names": {"Amanda Miller": ["Q18154419", "Q55825839", "Q56508116"], "Donald Trump": ["Q22686", "Q27947481"], "Michael Cohen": ["Q16728129", "Q18038631", "Q1930523", "Q22277395", "Q28868110", "Q6829330", "Q6829331", "Q6829332", "Q6829335", "Q6829336"]}}, {"date": "2018-12-06", "url": "http://www.theage.com.au/politics/federal/minister-slams-labor-protection-racket-after-union-high-court-failure-20181206-p50kmd.html", "content": "Minister slams Labor \"protection racket' after union High Court failure Minister slams Labor\" protection racket' after union High Court failure Larger text sizeVery large text size Federal Industrial Relations Minister Kelly O'Dwyer has accused the Labor Party of running a \"protection racket\" for union thugs, after the High Court threw out a CFMMEU appeal against a decision to impose maximum fines on the union and its law-breaking official. The militant Construction, Forestry, Maritime, Mining and Energy Union had sought leave to appeal a full Federal Court decision imposing a maximum $306,000 fine against the union, and $10,200 against the official who abused a site manager while breaching right-of-entry laws. Industrial Relations Minister Kelly O'Dwyer says Labor must distance itself from the militant CFMMEU. Alex Ellinghausen / Fairfax Media Credit: The High Court ordered the CFMMEU to pay the Australian Building and Construction Commission's legal costs of defending the application, which had sought to challenge the penalty imposed on the union and its former Queensland president Dave Hanna. Mr Hanna was found to have breached right of entry laws at a Brisbane construction site, squirting water in the face of the site manager and refusing to leave while firing off obscenities in the 2015 incident, saying: \"Take that phone away or I'll f--ing bury it down your throat .\" Advertisement Former CFMEU Queensland president Dave Hanna was hit with the maximum penalty for his \"abhorrent\" behaviour. ABCC Commissioner Stephen McBurney said the High Court's refusal to grant special leavevindicated the Commission, which Opposition Leader Bill Shorten has pledged to abolish if Labor wins the coming federal election. \"I will continue to seek the imposition of maximum penalties in appropriate cases to deter repeat offending by the CFMMEU and others,\" Mr McBurney said. Ms O'Dwyer agreed, saying the ABCC was \"a very important cop on the beat\". \"It is very important that we have a regulator that is ensuring that we are putting an end to thuggery, bullying and intimidation on construction sites right across this country,\" she said. Ms O'Dwyer slammed Labor for its opposition to the ABCC, saying if elected it would \"want to run a protection racket for the CFMMEU who are engaged in what can only be described as thuggish behaviour. It shouldn't be tolerated .\" She said the courts had \"made very clear that the CFMMEU are one of the most recidivist unions in this country\". \"They are up before the Federal Court time and time again,\" she said, repeating her call for Mr Shorten to distance himself from the CFMMEU. \"Even Bob Hawke, former leader of the union movement, has said that there needs to be a disassociation from the thuggish tactics involved,\" she said. Mr Hawke famously deregistered the Builders Labourers Federation when he was prime minister in 1986, a task the Coalition has been unable to achieve with the CFMMEU, which was known as the CFMEU before it merged with the Maritime Union in March. The vast majority of cases brought by the ABCC involve the CFMMEU, which paid $5.6 million in fines over the past financial year, as the main defendant. The government's Ensuring Integrity Bill, which would make it easier to deregister law-breaking unions, remains held up in the Senate and is not expected to pass, while employers have mounted a legal challenge against the CFMMEU merger. The Australian Council of Trade Unions, which supports the CFMMEU's tactics, is campaigning for a dramatic overhaul of the nation's industrial relations laws. Mr Shorten has promised to \"look closely\" at the union peak body's demands, including a return to industry-wide bargaining, ahead of Labor's national conference next weekend. Federal Circuit Court Judge Salvatore Vasta said while imposing the fines against Mr Hanna and the CFMMEU that it was \"the most recidivist corporate offender in Australian history\". On appeal in the Full Federal Court, Justice <mark>Richard Tracey</mark> said the union had \"determined that its officials will not comply with the requirements of [the Fair Work Act] with which it disagrees\" and \"simply regards itself as free to disobey the law\". Labor industrial relations spokesman <mark>Brendan O'Connor</mark> and the CFMMEU have been approached for comment.", "articleID": "2018120604_00325239_W", "names": {"Brendan O'Connor": ["Q4961041", "Q4961043", "Q4961047"], "Richard Tracey": ["Q7329532", "Q7329533"]}}]