[{"date": "2018-12-06", "url": "http://thehill.com/homenews/senate/419970-manchins-likely-senior-role-on-key-energy-panel-rankles-progressives", "content": "Sen. Joe Manchin Joseph (Joe) Manchin Overnight Health Care: Manchin pitched <mark>Trump</mark> on reviving bipartisan ObamaCare fix | 4 in 10 don't plan to get flu shots | Survey finds more than a quarter have pre-existing conditions Overnight Energy: Senate advances <mark>Trump</mark> energy pick | Manchin votes \"no' in surprise | Carbon emissions on track for record | EPA targets another Obama coal rule Senate advances <mark>Trump</mark> energy pick after Manchin flips MORE (D-W. Va.) is likely going to be the top-ranking Democrat on a powerful energy committee in the next Congress--and that is not sitting well with various voices on the left. The West Virginia centrist narrowly won his midterm election by championing the coal industry and emphasizing his relationship with President <mark>Trump</mark> <mark>Donald</mark> John <mark>Trump</mark> Napolitano: <mark>Trump</mark> Jr. thinks he will be indicted by Mueller Dems cry foul in undecided N.C. race On The Money: <mark>Trump</mark> touts China actions day after stock slide | China\" confident' on new trade deal | GM chief meets lawmakers to calm anger over cuts | Huawei CFO arrested MORE. He is favored to be the ranking member on the Energy and Natural Resources Committee, which oversees the Department of Energy and Interior Department. But progressive politicians including Rep.-elect Alexandria Ocasio-Cortez Alexandria Ocasio-Cortez Ocasio-Cortez confirms she will pay interns \"at least' an hour WaPost fact checker gives Ocasio-Cortez four Pinocchios for Pentagon claim Ocasio-Cortez: Fighting climate change will be\" the civil rights movement of our generation' MORE (D-N.Y.) and potential 2020 hopeful Washington Gov. Jay Inslee (D) want Senate Democratic leaders, namely Senate Minority Leader Charles Schumer Charles (Chuck) Ellis Schumer The Hill's 12:30 Report--Latest on Dem leadership votes | <mark>Trump</mark> threatens new auto tariffs | Senators briefed on Khashoggi Schumer welcomes his first grandchild No, it's not a gamble for Dems to back Beto for president MORE (N.Y.), to override the rules to circumvent Manchin. \"At this moment it is simply intolerable and unacceptable for the U.S. Senate to have a senator who is unalterably opposed to the cap-and-trade system and other measures that we worked so hard to advance as climate policy against climate denial,\" Inslee told The Hill. Inslee, who backed his state's ballot initiative that would have instituted the nation's first carbon tax, called on the Senate to find a way to intervene, regardless of Senate protocol. He launched a petition drive Wednesday asking Democratic leaders to stop Manchin. \"The fundamental thing I'm saying is the fate of the planet right now has got to <mark>trump</mark> any seniority system of the U.S. Senate,\" he said. Ocasio-Cortez, who hails from Schumer's home state, has introduced her own \"Green New Deal\" plan to transition the country to run solely on renewable energy sources for electricity. Asked about Manchin's possible position on the panel, Ocasio-Cortez on Friday responded, \"I have concerns because I don't think we should be financed by the industries that we are supposed to be legislating and regulating .\" While the Energy Committee doesn't have a direct say on issues like climate change, it plays important roles in areas like federal land and energy policy. The ranking member is expected to try to stop objectionable nominees, attempts to waive environmental laws for logging or oil drilling and perform other tasks. \"The ranking member is a backstop to extreme measures,\" said a former committee aide. \"Some of the concern would be, if no one is pushing back, then it's like there's no minority power .\" Manchin frequently sides with the GOP on the energy panel. He has backed the <mark>Trump</mark> administration, for example, in its ongoing attempts to aid the coal and nuclear power industries, despite nearly unified Democratic opposition. ADVERTISEMENT In a committee vote last month, he supported Bernard McNamee, <mark>Trump</mark>'s nominee to the Federal Energy Regulatory Commission, who worked at the Energy Department in support of the coal efforts. But he flipped on Wednesday and voted against limiting debate on McNamee in the full Senate. With Senate committee leadership established by seniority, Manchin could only feasibly be denied the position in two ways: another senior senator vies for the job or Schumer disregards the rules and appoints someone else. But the four Democrats who would be eligible to fill the position aren't interested. The list includes Sen. Bernie Sanders Bernard (Bernie) Sanders Andrew Gillum met with Obama during DC visit: report Deval Patrick telling staff he'll pass on 2020 White House bid: report The Hill's Morning Report--Presented by T-Mobile--What the <mark>Michael Flynn</mark> news means MORE (I-Vt .), a possible 2020 presidential candidate who supports climate change legislation, and who said he wants to remain ranking member of the Budget Committee. \"I'm with Budget,\" he told The Hill. The Budget Committee oversees the Congressional Budget Office, sets high-level numbers for government spending and works to ensure that the Senate doesn't violate budgetary rules. Sen. Debbie Stabenow Deborah (Debbie) Ann Stabenow This week: Lawmakers return to mourn George H.W. Bush George H.W. Bush remembered at Kennedy Center Honors GOP lawmakers say <mark>Trump</mark> should tamp down trade rhetoric MORE (D-Mich .) confirmed Wednesday that she is committed to heading the minority on the Senate Agriculture Committee and offered support for Manchin heading Energy. \"I think that Joe understands the difference between representing your state as a member and the responsibility to the caucus as a ranking member, and so I think he has a larger responsibility in that role,\" Stabenow said Wednesday. \"I think at this point if he is next up in seniority than I think that's the way the process works .\" Sen. Maria Cantwell Maria Elaine Cantwell Senate advances <mark>Trump</mark> energy pick after Manchin flips Senate panel advances <mark>Trump</mark>'s energy nominee despite Dem objections Privacy legislation could provide common ground for the newly divided Congress MORE (D-Wash .), the current ranking member, is seen as likely to take the top spot on the Commerce, Science and Transportation Committee. That position is open because Sen. <mark>Bill Nelson</mark> Clarence (<mark>Bill</mark>) <mark>William Nelson</mark> Rick Scott delays Senate swearing-in ceremony Races Dems narrowly lost show party needs to return to Howard Dean's 50 state strategy Scott suspends Broward County official Brenda Snipes over \"widespread issues with voting' MORE (D-Fla .) lost his reelection bid last month. Cantwell is the next most senior senator available for the spot. She has avoided saying publicly whether she'll take it, and didn't answer a question about it Wednesday. Sen. Ron Wyden Ronald (Ron) Lee Wyden Marriott breach spurs new privacy law push Overnight Health Care: Top biotech lobbyist sees industry under\" greater threat' than ever | Senators offer bipartisan drug pricing <mark>bill</mark> | 5.1 M pounds of beef added to salmonella recall Bipartisan senators introduce new drug pricing <mark>bill</mark> MORE (D-Ore .) also has more seniority than Manchin. But the Finance Committee, where he is currently the top Democrat, is one of the most prestigious in the Senate, and he's given no indication that he would give up the position. Manchin is committed to taking over the job. He told reporters Wednesday that since Senate Democrats have historically handed out ranking memberships based on seniority, he deserves the post. \"I think you all have been around here long enough to understand the system, don't you? Seniority is what it is. So we'll see what happens,\" Manchin said. With other possibilities appearing exhausted, critics of Manchin said the best way to stop him is for Schumer to sidestep Manchin's appointment for a nonsenior candidate. Sen. Martin Heinrich Martin Trevor Heinrich Senate panel advances <mark>Trump</mark>'s energy nominee despite Dem objections Dems wonder if Sherrod Brown could be their <mark>magic man</mark> Heinrich wins reelection to Senate in New Mexico MORE (D-N.M.) would be the next in line. \"The first thing is, Joe Manchin is categorically unacceptable as ranking member and the second thing is that Chuck Schumer Charles (Chuck) Ellis Schumer The Hill's 12:30 Report--Latest on Dem leadership votes | <mark>Trump</mark> threatens new auto tariffs | Senators briefed on Khashoggi Schumer welcomes his first grandchild No, it's not a gamble for Dems to back Beto for president MORE can fix this,\" said Lukas Ross, senior policy analyst at Friends of the Earth. \"This is truly a question of moral courage and leadership--it is within his power to waive the seniority rules .\" But doing so would be extremely rare, and could be politically risky--especially considering rumblings that Manchin in the past has considered flipping parties. Senate Democrats take seniority seriously, and could see exceptions as a threat. Schumer's staff would not comment on the record. \"I can't think of instances where it happened. I can think of instances where people agitated for it to happen,\" said a former Democratic leadership aide. \"Everybody just feels like it won't be done,\" said another former staffer. Furthermore, Manchin serves on Schumer's leadership team and the two senators enjoy a close working relationship. \"There's not a snowball's chance in hell that Schumer would push him off for somebody more junior,\" said <mark>Jim Manley</mark>, a Democratic strategist who worked for former Senate Majority Leader <mark>Harry Reid</mark> Harry Mason Reid Water wars won't be won on a battlefield Poll finds most Americans and most women don't want Pelosi as Speaker Schumer walking tightrope with committee assignments MORE (D-Nev .). <mark>Manley</mark> added that Schumer and Manchin have a strong alliance, due largely to Schumer's long-standing refusal to criticize Manchin's more conservative positions. \"I can assure you they have a great relationship,\" he said. That relationship could work to Schumer's advantage. \"If Manchin does ascend to the ranking membership, he has to be attentive to what the Democratic leader's priorities and concerns are, and I would hope that that is actually the case,\" the former aide said. \"Not that there won't be tensions and issues that give the Republicans an opportunity to put the Democrats on the committee in a difficult position, but hopefully with communication and some leadership, they'll figure out how to navigate those situations .\" Tags Alexandria Ocasio-Cortez Debbie Stabenow Martin Heinrich Charles Schumer Bernie Sanders Maria Cantwell Chuck Schumer <mark>Donald Trump</mark> Joe Manchin <mark>Bill Nelson</mark> <mark>Harry Reid</mark> Ron Wyden", "articleID": "2018120611_00390505_W", "names": {"Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"], "Donald Trump": ["Q22686", "Q27947481"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Jim Manley": ["Q16105372", "Q48976990", "Q6196608"], "Magic Man": ["Q23928996", "Q2654402"], "Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"], "William Nelson": ["Q18601511", "Q54093519", "Q8016066"]}}, {"date": "2018-12-06", "url": "http://feeds.marketwatch.com/~r/marketwatch/internet/~3/S2aX37IYXzw/story.asp", "content": "Stock-market bulls are definitely not catching any breaks these days, and Thursday isn't looking like the exception. Thus far, the market isn't sanguine about the chances for further progress on trade relations between the U.S. and China, after the arrest of Huawei's CFO Meng Wanzhou. Indeed, carnage in global equity markets is already on display. Combine that narrative with an OPEC production gathering that has the market on a knife's edge, and the recipe for more pain seems fairly baked in as traders return from a day off to mourn the 41st U.S. President George H.W. Bush. That detention of a high-profile tech executive in China is being credited, at least in part, for some crazy action for S & P 500 futures as electronic trade restarted in the wee hours of Thursday. As this chart shows, those futures plummeted so viciously at the open that the CME had to step in and stop trading for a period, just to cool things off: FactSet/MarketWatch That leads us to our call of the day from trader Greg McKenna, who runs McKenna Macro. He says while the jury's still out on whether a so-called fat finger, or accidental trade, caused that big spike down, or it was something else, it's a warning shot for investors. \"This is a very dangerous set up. I'm not Chicken Little, but we need to see a base build up or prices will slip,\" he said in emailed comments. \"Market collapses happen from weakness so we need to get through Thursday trade in the U.S. to give folks more confidence again .\" As for retail investors, probably a bit frazzled by now given what the week has thrown at them so far, his advice is to \"stay in the time frame that they trade. Investors invest, and traders trade. Don't get caught outside those parameters .\" McKenna says cash is a \"reasonable alternative\" right now, for those who are a bit unnerved right now. He says the levels to watch are 2,600 for the S & P 500 and above 2.8% for the yield on the 10-year Treasury note. In addition to trade worries, investors have been focused on a narrowing of the yield spread between the 2-year and 10-year government bonds to the tightest gap in about 11 years has many fretting about a potential recession. Read: Money-management CEO sees \"significant slowdown' in economy, shifts to less-risky investments While some are fretting about that outsize move overnight, others are taking a glass half-full view .\" Personally I think everyone looking at this the wrong way. the circuit breaker worked and limited the damage. Everyone missing that point that an algos-gone-rogue was prevented by CME systems from causing further unnecessary losses, \"said <mark>Chris Weston</mark>, head of research in Pepperstone, in emailed comments .\" So many are worried about a world with algos causing distortions but in the case we can sleep slightly better at night--the system won, \"said <mark>Weston</mark>. I REFUSE TO BELIEVE THE FUTURES. THE PAJAMA TRADERS KNOW NOTHING. THEY KNOW NOTHING!--Ramp Capital ♿ ️ (@ RampCapitalLLC) December 6, 2018 The market Dow YMZ8, -1.45% S & P 500 ESZ8, -1.30% and Nasdaq NQZ8, -1.62% futures are deep in the red. That's after Tuesday's bloodbath wiped 800 points off the Dow DJIA, -3.10% making for the worst day in a month for all three big indexes SPX, -3.24% COMP, -3.80% Read: Here's one theory to explain the stock market's plunge on Tuesday Europe SXXP, -2.12% is also in the red, and it was no better in Asia, which saw widespread losses, led by Hong Kong HSI, -2.47% Crude US: CLU8 has taken a big hit as the market grapples with the Vienna OPEC meeting where there's some confusion over a potential production cut. The dollar DXY, -0.09% is flat and gold US: GCU8 is easier. The yield on the 10-year Treasury note TMUBMUSD10Y, -0.79% is hovering at 2.894%. Read: Brace for a 15% plunge in S & P 500 next year if the Treasury yield curve fully inverts Check out the Market Snapshot column for the latest action. The buzz Huawei's CFO was detained on Saturday, but news seemed to get around slowly and take the market by surprise in Asia Thursday. Arrests don't get more high-profile than Meng--the daughter of the Chinese telecommunications giant's founder and potential successor. The Chinese are furious, with the embassy in Canada demanding her release, while the company says she's innocent. One security expert says U.S. tech executives should avoid traveling to China until this all cools off. The other big spotlight Thursday is on Vienna, where markets are waiting to see if OPEC will green light a production cut to help support struggling oil prices. Crude is tearing lower amid some worries Saudi Arabia won't push for a big enough cut. China may have been behind the massive hack at hotel chain Marriott MAR, -5.04% say sources. Facebook FB, -2.24% has\" too many adversaries, \"said Stifel Nicolaus, which cut the company to hold from buy on Wednesday. Facebook is among the techs getting hit pretty hard Thursday. Lands' End LE, -0.28% Children's Place PLCE, -4.48% Hovnanian NOV, -3.65% and H & R Block HRB, -1.64% are reporting ahead of the open, with Lululemon LULU, -4.48%, AVGO, -4.14% and American Outdoor AOBC, -3.35% after the close. Earnings released late Tuesday and Wednesday may grab attention, after Brown-Forman's BF. B, -4.78% sales numbers disappointed, but Marvell MRVL, -5.37% beat revenue forecasts. Boeing BA, -4.85% is among the losers after the CEO of its biggest client, Lion Air, said it may cancel a huge order after the airline group appeared to blame his company for a deadly crash in October. The economy A huge batch of data is headed our way, kicking off with ADP employment data, weekly jobless claims, the trade deficit, productivity, unit labor costs, the Markit services PMI, the ISM nonmanufacturing index, factory orders and a quarterly services survey. Read: Wages may spike higher in November jobs report and Wall Street won't like it Opinion: Trump's economy will boost wages The stat 6 million--That's how many Brits are using smart devices to snoop on loved ones, says a new survey from Direct Line Insurance. The survey showed nearly 4 million parents (13%) are already watching their offspring and eight million say they intend to do so. One in five surveyed said they'd happily spy on their cleaner or babysitter. Random reads The first presidential funeral train in nearly 50 years will carry George H.W. Bush\" s casket through several Texas towns CO2 levels hit an all-time in 2018, thanks largely to coal use in China Check out the 100 best songs of 2018 Cheap and simple test reveals if you any cancer cells anywhere Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern. Follow MarketWatch on Twitter, Instagram, Facebook. Providing critical information for the U.S. trading day. Subscribe to MarketWatch's free Need to Know newsletter. Sign up here. Barbara Kollmeyer Barbara Kollmeyer is an editor for MarketWatch in Madrid. Follow her on Twitter @ bkollmeyer. We Want to Hear from You Join the conversation Comment Related Topics U.S. Stocks Markets NY Stock Exchange NASDAQ", "articleID": "2018120613_00361426_W", "names": {"Chris Weston": ["Q27889126", "Q5108451"]}}, {"date": "2018-12-06", "url": "https://www.marketwatch.com/story/the-next-big-risk-to-your-security-is-your-kids-video-game-habit-2018-12-06", "content": "Be careful who you play with. Online gaming is a growing target for hackers, a new report from identity theft protection firm Experian EXPN, -2.12% found. Cyber criminals are increasingly posing as gamers to gain access to the computers and personal data of players, its 2019 Data Breach Industry Forecast predicted. \"We are not trying to imply all gamers are hackers, but they do live in an anonymous environment, have good computer skills, and are in an industry with billions in revenue,\" Michael Bruemmer, vice president of data breach resolution at Experian said. \"There is a unique opportunity for them to be able to profit .\" The gaming industry is worth more than $4 billion in annual revenue, according to industry analysis firm IBISWorld. Cyber criminals can easily pose as a gamer or take over an avatar to infiltrate games and communities, stealing personal and credit-card information and valuable game pieces and tokens, the report said. (The Entertainment Software Association, a trade group for video games, did not immediately respond to request for comment .) This puts responsibility on parents to educate their children about online security risks, said <mark>Sean McGrath</mark>, cybersecurity advocate at security service comparison site BestVPN.com. \"The old adage,\" Don't speak to strangers' can't really be applied in the online gaming world, but perhaps we can still aim for \"don't thoughtlessly trust strangers',\" he said. \"The old adage,\" Don't speak to strangers' can't really be applied in the online gaming world .'--<mark>Sean McGrath</mark>, cybersecurity advocate at security service comparison site BestVPN.com Others are less concerned. Hacking in the gaming world is a risk, said Chris Morales, head of security analytics at San Jose, Calif. cybersecurity solutions firm Vectra, but it's well-known and largely controlled. Hacking in the gaming world has \"occurred as long as online gaming has existed,\" he said. \"Gaming has always been an arena for hacking and attacks,\" he said. \"In the early days that meant cracking software licenses to play games for free. Today, in the highly competitive and financially lucrative gaming world, that means bypassing developer controls to gain a competitive advantage or to impose disruption on other players .\" Still, new sophisticated threats raise additional cause for concern, said Darrell Laffoon, chief technology officer of security firms EZShield and IdentityForce. In the past a hacker may take over a player's account to gain points, but today gaming consoles can be used as a gateway to access the person's entire device, whether desktop or mobile, and hack banking information and other accounts. Today gaming consoles can be used as a gateway to access the person's entire device, whether desktop or mobile, and hack banking information and other accounts. \"Games today are very social in nature,\" he said. \"Even if you are playing a single-player game, you are connected, and your information is a valuable resource to the cyber criminal .\" To lower the risk of hacking, gamers should use a password manager for all accounts, he said, and implement two-factor authentication where it is offered. Most major gaming apps, including Nintendo NTDOY, -1.46%, PlayStation SNE, -0.58%, Epic Games, Runescape, and Steam allow two-factor authentication. Be sure to only download gaming apps from trusted vendors to avoid installing malware on your computer, he said. Users should also avoid sharing information publicly even with online friends they think they know. \"Anything that is personally identifiable or non-public should not be shared,\" Laffoon said. \"Your date of birth and where you live can be used against you .\" Get a daily roundup of the top reads in personal finance delivered to your inbox. Subscribe to MarketWatch's free Personal Finance Daily newsletter. Sign up here. Also see: Did your doctor ask for your Social Security number? Think twice before saying yes Google's algorithms are keeping us in a political bubble, study finds FCC will vote next week to combat text-message spam and increase fines Kari Paul Kari Paul is a personal finance reporter based in New York. You can follow her on Twitter @ kari_paul. We Want to Hear from You Join the conversation Comment", "articleID": "2018120619_00458250_W", "names": {"Sean Mcgrath": ["Q2849939", "Q56596974", "Q59560929", "Q7441236", "Q7459565"]}}, {"date": "2018-12-06", "url": "https://www.cbc.ca/news/canada/windsor/local-444-women-violence-massacre-anniversary-1.4935681?cmp=rss", "content": "Unifor Local 444 honours women lost to violence on day of remembrance The women's committee at Unifor Local 444 held a memorial to remember women lost to violence on the National Day of Remembrance and Action on Violence Against Women. \"I don't know if our family will ever heal,' says Autumn Taggart's cousin CBC News · Posted: Dec 06, 2018 4:57 PM ET | Last Updated: December 6 Women's committee at Unifor Local 444 held its 19th annual memorial for women who have been victims of violence. (Dale Molnar/CBC) For the 19th year, the women's committee at Unifor Local 444 held its annual memorial for Mary Lou Turjeon-Lewenza (Hyjek), who was a Plant 6 worker when she was killed by her husband in 1998 .\" She was vibrant, loved life. It's been 20 years since she was stolen from us, \"said Pamela Turjeon-Miller, her sister. Man charged in Windsor mother homicide a Canadian citizen living in Michigan, police say The memorial is planned on the National Day of Remembrance and Action on Violence Against Women, which was marked since the massacre in Montreal where 14 women died at École Polytechnique in 1989. The committee also donated $2,000 to House of Sophrosyne and $2,000 to the Welcome Centre Shelter for Women as part of the commemoration. The memorial was held at the memorial stone for a former Plant 6 worker who was killed by her husband. (Dale Molnar/CBC) Lori Dupont, a Windsor nurse who was killed by her ex-boyfriend who worked at the same hospital in 2005, was also remembered at the memorial. As was Theresa Vince, a Chatham woman who was murdered by her boss in 1996. And more recently, Autumn Taggart, who was found dead in her apartment June this year. A 27-year-old man is charged with first-degree murder aggravated sexual assault in relation to Taggart's death. Unifor Local 444 members call for end to violence against women Her cousin, Amber Gelinas, said Taggart's death has had an\" astronomical \"impact on the family .\" I don't know if our family will ever heal, or if we'll ever feel like we're whole again, \"she said .\" Because a part of us has just been taken away and she was just so young, and she had so much of her life in front of her. \"Amber Gelinas, cousin of Autumn Taggart, says the family has been having an incredibly difficult time coping in the last six months. (Dale Molnar/CBC) Those names they're remembering are only several\" out of thousands \"who have faced violence, said <mark>James Stewart</mark>, secretary-treasurer at Local 444. He said men, including himself, need to question themselves on whether they're doing enough to end the problem .\" It starts with building a culture that's equitable, that's when violence will stop, \"said <mark>Stewart</mark>. Slain Windsor nurse often harrassed by doctor, colleague testifies According to Susan McKinnon, chairperson of the committee, one of the things they want to see is to have the provincial roundtable on violence against women reinstated .\" We're here to make sure we don't forget and we need to make sure we add action to our plans to move forward, \"she said. CBC's Journalistic Standards and Practices | About CBC News Report Typo or Error | Send Feedback Related Stories Man charged in Windsor mother homicide a Canadian citizen living in Michigan, police say", "articleID": "2018120622_00477024_W", "names": {"James Stewart": ["Q16214641", "Q16236569", "Q21457696", "Q23618352", "Q2706595", "Q43394132", "Q43395260", "Q43911566", "Q4444819", "Q4444825", "Q6137399", "Q6143635", "Q6143644", "Q6143657", "Q6143663"]}}]