[{"date": "2018-12-07", "url": "http://www.thisislancashire.co.uk/news/17283490.o2-compensation-how-to-claim-money-back-after-network-outage/", "content": "News O2 compensation: How to claim money back after network outage O2 says its services have been restored after a technical fault left millions of customers unable to get online Photo: Nick Ansell/PA Wire 0 comment O2 customers affected after a technical fault left millions unable to get online could be in line for compensation. The mobile network suffered disruption from 5am on Thursday, with full service not returning until early today. Guidance from regulator Ofcom said that, depending on circumstances, it \"may be appropriate\" for mobile networks to offer some form of compensation for loss of service. O2 said it would update customers later on Friday on how \"we will make yesterday's data service issue up to them\". Customers wishing to complain should follow a company's formal complaints procedure - usually completing an online form or phoning the company directly. If customers are not happy with how a complaint has been responded to, or it takes more than eight weeks to be resolved, a further complaint can be submitted to an independent Alternative Dispute Resolution (ADR) scheme. In the case of O2, this is Ofcom-approved Ombudsman Services: Communications, which reviews a case and comes to an independent decision on it, usually within six weeks. Sky Mobile, one of the operators affected by the outage as it uses O2 network, has already confirmed it will compensate customers with a day of free unlimited data. The network said: \"We're really sorry for the issues you experienced on Sky Mobile yesterday .\" We're giving you a day of free unlimited UK data this Saturday 8 Dec, so you can catch up on all the things you've missed. You don't need to do a thing. \"Meanwhile, O2 promised to carry out a review to understand what went wrong. British customers reported not being able to use mobile data to access the internet and the operator's network on Thursday after disruption began at about 5am. On Thursday evening, O2 said 3G data service had started returning and was expected to be fully restored by 9.30 pm, while the company reported at 3.30 am on Friday that the 4G network had been restored .\" Our technical teams will continue to monitor service performance closely over the next few days to ensure we remain stable, \"a spokesman said .\" A review will be carried out with Ericsson to understand fully what happened. \"We'd like to thank our customers for their patience during the loss of service on Thursday 6 December and we're sorry for any impact the issue may have caused .\" The company had earlier issued a joint apology with telecoms company Ericsson. O2 UK chief executive <mark>Mark Evans</mark> said: \"I want to let our customers know how sorry I am for the impact our network data issue has had on them .\" We fully appreciate it's been a poor experience and we are really sorry. \"O2, which has more than 25 million UK customers, saw disruption to its network last for most of the day on Thursday. Other mobile networks, including Sky, Tesco and Giffgaff, were also affected by the problem because their networks use O2 services. Marielle Lindgren, chief executive of Ericsson UK and Ireland, said:\" The faulty software that has caused these issues is being decommissioned. \"She added:\" Ericsson sincerely apologises to customers for the inconvenience caused. \"0 comment", "articleID": "2018120712_00034946_W", "names": {"Mark Evans": ["Q12795898", "Q14946841", "Q16194528", "Q16210885", "Q20090670", "Q358208", "Q43006927", "Q46585872", "Q57561127", "Q59219170", "Q6767546", "Q6767547", "Q6767549", "Q6767552"]}}, {"date": "2018-12-07", "url": "http://www.rhyljournal.co.uk/sport/national/17284225.chelsea-clash-comes-too-soon-for-de-bruyne-and-aguero/", "content": "Sergio Aguero will miss Manchester City's trip to Chelsea 0 comments Sergio Aguero and <mark>Kevin De Bruyne</mark> have been ruled out of Manchester City's Premier League clash at Chelsea on Saturday. Aguero, City's record scorer, has not featured in the champions' last two games due to what was initially described as a minor muscle problem and he will again not be risked. <mark>De Bruyne</mark>, who scored the winner against his former club at Stamford Bridge last season, has missed most of the campaign so far with knee problems. Guardiola confirms neither Aguero nor <mark>De Bruyne</mark> will be fit to face Chelsea #MCFC pic.twitter.com/gu6Mbczwc2--Andy Hampson (@ andyhampson) December 7, 2018 When the Belgian suffered his latest setback early in November it was thought he could have an outside chance of returning to face the Londoners, but that has proved too optimistic. Speaking at his pre-match press conference, manager Pep Guardiola said: \"Both cannot play tomorrow. Both will be back soon .\" Chelsea have slipped to fourth in the table, 10 points behind leaders City, after losing two of their last three games but Guardiola sees it as a tough time to be playing them. He said: \"Always Stamford Bridge is difficult. I've travelled there many times as a manager and won once--last season. Most of the time I lose there. The day we truly believed we could win the league ...?? ⚽ ️ #mancity pic.twitter.com/mas3GeRqnn--Manchester City (@ ManCity) December 7, 2018\" They are a good side, a really good team. You see the level of people on the bench--they don't play regularly but they are excellent players. They are a real contender, an excellent team. \"How are they going to react after losing two games? I can imagine how intense, how aggressive and how committed they will be. That's why it's a good test for us, I will welcome that .\" Guardiola's opposite number Maurizio Sarri has spoken of City in complimentary terms ahead of the game, describing them as \"the best team in Europe, maybe the best in the world\". Guardiola was too modest to agree. Pep Guardiola insists his side have more to prove before they can call themselves the world's best team (Martin Rickett/PA) \"Thank you but we are not the best,\" he said. \"To be the best we have to win the titles and we did not win the titles to be the best in the world .\" Guardiola feels Tuesday's 2-1 victory at Watford, when City endured a nervy finish after dominating early on, underlines this point. He said: \"We could have dropped two points in the last 10 minutes. After 2-0 we were not the best side. There are many things we can do better and tomorrow we have a very demanding test for us .\" Guardiola has been impressed by the work of Sarri so far in his first season at Chelsea. He said: \"He needs time. Maybe they are not playing 90 minutes but when they play good for 50, 60, 70, 75 minutes they are excellent .\" 0 comments", "articleID": "2018120715_00458348_W", "names": {"Kevin De Bruyne": ["Q357984", "Q52835665"]}}, {"date": "2018-12-07", "url": "http://www.tribtown.com/2018/12/07/eu-opec-meeting-2/", "content": "VIENNA--Oil prices spiked sharply higher Friday after OPEC countries agreed to a proposal that would see global oil production reduced by 1.2 million barrels a day. Following a morning meeting of the Organization of the Petroleum Exporting Countries, Iraq Oil Minister Thamir Ghadhban told reporters the proposed cut would be made up of 800,000 barrels per day from OPEC countries and 400,000 barrels per day from Russia and other non-OPEC nations. His Iranian counterpart, Bijan Zanganeh, confirmed the proposed cuts ahead of a closed-door session to finalize the deal with the non-OPEC countries. He said the cuts were to begin January 1, 2019, for a period of six months. Oil producers have been under pressure to reduce production following a sharp fall in oil prices over the past couple of months. The price of oil has fallen about 25 percent recently because major producers--including the U.S.--are pumping oil at high rates. The mooted reduction has certainly met with the response hoped for by ministers. Brent crude, the international standard, up $3.11 a barrel, or 5.2 percent, at $63.17. Benchmark New York crude was $2.23, or 4.3 percent, higher at $53.72 a barrel. The proposed cut was in line with the 1 million to 1.3 million barrels per day expected by analysts. <mark>Neil Wilson</mark>, chief analyst for Markets.com, said the cut at the upper-end of forecasts and a \"real positive .\" \"The fact that the OPEC-Russia alliance is still holding matters as much as the details of the deal itself,\" he said. Russian Energy Minister Alexander Novak did not mention the specific proposal as he addressed colleagues in public before the beginning of the closed session, but said he was \"confident\" they would be able to \"send a strong to the market, to act with resolve .\" \"I believe that our unity of thought and our resolve will help us achieve success in the goal of achieving long-term sustainability and stability of the market,\" he said. The cut is unlikely to be greeted warmly by U.S. President Donald Trump, who has been pressuring the cartel publicly to maintain production. On Wednesday, he tweeted: \"Hopefully OPEC will be keeping oil flows as is, not restricted. The World does not want to see, or need, higher oil prices!\" Heading into the first round of meetings, Saudi Arabia, the heavyweight within OPEC, said it was in favor of a cut of about a million barrels a day. One stumbling block to an agreement had been Iran, Saudi's regional rival and fellow OPEC member, which had been arguing for an exemption to any cuts because its crude exports are already being pinched already by U.S. sanctions. Zanganeh told reporters Iran had been given the exemption. Rising reported from Berlin", "articleID": "2018120716_00359459_W", "names": {"Neil Wilson": ["Q3337844", "Q6989491"]}}, {"date": "2018-12-08", "url": "http://www.richmondandtwickenhamtimes.co.uk/news/17285726.new-december-train-timetable-to-be-launched-soon/", "content": "News New December train timetable to be launched soon Photo: PA 0 comment Rail passengers are braced for the first national timetable change since the chaotic introduction of new schedules in May. Industry body the Rail Delivery Group (RDG) warned there may be \"some impact on punctuality as the new timetable beds in\" after its introduction on Sunday. Similar statements were made ahead of the summer timetable change, which crippled large parts of the network in the north and south-east of England. The RDG insists the industry is \"learning lessons\" from the disruption and has decided to reduce the scale of the alterations in the winter timetable. Darren Shirley, chief executive of the Campaign for Better Transport, said: \"It is vital the mistakes of last May are not repeated again this winter .\" Passengers have already had a bad year and do not deserve to endure any further problems with their journey. \"Following the May timetable launch, Govia Thameslink Railway (GTR) and Northern cancelled up to 470 and 310 trains respectively each day. Train companies, government-owned infrastructure company Network Rail and Transport Secretary Chris Grayling have all been blamed for the chaos. A review by Office of Rail and Road (ORR) chairman Professor Stephen Glaister called for the industry to improve how information is provided to passengers. <mark>Anthony Smith</mark>, chief executive of watchdog Transport Focus, said:\" This time around passengers expect the rail industry to drive a smooth set of timetable improvements. \"Passengers paid a hefty price for the catalogue of over-optimism, missed deadlines and blurred accountability that led to a summer of timetable crisis and ensuing chaos. To regain their trust, passengers need to see that lessons have been learned .\" Rail timetables are changed twice a year, in May and December. The decision to scale back Sunday's change has been controversial as it will delay the launch of some new services. South Western Railway said it was \"disappointed\" it is not able to go ahead with its planned \"major timetable change\" which would have led to extra services and more capacity. RDG regional director <mark>Robert Nisbet</mark> said: \"We know that people in some areas might be concerned about another timetable change, but - as the Glaister Review acknowledges - the rail industry has worked together to start learning the lessons from May .\" As with the introduction of any new timetable, there may be some pockets of disruption as people get used to new journeys and train times, so we advise people to check before travelling next week. \"0 comment", "articleID": "2018120816_00077862_W", "names": {"Anthony Smith": ["Q16197257", "Q20640889", "Q27838053", "Q2852962", "Q2852963", "Q4773483", "Q4773484", "Q4773486", "Q4773487", "Q4773488", "Q4773489", "Q7823446", "Q7823448"], "Robert Nisbet": ["Q16292939", "Q21999572", "Q7348044"]}}, {"date": "2018-12-09", "url": "http://www.southendstandard.co.uk/news/17283618.popular-polash-restaurants-8-simple-words-which-has-proved-a-recipe-for-success/", "content": "News Popular Polash restaurant's 8 simple words which has proved a recipe for success By Community contributor Show caption See all photos images Skip to next image \"0 comment NOT many Southend restaurants make it to their 40th anniversary, but the Polash, in Shoeburyness, is no ordinary eatery. The business has been a fixture for 40 years, and so have many of the customers as well. The West Road restaurant rides high in the food stakes. Patak's Curry Guide has listed it among the top 30 Indian restaurants in the entire UK. Stronger, though, than even the strongest curry, is the loyalty the this place engenders. Some of the diners at Polash's tables were there in 1979. when it first opened. For them, the Polash experience is not just a question of an eat in, but of a love in. One of those decades-long regulars is Adventure Island owner Philip Miller MBE, executive chairman of Stockvale .\" In fairness, I am a relative newcomer, as I have only been visiting for the past 35 years! \"he says. Mr Miller is in no doubt as to what keeps drawing him back. He says:\" The food has always been first class, but then it is in many other restaurants locally. It's the genuine warmth that sets it apart. It's something you can only get at the Polash and it's a magic formula that cannot be copied. \"The special atmosphere at the Polash stems directly from the owner and founder, Sheikh Khalique, and his personal rags to riches story. One of six brothers, Mr Khalique arrived in England from Bangladesh in 1967 .\" My father wanted me to study, but I just wanted to get out and work, \"he says. At 16 he started out as a waiter at his uncle's restaurant in Wembley, and found that he had a real flair, and love for, the work. Another brother, Harun, was separately forging a career as a skilled chef. The brotherly network went into overtime when a third brother, Ahmed, told Sheikh and Harun about an opportunity he had spotted. Ahmed was working in Southend, and had learnt that a launderette site in West Road was about to become vacant .\" By then I had my own strong idea for running my own business, \"says Mr Khalique. The idea does not sound so radical now, but back in 1979, when restaurants from the Indian sub-continent were still labelled as\" curry houses, \"it was highly original. It consisted of authentic sub-continent cuisine, using locally sourced raw materials. Mr Khalique describes it as\" going back to the roots \".\" When we opened, we were something special. Since then, lots of people have copied us, to be honest, \"he says. Shoebury residents bought into the Khalique brothers' culinary vision from day one. There were queues round the block on opening night. Then came a rave review by restaurant critic Jim Worsdale in this newspaper .\" Mouthwatering \"was one of the more low-key adjectives that he used .\" I remember that review by heart, \"says Mr Khalique .\" Since then, we have never looked back. \"Over those 40 years, however, the Polash, once so innovative, has come to be known for another, quite different quality--unchanging reliability. The world changes, but the Polash doesn't. It remains a reassuring haven .\" We don't react to changes in fashion in the industry, \"Mr Khalique says .\" We keep things authentic and traditional. \"Not that he allows complacency to settle in .\" The items on the menu, they frankly have not changed that much, \"he says .\" People have come to love them. But we constantly work to improve (the recipes). \"This sense of continuity clearly influences the customers. The Polash is a family run business, and the clientele are also something of an informal family .\" Nearly everyone who eats there sort of knows each other, and we greet other customers like old friends, \"says Philip Miller. Food apart, it is the warm welcome that Polash fans extol. Service values lie at the heart of Mr Khalique's philosophy. He says that a lot of industry trainees seek out the Polash .\" They know that this is a good place to learn the skills, and that time spent training at the Polash will be a good qualification for jobs elsewhere, \"says Mr Khalique .\" Many of my waiters have gone on to open their own businesses. \"The core principles he teaches are not complex, boiling down to eight words .\" Welcome with a smile. Take care of customers. \"He makes it sound almost cosy, but the road to the Polash was a tough one by any standards .\" My background was very poor, \"he says .\" I had to walk 10 miles to school. Across fields--there were no roads. \"At that stage, he made a resolution .\" I promised myself that if ever I had the opportunity, I would help build a high school in my home village. Thankfully I had that opportunity. \"Mr Khalique kept his promise to himself. Working with local fund-raisers back in Bangladesh, he was instrumental in setting up Shahkamal High School, which opened in 1990. The school has around 600 pupils,\" and they are all very appreciative \". He is also widely involved in charities here at home. Philip Miller, also active in charities, comments:\" The family have always supported local charities with curry nights at detriment to his usual trade no doubt, but that is the kind of guy he is. \"The Polash has stayed reliable and unchanging for 40 years. What about the next 40? Regulars seem unworried. The Echo spoke to one of them, <mark>James Pearson</mark>, from Shoebury Barracks. He first came to the Polash with his father, at the age of seven. He said:\" I've been coming ever since, and it's always been the same. Same smile. Same greeting. And same delicious food. The Khalique family know how much customers value that unchangeability, so I bet nothing too revolutionary will happen over the next 40 years. \"Certainly, the next generation look a safe bet. Sheikh's son Rubel spent much of his childhood at the restaurant, studying cookery with his uncle, chef Harun .\" He used to hurry home from school, \"says Mr Khalique .\" He just wanted to get into the kitchen. \"Rubel is now effectively in charge of the kitchen, following Harun's semi-retirement. He says that he plans to develop and improve the regular dishes .\" I am very curious, and I like to experiment. \"One idea he is developing is the notion of Indian-style variations on trad British dishes like turkey dinners and Beef Wellington .\" But it will still be the Polash that people know and love, \"he promises. Right now, major change seems a very remote concept. Customers are still met at the door by the boss and founder, just as they were back in 1979. Now 67, Sheikh Khalique flirted briefly with retirement, but did not enjoy the experience .\" I don't like just sitting down, \"he says. He was soon back at the Polash door .\" Being here, meeting and greeting people, that's what I love, \"says Mr Khalique. 0 comment", "articleID": "2018120913_00083627_W", "names": {"James Pearson": ["Q16197996", "Q16222383", "Q16235722", "Q30122935", "Q43912757", "Q6141109"]}}, {"date": "2018-12-11", "url": "https://www.fox13memphis.com/news/patriots-on-to-pittsburgh-after-stunning-loss-to-dolphins/886867026?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Patriots \"on to Pittsburgh' after stunning loss to Dolphins Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Patriots\" on to Pittsburgh' after stunning loss to Dolphins By: KYLE HIGHTOWER, AP Sports Writer Updated: Dec 10, 2018 - 6:18 PM Loading...Patriots \"on to Pittsburgh' after stunning loss to Dolphins FOXBOROUGH, Mass. (AP) - More times than not, the sight of Rob Gronkowski approaching the end zone has signaled good things happening for the New England Patriots. Yet there was the image of Gronkowski awkwardly crashing to the ground in a desperate attempt to prevent Kenyan Drake from crossing the goal line during Sunday's last-second 34-33 loss to the Dolphins. Talk about something being the opposite of what people have come to expect from the Patriots. While Miami's pass and double-lateral on the final 69-yard touchdown play got all the attention in the aftermath of Sunday's loss, coach Bill Belichick reiterated there were other miscues that contributed. There was Stephen Gostkowski's first missed extra point in 38 tries this season and only his second missed field goal inside 50 yards in 2018. New England also missed a scoring opportunity at the end of the first half. Albert McClellan blocked a Miami punt inside the Dolphins 20, setting up the Patriots on the 15 with 14 seconds left and no timeouts. <mark>Tom Brady</mark> completed a 13-yard pass to Gronkowski to get the ball to the 2. But <mark>Brady</mark> was sacked by <mark>Robert Quinn</mark> on the next play - very unlike <mark>Brady</mark> to miss a scoring opportunity - leaving New England's lead at 27-21 at halftime. Finally, on its last series of the game, the offense failed to get into the end zone and settled for a 22-yard Gostkowski field goal, despite having a first-and-goal on the 7 .\" I think there were a lot of things that could've been better in the entire game, \"Belichick said .\" I think the game was about a lot more than that (final) play, but certainly that play wasn't a good one for us. \"Belichick said the reason Gronkowski was at safety instead of Devin McCourty, one of New England's best defensive players:\" It would be his ability to play the deep, long throw. \"But the coach then admitted that Dolphins quarterback Ryan Tannehill probably didn't have the arm strength for such a desperation heave .\" I think it was a little too far to get to the end zone, \"Belichick said,\" but certainly a deep pass in that situation is a possibility. I wouldn't rule that out. \"The irony of the ending is that it overshadowed one of Gronkowski's best performances of the season. The tight end finished with eight catches for 107 yards, marking the 28th 100-yard game of his career. The only tight end with more 100-yard games than Gronkowski is <mark>Tony Gonzalez</mark> with 31. It was just Gronkowski's second 100-yard receiving game this season and his first since New England's season opener. Fullback James Develin also continued to impress with his fourth rushing touchdown in four games. He had one in his first 74 career games .\" It's going to test our character. It's going to test our mental toughness, \"Gronkowski said Sunday .\" I mean, I feel like I've been going through that all year, and now to get to this point now. We've just got to keep working hard. We've just got to keep grinding. We've got to keep focusing and just come together as a team more. \"Still, the loss only meant their route to reaching another Super Bowl will be that much tougher. As stunned as New England's players felt as they trudged off the field following the loss, other surprise results around the conference on Sunday kept their hopes of securing a ninth consecutive first-round bye in the playoffs very much alive. The Patriots (9-4) began preparations for their Week 15 game at Pittsburgh still on track to capture the second seed in the AFC behind Kansas City (11-2), which stayed in first place after fighting off Baltimore in overtime. Los Angeles improved to 10-3 after its win over Cincinnati and has the conference's second-best record. But the Chargers are division-mates with the Chiefs and would have to settle for a wild-card spot if nothing changes over the final three weeks of the regular season. New England holds the head-to-head tiebreaker over Houston, which is also 9-4 after its loss to Indianapolis. And courtesy of the Steelers' loss to the Raiders, even should Pittsburgh (7-5-1) beat New England, it would still trail the Patriots in the AFC standings. The Texans would move ahead of the Patriots in the AFC if they beat the Jets on Saturday and the Steelers win Sunday. Patriots center <mark>David Andrews</mark> said the fact they still have a say in where they finish up is the only thing they were thinking about when they walked back into the team facility Monday .\" We've got a lot we can do better. We got a big challenge coming up this week, so that's what our focus is on, \"he said on Monday .\" We can't do anything to change what happened yesterday, so we gotta move on. \"Special teams captain Matt Slater, invoking Belichick's classic parlance, said everyone in the locker room is officially\" on to Pittsburgh. \"\"I don't think there's really much else to talk about,\" Slater said. \"Over the course of the season it's gonna be very rare that things go your way all the time. And we've certainly been spoiled around here with some good fortune over the years. So we're just gonna move forward and focus on the Steelers and what we need to do to perform well there .\" ___ More AP NFL: https: //apnews.com/NFL and https: //twitter.com/AP_NFL ___ Follow Kyle Hightower on Twitter at http: //www.twitter.com/khightower Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:", "articleID": "2018121104_00382443_W", "names": {"David Andrews": ["Q1111220", "Q16096796", "Q20630502", "Q21085750", "Q330801", "Q5230783", "Q5230786", "Q5230788", "Q55861112", "Q56557174", "Q56707376", "Q59094383"], "Robert Quinn": ["Q12374132", "Q3938397"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "Tony Gonzalez": ["Q729462", "Q7822457"]}}]