[{"date": "2018-12-11", "url": "http://www.gamereactor.eu/blogs/mike", "content": "Board games on GR Written by <mark>Mike Holmes</mark> on the 13th of September 2017 at 12:39 We love games here at Gamereactor (the clue's in the name, right?) and when it comes to the games we play we're looking to expand our scope a little. From here on in we're going to start writing about our experiences with board games too, specifically ones that have some sort of direct link to video games. If that goes down well with you lot, maybe we think about widening the range of games we talk about. Let us know what you think in the comments below. How Long is Too Short? Written by <mark>Mike Holmes</mark> on the 1st of August 2016 at 08:55 The recent news that No Man's Sky can apparently be completed in around 30 hours, and the reaction that this news has brought with it, certainly has caught my attention, and it has me pondering the question: what is the ideal length for a video game? As someone who plays them in less than ideal circumstances (having to rush through them for review) a complete but somewhat succinct experience can be quite a relief, but that doesn't mean that every now and then I don't like an extended love affair with a game (Crusader Kings 2, Destiny or The Witcher 3 in my case). 30 hours, with the option to get distracted and expand on that if required, seems like a perfectly reasonable period of time to play a game like No Man's Sky, but I also appreciate why some people might be disappointed that the scale of the galaxy built by Hello Games doesn't quite tally with the (prospective) length of the game. In this case we'll have to wait and see what the future brings, but it's still an interesting question and the answer will change depending on who you ask. As someone who loved the super-short Thirty Flights of Loving just as much as the timesink that is Destiny, I'm going to sit on the fence on this one and say \"how long is a piece of string?\" Who Won E3? Written by <mark>Mike Holmes</mark> on the 15th of June 2016 at 18:36 Two very different companies pitched us two very different shows during E3 this year. Sony and Microsoft, not for the first time, went head to head in unveiling their latest wares. Microsoft had an ace up their collective sleeve, but Sony were able to show a line-up of games that had the audience purring. Let's get it out of the way now and say there wasn't a clear winner, although if I was pushed into making a call, I might say that Sony edged it. The why is perhaps a little more complicated, and were it not for leaks and (potential) absentees, I might well have been singing a very different song. Let's face it, we knew practically everything about the Microsoft presser before it even happened. You can't help but think that maybe Sony knew too, and that their conference would have been ten minutes longer and would have included a hardware reveal of their own. Perhaps the power of Scorpio forced the PlayStation team to hold fire on their own announcement because they knew they were bested. Speculation on our part, fuelled by whispers, but certainly plausible. Either way, it was good work across the board, with Microsoft continuing the process of rebuilding their reputation, and Sony continuing to deliver great software for their all-conquering console. And while nobody is talking about Nintendo in the same breath as its rivals this time around, it's worth noting that a study shows that The Legend of Zelda: Breath of the Wild was the most talked about game at the show (so far). That's got to count for something. Finally, let's also shout out for the PC crowd (that includes me), who got another PC Gaming show, as well as a bunch of cross-buy and cross-platform announcements during Microsoft's event. It's a good time to do your gaming on PC. On top of all that, if you throw in a bunch of games on show at EA Play, Bethesda and Ubisoft, and everything else in between, and you've got a solid E3 all round. It might not have the stellar game that has everyone buzzing (perhaps, possibly, with the exception of Zelda), but we've still seen some big reveals and a few fascinating trailers. Covering it from here in the UK has been largely enjoyable (chaotic, but enjoyable) and, from where I'm sitting, nearly everyone has come out this year's show a bit better off. Parental Guidance Written by <mark>Mike Holmes</mark> on the 17th of April 2016 at 08:19 As the father of two young boys, games are on my radar in one more than one sense. Not only do I have my own gaming habits to consider, but I have to think about the games that my sons consume too. Given my profession, there's no getting away from this, and because I play and write about games all the time, it's only natural that the boys find them fascinating. Monkey see, monkey do. Given what I do for a living, as you might expect, other parents often talk to me about what they let their children play, and while I'll either agree or disagree with what they consider age appropriate, one thing is constant throughout each discussion, and that's a shared appreciation that kids today have it so good when it comes to games. They really are spoiled for choice. Whether we're talking about cleverly made tablet titles that take advantage of the intuitive touch screen controls (something that we now take for granted), or educational offerings on the desktop PC that test the grey matter, or even console games that develop coordination and reflexes (for example, my kids, like so many others, are partial to a bit of Lego-based gaming); there's so many great games for the younger generation to enjoy. Of course there's some total shite out there too, and with kids being easy to please and an impressionable audience, it's often parents like yours truly that are left to pick up the tab for questionable pieces of programming. However, once you ignore all the rubbish and start to seek out real quality, it becomes abundantly clear that there's plenty of decent stuff for them to play. The starting point for this blog came yesterday, Saturday, walking through town on the way to the local swimming pool, bumping into a friend and fellow parent, and talking about Disney Infinity and how impressed he was with the depth of the offering. It got me thinking about the difference in quality between what I played as a youngster, and what my children have to enjoy nowadays. Of course, back then, a lot more games were universal in terms of age appeal, and as a whole the game-consuming audience was less mature and it was less socially acceptable (remember when it wasn't really normal to play games?), but I still think it's fair to say that youngsters have never been served better than they are today. My kids enjoy Lego games (we're currently playing Lego Jurassic World at the moment), Steamworld Dig is another favourite, we're all partial to classic Sonic, and of course Nintendo makes great family friendly titles that we enjoy playing together. We've not got into full-on Minecraft mode just yet, but it's edging ever closer; I fear that addiction is just around the corner. There's a nice range of titles for the boys to choose from, and I know other parents think the same, even if we don't always agree on when it's suitable to let the little ones start playing games made for a slightly older audience. One thing we all agree on, though, is the online element, and I'm not alone in keeping my kids away from the interwebs and limiting (almost completely) their online interactions. Because while we can trust our kids to play nicely - most of the time - the same can't be said of everyone else, and I think it prudent parenting to be extremely careful about what, and who, they're exposed too. To sum up this rambling blog post: kids have never had it better. But like most parents, I think it pays to limit the time they can spend playing, as well as being extremely careful about what/who they're exposed to. There's a world of amazing digital experiences out there waiting to be discovered and enjoyed, but as a parent I personally think that we have a responsibility to our children, to expose them to certain games when they're ready for them, which isn't always when they might want to play them. My Private Army Written by <mark>Mike Holmes</mark> on the 4th of February 2016 at 09:46 Xcom 2 is here tomorrow, and I for one am looking forward to personalising my cadre of elite marines and taking on the alien scum. One of my favourite things about Xcom, and the reason I love the series so much, is the bond you form with your soldiers, this because of the permadeath feature, but equally because of the range of customisation options on offer. In particular, being able to name your soldiers makes such a difference. But who to name them after? My last play of the original game (well, the reboot) saw me name my soldiers after popular sci-fi movie characters, which worked better than my first play, where I named them after my friends. Watching your buddies die is less fun. So which way will I go this time? Name them after the players at my beloved Arsenal FC? No, they'd just bottle it and finish in fourth. Name them after musicians? I'd be worried they'd all check out aged 27. What about video game characters? That might work...Hmmmm. Decisions, decisions. What I don't want to do is spend too many hours of my initial play through customising my troopers, because you know, there's aliens to kill! Regardless of what I call the troopers in my private army, I can't wait to see how this next game plays out. Expect my thoughts on Xcom 2 in the nearish future.", "articleID": "2018121109_00106056_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}}, {"date": "2018-12-11", "url": "http://www.swindonadvertiser.co.uk/news/national/17290478.children-from-deprived-areas-struggling-to-meet-literacy-and-numeracy-targets/", "content": "School pupils in a classroom 0 comments Fewer than three out of five youngsters leaving primary school in Scotland's most deprived areas achieve the expected standards in literacy. Just two-thirds of these pupils are meeting the expected level in terms of numeracy. New data on pupil achievement was published at the same time as union leaders complained about the \"growing teacher recruitment and retention crisis\" in Scotland's classrooms. Scottish Government statistics showed schools employed the full-time equivalent (FTE) of 51,138 teachers The total of 24,899 FTE primary teachers is the highest since 1980, the government said. Overall teacher numbers, including those working in early learning and childcare centres, are the largest they have been since 2010 at 51,959. As a result, the teacher workforce in 2018 is 447 higher than it was the previous year. Teacher levels are high and our schools have never been in better condition. Find out more -> https: //t.co/ZBDC6gAB0G pic.twitter.com/UpjhVhSnfa--ScotGov Education (@ ScotGovEdu) December 11, 2018 But EIS general secretary Larry Flanagan said: \"We also have a large increase in the number of pupils in our schools which means that pupil-teacher ratios remain at an absolute standstill compared to last year .\" Scotland's schools had 693,251 pupils in 2018, an increase of 4,611 from the 2017 total. The pupil-teacher ratio in schools was unchanged from 2017 at 13.6 with the average primary school class size also remaining the same at 23.5 children. Separate figures showed 70% of P7 pupils across Scotland in 2017-18 were meeting the expected standard in literacy, with 75% achieving this for numeracy. In the most deprived parts of Scotland in 2017-18, just 59% of P7 pupils met the expected standards in literacy, compared to 83% in the most affluent communities. Meanwhile, two-thirds (66%) of P7 pupils in the poorest areas achieved the expected standards for numeracy, 20 points lower than the 86% who did so in the least deprived areas. NEW: the attainment gap for literacy, numeracy, and writing grows at every stage of Primary school in Scotland. pic.twitter.com/3NWavg1GLN--Kieron Higgins (@ HigginsKieron) December 11, 2018 \"Pupils from the least deprived areas performed better than pupils from the most deprived areas at all stages,\" the report noted. While 85% of P1 children met the expected standards for numeracy, this fell to 76% for P4 pupils and 75% for those in P7. Three-quarters (75%) of P1 pupils were at the expected level in terms of literacy but this fell to 69% for P4 before increasing slightly to 70% for P7 youngsters. In S3, 95% of students from the least deprived areas met the expected standards under Curriculum for Education for literacy, compared to 81% of youngsters from the most deprived areas. The situation for numeracy was similar, with 96% of those from the least deprived areas reaching the expected standards, compared to 82% of those from the poorest areas. Some encouraging signs in the latest CfE statistics--and important to acknowledge them--but there are some big worries too, the persistence of the attainment gap being one .--<mark>Liz Smith</mark> (@ MspLiz) December 11, 2018 Education Secretary John Swinney said he was \"encouraged to see the attainment gap has also narrowed slightly\". He said: \"There is an increased proportion of primary pupils assessed as achieving the expected levels of Curriculum for Excellence by up to four percentage points .\" This coincides with the first year of our £ 120 million Pupil Equity Fund. \"While it is too early to draw direct conclusions from this data, I am encouraged to see the attainment gap has also narrowed slightly .\" He added: \"Teacher levels are the highest this decade and the number of primary teachers is the highest since 1980 .\" The average size of primary one classes has been dropping consistently in recent years, which is particularly important as helping children in the early years is crucial if we are to close the attainment gap between the most and least deprived. \"The figures also show 86.6% of school buildings were in a good or satisfactory condition in April 2018, up from 81.7% in April 2012 .\" For the first time, more than 600,000 pupils are educated in schools classed as good or satisfactory condition, \"Mr Swinney said. Our investment in school facilities is benefitting more pupils than ever. https: //t.co/ZBDC6gAB0G pic.twitter.com/0Hfuq2HOpQ--ScotGov Education (@ ScotGovEdu) December 11, 2018 Tory education spokeswoman <mark>Liz Smith</mark> said:\" Notwithstanding a very welcome rise in teacher numbers, there remain some grim statistics which will make worrying reading for parents and teachers right across Scotland. \"The fact that one in three pupils is leaving primary school without reaching basic standards in literacy is the main worry .\" These literacy figures aren't just bad news for the prospects of youngsters, but bad for the future economy too. \"Labour's Iain Gray was also critical over the\" utter failure of the SNP government to tackle attainment \". He said:\" This is a consequence of 3,000 fewer teachers under the SNP and £ 400 million slashed from schools since 2010. \"SNP ministers claim that education is the top priority--these figures show that the poorest young people are being failed badly .\" While the SNP pledged children in the first three years of primary would be taught in classes of 18 students or less, Liberal Democrat education spokesman Tavish Scott said this was being achieved for just 12% of youngsters \"These figures show that the SNP Government deserves an F for the delivery of its flagship class size policies,\" said. \"It is symbolic of their failures in education. This won't be turned around so long as teachers receive a rotten deal .\" 0 comments", "articleID": "2018121114_00191736_W", "names": {"Liz Smith": ["Q27517406", "Q291438", "Q644208", "Q6660303"]}}, {"date": "2018-12-11", "url": "http://www.leaderlive.co.uk/news/national/17290515.romes-waste-troubles-turn-into-emergency-after-blaze/", "content": "Smoke rises from the fire 0 comments Rome's long-standing waste problems turned into an emergency as a huge fire at a disposal plant blanketed the Eternal City in smoke and forced authorities to scramble to find alternative facilities to treat the capital's rubbish. The Salaria plant has been the subject of protests for years by residents complaining of putrid smells and demanding its closure. Arson was suspected as the blaze put the plant out of operation indefinitely. It also sparked shorter-term health concerns given the huge cloud of smoke that covered the city. Smoke rises from the fire (Italian Firefighters Vigili del Fuoco/AP) While no health emergency was declared, Rome authorities urged residents to close their windows and stay indoors. Officials also recommended Romans avoid eating produce cultivated near the plant, suggesting fears of toxic residue settling in the northern part of the city. Authorities are trying to monitor the smoke cloud and to find an alternative plant for regular waste treatment and to deal with the Christmas period, when rubbish collection spikes. The Salaria facility treats about 800 tons of garbage a day--between 20% and 25% of the city total, news reports said. Rome's garbage collection and disposal system were notoriously insufficient even before the plant went out of service, and officials acknowledged the blaze had turned a festering problem into an emergency. Firefighters work to extinguish the fire (Massimo Percossi/Ansa/AP) Mayor Virginia Raggi appealed for local authorities in Lazio and other regions to lend a hand and open their depots to Rome's waste for the foreseeable future. \"All institutions are working to facilitate a solution,\" she said at a news conference that was interrupted by hecklers. Environment minister <mark>Sergio Costa</mark> said health authorities have determined that there is no immediate health emergency due to the smoke, but the situation is being monitored. He suggested foul play, noting that in recent days structural work had begun to improve the plant's functioning and capacity. \"It's perplexing that precisely at the moment that the problem was being dealt with...a fire breaks out,\" he said. 0 comments", "articleID": "2018121114_00299829_W", "names": {"Sergio Costa": ["Q54565819", "Q59614449"]}}, {"date": "2018-12-11", "url": "http://feeds.inquisitr.com/~r/google/yDYq/~3/Aj3hrhwYOyw/", "content": "Rachel Dillin Democratic New York Representative-elect Alexandria Ocasio-Cortez reportedly gets called a fraud daily, in part, for allegedly being elected to the U.S. Congress as a 28-year-old woman. While she's busy pointing out the multiple flaws and outrages she's seen as she prepares for her new job, she's also pointed out something else. A not so shocking double standard she faces. According to a report from the Hill, the Representative-elect called out the difference between how she's been treated and how Republican Speaker of the House <mark>Paul Ryan</mark> was treated when he won an election at only 28-years-old. While <mark>Ryan</mark> was called a \"genius,\" Ocasio-Cortez is called a \"fraud .\" She took to Twitter to explain what she's experiencing. \"Double standards are <mark>Paul Ryan</mark> being elected at 28 and immediately being given the benefit of his ill-considered policies considered genius; and me winning a primary at 28 to immediately be treated with suspicion & scrutinized, down to my clothing, of being a fraud .\" Since she's arrived in Washington, the Representative-elect has pointed out all the things she's seen that do not seem right. When she signed up for her Congressional benefit package, Ocasio-Cortez pointed out how it cost so much less than what she paid as a server and a bartender in New York. Then, she pointed out the hypocrisy of unpaid internships for Congress, which led to a colleague offering a paid position after initially posting it as unpaid. Ocasio-Cortez promised to pay her own interns at least $15 an hour while she serves. 29 YEARS OLD: On the left: Rep.-elect Alexandria Ocasio-Cortez (12/3/2018) On the right: Rep. <mark>Paul Ryan</mark> (3/2/1999, his first floor speech) pic.twitter.com/f19KxGRd5Q--Howard Mortman (@ HowardMortman) December 11, 2018 Yesterday, Inquisitr reported that Ocasio-Cortez pointed out how her Congressional orientation program at Harvard Kennedy School is basically a front for pro-corporate lobbyists. Of the event, she tweeted, \"This Harvard session has been going on for new Congress members since the 70s. This year we heard things like\" the $2T tax cut was great' and \"$15 wage is a bad idea .' No labor reps were there. Was this a multi-decade, pro-corporate lobbyist project the entire time?\" Ocasio-Cortez arrives in Congress with more Twitter followers, a broader audience, than the rest of her Democratic freshmen colleagues in the House of Representatives at 1.54 million. In addition to keeping people informed about the things she's doing leading up to taking office, she has also encouraged other younger people to run for office and fill the halls of both the Senate and the House. Ocasio-Cortez pointed out that Congress needs more young people and a wider variety of people to adequately work for the people of the U.S.", "articleID": "2018121115_00309317_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2018-12-11", "url": "http://brentwoodweeklynews.co.uk/news/national/17291082.350000-police-misconduct-hearing-should-have-been-avoided/", "content": "Police signage Police misconduct proceedings against a chief constable which cost almost £ 350,000 of public money \"could--and should--have been avoided\" , a panel has ruled. Simon Byrne was suspended as chief constable of Cheshire Constabulary last year after being accused of breaching standards of professional behaviour in respect of authority, respect and courtesy and discreditable conduct. At a hearing at Warrington Town Hall on Tuesday, police and crime commissioner <mark>David Keane</mark> said the panel, led by Rachel Crasnow QC, had found no allegations of misconduct or gross misconduct were proved against Mr Byrne. No misconduct allegations against Simon Byrne were proved (Cheshire Constabulary/PA) The 55-year-old, whose contract with the force has expired since his suspension, said he was pleased to have been \"totally exonerated\" following the allegations he bullied and belittled staff after moving from the Met Police to take up the top role at the Cheshire force in 2014. In its report, the panel said: \"This misconduct panel has been an unfortunate experience for all concerned and our overriding conclusion is that it could--and should--have been avoided .\" We have reflected at length on the circumstances which led to such a time consuming (and costly) process being used to try and resolve what was essentially a clash of cultures, personalities and attitudes within Cheshire Constabulary following Mr Byrne's arrival. \"The panel, which found a number of the 74 allegations were exaggerated by witnesses, said guidance and mentoring for chief constables should be welcomed by police forces to prevent a similar situation. The misconduct hearing in July was told Mr Byrne had a reputation for being like Darth Vader and treated junior officers and staff like\" roadkill \". The panel heard he handed pictures of Dad's Army characters to officers after he became angry when flooding made him late for work. However in its report, it found the incident was an example of Mr Byrne's\" approach to leadership \"and it was wrong to attribute\" malevolent intent \"to it. Speaking after the hearing, Mr Byrne said:\" This whole affair has been an ordeal for all parties that has gone on too long and wasted precious public money scrutinising my conduct when leading what Mr <mark>Keane</mark> has described himself as a high performance force. \"He added:\" In some ways, it still feels like upside down justice as I have lost my vocation after 35 years of public service. \"I have today released the Independent Panel's report in the gross misconduct proceedings against former Chief Constable Simon Byrne. My statement is below and you can read the full report here ➡ ️ https: //t.co/oidcnDDgxM pic.twitter.com/NBE6BxseX3--<mark>David Keane</mark> (@ CheshirePCC) December 11, 2018 Mr <mark>Keane</mark> said the proceedings had cost just under £ 350,000 but his office had made savings much greater than that amount over the past couple of years. He said:\" What's really important to me is that we followed a statutory, laid down procedure with the Police (Conduct) Regulations, that we have had an open, transparent hearing and that we have had accountability within policing. \"That's my job as police and crime commissioner, to ensure we have an open and transparent police service and that I ensure the police service is accountable to everybody it serves .\" Joanne Moorcroft, secretary of the Cheshire Police branch of Unison, said the branch was \"extremely disappointed\" by the outcome of the hearing. She said: \"A number of our members have shown immense courage and bravery to come forward with their concerns about the behaviour of Mr Byrne .\" Every one of them genuinely believed and still believes that they were the victim of bullying and inappropriate behaviour. \"", "articleID": "2018121117_00979467_W", "names": {"David Keane": ["Q25172044", "Q52815831", "Q56260413"]}}, {"date": "2018-12-12", "url": "https://www.news18.com/cricketnext/news/india-vs-australia-ability-to-grow-as-a-cricketer-stands-between-pant-achieving-stardom-1970471.html", "content": "Rishabh Pant. (AFP) Loading...The distance from Haridwar to Perth, as the very tired crow flies, is 7943 kilometres. But, when you see just how far Rishabh Pant has come in his cricketing journey, even this humongous number seems small. In the first Test against Australia in Adelaide, Pant kept wickets, Pant batted, hell, without knowing it Pant was even commentator for one over when host broadcaster Fox decided to silence their men and allow the chirp from the wicketkeeper to Pat Cummins to inform the world on the state of play. In a Test match where the record for the most number of catches was broken--there were 35 in all--it felt right that the wicketkeeper had the lion's individual share, 11 catches. There might have been a 12th and a world record, but Pant's dive to his right to try and hold onto a healthy edge from <mark>Nathan Lyon</mark>, fell short and he had to be content with drawing level with England's <mark>Jack Russell</mark> and South Africa's AB de Villiers. There was another miss, not quite a drop, when Pant failed to get a glove to ball from a Tim Paine edge. But, you don't dwell on what went begging when someone has played his part in sealing a famous victory. Pant is playing only his sixth Test match and he knows better than anyone else what his limitations are behind the stumps. He will no doubt work on improving his footwork, which will help him attempt more catches with two hands rather than one. His anticipation can only get better as he closely watches the best in the world, how they bat and what the ball does in response to certain strokes. (AP Photo) With the bat, Pant is all excitement. Or none at all. When called to, he can block it, but he'd rather not. His natural instincts are to attack and the manner in which he picked up a full ball from Mitchell Starc in India's first innings and dinked it over backward square for six was pure Twenty20 magic. Pant made 25 and 28 in his two innings, 36 of 53 runs coming off only eight deliveries in boundaries. But while that contribution in this Test, a low scoring one, was adequate, the fact that he has predominantly two gears, first and overdrive, would not have missed the attention of opposition bowlers, coaches and video analysts. A case in point was when <mark>Lyon</mark> packed the off side field with slip, silly point, gully, point and two short covers and bowled his hard spun quick off breaks, Pant found it almost impossible to get off strike. He either had to take the high-risk option playing across the line or slog the ball over the infield. To his credit, he managed to strike a few clean blows, but the fact that he could not then make the most of it has been noticed by many, including the coach of the Indian team. \"You have to allow him to play his game, but he has to be a little more sensible now,\" said Shastri after the first Test. \"He did the hard work in getting <mark>Lyon</mark> to spread his fields, so he has to be smarter. You make a mistake now, but don't repeat it, then I'll be in his ears .\" It would be wise for Pant to engage in course correction on his own for he does not want to get a reputation for having only one style of play. Whether he works with fielding coach R Sridhar, reaches out to those who have helped him get where he is or learn by himself, he has to work on becoming a more complete batsman, one who can be relied on to work the singles, rotate the strike and keep the scoreboard ticking along when the big shots are taken out of the equation. Pant credited Mahendra Singh Dhoni for being a major influence in his evolution. \"He's (Dhoni) the hero of the country,\" Pant told the Cricket Australia website soon after the first Test. \"I've learnt a lot from him as a person and as a cricketer as well. Whenever he's around I feel more confident as a person. If I've got any problems I can share it with him and get a solution right away. As a wicketkeeper and as a player he has taught me to be patient in pressure situations. You have to keep calm and keep composed and give 100% .\" Working hard and giving 100% are things that this lot of international cricketers do not shy away from at any stage. That should be a given. What is not is skill levels and the ability to grow as a cricketer. When Pant adds that to his personality, he has the potential to become a superstar in front of the stumps and an invaluable asset behind them. AB de Villiers India vs Australia 2018 <mark>Jack Russell</mark> Mitchell Starc <mark>Nathan Lyon</mark> Pat Cummins Rishabh Pant Tim Paine First Published: December 12, 2018, 6:10 AM IST", "articleID": "2018121201_01602430_W", "names": {"Jack Russell": ["Q17402898", "Q3526123", "Q390197", "Q56254121"], "Nathan Lyon": ["Q6969216", "Q6969217"]}}, {"date": "2018-12-12", "url": "https://cdn2.benzinga.com/pressreleases/18/12/r12839058/dallas-fuel-to-host-first-home-games-in-overwatch-league-history", "content": "Dallas Fuel To Host First Home Games in Overwatch League History December 12, 2018 11:00 am Comments Share: DALLAS, Dec. 12, 2018 / PRNewswire /--The Overwatch League ™ is coming to North Texas. The Overwatch League, the first global professional esports league with city-based teams, today revealed the 2019 season schedule, which includes a weekend of eight matches hosted in North Texas by the Dallas Fuel franchise on April 27--28, 2019. This is the first time in Overwatch League history that regular-season matches will be played anywhere other than Blizzard Arena Los Angeles. The Dallas Fuel will host the first-ever home match for a franchise, taking on the Los Angeles Valiant on Saturday, April 27. Ultimate Weekend--Dallas will feature competition among eight of the 20 Overwatch League teams, with four matches played each day. The weekend will conclude with the sole regular-season meeting between the Dallas Fuel and their in-state rivals the Houston Outlaws on Sunday, April 28. Fans interested in tickets can sign up now at DallasFuel.com for the priority access ticket sale, which will launch on December 19, at 10 a.m. CST. Only reserved seating will be offered. \"It is an honor to have Dallas selected as the first team to bring Overwatch League matches into a home market,\" said Mike Rufail, owner of the Dallas Fuel. \"Texas is where I was born and raised. I know our home crowd will want to be a big part of this experience and fans from all around the world will have a chance to make esports history with us in North Texas. We will deliver an experience and weekend of entertainment that lives up to Texas standards .\" All matches during Ultimate Weekend--Dallas will be played at the Allen Event Center, a versatile sports and event venue located in the heart of the Dallas-Fort Worth metroplex. The event is expected to draw the largest spectator crowd ever to watch a live regular-season Overwatch League match. The Allen Event Center is situated near one of the largest mixed-use developments in the U.S., with ample parking, hotel accommodations, restaurants, and retail within a short distance. The Dallas Fuel and the Overwatch League are planning a weekend-long series of festival-style events, including autograph signings with Overwatch League teams and players, sponsor exhibitions, and family-friendly activations. \"This is going to be an incredible weekend on a number of levels: local gaming enthusiasts are going to get a can't - miss event in their backyard, Overwatch fans will have the opportunity to travel to North Texas for a historic weekend of matchups, and the streaming audience from around the world will get to join in on the excitement,\" said <mark>Geoff Moore</mark>, president of the Dallas Fuel. \"We're thrilled that our first-ever home match is part of a two-day Overwatch League festival that will showcase this region's passion for esports and make for a unique debut among the storied Dallas sports franchises .\" In addition to the Dallas Fuel, reigning Overwatch League champions the London Spitfire will play two matches during the weekend. Chengdu, Hangzhou, Houston, Los Angeles, Paris, and Seoul round out the eight Overwatch League teams scheduled to compete. For ticket information or more details on programming and events, follow @ DallasFuel on Twitter or visit DallasFuel.com. Match Schedule", "articleID": "2018121216_00844231_W", "names": {"Geoff Moore": ["Q21063119", "Q5534235"]}}, {"date": "2018-12-13", "url": "http://hero.wikia.com/wiki/Thor_Odinson_(Marvel_Cinematic_Universe)?diff=1285099&oldid=1284614", "content": "Revision as of 02:06, December 12, 2018 (view source) Yoda the Disney Minion (wall | contribs) ← Older edit Revision as of 00:22, December 13, 2018 (view source) Oghta (wall | contribs) Newer edit → Line 5: Line 5: | origin = \"Thor\" | origin = \"Thor\" | occupation = [[Iron Man (Marvel Cinematic Universe) | Iron Man]]'s first sergeant <br> Jane <mark>Foster</mark>'s boyfriend (formerly) <br> Superhero <br> God of the Thunder <br> Warrior <br> King of Asgard <br> Prince of Asgard (formerly) <br> Son of Odin | occupation = [[Iron Man (Marvel Cinematic Universe) | Iron Man]]'s first sergeant <br> Jane <mark>Foster</mark>'s boyfriend (formerly) <br> Superhero <br> God of the Thunder <br> Warrior <br> King of Asgard <br> Prince of Asgard (formerly) <br> Son of Odin − | skills = Superhuman strength and Invulnerability <br> Flight <br> Mjölnir Hammer wielding and control <br> Thunder and lightnings <br> Weather control <br> Cunning intelligence <br> Fighting skills + | skills = Superhuman strength and Invulnerability <br> Flight <br> Mjölnir Hammer wielding and control <br> Thunder and lightnings <br> Weather control <br> Cunning intelligence <br> Expert Combatant | hobby = Loving and protecting Jane <mark>Foster</mark> (formerly). | hobby = Loving and protecting Jane <mark>Foster</mark> (formerly). <br> <br> Revision as of 00:22, December 13, 2018 Do-gooder Full Name Thor Odinson Alias God of Thunder God of Hammers The Strongest Avenger Point Break Prince of Thunder Sparkles Lord of Thunder Prince of Asgard Heir to the Throne of Asgard Son of Odin Odinborn Odinson Little Princess Crazy Homless Person Donald Blake Doctor Blake Donny The Big Guy with the Hammer The Demigod Witless Oaf Your Majesty The Gypsy Dude Handsome muscolar man Angel pirate God-man Origin Thor Occupation Iron Man's first sergeant Jane <mark>Foster</mark>'s boyfriend (formerly) Superhero God of the Thunder Warrior King of Asgard Prince of Asgard (formerly) Son of Odin Powers/Skills Superhuman strength and Invulnerability Flight Mjölnir Hammer wielding and control Thunder and lightnings Weather control Cunning intelligence Expert Combatant Hobby Loving and protecting Jane <mark>Foster</mark> (formerly). Protecting Earth, the Nine Realms and Asgard. Defeating enemies. Taunt Loki. Going out to new adventures. Being with the Avengers. Goals To protect the Nine Realms and the Universe To protect Asgard and Midgard. To love and reunite with Jane <mark>Foster</mark> Protect the entire Earth from threats with The Avengers (done) and to stop Malekith from destroying the universe with The Aether (done) To defeat Hela and saving Asgard from Ragnarok (succeeded in the first part but failed in the second part because Asgard was destroyed) To kill Thanos and stopping him from killing half of the people of the universe with a fingersnap (failed) Undone Thanos' fingersnap and restore everyone who was killed by the fingersnap back to life and have his revenge on Thanos Family Odin Borson (father) † Frigga (mother) † Loki Odinson (adoptive brother) † Hela Odinsdottir (sister) † Bor Burison (paternal grandfather) † Buri (paternal great-grandfather) † Friends/Allies Loki, Jane <mark>Foster</mark> (ex-girlfriend), Iron Man, Hawkeye, Captain America, Black Widow, Hulk, Black Panther, Heimdall, Sif, Hogun, Volstagg, Fandral, Erik Selvig, Phil Coulson, Darcy Lewis, Tyr, Quicksilver, Scarlet Witch, Skurge, Valkyrie, Rocket Raccoon, Star-Lord, Gamora, Groot, Drax the Destroyer, Mantis, Doctor Strange, Falcon, War Machine, White Wolf, Vision, Nick Fury, Maria Hill, Okoye, M'Baku, Ian Boothby, Helen Cho, Laura Barton, Lila Barton, Cooper Barton, Eitri, Korg, Miek, Biff, Tasba, Ejashi, Hajo, Jasper Sitwell, Carlo, Dora Milaje, Jabari Tribe, Sakaaran Rebellion, S.H.I.E.L.D. Enemies Loki (formerly), Frost Giants, Malekith the Accursed, Kurse, Dark Elves, Ultron, Chitauri, Hela, Skurge (formerly), Surtur, Grandmaster, Thanos, Black Order, Scarlet Witch (formerly), Quicksilver (formerly), Cull Obsidian, Proxima Midnight, Ulysses Klaue, Fenris Wolf, Ebony Maw, Corvus Glaive, Laufey, Imir, Leviathans, HYDRA, Hailstrum, Raze, Grundoth, Wolfgang von Strucker, Marauders, List, Outriders, Jensen, Kronan Marauder, Horned Marauder, Fire Dragons, Fire Demons, Topaz, Sakaaran Guards, Beserkers Type of Hero Demigod, Viking \"I told you you'd die for that. „ ~ Thor to Thanos\" Bring me Thanos! „ ~ Thor as he arrives at the Battle in Wakanda - and his most famous line in the movie. Thor Odinson is an Asgardian warrior-prince, the God of Thunder and a self-proclaimed protector of Earth. Thor subsequently became well known for his actions on Earth, which included acting as a founding member of the Avengers. He is also based on his original comic book incineration. He is the Kid-Appeal Character of the \"Marvel's The Avegners\" Team. Thor is one of the main protagonists of the Marvel Cinematic Universe, appearing as the titular main protagonist of the Thor trilogy as well as being one of the titular main protagonists in the 2012 crossover film The Avengers, and it's sequels the 2015 Avengers: Age of Ultron, 2018 Avengers: Infinity War and Avengers: Endgame. He is the only Avenger that is non-human and one of the few superheroes in the MCU with genuine super powers (the others being the Hulk and Captain America). Thor wields the mystical war hammer Mjolnir, which controls the weather, but he himself also has godlike limitless strength, incalcuable durability and unimaginable agility until his hammer being destroyed by his evil sister Hela, now Thor have a more powerful weapon named Stormbreaker who can even injure the most powerful lord Thanos and the Stormbreaker permect to to the teletrasporta himself or someone else in another place and will back to him if he will launch it. He is based on the mythological thunder-god of the same name from Norse mythology. He is portrayed by Chris Hemsworth. Contents [show] Role in Marvel Cinematic Universe Early life Thor had an idyllic childhood, brought up in Asgard as the treasured son of Odin and his wife Frigga. His best friend and playmate was his adopted brother Loki, and though they were rivals for their father's throne, they still remained close companions. Loki was taught magic by their mother, while Thor was taught how to be a warrior by their father. Brought up in the warrior culture of the Asgardians, Thor valued strength, courage, and loyalty above all else. He desired to be exactly like his father, the war hero, and received the powerful hammer, Mjølnir. Thor often remarked on the monsters he would slay and the wars he would win once he was king. Thor (2011) Thor proved himself a great warrior, often leading his band of warriors, which included Loki, the Lady Sif, and the Warriors Three on adventures. However, he was also known to be reckless when Loki jokingly reminded him that he would be dead had he not used a smoke veil to allow them to escape during one battle. Thor also defeated Imir, a rogue Asgardian who threatened to take control of Asgard and kidnapped several Dwarves. While Imir managed to get the upper hand on Thor, he was eventually defeated when Thor electrocuted him with Mjølnir. Odin decided to make Thor king and ruler of Asgard as he was about to finally enter the Odin sleep after putting it off for so long. Thor reveled in the ceremony and underwent the passage of becoming king from Odin. As Odin was about to name Thor King, he sensed that Frost Giants had sneaked into Asgard and into his vault to steal the Casket of Ancient Winters. Odin, Thor, and Loki went to the vault to find the Frost Giants had already been slayed by The Destroyer. Seeing how close they had come to stealing the artifacts, Thor declared that they must go to Jotunheim and show their strength to ensure the Giants would never trespass in Asgard again. Odin replied that the trespassers were only a few, not an invading force and that they paid for their crime with their lives, but Thor insisted that as King of Asgard he would lead an army to Jotunheim as Odin had done before him. Odin reminded him that he was not King yet and ordered him not to attack. In their quarters, Thor began throwing tables around in anger. Loki convinced him that he was right and they must go to Jotunheim to confront King Laufey. As they were talking Lady Sif and the Warriors Three arrived. Thor announced they were going to Jotunheim and that he would lead them to victory, although they were initially skeptical over the risks, Thor reminded them of their past victories and soon changed their minds. They traveled to the Bifrost Bridge and sought Heimdall's permission for passage to Jotunheim. Heimdall granted it and sent them to Jotunheim, but warned that if they got into trouble they would not be granted entrance back. In Jotunheim, Thor led the warriors to King Laufey's chamber where the giant warned them to leave while he still allowed them. One of the Frost Giants approached Thor before Loki led him away. Thor remained silent until the Frost Giant called Thor a princess. Thor unleashed his anger and the mighty power of Mjølnir and the warriors bravely battled the Frost Giants. Fandral was struck by a Frost Giant and warned Thor to pull back. Thor told them to leave while he battled the Frost Giants alone. As his friends left and reached the Bifrost Bridge, Thor unleashed the full power of Mjølnir and erupted the ground around him killing hundreds of Frost Giants, before flying at full speed to kill Laufey's beast that was chasing the Asgardians. Laufey and his whole army then surrounded Thor and his friends, who were driven back to the edge of a cliff. Before they attacked, Odin arrived and warned Laufey by telling him to preserve the peace and not respond to the actions of a boy. Laufey said that war had already begun, and Odin transported himself and the other Asgardians back to Asgard. Back in the Bifrost, Thor told the Warriors Three to take Fandral to the Healing Room. Odin then chastised Thor for his reckless actions saying that he would sacrifice the lives of innocent people to go to war and that they were not the actions of a King, but a warrior. Thor told Odin he was an old man and a fool. Odin then took Mjølnir from Thor and removed his powers before using the Bifrost to banish Thor to Earth. Thor was sent through the Bifrost Bridge arriving to Earth in a wormhole, which was being studied by Dr. Jane <mark>Foster</mark>, Dr. Erik Selvig and their understudy Darcy Lewis. Thor stood only to be knocked over by the truck they were driving. He awoke, eventually realizing he was on Earth, and began shouting to Heimdall to open the Bifrost. The humans believed Thor to be crazy and when Lewis threatened Thor with a Taser, he was disgusted at her actions and she tasered him. He awoke in a hospital with a man over him saying he that was about to take some blood. Unaware of his surroundings, Thor attacked the hospital staff and security guards taking on dozens before being sedated. He awoke again to find himself strapped down but managed to squeeze out of the restraints and headed for the exit before being hit again by a car, again driven by <mark>Foster</mark>. They took him back to their Wormhole Research Center where <mark>Foster</mark> gave him some clothes. Thor said that he was hungry and they took him to Isabel's Diner. He ate enormous amounts of food astonishing the three before smashing his cup on the floor demanding another drink. <mark>Foster</mark> told him that if he wanted another he should ask nicely; Thor then overheard Pete and Jake talking about a \"satellite\" that had crashed to Earth. Thor realized it was Mjølnir and asked for directions. He said goodbye to <mark>Foster</mark>, Lewis, and Selvig and began to walk to Mjølnir. Realizing as a mortal it was too far, he went to the local pet store demanding a horse. The owner said that they did not have horses only cats, dogs, and other house animals to which Thor asked for one large enough to ride; instead all he received was a very confused look from the shop worker. He left unsatisfied only to see <mark>Foster</mark> again who offered him a ride. <mark>Foster</mark> told Thor that S.H.I.E.L.D. had stolen all of her research. Thor promised to tell her everything she wanted to know about the wormholes when he reclaimed what was his. They arrived at the site to find it covered by a makeshift research facility. Thor entered and took down Agents Jackson and Delancey before being noticed and began making his way to Mjølnir. Thor began taking down guard after guard, before coming across a particularly big guard whom Thor ultimately defeated outside. Thor was unaware that the entire time Clint Barton was taking aim and preparing to shoot him with an arrow. Finally at Mjølnir, Thor rejoiced before gripping his mighty hammer but could not lift it; using all of his mortal strength, he still could not lift it. Knowing his father had taken his powers away from him, he screamed at the heavens and fell to his knees. As the guards arrested him he noticed a small Asgardian symbol appear on Mjølnir, and became heartbroken that he may never see his home again. He was taken for questioning by Agent Phil Coulson but did not respond to any questions, Coulson was convinced he must be special forces due to his remarkable fighting skills. When Coulson left for a moment Loki then arrived in front of him to tell him that Odin was dead and that in Thor's absence Loki had been made ruler of Asgard. When Thor asked if he could go home Loki explained that Thor must remain on Earth to maintain peace with Jotunheim, Thor agreed to the arrangement and said goodbye to his brother. Agent Coulson then returned to find Thor saying goodbye to thin air. Dr. Selvig then approached telling S.H.I.E.L.D. that Thor was Dr. Donald Blake, their colleague who was drunk and very upset about the loss of their equipment, and Agent Coulson let him go so that he could follow them. Thor and Selvig went for a drink where Selvig asked Thor to leave in the morning. He agreed and they share another drink. After a few more drinks Thor's drinking prowess led to them getting into a bar brawl and Thor took a heavily drunk Selvig back to Jane's camper. Thor and <mark>Foster</mark> went to the roof of the Research Center and gazed at the stars. She told Thor about herself and Thor began to tell her about the Nine Realms and Yggdrasil, the World Tree; he explained that her theories were correct and tried to help her understand them better. He also returned her notebook which he had retaken from S.H.I.E.L.D.. When she fell asleep Thor ensured that she was warm before watching over her as she slept. The next day Thor's attitude had taken a change for the better and he made breakfast with Jane <mark>Foster</mark> when they were interrupted by the Warriors Three and Sif who had found Thor. Thor rejoiced to see them before they informed him that Odin was alive and that Loki was king and had showed the Frost Giants the way into Asgard until they saw another Wormhole in the distance and realized that Loki had sent forces after them. Thor, <mark>Foster</mark>, Erik Selvig and Darcy Lewis began to evacuate the town as the Warriors Three and Sif formulated a plan to stop the Destroyer. The Destroyer began attacking the town, destroying everything in its path and knocked back the Warriors Three before being seemingly stopped by Sif's Sword. The Destroyer simply rearranged its body to face Sif and nearly killed her. With this the Destroyer seemed unstoppable. Thor told them to fall back and that he had a plan. Thor approached the Destroyer and spoke to Loki through it, telling him that he was sorry but that he could not allow him to kill the innocent people and instead to take his life. Loki seemingly relented before using the Destroyer to send Thor flying backwards. Thor was dying and Jane came to his aid and sat with him before he seemingly passed. The Destroyer continued to destroy the town before Mjølnir flew to Thor and returned his powers. Thor then created a tornado around the Destroyer and engaged it, deflecting its beams before directing its energy against itself, destroying it. Thor then told Agent Phil Coulson who had arrived that he must return <mark>Foster</mark>'s research if he wanted his help in the future as they fought on the same side and for the same goal. Thor then promised to show <mark>Foster</mark> the Bifrost Bridge and flew her to the Bifrost site. When Thor asked for the Bifrost to open, Heimdall did not respond. The Warriors Three and Sif arrived and he still did not reply. Heimdall eventually answered and the Asgardians returned. Thor then flew to Odin's Chamber to see his mother Frigga and Loki who was shocked to see him. Thor revealed Loki's deception. Loki said he did it all to impress their father and to be Thor's equal; he promised to destroy Jotunheim using the Bifrost Bridge and attacked Thor, who refused to fight his brother. Loki sent Thor flying through the wall of the chamber and headed to the Bifrost where he began the process of destroying Jotunheim. Thor flew to the Bifrost and engaged Loki. After a heartbreaking argument, Loki and Thor erupted into an intense battle where they both appeared evenly matched, but Thor eventually managed to tie Loki down by placing Mjølnir on top of him and went to stop the Bifrost but it was too far gone to stop now. Thor did not want to destroy the Bifrost because then he could not return to Earth to see Jane <mark>Foster</mark> but for the sake of the Nine Realms, called Mjølnir to him and began destroying the Rainbow Bridge and the Bifrost fell away from Asgard in an almighty explosion and into the abyss of space. Thor and Loki were caught by Odin who had awakened from the Odin sleep and Loki revealed he did it all for him before letting go and falling into the abyss. As the Asgardians celebrated, Thor went to see his father, telling him that he was wrong for his prior actions and that he had a lot to learn from him. Odin in return told Thor that he would be a wise king. Thor then went to see Heimdall asking if there was any hope of returning to Earth. Heimdall told him there was always hope. Thor asked what Jane <mark>Foster</mark> was doing and Heimdall replied she was looking for Thor. A few days after Thor defeated Loki, Heimdall had discovered that destroying the Bifrost Bridge had put all of the Nine Realms in danger. He informed Odin and Thor of this. Thor feared for his friend Hogun's people in Vanaheim and warned him. A year later, Frigga managed to contact Loki in Chitauri Space. She informed Thor, Odin, and the Warriors Three of this and that he was planning an attack on Earth involving the Tesseract. Odin called upon the power of dark energy - the very fabric of the universe itself - to send Thor to Earth to stop him, at the cost of his own and Thor's health. An unconscious Thor landed on a mountain, not far from Loki's location, and began searching for his brother as soon as he regained consciousness. The Avengers (2012) When Capt. America and Iron Man succeded to capture Loki, who is on & off mind controlled by an unknown warlord, after he attacked people in Germany, Thor landed on the Quinjet in which Loki was being escorted back to the Helicarrier by Captain America, Iron Man, and Black Widow, and he took Loki from their custody. Thor tried to convince Loki to give up his plans and return home to Asgard with the Tesseract, though Loki still resented Thor. It was during their conversation that Thor learned that Loki was working for another party, although he never learned who it was. When Loki continued to mock him and refused to answer his questions, Thor picked up Mjølnir and threatened him. Iron Man suddenly attacked him and the two traded blows when Iron Man refused to allow Thor to take their prisoner. When Captain America intervened, he pointed out that they should not be fighting with each other, and asked Thor to put Mjølnir down. In response, Thor brought his hammer down on Captain America, who blocked it with his shield which absorbed the impact, shocking Thor, who realized - upon seeing the destruction he had helped to cause - that they had the same goal and so stopped fighting. They returned to the Helicarrier, where Loki was put into a cell designed to hold and dispose of Hulk if necessary. Thor was quick to point out that while Loki was unstable, he was his brother, though when it is brought up that Loki had killed several people, Thor quickly reasserted that Loki was adopted. Later he asked Agent Phil Coulson about Jane <mark>Foster</mark> and was told that she was moved to a secure location when Loki returned and Erik Selvig was put under his control. Nick Fury asked what Thor was prepared to do in order to keep Loki's plans from reaching fruition, though he was unsure. Later as Thor and the others argued, Hawkeye, under Loki's mind control, blew up one of the Helicarrier's engines and helped free Loki, also triggering Banner to transform into the Hulk. Thor found the Hulk moments before he would have killed Black Widow; Thor fought the Hulk, being the only one who could match him for strength. It is well known that Thor holds back an overwhelming majority of the abilities he possesses which are intrinsic to his physical being, sans Mjolnir. Else the Hulk would have been obliterated. Thor's reluctance to fight at optimal capacity allowed the Hulk to gain the upper hand against Thor until a S.H.I.E.L.D. jet shot at Hulk and caused him to leap from the heli-carrier. Thor went to make sure that Loki was still contained. When he arrived the cell door was open and Loki was leaving, Thor tried to stop Loki from leaving but it turned out to be an illusion and Thor became trapped in the cell. Thor tried to break the glass but this caused the cell to almost fall from the sky. Loki threatened to drop the cage when Coulson confronted him with a gun made from the Destroyer. Loki used another illusion to get behind Coulson stabbed him through the heart. Thor looked on helplessly as Loki and dropped Thor out of the Helicarrier. As he plummeted towards Earth, Thor was thrown from side to side and was unable to hit the glass, but he managed to smash free from the cell just in time to avoid the impact. He landed heavily in an empty field, dropping Mjølnir on his landing. Thor then retrieved Mjolnir then departed to rendezvous with the other Avengers. Arriving at Stark Tower once Loki had used the Tesseract to open a portal allowing the Chitauri and Leviathan to invade Earth, Thor again tried to convince him to stop, since the Chitauri were destroying the world he wanted to rule. Failing, he briefly clashed with his brother before Loki fled on a Chitauri Chariot. Thor joined Captain America, Black Widow and Hawkeye on the battlefield, and started helping to fight the Chitauri, before Iron Man and Hulk joined them. Captain America, the greatest field leader in the battle, charged Thor with using his mastery of lightning to stem the flow of enemies coming through the portal. Thor flew to the top of the Chrysler Building where he used his lightning bolts to destroy the oncoming army. If he were able to remain there and continue his assault on the enemy the battle would have been over in minutes. However, due to the other Avenger's inability to halt the enemy that had already arrived he was forced to abandon his post to assist his teammates. While flying around in New York City, Iron Man asked Thor if he had ever seen Game of Thrones, saying he reminded him of it. Thor then asked Iron Man how he could make jokes in the middle of a war. He was then eaten by a Leviathan. In a blind rage, Thor used Mjølnir to get out of the Leviathan. He later helped Hulk bring down a Leviathan; they fought the Chitauri army on top of the beast until together they killed the beast. Though when they were done Hulk punched him for earlier. This blind sided attack had no effect on Thor as he was able to return to the battle without a single mark to show from the a punch by a so-called massivley strong being. Soon Iron Man sent a nuclear missile intended for the city through the portal, which destroyed the Chitauri Command Center, cutting off the forces from their power source and killing them, while Black Widow closed the portal. Once the crisis was over, Thor joined the other Avengers in confronting Loki, who had already been heavily wounded and battered by the Hulk who accidentally free the God of Meschief from the mind control of the mysterious warlord, and took him into custody, however despite Loki is back in himself he will remains crazy for some time before he will have his mental sanity back due to the shocking mind control and so Loki temporarily remains with the warlord's ideas about the humans and for this he's taken in custody. Then, Thor and the other Avengers went to the Shawarma Palace and ate silently. They were interrupted by War Machine, who arrived too late to help fight in the battle. After claiming the Tesseract, Thor took Loki with him back to Asgard by opening a portal with the Tesseract and left the other Avengers in Central Park. After bringing Loki back to Asgard, Thor discovered that Vanaheim was getting slowly taken over by Marauders. Thor gave Heimdall the Tesseract so he that could remake the Bifrost Bridge and the Asgardians could help protect the Nine Realms again. He then, with an army of Asgardians, went to end the threats controlling the Nine Realms. Thor: The Dark World Sometime after the Battle of New York, a group of rag-tag invaders known as the Marauders started a war across all the Nine Realms. Thor, now a full-time general of the Asgardian army, bravely led his forces in a fight against the attackers. With Sif, Volstagg, Fandral, and Hogun, they teamed up to and fought the invading army. During a battle in Vanaheim, Hogan's homeworld, Thor and Sif fought side by side until a giant rock monster called Korg appeared. The Marauders celebrated as they believed Thor would be unable to defeat the monster. Sif allowed Thor to fight it alone and Thor calmly joked that he accepted it's surrender. When the monster appeared to still want to fight Thor killed it with a single powerful blow from his hammer, which caused all the other invaders to surrender. That was the final battle in a two-year war. After the battle was won the surviving invanders were taken to a Asgardian prison. Thor spoke to Hogun, telling him to stay there with his people, as the rest of them went back to Asgard, which Hogun was very grateful for. Thor then left Vanaheim via the Bifrost Bridge, which was repaired with the power of the Tesseract. A party was held for Thor for restoring the peace in the Nine Realms. Volstagg and Fandral remained in high spirits, drinking and telling war stories with beautiful women, but Thor left quickly. He was stopped by Lady Sif who asked him if he would have a drink with her; he kindly refused and thanked her for her company. He walked to the end of the Bifrost, wanted to ask Heimdall how Jane <mark>Foster</mark> was doing. The next day Odin told Thor that he should not hold on to <mark>Foster</mark> too much since she would die long before Thor. With Thor returning to see Jane <mark>Foster</mark>, <mark>Foster</mark> noticed a circle of rain around her; then Thor beamed down. <mark>Foster</mark> slapped him in the face to check if he was real, and then one more time for taking two years to visit her even though he was on Earth during the battle of New York. When one of the officers at the scene attempted to arrest her for trespassing, he was blown back by the Aether; Thor grabbed <mark>Foster</mark> to return to Asgard with her. Eir analyzed <mark>Foster</mark>'s condition upon Thor's request, but Odin arrived to tell him to take <mark>Foster</mark> back to Earth despite his protests. However, when the guards attempted to remove her and were once again blown back by the Aether. Seeing the potential danger, Odin explained to them that the Aether was created by the leader of the Dark Elves, Malekith. He allowed <mark>Foster</mark> to stay until it could be safely removed from her. Thor and <mark>Foster</mark> spent time together in Asgard and Thor explained to her the story behind the Convergence which had caused her to come in contact with the Aether. They shared a kiss and were interrupted by Thor's mother Frigga. Thor made introductions but was distracted by an alarm at the dungeons. When Malekith invaded Asgard, Thor flew into battle and ordered the prisoners to return to their cells, when they refused Thor battled them alongside Volstagg, Fandral and the remaining prison guards. After helping to quell the riot, Thor felt the entire palace shake as Malekith's ship crash landed into the Great Hall. He ran to the aid of his people and arrived just in time to witness his mother, Frigga, fall down bleeding on the ground from being stabbed by Algrim. In anger, Thor burned half of Malekith's face with a lightning bolt and threw his hammer, Mjølnir, into Algrim and Malekith, sending them back to their ship and repelling the invasion. A funeral was later held for the dead Asgardians and Frigga. Thor attended and watched his mother transform into stars in the universe. Thor knew that Malekith would return for Jane <mark>Foster</mark>, and he learned that Odin had locked Jane away in Asgard. Thor desperately tried to convince Odin that Malekith would return and destroy Asgard, he explained his plan to trick Malekith and destroy the Aether, but, blinded by hate and grief, Odin would not let Thor move her. Odin told Thor that he planned to fight a new war with the Dark Elves until they were wiped from existence. However during their argument it became clear that Odin was becoming weaker and uneasy on his feet. Thor knew that they would not win a war with the Dark Elves. Thor then devised a plan to move her even if he would then commit treason and in the worst case get them killed. He asked Heimdall if he could keep quiet. Since Loki managed to get three Frost Giants into Asgard, Thor hoped that he could take them to Svartalfheim. Thor traveled to the dungeons and spoke to Loki. He knew that Loki was maintaining an illusion and forced him to reveal the truth, that Loki had trashed his cell in grief when he learnt of Frigga's death. Thor promised Loki that he he agreed to help then he would free him from his prison cell and grant him revenge for their mother's death. Loki agreed. . Thor and Loki made their escape through the halls of Asgard, to remain unnoticed Loki disguised himself as a guard. However, when it became clear he was annoying Thor with his constant talking, Loki decided to have more fun and changed Thor's appearance into Lady Sif and his own into Captain America, mocking Thor as he went. Thor pinned Loki against a wall when he spotted some guards, Loki requested his dagger but Thor instead gave him a new pair of handcuffs. <mark>Foster</mark> and Loki then boarded the Dark Elf Harrow. While Sif and Volstagg delayed the guards, Thor flew out beside the Bifrost Bridge, pushed out Loki and jumped out himself with a sick <mark>Foster</mark> in his arms. They all landed on a smaller Asgardian Skiff that Fandral had been driving. They were hunted by an Asgardian patrol but Fandral went over to their ship and knocked out the soldiers. Loki then drove through the secret passageway that took them to Svartalfheim. The trio successfully landed in the wastelands of Svartalfheim and Jane <mark>Foster</mark> regained her strength. Loki began to mock Thor about his love for a mortal woman; this lead to an intense argument between the two leading to Thor nearly punching his brother. He stepped back when he thought how Frigga would not want them to fight. Loki however said she would not be surprised. They shared a laugh and started to talk about wanting to trust Loki; Loki told him to trust his rage. They made their way through Svartalfheim and saw Malekith leaving his ship. Loki once again asked Thor if he trusted him, when Thor asked if he would trust himself, Loki said he could not and used his dagger to stab Thor in the side and throw him off a cliff. He kicked and beat Thor before cutting his hand off. Malekithhad been there waiting for them; Loki told him that all he wanted in return for <mark>Foster</mark> was a good spot where he could see Asgard burn. Algrim remembered seeing Loki in a prison cell, so he told Malekith that Loki was an enemy of Asgard. Malekith then began to draw the Aether out of <mark>Foster</mark> but while he was still absorbing it, Thor shouted Loki's name. Loki had only created an illusion of cutting off Thor's arm and Thor called for Mjølnir. He then shot a lightning bolt on the Aether, causing it to explode. Loki jumped on top of <mark>Foster</mark> to prevent the Aether explosion from hitting her. Malekith had already absorbed enough power and he left, telling Algrim to take care of the rest. Algrim threw a Black Hole Grenade in the air; Loki almost got sucked in but Thor managed to save him. Algrim started to beat up Thor but Loki then stabbed him in the back with a sword. Algrim, being \"the last of the Kursed\" , was not injured and he grabbed Loki and pushed him towards his chest. The blade sticking out of Algrim's chest then pierces Loki's solar plexus. Loki managed to press one of Algrim's implosion bombs and Algrim was killed in the ensuing explosion. Loki then seemingly died in Thor's arms much to Thor's grief, unaware that in spite the fact that Loki agreed to cooperate with him, Loki has schemed to kill two birds with one stone: Go with his brother to gained the opportunity to avenge Frigga's death and then took over Odin's place after Thor left him. Thor and Jane <mark>Foster</mark> then entered a cave that seemed to have all the objects that did not come back when Ian Boothby, Darcy Lewis and the kids played at the storage house. <mark>Foster</mark> grabbed Boothby's car keys and, as she and Thor continued into the cave, they were transported back to the storage house in London. When they got to Earth the worlds were almost in line and Malekith had landed. Thor and Malekith met each other on the battleground and exchanged threats before Malekith attempted to kill Thor with the Aether's power. Thor was able to use Mjølnir to deflect the attacks and mocked Malekith's lack of strength and knocking him back with a hit from Mjølnir. The Asgardian and the Dark Elf began to fight and the Battle took them through many different worlds, although their equally matched strength meant neither could kill the other. The Dark Elves began to invade Greenwich but Erik Selvig's devices teleported some of them away. Thor and Malekith crash landed in Svartalfheim where Thor lost Mjølnir through a portal, leaving him near defenceless from Malekith's attacks. When they landed on Jotunheim they were nearly killed by a Jotunheim Beast before they were teleported to separate parts of London, with Thor being forced to use the subway to make his way back to Greenwich. Malekith, now back on Earth and next to his ship, started to release the Aether. Thor found <mark>Foster</mark> and Selvig. They told him that neither of them could get close to Malekith, but Thor could. Thor took Selvig's devices and threw them onto Malekith's arms, teleporting them to Svartalfheim. Then he threw the last one in Malekith's chest, teleporting him to Svartalfheim. But now Malekith's ship had started to fall down on to their heads. Luckily, Selvig's devices teleported the ship away and it crashed down on Malekith, killing him. After the battle, Thor returned to Asgard and talked with Odin (who was actually Loki using a magical disguise). He spoke about Loki's sacrifice and how he believed his brother had died a hero. He then explained his desire to return to earth and be with Jane <mark>Foster</mark>, and renounced his claim to the throne. He offered Odin Mjølnir which he refused (as Loki would have been unable to lift it). He then returned to Earth and was reunited with <mark>Foster</mark>. Soon after, when S.H.I.E.L.D. Agent Phil Coulson and his team were investigating the discovery of a lost Asgardian artifact known as the Berserker Staff, he sought to consult with Thor, but was informed by S.H.I.E.L.D. director Nick Fury that Thor had taken himself \"off the grid\". Phil Coulson told Sif, when she came to Earth chasing Lorelei, that it would be better if he told Thor himself that he was alive. Avengers: Age of Ultron Thor and the Avengers located Loki's Scepter at a secret HYDRA base in Sokovia. While searching for the Scepter, Thor noted that HYDRA would not have been able to build such powerful technology without it. During the battle the group was attacked by Pietro and Wanda Maximoff, twin siblings that had volunteered for HYDRA's experiments. Clint Barton was injured during this with Thor offering to get him back to the relative safety of the Quinjet. Eventually Tony Stark located the Scepter and HYDRA was finally defeated although the Maximoff twins did escape. On the Quinjet Natasha Romanoff asked Thor for an assessment of the Bruce Banner's skills on the battlefield Thor commented on the Hulk's violence. Seeing that this upset Banner Thor told him that many of the injuries he inflicted on the soldiers was non fatal. On the way back Tony asked Thor to allow him to analyze the scepter before Thor took it back to Asgard which he agreed to. Now living on earth, Thor attended a party at Avengers Tower challenging the other Avengers to lift Mjølnir; only <mark>Steve Rogers</mark> was able to move it which made Thor nervous for a moment. When all the Avengers failed, Thor implied that it was simply because they were unworthy. While the Avengers in the Avengers Tower were celebrating and trying to lift Mjølnir, Ultron emerged to greet the heroes as he described them all as killers. Ultron beckoned the Iron Legion to attack the heroes as he watched. As the battle ensued, one of the Iron Legion drones left with the Scepter in hand. When all the Iron Legion drones were destroyed, Ultron crushed the remains of one the drones while describing the initial confusion he had felt when he was \"born\". Thor immediately destroyed Ultron's body (which actually a one-use Prototype Body). Ultron is then heard ominously singing a phrase from \"Pinocchio\" as his voice dies out. After taking safe haven at Clint Barton's Homestead Thor decides to leave, telling <mark>Steve</mark> that he must unlock the secrets of his hallucinations. Thor finds Erik Selvig to help find the \"Water of Sights\". Thor enters the pool and the water sprites allow him to revisit his nightmare. He sees visions of the destruction of Asgard, the Infinity Stones and the birth of Vision. During a discussion between the Avengers, Thor appeared and cast a bolt of lightning at the machine. The body inside it broke, revealing a humanoid being with reddish pink and green skin. Confused about his surroundings as he glanced around, the being's gaze immediately focused on Thor as he recognized Thor to be an infinitely powerful being not of this Earth and the only real threat to him. He then jumped on the God of Thunder. Thor was able to counter by tossing him out a glass window, but the being was able to stop himself instantly. The being then took the time to examine himself on the reflection of the glass window while also gazing out into the city. The being apologized for its actions and then offered its gratitude to Thor before taking a similar appearance to the God of Thunder's outfit, mainly the cape and gauntlets. Thor explained that he witnessed a vision where the Earth will be destroyed and at the center of it is the gem that is implanted on the being's forehead which he reveals is the Mind Stone, a object that is a member of the Infinity Stones, describing them as the greatest power in the universe. Captain America, confused as to why this \"vision\" sounded like J.A.R.V.I.S., allowed Tony to explain that he reconfigured his matrix to create \"something new\". The Vision stated that he is not a child of Ultron, Ultron himself or J.A.R.V.I.S., he is only himself. The Avengers, along with the Maximoff twins, remained skeptical as to which side the Vision was on, to which the android explained that he was on the side of life while Ultron was not, and then went on to say that Ultron was waiting for the Avengers, especially Tony Stark, in Sokovia. He then stated that Ultron was in pain, and that he would spread his rage and pain all across the globe. After finishing, he casually lifted Mjølnir and offered it back to Thor, much to the bewilderment and surprise from everyone in the room, before leaving Thor a claims Tony. The first evacuation began with Quicksilver and Scarlet Witch escorting the civilians out of the city. Quicksilver being more aggressive due to them not cooperating at first, then Scarlet Witch using her hypnosis on the people and controlling them to leave their homes. Later, Bruce Banner along with Hawkeye were searching for Black Widow whom was held captive by Ultron. Bruce Banner found her first and destroyed the lock with a laser gun, freeing her. Later, Iron Man flew over to the church where Ultron was in his new armor. Ultron then confronted his creator and pointed out that he was stalling to protect the people of Sokovia. Tony replied that this was the mission that Ultron was supposed to complete, however, Ultron countered by saying that he has moved beyond his mission and that he is free. Suddenly, the activation device juts out from the ground as Ultron revealed that he too has been stalling until it reached the surface. Just then, the Ultron Sentries also emerged from the ground and the water and began to attack the civilians. This prompted Iron Man and the rest of the Avengers to retaliate by attacking the Sentries. Scarlet Witch attempted to aid her people by moving them off a bridge while Hawkeye bought her time by destroying the drones with his arrows. One of the drones landed down and fired at the people, only for Wanda to create a shield and repelling the blasts. However, the shield dissipated from the force of the blasts knocking Scarlet Witch to the ground. Back at the church, Vision confronted Ultron as the two gazed at one another while taking flight. The Vision pleaded to Ultron that he can change all of this since he is the one who set the terms. Ultron responded by choking the Vision, however, this gave the android the opportunity to hack into Ultron's mainframe and prevent him from escaping through the net. Captain America was battling the sentries on the bridge while Thor fought the bots underground as he made his way towards the machine. Quicksilver soon joined the fray, using his super speed to take out many drones in the blink of an eye. Vision succeeded in burning Ultron out of the net, but this incapacitated Vision and only stunned Ultron briefly. He smashed Vision to the ground before activating the machine. Thor reached the boosters of the machine, only to find himself too late as it was activated. A massive portion of Sokovia was beginning to lift off the ground, as the Avengers could do nothing but watch. The evacuated people watched in horror as their town was being lifted towards the sky while those who remained were either crushed by falling debris or falling below. Ultron began to boast on how the Earth will crack from the weight of the Avengers' failures and that no matter what they do, it means nothing to him. Once he completes his plan of global extinction, the only thing that will be left in the world will be metal. Back underground, Black Widow and Bruce Banner shared a kiss, only for Natasha to push him into a pit and forcing him to change into the Hulk. The Hulk along with Black Widow leaped above towards the ascending slab of the city and landed in a forest before they split up to destroy the drones and protect the civilians. After Iron Man rescued a family from a collapsing apartment, Captain America ordered the Avengers to destroy the Ultron Sentries and if they get harmed they harm the opponents in return and if they get killed then they should \"walk it off\". Meanwhile, Scarlet Witch and Hawkeye were rescuing civilians while they fought off the Ultrone drones. As Hawkeye grabbed Scarlet Witch and took cover inside a house from an oncoming Ultron drone, Wanda began to panic as she felt great guilt in joining Ultron and allowing this to happen. Hawkeye stated that now is not the time to be afraid, and despite being a human with a bow and arrow, he does this because it is his job. He can't do a job and babysit at the same time, it no longer matters what she did and what she was. What matters is that she fights to protect, and when she does she becomes an Avenger. He then went out and continued to fight off the Sentries. Back in the city at the bridge, two cars were about to fall from the shattered edge. Captain America attempted to save on but the fender dislodged and the two cars fell below. Thor intercepted one of the cars and tossed the woman that was in it back to Captain America as he lifted the second car back up to the bridge. Black Widow joined the battle, using her electric batons to fight off the drones. Captain America and Thor worked in tandem, as Thor batted Cap's shield with enough force to ricochet it off of several drones while simultaneously. Thor destroyed many of the drones effortlessly which irritated Ultron and took him away from his allies. Hawkeye continued to destroy as many drones as he could, but more piled on regardless. However, Scarlet Witch soon joined the fray and used her hex bolts to destroy the Ultron Sentries while using her telekinesis to dismember them. After destroying them, she was carried off by Quicksilver. Ultron tossed Thor back at the church and began to pummel him savagely. Iron Man was trying to find solutions as to how to stop Ultron's plan, and realized that he should redirect the energy back at the thrusters to overload, but F.R.I.D.A.Y. stated that would take the city and everyone else on it. The Avengers, thinking that they were going down along with the city, were then shocked and surprised to see that Nick Fury, along with Maria Hill and several other former S.H.I.E.L.D. had arrived with a Helicarrier to rescue the stranded civilians. The Ultron drones were about to attack the Helicarrier only for Nick Fury to deploy Rhodes in his new War Machine armor and began to destroy the attacking drones with Iron Man joining the fray alongside his comrade. Ultron continued to beat Thor before putting him in a choke hold saying that once he turns the key he will cause the city to plummet down and kill billions of humans despite saving the people on it. Thor began to distract Ultron as Vision soon regained consciousness and whacked Ultron away with Mjølnir before returning it to Thor. While Iron Man fought off the sentries, one of the bots destroyed the propellers for the evacuation pods causing Iron Man to prevent it from falling. Thor then called out to the Avengers that the drones are coming for the core to activate it. Iron Man told Rhodey to rescue the other civilians while they regrouped back at the church. After they all met up, Ultron soon confronted them all and summoned a massive armada of his sentries in response to Thor's challenge and to Captain America's dismay. After Ultron questioned on how they could stop him, Iron Man replied \"together\". This prompts the legion of drones to all attack the Avengers. The heroes then work in tandem and began to destroy any drone that attempted to go near the machine. Captain America using his shield and fighting prowess, Black Widow using her martial arts skills and taser batons, Hawkeye using his arrows and bow, Vision using his density altering powers, Scarlet Witch using her hex bolts and telekinesis, Quicksilver using his speed and friction, Thor using his hammer and lightning, Iron Man using his repulsor blasts, and Hulk using his fists as they all fought off the robotic army. Ultron, shouting with rage, attacked himself and began with the Vision. The Vision then blasted him away with a beam of energy from the Mind Stone on his forehead, prompting Thor and Iron Man to join him as they blasted Ultron with repulsor beams and lightning bolts respectively slowly melting his shell away before stopping. Weakened and damaged, Ultron was punched away by the Hulk and forcing the drones to all escape. Iron Man ordered the Avengers to stop them from leaving and destroy them should Ultron download himself into one of them when he is destroyed. War Machine was joined by the Vision to destroy the airborne drones much to his bewilderment. Captain America then ordered the other Avengers to retreat to the boats, however, Scarlet Witch volunteered to remain behind to protect the core in order to prevent a drone from activating it. Unbeknownst to them, a damaged Ultron makes his way to the Quinjet. Hawkeye drops Black Widow off near the Hulk's location in order for her to calm him down and revert him back to normal, unfortunately this was prevented after Black Widow and the Hulk recieved a hail of bullets from the Quinjet which was controlled by Ultron. Meanwhile, Hawkeye left the boat in order to rescue a Sokovian woman's son but soon realized he was in the line of fire as the bullets from the Quinjet were racing towards him. Before the killing blow was struck, Hawkeye and the boy were saved by Quicksilver as he sped past them, taking the bullets instead and dies from his wounds. Scarlet Witch senses this and screams in pure anguish at the loss of her brother. Hawkeye carries off the dead Quicksilver to the boat while Captain America takes away the boy. Hulk is then seen carrying Black Widow before landing on the Helicarrier, dropping her there before he lunges towards the Quinjet. He removes Ultron from the controls as the A.I. crashes into a train car. Scarlet Witch finds Ultron and rips his central core out of his body in revenge for him killing her brother. However, because she left her post, Ultron was able to take control of a damaged sentry and activate the machine. Thrusters went into reverse thrust in order to increase the devestation of the impact as Sokovia plummets towards the Earth below. Iron Man uses his Unibeam to counteract the energy being given off through the vibranium engine while Thor summons a massive bolt of lightning. Vision flies through the rubble and saves Scarlet Witch at the last moment before Thor swings Mjolnir down with incredible force, using the power from the lightning and completely destroying the slab of Sokovia through the mechanism itself. Black Widow attempts to reach the Hulk through the Quinjet, informing him to deactivate the stealth mode in order for them to track him. However, the Hulk simply cuts out the transmission much to Black Widow's shock. The Hulk remains within the Quinjet as he along with the ship drift through the skies. Ultron on the other hand, survived through a final Ultron Sentry. But he was then confronted by the Vision who noticed that he was afraid of death. The two engaged in a rather friendly conversation before they shared their respective views of humanity. While they both agreed that humans are flawed and are doomed to self destruction, Vision points out that they have faith in attempting to achieve their accomplishments and destroys the attacking drone, ending the threat of Ultron. Thor travels away from Earth for search the Infinity Stones and to discovers what his hallucinations reference about and he say hello to Tony and Cap after he travels away thanks to the Bifrost. Thor: Ragnarok Thor has spended his time to search the Infinity Stones but he didn't find them and he's being captured by the fire demon Surtur who tell to him who Odin is not longer on Asgard and his absence haved left the throne defensless, Surtur tell to Thor who he's ready to make Ragnarok, the end of Asgard and with the destruction of Thor's home he will finally die, Thor free himself from his cages thanks to Myolnir and he steal Surtur's crown killing Surtur and he's convinced who killing Surtur he haved stopped Ragnarok, so Thor escape from Surtur's palace and with Surtur's crown he's chased by the Fire Dragon until he's saved by the Bifrost who teletrasporta him into Asgard where Thor meets the new guardian of the Bifrost, his old friend Skurge who reveal to him who Odin haved fired Heimdall for betrayal but he's disappeared before the execution, Thor go in the central of Asgard where he found a statue of Loki and discovers who Loki is alive, Loki haved faked his death and haved stealed the throne disguised himself as Odin and then Loki is watching a opera on his fake death disguised as Odin, Thor force Loki to reveal his true sembiances and identity to the whole Asgard and unmask Loki, after Loki haved reveal himself Thor asks him where is the real Odin and Loki answer him who he don't haved killed Odin but simply banish him into Earth and then the two brothers thanks to the Bifrost go to Earth, specifically in New York. Thor and Loki watch the destroyed retirement home where Loki was left Odin who now he's no longer there anymore, Thor asks to Loki on how he faked his death and reveal to him who he and Jane broke up each other, then Loki being captured and teletrasported by Doctor Strange who meets Thor because he believe who he and Loki are dangerous for Earth and asks them to go away but Thor tell to him who they must found Odin and Strange propose to him to help them to find him and Thor agrees, so Strange free Loki but Loki is anger at Strange for haved captured him and try to kill him but Strange simply teletrasport them to Norvegy where Odin is waiting them. There Odin reveal to Thor and Loki who he's gonna die and with his death Hela, the godness of death, his daughter and their sister, will be free from her prison and will try to steal the throne and to destroy the Nine Realms, Thor and Loki watch Odin sadly die and disappears before their eyes, then Hela being free and meets her brothers, Hela orders to Thor and Loki to nail but Thor refuses and try to smash her with Myolnir but Hela shockingly and incredibly easily block the powerful hammer and destroy it with Thor's sadness and Loki's shock, then Hela prepares to attack them and Loki, in the panic, orders to Volstagg to bring them back to Asgard with the Bifrost, Thor try to adverts Loki who if they escape with the Bifrost when Hela is before them Hela will finish in the portal too, however it's too late, Hela chase Thor and Loki trough the portal and attack them, Loki try to stop Hela with his hagger but Hela easily block it and kick Loki out of the portal making him finish into the space, then Thor fight Hela for stop her from arriving to Asgard but Hela try to cut his head off with her sword, however Thor kick her away from him and despite Thor save himself Hela arrives to Asgard where she start a tyrannical empire as a evil queen, Thor finish out of the portal due to having kicked himself away from Hela and the God of Thunder finish into space. Thor finish into a alien planet named Sakaar where he being attacked by Rebels who wants eat him, Thor being saved by a female humanoid named Scrapper 142, however she capture him and take him as a cointendaint for the leader of the planet, the tyrannical and ruthless but eccentric and kind Grandmaster, Thor being caged on a chair and meets the Grandmaster and then Thor discovers who Loki is alive and is on Sakaar right before his eyes, Thor and Loki argues and Loki reveal him who he has arrived weeks ago and he has become friend of the Grandmaster for have a good life on Sakaar and the Grandmaster who time goes in different ways on Sakaar, then Thor make a deal with the Grandmaster, if him will defeat his champion he will can back to Asgard, so Thor being prisoned and there he meets the sweet gladiator Korg who become his friend. Later Thor have a lite with Loki and Loki tell to him good luck for his fight with the champion after having tryed to convince him who he can't defeat Hela. Before the fight in the arena Thor discovers who Scrapper 142 is an Asgardian and who is a Valkyrie, so Thor try to convince Valkyrie to help him but Valkyrie refuses. Thor have his hairs cute and his hairs color change from blonde to ash blond, in the arena Thor finds out who Grandmaster's mysterious champion is his Avenger teammate and friend Hulk, Thor is happy to see him but Hulk is professional and due to his anger and his love for the fight attack without any esitation Thor, the two friends fight with Thor who try to convince Hulk to not fight each other but Hulk smash him like he did to Loki time ago when he was mind controlled and crazy and slump him away, this make Thor angry and he attack his former friend with a big hammer take from the walls and smash Hulk away, then Hulk at some point of the fight block the hammer and punch Thor away and start to beat him to death until Thor have a vision of Odin and then Thor discovers his true powers and defeat Hulk with a big and powerful thunder, then Thor with his amazing thunder powers beat several times Hulk and is gonna win until the Grandmaster fake the fight making Thor shock and making win Hulk, Hulk then jump and try to kill Thor but the God of Thunder reprise his senses in time and easily block him with one hand, so Thor survives. In the cellroom Thor and Hulk are still mad each other and Thor asks to Hulk where is the Quinjet and Hulk say it to him, there Thor try to convince Hulk to help him to stop Hela and Ragnarok but Hulk refuses and then Thor try to escape from the room but being shocked from the elettricized walls with Hulk laugh at him. At night Thor and Hulk have a lite but after the lite the two back to be friends and riconcile each other with Hulk try to convince Valkyrie to help Thor but Valkyrie refuses, Thor try to convince Hulk to join him but he refuses too, so Thor escape alone and found the Quinjet and haved actived it but Hulk enters to convince him to remains as his friend and accidentally break the Quinjet but Thor shows a foto of Natasha making Hulk transforms into Bruce Banner for the first time after 2 years, the two reunites and Banner and Thor ally to defeat Hela and Valkyrie join them for avenge her deceased teammates, Valkyrie gave as a piece offert Loki to Thor and Banner reunites with his former enemy and ally, Thor and Loki ally again for found a ship for escape but Loki try to bertrays Thor but Thor shock him with the disc of the obbedince and leaves him there after having tell to him who he will ever be the God of Meschief but he could be something more and could mature, Thor, Banner and Valkyrie escape from Sakaar with the Commodore and they arrive to Asgard where Thor with the help of Heimdall make the Asgardians escape from Hela, Thor fight with Hela who cut his eye off, then the completely redeemed and matured Loki arrives with Korg and the Sakaarians Rebels to make evacue the Asgardians, Thor is overpowered by Hela. Then Thor have a vision of Odin where Odin incorauge him to defeat Hela and reveal to him who the solution is not stop Ragnarok but causing because Asgard is not a place, Asgard it's where the Asgardians lives, then Thor reprise the senses and with his great powers kick Hela away from him and with Loki, Valkyrie, Korg, Hulk and Heimdall start to kill and fight Hela's henchmen, then Thor asks to Loki to revive Surtur to defeat Hela despite this will destroy Asgard, Loki go to take Surtur's crown to pose in the eternal flame to revive him and Thor and Valkyrie fight Hela, at a point Surtur is revived and start to destroy Asgard and to fight Hela, Thor, Valkyrie, Loki, Hulk, Heimdall and all the Asgardians escape on board of the ship Statesman and they evacue the planet in time before Ragnarok being completed. After Hela and Surtur's deaths and Ragnarok completed, Thor, Loki, Hulk, Valkyrie, Heimdall and a the Asgardians in the space look with sadness from the ship Asgard destroyed, then Thor becomes the king of Asgard and he has a black eyepatch like his father on the missing eye, Loki console him telling who he look good with the eyepatch, the two brothers are now finally reconciled and affectionate than ever. Thor sitting on his throne and then with Valkyrie, his beloved brother Loki, Hulk, Heimdall and his people by his side Thor decide as their new home the Earth. Avengers: Infinity War During their travel to Earth, the Statesman is attacked by the Mad Titan and dark lord Thanos and his Black Order, then they enters in the ship and Thor apparently being defeated easily and half of the Asgardians being murdered by Thanos with the other half of Asgardians escapes on several escape pods togheter Valkyrie and haved done a help call to save the others, Thor is at the feet of Thanos, Heimdall is slumped to the ground and Loki is kept under fire by Proxima Midnight. Thor is held from the head by Thanos who take him as an onstage with Thor reprise the senses and get nervous, then Thanos force Loki to gave him the Tesseract threatening him if he will not gave it to him he will kill Thor, Loki initially try to protect the universe by not gaving the Tesseract but he can't see his brother being tortured and so reveal that he had steal the Tesseract from Odin's Vault before Ragnarok and pose it to Thanos apparently gaving to him the Tesseract but then he says to him \"We have a Hulk!\" citing his former enemy Tony Stark and then Hulk appears and attack Thanos, as Loki haved predicted Thor fall and being free from Thanos's catch and Thor being saved by Loki and the two escape during Hulk and Thanos fight, however they unluckily remains in the ship. After Thanos haved incredibly easily defeated Hulk and haved beat him in the ground leaving him out of conscience, Thor try to save Hulk but Thanos's easily gave to him a violent punch making him finish far in a floor, there Ebony Maw immobilize Thor with cybernetic technology to impeding him to stop Thanos, then Heimdall teletrasports Hulk to Earth thanks to the Bifrost but he being killed by an angered Thanos with Corvus Glave's sword leaving Thor, as Heimdall was his best friend, sad and angered for Heimdall's death and he promise revenge to Thanos only to have his mouth closed with cybernetic metal by Ebony Maw, Thor watch sad Loki's apparently death who being apparently strangled to death by Thanos and an apparently dead Loki being throwed before a Thor's horrified, angry, sad and vengeful, then Thanos, with the Space Stone acquired on his Infinity Gauntlet teletrasports himself and the Black Order on their ship again, then Thor being free by the cybernetic metals and start to cry on Loki believing that his brother could be really dead this time, with his beloved brother apparently dead nothing feels could be going worse until Thanos destroys the Statesman with Thor still inside it, Thor however survives despite being leaved out cosciencly flout in space depressed for Loki's apparently death. Later Thor is saved by the Guardians of the Galaxy who take him inside their ship, there Mantis wake up Thor who tells to him what Thanos haved done to him and the people that he love, then he console Gamora when he discovers that Thanos is his hated adoptive father telling to her about his father's death and about his sister Hela and how he had lost his eye, then Star-Lord, jealous as Gamora is his girlfriend, start a competition with Thor even imitating his voice when he tells to him that he will not leave him to steal their ship to go to Nidavelier, then Thor friendship with Rocket Raccoon despite erroring calling him \"rabbit\" , then Thor, Rocket and Groot (that he call \"three\" ) with an escape pod travels to Nidavellier to make a new weapon for Thor for his battle against Thanos, then the other Guardians go to Knowere. In their travel Thor tells to Rocket about his losses friends and family and who he must defeat Thanos and winning, Rocket asks to Thor what would happen if he would lose and Thor say who even if he would lose he would have nothing to lose with Rocket correct him that he would lose much if Thor dies, then Rocket gave to Thor a elettronical eye to replacing the missed one with Thor instantly puts it despite Rocket tell him that he would wash it before wearing it, then they arrives to Nidavelier. Then they go in the planet and Thor notice that there's no nanes but then his old friend Eitri attacks them but stop after having ricognized his old friend Thor, then Eitri tells to the trio that Thanos haved forced him and the nanes to make the Infinity Gauntlet bit he ugually killed them all except him leaving Eitri scared and shocked believing that he can't do other weapons, however Thor tells him that he can still make weapons and his ability can't be removed, then Eitri present to Thor, Rocket and Groot the work in progress leaved most powerful Asgardian weapon, the Stormbreaker, so they decide to riactivate the fucine and to make the Stormbreaker, Thor however in the process being burned alive and he's going to die, Eitri says that only complete the Stormbreaker can save him but miss the handle and asks Groot to help him to find a handle, however Groot then make grows his forearm to a suitable strength and the broke it off, creating a wooden handle and completing the Stormbreaker, not long after the burned and unconscious body of Thor regained life with the completetion of Stormbreaker, so Thor teletrasports via Stombreaker who can evocate Bifrost himself, Rocket and Groot to Wakanda where Thor saves a team formed by some of his Avengers's teammates and Wakandians from aliens named Outriders with the Stormbreaker. Then Thor make a heroic entrance with his old armature, the Stormbreaker and his new friends Rocket, who have a gun with him, and Groot, then them three join the battle and procede to beat Outriders, Thor then reunites with <mark>Steve Rogers</mark>, who now is becomed mature and no longer arrogant or stupid and is not Captain America anymore, and then the two start to argues about Thor's haircut and Thor jokingly accuses <mark>Steve</mark> to having copy his beard, so then Thor present Groot to <mark>Steve</mark> and when Groot says \"I am Groot\" who is his linguage for every word <mark>Steve</mark> comically believe this as a presentation and says \"I am <mark>Steve Rogers</mark>\" , then after a long battle they destroys every Outriders and win the battle. However then Thanos arrives and he kill Vision and take the Mind Stone from his head, then Thanos, with all the Infinity Stones in his possess, is ready to snap the fingers and to erase from existence half of universe but Thor, more power than ever, start to attack him and stabs him into the chest with the Stormbreaker incredibly truly injuring the Mad Titan, then Thor, wisher to avenge his apparently death brother, procede to push the Stormbreaker more inside Thanos's chest injuring him more, Thanos seems die but then he reveals that of he wants to kill him he should go for the head and then snaps the fingers. Then Thor angrily asks Thanos on what he have done but Thanos simply smile and save himself teltrasporting himself in an unknown alien planet leaving the Stormbreaker fall out of his chest on Wakanda's floor before Thor's eyes, then Bucky Barnes, T'Challa, Groot and several Wakandians disappears from existence leaving only dust behind them, then Thor togheter his friends watch sad and devasted Vision's body and Thanos's victory. Personality Thor is a noble warrior and a man of honor. He has dislike of mortal technology and science for creating supervillains and admires heroes with courage, honour, compassion, and the gift of battle. He was very wise about mortal tales and criticizing villains about their abilities they boasted Originally, he was very arrogant, full of himself, and sought battle to prove his strength, heroism, and was short-sighted, acting on impulse or however he felt justified. For his actions and inexcusable behavior, Odin stripped Thor of his powers, titles, and rights, banishing him to Midgard until he proved himself worthy of his Asgardian power. On Earth, Thor was an arrogant stranger and quickly fell into depression when his brother lied to him and how he could not lift Mjolnir. However, he fell in love with Jane <mark>Foster</mark> and quickly learnt humility and wisdom. This changed him so much that he was even willing to stand up to Loki and protect the Frost Giants, his enemies. Physical Appearance Thor is a very tall Asgardian. He has blonde hair, fair skin, and blue eyes. He has very large arm muscles and long legs. He wears a silver Viking-style helmet, red cape, black armor with silver circles, red wristbands, silver chain mail sleeves, large golden belt, blue tights, and tall golden boots. In Ragnarok, his hair was cut short and his right eye was cut off by his sister Hela, however in Avengers: Infinity War Thor have a elettronic eye by Rocket as a replacement for the original eye. Relationships Family Buri †--Great-Grandfather Bor †--Grandfather Odin--Father Frigga †--Mother Loki--Adopted Brother and Friend (Former enemy) Hela +--Sister and Enemy Friends and Allies Tyr Heimdall + - Best friend Sif & ndash +; Friend Warriors Three--Friends Fandral + Hogun + Volstagg + Jane <mark>Foster</mark>--Ex-girlfriend Erik Selvig--Friend Darcy Lewis - Friend Ian Boothby Avengers--Teammates Korg - Friend Tony Stark / Iron Man & ndash - Temporary Enemy turned Team Leader, Best Friend and Teammate <mark>Steve</mark> Rogers/Captain America--Temporary Enemy turned former co-team Leader, Friend and teammate Bruce Banner/Hulk - Close friend and teammate turned enemy, Attempted Killer and Attempted Victim turned close friend, saviors, rescuee, and teammate Natasha Romanoff/Black Widow - Riluctant Ally and Enemy turned friend, ally and teammate Clint Barton/Hawkeye - Teammate Wanda Maximoff/Scarlet Witch--Enemy and Enthraller turned Ally Pietro Maximoff/Quicksilver †--Enemy turned Ally Vision--Co-creation, friend and teammate S.H.I.E.L.D. Phil Coulson--Friend Nick Fury Maria Hill Jasper Sitwell † (former) Helen Cho--Ally and Admirer Guardians of the Galaxy - Allies and Saviors Star-Lord - Savior turned Rival Gamora - Close friend and Savior Drax the Destroyer - Friend, Fan and Savior Rocket Raccoon - Close friend, fan, teammate and helper Groot - Friend, teammate and helper Enemies Frost Giants Laufey † Hailstrum † Raze † Grundroth † Chitauri Marauders Korg † Dark Elves Malekith † Algrim † Ultron † Ultron Sentries † HYDRA Wolfgang von Strucker † Hela + - Sister, Enemy, Attempted Killer and Indirectal victim Fenris + - Enemy Thanos - Sworn enemy, Attempted Killer, attacker and Attempted Victim Black Order - Enemies and Attempted Killers Corvus Glaive † Ebony Maw † Cull Obsidian † Proxima Midnight † Video Games Only Ymir Mangog Fire Demons Surtur Rock Trolls Ulik Hela Duhg Powers and Abilities As the first born son of Odin, Thor possesses a number of superhuman attributes common among the Asgardians. However, some of his attributes are considerably more developed than those of the vast majority of his race. Thor is the second most powerful Asgardian in the Nine Realms, second only to his father, Odin the All-Father. Thor is a Norse warrior god, trained and skilled in the arts of battle, which he has practiced for thousands of years. He is recognized to relying solely on his superior fighting ability, strength, and nigh invulnerability. Following his banishment to Earth, Thor greatly withholds his power unless fighting someone with similar strength and durability. Due to his immense power and disciplined perspective, Thor often has to hold back during a fight due to the destruction his strength may cause to his surroundings, such as his fight on the Helicarrier with Hulk. When he does let loose with his powers, Thor is capable of decimating much of his surroundings, such as when he shattered an entire ice shelf during a battle on Jotunheim. Powers Asgardian Physiology: As an Asgardian, Thor has several superhuman abilities. Superhuman Strength: As an Asgardian, specifically the son of Odin, Thor is the strongest Asgardian alive, apart from Odin himself. His incredible superhuman strength enables him to overpower normal humans, Frost Giants, Chitauri aliens, Dark Elves, Ultron Sentries, and various other species within or beyond the Nine Realms. He can lift or move immensely heavy objects effortlessly and can tear through traditionally durable objects, such as Iron Man's gauntlets, like crushing paper. Thor's strength extends to his ability to leap great distances. With his strength, Thor is able to take on multiple enemies at once, using Mjølnir to send large groups of enemies, like the Frost Giants, the Chitauri, or Ultron Sentries flying one by one with each strike. Using his weapon Mjølnir, Thor's strength is compounded, as he is able to swing his mighty hammer with great speed and force. Thor's strength is so great, that he can throw his hammer with enough force to break through nearly any barrier, whether it be stone, metal or dark energy. His strength is so great, that strikes with Mjølnir are usually fatal, knocking out opponents with one hit, and only beings of incredible power, like Hulk and Malekith, can take multiple direct hits from Thor. Hence, Thor was able to shatter a massive Kronan, take down a Leviathan, and even break the Bifrost Bridge, all with only several blows of his hammer. Thor's immense strength also enabled him to break out of an extremely durable confinement capsule (specifically designed to hold the Hulk), stop a mighty punch from the Hulk with his own hand, and punch the latter in the face hard enough to make him stagger. Thor also went toe-to-toe in a prolonged battle against Malekith, whose strength was greatly compounded by the Aether, and ultimately defeated him. During the Battle of Sokovia, Thor was able to easily catch a falling car with one arm, saving the family trapped inside it. Superhuman Speed: Thor can move at extreme superhuman speeds. Thor tackled the Hulk through the wall of the Helicarrier in a split second, visibly appearing as a blur. Using Mjølnir, Thor can fly at high speeds, moving across the New Mexico desert in a matter of seconds. While flying Thor can use his speed to strike enemies with immense force, such as when he killed a large creature on Jotunheim by flying through it's skull. He can also swing Mjølnir at such high speeds that it seems like a blur to the naked eye. Superhuman Agility: Thor's agility, balance, and bodily coordination make him a great warrior for battle. He moves with incredible grace and speed despite his considerable size and body density. He was able to dodge the wing of a jet fighter thrown at him by the Hulk while they battled in the hangar bay of the Helicarrier. Superhuman Durability: Thor's skin, muscle, and bone tissue have many times the density of the same tissue in the body of a human being, making him Virtually Invulnerable. Even when he was stripped of his powers, Thor was still amazingly resilient due to his dense body, withstanding several energy blasts from the Destroyer. When he is at full power and armed with Mjølnir, Thor possesses nigh-invulnerability, including resistance to powerful energy blasts, immense blunt force trauma, falls from great heights, explosions and various other opposing forces. He survived a direct near point blank range blast from Gungnir blasting him out of Odin's chamber, and falling several hundred feet to the ground, showing no visible signs of injury. Thor withstood a 400% - charged repulsor blast from Iron Man, was barely affected by Quicksilver smashing into him at supersonic speeds, and even a mighty punch from Hulk only gave him a nosebleed. During his final battle with Malekith, Thor was even able to survive being hit by quite a few tendrils of the Aether Infinity Stone energy, without any permanent damage. When he is injured, Thor's physique allows him to shrug off minor injuries such as small stab wounds from Asgardian blades, or allows him to withstand a direct blow in the face from a massive Frost Giant and laugh afterwards. However, when matched with a rare enemy that is stronger than himself, like the Kursed Algrim, Thor will eventually sustain injuries and increasingly show signs of exertion and fatigue. Superhuman Stamina: Thor's advanced musculature is considerably more efficient than that of a human and most other Asgardians. As a result, his muscles produce practically no fatigue toxins during physical activity compared to those of humans and most other members of his race. His virtually inexhaustible stamina enables him to exert himself at peak capacity for an undefined period of time without tiring at all. Regenerative Healing Factor: Despite his astounding resistance to injury, it is possible to injure Thor. However, due to his Asgardian physiology, Thor is able to heal at a rate much faster than a normal human being. After seemingly being killed by the Destroyer and proving himself worthy of Mjølnir once again, Thor regained his full power and immediately healed himself in seconds. Despite receiving mild to sever stab wounds from Asgardian blades on several occasions, after working past the initial pain of the injury, Thor was able to quickly recover and continue fighting. After the brutal beating he suffered from Algrim on Svartalfheim, upon arriving to Earth, he had nearly completely recovered. Longevity: Thor, like all other Asgardians, is not truly immortal as it is possible to kill an Asgardian and other beings in the Nine Realms. More accurately Asgardians are extremely long lived beings. Thor ages at a pace far, far slower than a human being as he is at least 1,000 or more years old; more than likely born shortly before the last great war between the Asgardians and the Jotuns. Weather Control: Thor as an Asgardian and son of Odin, was born with the natural ability to control weather even though his relying on Mjølnir has caused a lack of practice, and so he has displayed weather control only few times without relying on the hammer. This power is seemingly also tied to his emotions. So far, he has only displayed creating rain and electricity without Mjølnir. Electrokinesis: As a part of his weather control powers, Thor can generate electricity from his body without relying on Mjølnir. Abilities Expert Combatant: Thor is the greatest and most powerful warrior in Asgard since Odin, and is one of the most skilled fighters to ever walk the planet. Thor is a superbly skilled warrior trained in the arts of war and various fighting techniques by his teachers in Asgard. He is proficient, even masterful in numerous areas of combat, including hand-to-hand and various forms of weaponry available in Asgard, including spears and swords with over centuries of combat experience. He is known to be very cunning and intuitive in battles and in warfare, having fought and defeated over a hundred warriors in Nornheim and battle hordes of Frost Giants with great ease in Jotunheim. He was able to fight and gain the advantage with nearly a dozen S.H.I.E.L.D. operatives, while powerless weakened and mortal, with only his vast fighting skills and experience, as Coulson stated \"he made [his] men, some of the most highly trained professionals in the world, look like a bunch of minimum wage mall cops .\" He was able to maneuver around the larger Hulk and strike him with ease. He also went toe to toe with the highly skilled Dark Elf Malekith, and ultimately defeated him after a prolonged battle. During the Battle of Sokovia, Thor fought and destroyed many Ultron Sentries effortlessly, prompting an irritated Ultron to tackle him away and deal with him personally. \"It's all in the swing .\" --Thor to Vision. Hammer Mastery: After centuries of practice wielding his hammer, Thor is a master of fighting with Mjølnir and is proficient in hammer throwing. He can even block several energy shots with Mjølnir, from the Destroyer, Loki's staff and Chitauri weaponry. Master Tactician: For centuries he has lead Asgard, including Sif and the Warriors Three, into battle against forces with great leadership and employing strategies and tactics adapted from various civilizations across the Nine Realms, including forgotten ones. Equipment Mjølnir \"You got the lightning. Light the bastards up .\" --Captain America to Thor, on the attack of the Chitauri. Thor has been entrusted with the mighty hammer Mjølnir, that was forged from the heart of a dying star. Thor's mystical hammer Mjølnir, which resembles a mallet rather than a traditional war hammer, has a number of elemental based powers. It has been stated by Odin himself that Mjølnir's power has no equal. Mjølnir itself is extremely durable, and combined with the various enchantments placed upon it by Odin, it is, for all intents and purposes, indestructible. It has deflected three blast from the Destroyer (which was able to disintegrate anything that it hit) and return the blast back into the Destroyer. Thor often uses the hammer as a physical weapon, with almost nothing being capable of withstanding a hammer blow or throw (with the exception of Captain America's Shield). A few examples of the abilities Thor has shown with Mjølnir are: Weather Control: Wielding Mjølnir grants Thor the ability to control the elements of a storm. It can control the elements and can create giant raging electrical storms complete with thunder, lightning, hurricane-force winds, tornadoes, tidal waves, earthquakes, and torrential rains on a moment's notice. He summoned an isolated class 5 tornado while battling the Destroyer, as well as summoning lightning bolt strong enough to destroy a large piece of landscape in Jotunheim. The Norse myths and legends regarded him as a Thunder God because of the hammer's influence over the weather. Lightning: Thor's main weapon while using Mjølnir is the ability to summon a lightning bolt from the surrounding skyline. While it is unable to generate electricity on its own, Mjølnir is able to attract the ambient electricity from the surrounding atmosphere and redirect it towards a given target. However, this also puts a limit on the extent to which Thor can use this power at any given time. While on Jotunheim, Thor summoned a lightning bolt strong enough to destroy a large piece of landscape. During the Battle of New York he used the spire of the Chrysler building to channel a massive lightning bolt, which he directed at the portal of the Chitauri to deter a portion of the enemy reinforcements. Worthiness Enchantment: After Thor disobeyed Odin and nearly caused a war between Asgard and Jotunheim, Odin banished Thor to Earth without his powers and placed an enchantment on the hammer Mjølnir. \"Who so ever holds this hammer, if he be worthy, shall possess the power of Thor .\" This enchantment surrounding Mjølnir prevents it from being wielded by anyone save those who have been found worthy. When Thor sacrificed himself to protect Earth from The Destroyer he proved himself worthy to wield Mjølnir once again and gained full use of his powers. Only Thor, Odin, and Vision are able to wield Mjølnir. Other than that, none who have tried to lift it have managed to make it move. Not even the Hulk's incredible strength could lift Mjølnir. \"Is this how you normally look?\" \"More or less .\" --Jane <mark>Foster</mark> and Thor Material Transformation: By summoning lightning from the sky into Mjølnir, Thor's clothes are transformed into his armor. Mystical Link: Mjølnir obeys Thor's commands as though it were driven by a form of intelligence. Mjølnir went to Thor when it was in a crater miles away, arriving in seconds. Mjølnir will return to Thor whenever he throws it at an opponent. While battling the Hulk in a hanger of the Helicarrier, Thor summoned Mjølnir from another room and it came crashing through the Helicarrier to get to him. Massive Speed Flight: Thor is capable of hurling Mjølnir with great force and, by holding onto the leather thong, is capable of flying through the air at tremendous speeds. How fast is not specified, but he was able to remain aloft in the middle of a Class 5 tornado, and traverse the distance from his father's chambers to Heimdall's observatory and back again in seconds. Immense Speed: Thor is capable of hurling Mjølnir at great speeds by holding onto the leather thong. In Jotunheim, he bashes the Frost Giants around him, then throws Mjølnir, making it hit multiple Frost Giants in it's path in moments. Energy Projection: With Mjølnir, Thor can project powerful mystical blasts of energy. He can even channel energies for stronger energy attacks. With Mjølnir, Odin projects a powerful mystical blast of energy using it to channel an energy blast through it, taking away all of Thor's superhuman powers and destroys what was left of Thor's armor after stripping much of it off of him and throwing him into the Bifrost. Indestructible: The Hammer is virtually unbreakable, nothing is able to shatter, dent or destroy it. Other Equipment Armor First Set: His first set of armor had a collared blue tunic with red piping, and black pants. Over the blue shirt he wore a black vest emblazoned with silver overlay. He wore a bright red cape that connected at the shoulders of his vest. His arms were covered in a form of chain-mail and he wore detailed, black, knee-high boots. Second Set: Thor's second set of armor worn while fighting in the forest with Captain America and Iron Man. It was sleeveless with a black top covered in silver plates. It has blue pants and black boots. It had red wrist bands covered with silver arm bracers. It also had a bright red cape. During Thor's stay on the Helicarrier he removed portions of his armor such as his cape, larger arm bracers and part of his chest plate, while in the more relaxed setting. While heading into the Battle of New York he re-donned his cape and heavier portions of his armor, adding to it a set of chain-mail sleeves as seen in the first set. Third Set: The Third set was a layered, collared, black vest with gold plates and blue accents worn over a chain-mail shirt. The vest continued into a loincloth which hung over chain-mail and leather pants. The sleeves ended at arm-bracers similar-looking to the vest with a red underside. He wore knee-high brown boots with gold piping. The fifth set also featured a bright red cape that was attached to the vest by two gold disks. Appearances in Movies In chronological order: Thor, The Mighty Avenger The Avengers Prelude: Fury's Big Week Thor (concurrent events) The Avengers Iron Man 3 Prelude (concurrent events) Thor: The Dark World Prelude (concurrent events) Iron Man 3 (mentioned) Agents of S.H.I.E.L.D. Season One Pilot (mentioned) Thor: The Dark World Agents of S.H.I.E.L.D. Season One The Well (mentioned) Repairs (mentioned) The Bridge (mentioned) Yes Men (mentioned) Season Two Who You Really Are (mentioned) Avengers: Operation HYDRA Avengers: Age of Ultron Doctor Strange (cameo) Thor: Ragnarok Avengers: Infinity War (upcoming) \"Avengers 4\" (upcoming) Trivia In the non-canon comic Captain America & Thor: Avengers! Thor and his friends sneak into Svartalfheim to free Fandral who is captured by the Dark Elves led by Queen Alflyse. In the comics, Thor was the son of Odin and the primeval Earth goddess Gaea, not Frigga. Gallery Thor in Thor and The Avengers Thor in Thor: The Dark World Thor in Disney INFINITY 2.0. Thor in Avengers: Age of Ultron Thor in Thor: Ragnarok Thor in Avengers: Infinity War Add a photo to this gallery Navigation Marvel Cinematic Universe Heroes Individuals Iron Man | War Machine | J.A.R.V.I.S. | Pepper Potts | Nick Fury | Black Widow | Hulk | Betty Ross | Captain America | The Winter Soldier | Odin Borson | Thor | Loki | Jane <mark>Foster</mark> | Maria Hill | Hawkeye | Phil Coulson | Erik Selvig | Melinda May | Falcon | Peggy Carter | Sharon Carter | Star-Lord | Groot | Rocket Racoon | Gamora | Drax the Destroyer | Yondu Udonta | Nebula | Daredevil | Foggy Nelson | Karen Page | Claire Temple | Vision | Scarlet Witch | Quicksilver | Ant-Man | Wasp | Hank Pym | Luis | Dave | Kurt | Cassie Lang | Jim Paxton | Quake | Jessica Jones | Trish Walker | Elektra | Punisher | Black Panther | Spider-Man | Ghost Rider | Luke Cage | Doctor Strange | Karl Mordo | The Ancient One | Wong | Iron Fist | Colleen Wing | Mantis | Valkyrie | Korg | Miek | Zuri | Okoye | Ayo | Nakia | Shuri | Ramonda | T'Chaka | M'Baku | Everett K. Ross | Eitri | Cloak & Dagger | Brigid O'reilly | Jimmy Woo | <mark>Bill Foster</mark> | Ghost | Janet Van Dyne Organizations The Avengers | S.H.I.E.L.D. | Nova Corps | Guardians of the Galaxy | Masters of the Mystic Arts | The Defenders | Dora Mijale Retrieved from \"http: //hero.wikia.com/wiki/Thor_Odinson_ (Marvel_Cinematic_Universe)? oldid = 1285099\" Categories: Protector of Innocence Avengers Members In Love Heroes who can fly Mythology Warriors Empowered Monarchs Siblings Speedsters Titular One-Man Army Armored Vikings The Messiah Elementals The Chosen One Heroes from the past Egalitarian Friend of a Villain Charismatic Leaders Martial Artists Evil Imprisoners Honorable Brutes Successful Magic Wrathful Benefactors Arrogant Universal Protection Demigods Male Lawful Good Aristocrats Provoker Aliens Nemesis Archenemy Genius Science Fantasy Heroes Good Hearted Bastards Cosmic Protection Lethal Tragic Cosmic Entity Pessimists Turned Optimists Famous Remorseful Philanthropists Loyal Determinators Martyr Global Protection Hope Bringer Related to Villain Knights Neutral Good Heroes with Evil Counterparts Super Hero Destructive Master Combatants Comic Book Heroes Book Heroes Hulk Heroes Feminists Marvel Heroes Live Action Heroes Movie Heroes Action Movie Heroes Bond Protector Chaotic Good Gladiators Law Enforcers Crime Stoppers Reality Warper Disabled Sole Survivors Casanova Heroic Jerks Mythical Successors Superheroes", "articleID": "2018121303_00544138_W", "names": {"Bill Foster": ["Q2903389", "Q4909019", "Q4909020", "Q4909021", "Q4909026"], "Steve Rogers": ["Q24006357", "Q3499089", "Q3973387", "Q7613788"]}}]