[{"date": "2018-12-13", "url": "https://www.theepochtimes.com/broken-hook-flash-mark-and-bullet-holes-among-new-details-released-by-pge-about-the-camp-fire_2737506.html", "content": "Pacific Gas and Electric (PG & E) crews repair power lines that were destroyed by the Camp Fire in Paradise, Calif. on Nov. 21, 2018. (Justin Sullivan/Getty Images) Broken Hook, Flash Mark, Bullet Holes Among New Details Released by PG & E About the Camp Fire By Zach Li December 12, 2018 Updated: December 12, 2018 Share LINKEDIN PINTEREST REDDIT TUMBLR STUMBLEUPON After lawsuits blaming Pacific Gas and Electric (PG & E) for causing the Camp Fire was filed, the company confirmed on Dec. 11 that several damages including a broken hook, flash mark, as well as bullet holes were found on its equipment in the vicinity of where the fire started, according to a letter PG & E sent to the California Public Utilities Commission. According to the letter, a PG & E employee spotted a fire that was close to a power transmission tower around 6:30 a.m. on Nov. 8. Later that day, an aerial patrol realized that the tower was damaged as a suspension insulator, which was supposed to support a transposition jumper, had separated from an arm on the tower but was still above the ground. PG & E said the damaged tower was inaccessible due to the restriction from Cal Fire until Nov. 14 when the company was asked to assist an investigation carried out by Cal Fire. They found a broken C-hook attached to the separated suspension insulator. The C-hook was used to connect the suspension insulator to a tower arm. Close to where the damage happened and the suspending transposition jumper, a flash mark was observed on the tower by PG & E. In addition, another adjacent power transmission tower was also found damaged, which has an insulator hold down anchor disconnected. PG & E confirmed in the letter there was an outage on the Caribou-Palermo 115 kV Transmission line 20 minutes before the fire started, which they have reported in a notice on Nov. 8. Moreover, the letter mentioned there was another outage on the Big Bend Circuit 15 minutes after the fire started and its equipment was damaged by gunshots. One day after the fire ignited, an employee of PG & E went to where the outage occurred. As a result, the employee found \"the pole and other equipment was on the ground with bullets and bullet holes at the breakpoint of the pole and on the equipment,\" according to the letter. The company also noticed that there were wires down and poles damaged on the road within the burned area. One employee with PG & E also observed \"several snapped trees, with some on top of the downed wires .\" \"These incidents remain under investigation and this information is preliminary,\" said PG & E Regulatory Executive Meredith <mark>E. Allen</mark>. \"The cause of these incidents has not been determined and <mark>may</mark> not be fully understood until additional information becomes available, including information that can only be obtained through examination and testing of the equipment retained by CAL FIRE .\" Last week, a lawsuit against PG & E was filed by a collation of law firms named Northern California Fire Lawyers on behalf of 34 Camp Fire survivors, alleging that the mechanical failure of a component on a power transmission tower resulting from poor maintenance was the cause of the Camp Fire. The lawsuit claims a steel wire hook on a power transmission tower failed to hold up a high voltage line amidst strong winds and led the uninsulated wire to make contact with the steel tower. As a result, \"blazing hot molten materials\" fell on dry vegetation below the tower and ignited the fire. The Camp Fire, which started on Nov. 8, is the deadliest wildfire in the state history, which killed at least 85 people--mostly the elderly and the disabled. The fire charred more than 150,000 acres by the time it was finally extinguished on Dec. 6. The fire consumed nearly 14,000 residences in addition to some 4,800 other buildings and forced tens of thousands of people to evacuate. Watch Next: Why Banks Love War & the War Economy The global banking system has historically played both sides of major conflicts through war financing, and drawing out the battles by providing funds beyond what each country could have otherwise spent. Share this article RECOMMENDED TOP VIDEOS Videos of the Day: Melania Trump Visits Military Families 3hr By Epoch Newsroom Videos of the Day: Trump Confronts Top Democrats Over Border Wall Funding 1d By Epoch Newsroom Videos of the Day: Macron to Speed up Tax Cuts, Raise Wages in Response to \"Yellow Vest' Protests 2d By Epoch Newsroom TOP NEWS Newly Minted Middle Eastern Women's Coalition Throws Support Behind Trump NEW By Holly Kellum More Than Two Decades After the War, Bosnia Faces New Challenges 1hr By Fatjona Mejdini, Special to The Epoch Times Melania Trump Makes First Lady History With Ride in Osprey 3hr By The Associated Press Trump Signs Order to Boost Investment in Opportunity Zones 3hr By Emel Akan Flynn Sentencing Memo Details Unusual FBI Questioning, Asks for Probation 5hr By Petr Svab US Border Crisis: 100,000 Illegal Immigrants in 60 Days 5hr By Charlotte Cuthbertson Former Canadian Diplomat Detained by Beijing State Security Bureau, Canadian Officials Confirm 5hr By Margaret Wollensak, The Epoch Times US Seeks 2-Year Sentence for Ex-Senate Staffer Indicted in Leak Probe 6hr By Ivan Pentchoukov <mark>Theresa May</mark> Clings to UK Premiership Amid Brexit Chaos 6hr By Simon Veazey Boulder Residents Ordered to Bring Guns to Police for Certification 7hr By Colin Fredericson", "articleID": "2018121304_00502462_W", "names": {"E. Allen": ["Q27567931", "Q27913609"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2018-12-13", "url": "https://www.computerweekly.com/news/252454370/Sberbank-partners-US-accelerator-for-startup-programme", "content": "elvis_dead - Fotolia Sberbank partners US accelerator for startup programme Russian state-run bank links up with San Francisco-based accelerator 500 Startups to provide expert advice to startups in a variety of tech fields Share this item with your network: <mark>Vladimir Kozlov</mark> Russian state-run bank Sberbank and San Francisco-based accelerator 500 Startups have launched a programme aimed at uncovering IT startups. The accelerator programme, a first for Russia, was announced in early September. It is inviting applications from startups in a range of fields, including e-commerce, advertising technology, educational technology, the internet of things (IoT), big data, machine learning, artificial intelligence (AI), robotics and cyber security. Sberbank holds almost one-third of Russia's aggregate assets in the industry and boasts more than 145 million customers in 20 countries. In recent years, the bank has increased its activity around tech innovation and is one of the largest investors in Russian tech startups, also investing in tech companies across the globe. In September 2018, Sberbank signed an investment deal with Israeli company ThetaRay, focused on cyber security. The bank also pumped cash into local company VisionsLab, which provides face-recognition technology. \"We are glad to cooperate with 500 Startups, which entrepreneurs all over the world dream about being invited to,\" said Lev Khasis, Sberbank's first deputy chairman of the executive board. \"It is important that our joint project is focused on selecting Russian startups and allows American companies to take part in the selection .\" There has been nothing like this in Russia before. During the acceleration programme, large Russian companies and Sberbank will become customers of the startups. So, taking part in our programme will enable them to test their products in real conditions and find future clients. \"More than 840 startups applied to the programme; 56% of them already had a minimum viable product and 15% had a product in open beta testing .\" The selection process was tough as we received applications from top teams from all over Russia, \"said Khasis .\" When making selections, we primarily looked at startups that could not only become an integral part of Sberbank's ecosystem, but could also have good prospects in the global market. \"I hope that during the acceleration, 500 Startups and the competences of the accelerator's Russian partners will help the teams to graduate to a new level of development .\" Read more about startups in Russia Annual IT event Startup Village in Russia saw blockchain take centre stage and support from the country's government. The annual Startup Village event near Moscow to showcase Russian innovators was the biggest yet. E-commerce was the most popular area for startups applying to the programme, accounting for 15% of all applications, followed by cloud services and lifestyle services with 9% each. AI and big data were also popular areas of activity, while other startups work in financial technologies, blockchain, digital healthcare and educational technologies. In late November, Sberbank announced a list of 30 startups selected for the programme. Each project will receive seed investment of up to 10 million roubles (US $150,000) and the possibility to promote their product in Sberbank's ecosystems and corporations, which are partners of the accelerator. According to Sberbank, all the selected startups already have working products and paying customers. One of them, Data Screen, develops technology for analysing and managing digital content distribution through the entire supply chain. Michael Ilyichev, partner at Data Screen, told Computer Weekly: \"Our project is at a stage when the solution is ready and needs to be scaled beyond Russia. We think that attention from 500 Startups and their community can help us with that .\" Find new customers Ilyichev said Data Screen expects participation in the programme to help to find new customers for the company's products outside Russia and attract international venture capital to the next funding round. Another startup, ArtLogics, has developed pooling. me, an online platform for cargo deliveries to retail chains. It ran a pilot project with major Russian food retailer Magnit and four of its suppliers this summer. \"We believe our project could potentially have a very big impact on Russia's logistics industry,\" said <mark>Pavel Vasilyev</mark>, managing director at ArtLogics. \"So when we heard about the accelerator of Sberbank and 500 Startups, we immediately realised that it would be exactly the kind of support that we need at this point, as both companies have enormous expertise and a network of contacts and could help us to develop this project in the right way .\" ArtLogics expects its participation in the programme to help it devise a growth strategy and make contact with retail and logistics operators in other markets to see if its technology is applicable outside Russia, said <mark>Vasilyev</mark>. Improving skills Meanwhile, Doczilla, a digital document creation service, expects taking part in the accelerator to improve its skills for product development and promotion, and to learn from 500 Startups' mentors about business scaling in Europe, the US and other countries, according to Kirill Buryakov, the company's CEO. \"We also hope to show Sberbank and its partner the possibilities of our platform and to launch pilot projects,\" he added. Alexander Fokin, general director of Calcul. ru, a service for calculating insurance payments that is also taking part in the programme, said: \"We would be certainly like to test ourselves in working with foreign customers .\" During the accelerator's first stage, the teams will work with startups in Moscow for nine weeks. The mentors of the teams will be specialists from 500 Startups, who will give lectures and seminars and provide one-to-one consultations. The final stage of the accelerator will be a demo day, where top managers from Sberbank, private venture investors and representatives of funds will choose the seven best startups. The winners will be sent to the US to take part in the Silicon Valley Exchange Programme. There, they will learn about international business practices and develop their products, before presenting their projects to Russian and foreign investors and large companies on a demo day in San Francisco. Read more on Technology startups Manchester's evolution from rag trade to e-commerce riches Trusted nodes: The next generation in quantum key distribution CTO interview: Proving new technology at Bloomberg", "articleID": "2018121314_01094801_W", "names": {"Pavel Vasilyev": ["Q18218137", "Q7155784"], "Vladimir Kozlov": ["Q15069024", "Q18226133", "Q18613644", "Q18923776", "Q30346141", "Q336143", "Q3561808", "Q39389553", "Q4015848", "Q4226710", "Q4226713", "Q4226714", "Q4226716", "Q4226717", "Q4226718", "Q4226720", "Q57416884", "Q59449027"]}}, {"date": "2018-12-15", "url": "http://www.tricitynews.com/trump-weighs-next-move-on-border-wall-as-shutdown-looms-1.23539301", "content": "WASHINGTON--Congress is racing to avoid a partial government shutdown next Friday over President Donald Trump's border wall. But you wouldn't know it by the schedule, as lawmakers left town waiting for the White House's next move. The House is taking an extended five-day weekend, returning Wednesday night. The Senate returns Monday after a three-day absence. article continues below Trending Stories Mueller says FBI not to blame for Flynn's false statements Trade food for overdue book fines at PoCo library Books Plus: Stories for CP Rail Holiday Train party PoCo puts a notice on title against Art Knapp The ball is in Trump's court, both sides say, and the president met Friday with top aides to discuss his spending strategy. There's an expectation on Capitol Hill he'll reach out soon to offer lawmakers a plan. The president said this week he'd be \"proud\" to shut down the government over the $5 billion he wants for the wall on the southern border, but he has since taken a softer tone, tweeting, \"Let's not do a shutdown, Democrats - do what's right for the American People!\" But Trump doesn't have the votes from the Republican-controlled Congress to support funding for the wall at the level he wants. Democratic congressional leaders, Sen. Chuck Schumer and Rep. Nancy Pelosi, made a counter offer during a contentious meeting at the White House of no more than $1.6 billion, as outlined in a bipartisan Senate bill. The money would not go for the wall but for fencing upgrades and other border security. Democrats also offered to simply keep funding at its current level, $1.3 billion. Without a resolution, parts of the federal government would shut down at midnight Dec. 21. Trump met on Friday with legislative affairs director Shahira Knight and budget director Mick Mulvaney to discuss strategy. Some White House aides were startled by Trump's embrace of a shutdown during his meeting with Democratic leaders, though others argued that it was another example of Trump sticking with his campaign promises. \"The president made it very clear: He does want a border wall. He does want border security. He wants to protect the American people,\" White House spokesman Hogan Gidley told reporters on Friday. While Trump has long rallied for the border wall with Mexico, a centerpiece of his 2016 campaign, Republicans on Capitol Hill never fully warmed to the plan, and they are less likely now to round up the votes for it after losing the House majority in the November election. Each passing day brings Democrats closer to taking control of the House, and with Christmas approaching, enthusiasm for a prolonged fight over the wall was waning even among some Republicans who support it. \"We're out of time,\" said Rep. Jeff Denham, R-Calif ., who lost a bid for re-election last month. Denham backs the wall as part of a broader immigration overhaul, but said Republicans would be better served by approving a short-term budget resolution that postpones the wall fight until January while keeping the government open. \"Allow the next Congress to come in, get seated, committee chairs to get filled, and then actually have a full debate on a bipartisan solution,\" Denham told CNN Friday. Democrats, meanwhile, are not inclined to give an inch, as seen by the backing Pelosi received after confronting Trump during their televised meeting in the Oval Office. She's poised to become House speaker when the new Congress convenes Jan. 3. As of Friday, Trump had neither accepted nor rejected the Democrats' proposal, according to the Democrats. He told them he would take a look. Trump will need Democratic votes either way, now or in the new year, for passage. The mood on Capitol Hill has quickly shifted as newly elected members arrive to set up offices on Capitol Hill and dozens of Republicans head for the exits. Outgoing House Speaker <mark>Paul Ryan</mark>'s pre-election prediction of a \"big fight\" over the wall has run up against the reality of the changed circumstances. Thursday was supposed to be the House's final day in session for the year, but lawmakers instead were told to return Wednesday night. Already Republican attendance during the lame-duck session has been spotty, and it's unclear how many votes <mark>Ryan</mark> will be able to garner in the final days of the GOP's majority in the House. Even if a bill with the wall funding passes the House, it is almost certain to fail in the Senate, where Republicans hold a slim majority, and Democrats have pledged to block it from receiving the necessary 60 votes needed to advance. Rep. <mark>Kevin McCarthy</mark>, R-Calif ., the incoming minority leader, said on the House floor as lawmakers left for the long weekend that he thinks \"going into a shutdown is stupid,\" but he offered no immediate plan to resolve the standoff. Fellow California Rep. Lucille Roybal-Allard, the top Democrat on a subcommittee for homeland security spending, said it makes no sense to be \"squandering\" $5 billion on the wall when the nation has so many other security vulnerabilities. \"Republicans are driving our nation to the brink of another disastrous government shutdown - at a time of great economic uncertainty and right in the middle of the holiday season,\" Roybal-Allard said in the Democrats' weekly address. For now, Republicans still control the House, the Senate and the White House, she reminded listeners. \"They have the responsibility and the power to keep our government open .\" If the two sides do not reach agreement, about one-quarter of the government would be affected, including the departments of Homeland Security, Transportation, Agriculture, State and Justice, as well as national parks. Read Related Topics", "articleID": "2018121511_00314355_W", "names": {"Kevin Mccarthy": ["Q26837187", "Q281404", "Q56875753", "Q6377709", "Q6396888", "Q6396889", "Q6396891", "Q766866"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2018-12-16", "url": "https://www.wjhg.com/content/news/Height-incentives-are-no-longer--502841651.html", "content": "Panama City Beach leaders vote to remove height incentives, buildings must now be built to code Posted: Sat 5:47 PM, Dec 15, 2018 | Updated: Sat 5:51 PM, Dec 15, 2018 PANAMA CITY BEACH, Fla. (WJHG/WECP) - Developers in Panama City Beach will have now have to build to code now that height incentives have been given the thumbs down by council members. The Panama City Beach City Council voted to remove the incentives during this week's meeting. Buildings can now be no higher than 150 feet tall, which is 15 stories. \"Those incentives were something that you just can't enforce, you can't give somebody extra height for something and then take it away,\" said Panama City Beach Mayor <mark>Mike Thomas</mark>. \"Our community is not set up to fight those things and make people do them .\" The city will also welcome a new Busy Bee gas station. The fuel station is a joint venture between the St. Joe Company and Johnson and Johnson, Inc.. City leaders said it's one of the first new businesses to come to the city since Hurricane Michael hit. \"We lost so much property value with Bay County because of this storm,\" said Mayor <mark>Thomas</mark>. \"This will help property value at least on the beach, that tax money goes to Bay County .\" The new gas station station will be located on Panama City Beach Parkway and Nautilus Street. The gas station is expected to have an approximately 13,000 square foot convenience store and 14 fueling pumps. City leaders said it's expected be the largest convenience store in the region and the first of many stores in the northwest Florida.", "articleID": "2018121600_00915162_W", "names": {"Mike Thomas": ["Q16207321", "Q17511846", "Q24007200", "Q3313561", "Q42807736", "Q6849033", "Q6849035", "Q6849036", "Q6849038"]}}, {"date": "2018-12-17", "url": "http://wdiy.org/post/art-series-captures-taste-and-color-prisoners-first-meal-after-exoneration", "content": "Art Series Captures Taste And Color Of Prisoners' First Meal After Exoneration By Kristen Hartke • 23 minutes ago Tweet Share Google + Email View Slideshow 1 of 3 Exonerated after 16 years in prison, Kristine Bunch ate a celebratory meal of scallops, cheese grits, a platter of hummus and vegetables, and champagne. It was a meal that became the first image by artist <mark>Julie Green</mark> in her series \"First Meal,\" a project supported by the Oregon State University Center for the Humanities. (Paintings are 4 feet by 3 feet, acrylic on Tyvek .) <mark>Julie Green</mark> / Courtesy of <mark>Julie Green</mark> and Upfor Gallery View Slideshow 2 of 3 One exoneree, after spending 15 years in prison for murder, was given an orange by a waitress and just held it, basking in its color and scent. \"How do you illustrate holding an orange for 40 minutes before savoring every bite?\" asks <mark>Green</mark>. <mark>Julie Green</mark> / Courtesy of <mark>Julie Green</mark> and Upfor Gallery View Slideshow 3 of 3 In a scene recreated by <mark>Green</mark>, someone brought blueberries--the exoneree's favorite fruit--to her first meal, a potluck, and hand-fed them to her in a moment of tenderness. <mark>Julie Green</mark> / Courtesy of <mark>Julie Green</mark> and Upfor Gallery A cookie may have led to Kristine Bunch's release from prison--and sparked a series of paintings inspired by wrongful convictions. In 1996, Bunch was found guilty in Indiana for the arson-murder of her 3-year old son. She proclaimed her innocence for the next 16 years behind bars, until she was finally exonerated in 2012. She was 22 years old and six months pregnant with her second son when she first entered prison. Several years later, Bunch saved cookies for a pregnant fellow inmate, a small kindness that unexpectedly helped her find a lawyer to take her case. \"I knew what it was like to be pregnant in prison,\" recalls Bunch, \"so I would bring this girl cookies from the kitchen. One day, she asked me about my case, and then she wrote to her lawyer about me .\" Bunch's case was eventually taken up by the Center on Wrongful Convictions at Northwestern University's Pritzker School of Law, which obtained previously withheld documents from the Bureau of Alcohol, Tobacco, Firearms and Explosives, along with her son's autopsy report, which directly contradicted the initial arson investigation and showed that the trailer house fire was accidental. Tasting freedom for the first time since she was arrested at age 21, Bunch went to a restaurant near the courthouse in Columbus, Ind., and ate a celebratory lunch: scallops, cheese grits, a platter of hummus and vegetables, and champagne. It was a meal that ended up becoming the first image in a series titled \"First Meal\" by <mark>Julie Green</mark>, a visual artist and professor of art at Oregon State University. <mark>Green</mark>, who is known for another project called \"The Last Supper,\" an ongoing series depicting the final meals of death row prisoners, is now documenting first meals eaten by exonerated prisoners. <mark>Green</mark> met Bunch in 2015, when her work was being exhibited at Northwestern University's Block Museum. The concept for the new series was already incubating in <mark>Green</mark>'s mind, however, from a conversation she'd had back in 2000 with Oklahoma State University art department chair Jim Folts. \"Jim said,\" When you end the [Last Supper] series, you could paint a final plate: a first meal of an exoneree,' \"says <mark>Green</mark>, who has a goal of immortalizing 50 death row meals each year until capital punishment is abolished--and has completed 800 so far .\" Eighteen years later, I am doing just that, painting First Meal. I couldn't wait any longer. \"<mark>Green</mark> views this series, and her other work, in the same way, saying,\" I hope the viewer will consider the margin for error in the judicial process. \"First Meal' may bring about conversation that could lead to positive change. Art can do that .\" Bunch wasn't intending on becoming the subject of a painting when she met <mark>Green</mark>, but wanted to find out if <mark>Green</mark> had yet documented the final meal--which included enchiladas and pie--of Cameron Todd Willingham, who was convicted of the arson-murder of his three young children in 1992 and executed in Texas in 2004. The forensic evidence in Willingham's case, eerily similar to that which convicted Bunch, has been questioned in the years since his death. \"<mark>Julie</mark> told me she hadn't had time to create his plate yet,\" says Bunch, \"but then she contacted me later and sent me a reproduction of what his plate would look like. It touched me so much that she did that, so when I heard about the new project, I was absolutely on board with participating .\" Sara Sommervold, a fellow and attorney at the Center on Wrongful Convictions, sees the \"First Meal\" project as one that, like \"The Last Supper\" series, helps to humanize convicted prisoners. \"That first meal is a very profound event in an exoneree's life,\" says Sommervold. \"The inability to choose food in prison, the absence of color and flavor, these are all fundamental parts of the experience. It's no accident that so many exonerees choose colorful plates of food when they are released .\" One exoneree, who spent 15 years in prison for murder, spoke in his interview with the Center on Wrongful Convictions about being given an orange by a waitress during his first meal, and how he simply held it for more than half an hour, glorying in its color and scent, saying, \"The little things in life mean so much when you're deprived of them, but out in the world we take them for granted .\" With a goal of amassing 20 menus, Sommervold helps collect interviews with clients who have been exonerated, which <mark>Green</mark> then crafts into a visual representation--but the process is about more than paint. \"Naively, I thought\" First Meal' would be more uplifting to paint than \"The Last Supper,'\" says <mark>Green</mark>. \"Of course the meal is celebratory, but it is nothing compared to all those lost years. And how do you depict absence, not having an orange for seven years? How do you illustrate holding an orange for 40 minutes before savoring every bite?\" <mark>Green</mark>'s approach is inspired by her love for flow blue, a type of ceramic dishware--also called transferware--that originated in Staffordshire, England, in the early 19th century and is distinguished by its soft, or flowing, blue glaze. The decorative images on the pottery often depict scenes of pastoral countryside or happy celebrations, which <mark>Green</mark> felt could offer an interesting counterpoint to the underlying subject. She also often incorporates other symbolic imagery, like the state bird where the conviction took place or thumbprints representing DNA analysis. For the image of Bunch's first meal, <mark>Green</mark> says, \"I chose a transferware of an idyllic gathering to show the passage of time, and how surreal it must be to leave prison and be with your family and friends eating hummus and scallops .\" As the project continues to take shape, <mark>Green</mark> has begun incorporating text from the actual interviews into the images to help provide necessary context, such as an exoneree who described having a potluck-style first meal at a friend's home. Someone brought blueberries--the exoneree's favorite fruit--and hand-fed them to her in a moment of tenderness, a scene recreated by <mark>Green</mark> in the final piece. The subtlety of the imagery can be surprising when juxtaposed against the human tragedies that are at the root of the artwork. \"She's not your standard commercial gallery artist,\" says Theo Downes-LeGuin, who represents <mark>Green</mark> at Upfor Gallery in Portland, Ore. \"The power of art, and of this type of project, is that it gives people enough controversy to have that conversation, but also a safe place in which to discuss it .\" Kristen Hartke is a food writer based in Washington, D.C. Copyright 2018 NPR. To see more, visit https: //www.npr.org. Tweet Share Google + Email View the discussion thread.", "articleID": "2018121713_00436442_W", "names": {"Julie Green": ["Q22278018", "Q56251731", "Q57417848"]}}, {"date": "2018-12-17", "url": "http://feeds.manchestereveningnews.co.uk/~r/menews/~3/1xQwvq9V7NY/wythenshawe-hospital-manchester-crown-court-15564413", "content": "Get daily updates directly to your inbox Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Security guards stole more than £ 200,000 from car park payment machines at Wythenshawe Hospital, a court heard. Hospital bosses said that the money could have instead been used to save lives, and would have funded six nurses for a year. Now gang leader Peter O'Garro, supervisor Stephen Seddon and security officers Christopher Hughes and Shahid Nadeem have all been jailed. Three women, Elizabeth Seddon, Marie McGovern and Karen O'Garro, all wives or partners of the men, were spared jail after laundering or possessing the stolen money. In a statement read to the court by prosecutors, <mark>Nick Smith</mark>, assistant finance director at the hospital, said: \"This amount represents a significant loss for the hospital and its patients and this money would otherwise have been used to enhance the care we provide to our patients .\" For example, it could have been used to fund the salaries of six fully qualified nurses for a full year or for the purchase of major items of medical equipment or lifesaving drugs. \"Stephen Seddon (Image: MEN) Read more of today's top stories The sentencing judge said the crime was motivated by greed, and described it as\" unforgivable'. Judge Hilary Manley said: \"The money was not stolen from some faceless corporate body, but an NHS hospital trust .\" At a time when it is common knowledge that funding the NHS, a service for all, is beset with difficulties, to steal from it is, many would feel, an unforgivable crime. \"The men were eventually caught out after a new member of staff found out what was going on and reported them. A Manchester Crown Court sentencing hearing heard that between June 2015 and February 2016, the men stole £ 207,412 from six car park machines across the hospital. Read More Drunk thug whose\" shirt was ripped' in mosh pit at Royal Blood gig punched innocent woman in the face Read More Police have told idiots throwing rocks from M60 bridges that the could be done for attempted murder Shahid Nadeem (Image: MEN) Hospital security staff were responsible for collecting the money that was deposited into the machines by members of the public, prosecutor Daniel Calder said. Seddon was the security supervisor, while Nadeem, Hughes and O'Garro were security officers all employed by a private firm on behalf of the hospital. Staff were not supposed to have access to the contents of the boxes of notes and coins inside the machines. Hospital protocol meant that they should have immediately been taken to to the cashiers office, for the money to be counted then banked. Christopher Hughes and Marie McGovern (Image: MEN) They were also supposed to sign an electronic register on a computer spreadsheet, recording who was working and who had signed out the key for a particular payment machine. The hospital's computer system made it possible to show how much cash was paid into each parking machine, how much cash was collected and then how much was deposited and then later banked. This would later help prosecutors catch out the thieves. The court was told that the first theft happened in July 2015 and acted as a \"test run'. A total of £ 1,743.60 was taken from a machine, but never taken to the cashiers office while the key was signed out to Seddon and Hughes. Elizabeth Seddon and Stephen Seddon (Image: MEN) Mr Calder said that after the gang were satisfied that the theft had not been detected, the number of thefts then\" dramatically increased'. In August 2015, £ 24,556.70 was stolen. The highest figure was in September 2015, with a total of £ 39,198. In October 2015, £ 37,895.80 was stolen. Then in November 2015, £ 32,031.70 was taken. In December 2015, £ 20,940.10 was stolen. Into the New Year of January 2016, £ 34,444.30 was stolen. Finally in February 2016, £ 16,601.70 was taken by the gang. Their scam was rumbled when a new temporary member of staff started work in the security team. After being trained about the correct banking procedures, the man quickly realised his colleagues were not working as they should have been. Karen O'Garro (Image: MEN) In September 2015, the man overheard Seddon saying that O'Garro was \"getting greedy'. The following month, he then spotted a large amount of cash in the glove box of the security van being driven by O'Garro. He asked O'Garro about the money, and also took a picture of it. Initially O'Garro reacted angrily, but then said the money was\" for all of us. Ten weeks for us, one week for you'. O'Garro invited his colleague into the conspiracy, but he refused. Later, when the man was speaking with Seddon, the defendant warned him \"if you join us, don't get greedy'. Mr Calder said that Seddon also described O'Garro as\" our main guy'. On another occasion when he was out in the security van with Hughes, there was a number of full cash boxes in the boot. When he asked about them, Hughes replied: \"Don't ask any questions. It's none of your business .\" After leaving his job December 2015, he told the hospital about what he had heard. Wythenshawe Hospital The judge praised him as an \"honest man' who had to put up with\" veiled threats' from the defendants, as they realised he knew what they were up to. In February 2016, police arrested O'Garro, Seddon and Hughes at the hospital's security lodge. From inside O'Garro's Mini Cooper, police recovered more than £ 1,100 in coins. Seddon had £ 650 in cash on his person. At the O'Garro family home in Middleton, £ 4,821.34 in coins were recovered. A total of of £ 16,723.65 in cash was seized at the Seddon family home in Failsworth. At the Wythenshawe home of Hughes and McGovern, £ 4,221.34 in cash was recovered. At Nadeem's Cheetham Hill home, £ 1,981.86 almost entirely in coins was found. Officers discovered evidence that O'Garro and Seddon, the prime movers in the gang, had purchased \"high value' goods including electronics, jewellery and clothes. Further investigations led to Karen O'Garro, Elizabeth Seddon and Marie McGovern being brought before the court. The money stolen could have been used to pay for six nurses, hospital bosses said Mrs O'Garro and Mrs Seddon both laundered money stolen by their husbands. Mrs O'Garro deposited £ 15,996.45 stolen by her husband into four bank accounts in her name. Mrs Seddon put £ 6,140 of the stolen money into her bank account, and a further £ 8,041.52 to a credit card in her name. Ms McGovern stored £ 4,221.34 of stolen money at the address she shared with Hughes. Peter O'Garro, 52, of Sherbourne Road, Middleton, who latterly worked for Virgin Media, was jailed for three years, after pleading guilty to theft. Stephen Seddon, 31, of Samuel Street, Failsworth, who trained to be an electrician after losing his job at the hospital, was jailed for two years and six months after pleading guilty to theft. Christopher Hughes, 53, of Burdale Walk, Wythenshawe, who continues to deny his offending, was jailed for two years and three months after being found guilty of conspiracy to steal. Shahid Nadeem, 39, of Blendworth Close, Cheetham Hill, was jailed for two years after pleading guilty to conspiracy to steal. Read More' I was refused a smear test - now I'm battling cervical cancer' Read More Students taken ill after\" pepper spray' let off in high school corridor Karen O'Garro, 48, of Sherbourne Road, Middleton, who works as a nurse at Springhill Hospice in Rochdale, was sentenced to eight months in prison suspended for two years. Trainee teacher Elizabeth Seddon, 32, of Samuel Street, Failsworth, received the same sentence. They both pleaded guilty to converting criminal property. Marie McGovern, 51, of Burdale Walk, Wythenshawe, was sentenced to a two year community order after being found guilty of possessing criminal property. A proceeds of crime hearing aimed at clawing back the gang's ill-gotten gains will be held next year. Got a story or an issue you want us to investigate? Want to tell us about something going on where you live? Let us know - in complete confidence - by emailing newsdesk @ men-news.co.uk, calling us on 0161 211 2323, tweeting us @ MENnewsdesk or messaging us on our Facebook page. You can also send us a story tip using the form here. Join the Manchester Evening News breaking news Facebook group for a place to read and talk about breaking news in Greater Manchester.", "articleID": "2018121719_00640439_W", "names": {"Nick Smith": ["Q16208073", "Q1790063", "Q23992214", "Q390760", "Q6379891", "Q7027945", "Q7027947", "Q7027953", "Q976339"]}}, {"date": "2018-12-18", "url": "http://chronicle.northcoastnow.com/national-news/2018/12/18/Actress-and-director-Penny-Marshall-dies-at-age-75.html", "content": "Advertisement LOS ANGELES (AP)--<mark>Penny Marshall</mark>, who starred in \"Laverne & Shirley\" before becoming one of the top-grossing female directors in Hollywood, has died. She was 75. Mashall's publicist, Michelle Bega, said <mark>Marshall</mark> passed away in her Hollywood Hills, Calif., home on Monday due to complications from diabetes. <mark>Marshall</mark> starred alongside <mark>Cindy Williams</mark> in the hit ABC comedy \"Laverne & Shirley,\" which aired from 1976 to 1983. As a filmmaker, she became the first woman to direct a film that grossed more than $100 million with \"Big,\" the 1988 comedy starring Tom Hanks. She also directed \"A League of Their Own,\" \"Jumpin' Jack Flash\" and \"Awakenings .\" Related Topics: <mark>Penny Marshall</mark>, Laverne & Shirley Click to view comments Close comments Please enable JavaScript to view the comments powered by Disqus.", "articleID": "2018121819_00297187_W", "names": {"Cindy Williams": ["Q266820", "Q5120612"]}}]