[{"date": "2018-12-18", "url": "http://chronicle.northcoastnow.com/national-news/2018/12/18/Actress-and-director-Penny-Marshall-dies-at-age-75.html", "content": "Advertisement LOS ANGELES (AP)--<mark>Penny Marshall</mark>, who starred in \"Laverne & Shirley\" before becoming one of the top-grossing female directors in Hollywood, has died. She was 75. Mashall's publicist, Michelle Bega, said <mark>Marshall</mark> passed away in her Hollywood Hills, Calif., home on Monday due to complications from diabetes. <mark>Marshall</mark> starred alongside <mark>Cindy Williams</mark> in the hit ABC comedy \"Laverne & Shirley,\" which aired from 1976 to 1983. As a filmmaker, she became the first woman to direct a film that grossed more than $100 million with \"Big,\" the 1988 comedy starring Tom Hanks. She also directed \"A League of Their Own,\" \"Jumpin' Jack Flash\" and \"Awakenings .\" Related Topics: <mark>Penny Marshall</mark>, Laverne & Shirley Click to view comments Close comments Please enable JavaScript to view the comments powered by Disqus.", "articleID": "2018121819_00297187_W", "names": {"Penny Marshall": ["Q237659", "Q3374792"]}}, {"date": "2018-12-18", "url": "https://finance-commerce.com/2018/12/lawsuit-pits-witchs-hat-against-condo-tower/", "content": "A Prospect Park neighborhood group has turned to the courts to try to force a developer to shrink the height of a residential project proposed near the historic Witch's Hat water tower in Tower Hill Park. Chicago-based Vermilion Development has already received city approval for the Arts & Architecture Project, named for the historic building at 3338 University Ave. SE in Minneapolis. The $75 million apartment and condominium project is about a block and a half west of the Westgate Station on the Green Line light rail route. Vermillion plans to renovate the 1919 structure for commercial uses and build a seven-story, 137-unit apartment building wrapping around it. It also wants to build a 13-story, 72-unit condo tower next door. It's that condo tower that alarms the Friends of Tower Hill Park, a nonprofit group organized to \"protect the views of, and from, the Prospect Park Water Tower,\" according to a court filing in Hennepin County District Court. The group is suing Vermilion and the current landowners under the Minnesota Environmental Rights Act, arguing the view from the building is legally protected. The tower and surrounding park occupy the highest land elevation in the Twin Cities and are on the National Register of Historic Places, according to the lawsuit. The lawsuit, which seeks an injunction blocking the project from moving forward, is \"ludicrous,\" Vermilion said in a statement Tuesday. \"We hold tremendous and sincere respect for the community of Prospect Park and for Tower Hill and the Witch's hat, and we're honored to be contributing to the area's growth along the green line,\" Development Manager Ari Parritz said in an email statement. \"The baselessness of this lawsuit is a painful smear on the positive nature of all of our relations to date .\" The complaint was filed Dec. 11. A supporting affidavit by Gayla Lindt, a University of Minnesota lecturer in architecture and vice chair of the group, argues that blocking the view from the 107-foot tower would cause \"irreversible\" harm to the neighborhood. \"The view from the Witch's Hat Tower is breathtaking; in my opinion, it is the most spectacular view in the Twin Cities in that it allows uninterrupted views to the distant horizon,\" she said. The condo tower would be considerably taller than the Witch's Hat tower and located 450 feet away. The finished building would block the tower's view of downtown St. Paul and the Capitol, the group claims in the lawsuit. The group does not oppose the development entirely, said its attorney, <mark>Erik Hansen</mark> of Minneapolis-based Burns & <mark>Hansen</mark>. An early proposal for the apartment building--without the condo tower--was acceptable to the Friends of Tower Park Hill because it did not top the tree line around the Witch's Hat, he said Tuesday. \"If someone erected a skyscraper next to the State Capitol, people would object, and rightly so, because it changes the whole effect of the building,\" <mark>Hansen</mark> said in an interview. \"...I don't think the community is trying to stop the project, per se. The concern is the height .\" Vermilion believes the view from the Witch's Hat, which is open to the public only one day per year, should not block development nearby. The developer also denies many of the specific claims made in the lawsuit. The Capitol and St. Paul Cathedral are barely visible from the Witch's Hat, Parritz said in an interview. More important, he said, the tower won't even block that sight line. Plans filed with the city show the condos on the north end of the proposed development, east and slightly north of the Witch's Hat. Downtown St. Paul is to the east and southeast. \"Our building's location does not block that direction,\" Parritz said. \"What they are claiming is untrue .\" As to the broader objection that Vermilion's project will break up the uninterrupted view from the tower, Parritz said that creates an unrealistic burden for development. \"If you contemplate the consequences, or the precedent that this would set, and play it out, it's going to make your head hurt,\" he said. \"Because it means in 360 degrees around a fairly central location in Minneapolis, you cannot build any buildings that would block any sliver of any other building, anywhere in the metro .\" In response to community feedback, the height of the project was reduced earlier from 17 stories in the original proposal to 15 stories, then again to 13, Parritz said. Sight lines have played a role in other historic preservation debates. A market-rate apartment proposal by Plymouth-based Dominium in Uptown Minneapolis was delayed for several years due in part to concerns it would block the view of the adjacent Buzza Lofts, another historic building. The Minnesota Environmental Rights Act has been used before to protect the view from important landmarks, <mark>Hansen</mark> said. He cited a 2011 case in which a court blocked AT & T from building a 450-foot cellphone tower near the Boundary Waters Canoe Area Wilderness in northern Minnesota. Victory in that case was short-lived, however. An appeals court overturned the ruling and allowed construction to proceed. Vermilion has not yet filed its formal response to the lawsuit, and no hearings are scheduled. Barring an injunction, Vermilion plans to break ground on the project in the first quarter of 2019, Parritz said. The neighborhood group hopes to resolve the issue without further litigation, but believes the character of the landmark is at stake, <mark>Hansen</mark> said. \"Hopefully this isn't one where people will [on the] backend regret allowing the construction to go forward,\" he said. Related: Vermilion plans Prospect Park condo tower, apartments Friends of Tower Hill Park complaint [PDF] Friends of Tower Hill Park affidavit [PDF] Vermilion Development statement [PDF] Like this article? Gain access to all of our great content with a month-to-month subscription. Start your subscription here.", "articleID": "2018121822_00270713_W", "names": {"Erik Hansen": ["Q11967715", "Q12310324", "Q12310326", "Q12310328", "Q3305138", "Q37991672", "Q40523468", "Q5388613"]}}, {"date": "2018-12-19", "url": "http://www.gamereactor.eu/blogs/mike", "content": "Board games on GR Written by <mark>Mike Holmes</mark> on the 13th of September 2017 at 12:39 We love games here at Gamereactor (the clue's in the name, right?) and when it comes to the games we play we're looking to expand our scope a little. From here on in we're going to start writing about our experiences with board games too, specifically ones that have some sort of direct link to video games. If that goes down well with you lot, maybe we think about widening the range of games we talk about. Let us know what you think in the comments below. How Long is Too Short? Written by <mark>Mike Holmes</mark> on the 1st of August 2016 at 08:55 The recent news that No Man's Sky can apparently be completed in around 30 hours, and the reaction that this news has brought with it, certainly has caught my attention, and it has me pondering the question: what is the ideal length for a video game? As someone who plays them in less than ideal circumstances (having to rush through them for review) a complete but somewhat succinct experience can be quite a relief, but that doesn't mean that every now and then I don't like an extended love affair with a game (Crusader Kings 2, Destiny or The Witcher 3 in my case). 30 hours, with the option to get distracted and expand on that if required, seems like a perfectly reasonable period of time to play a game like No Man's Sky, but I also appreciate why some people might be disappointed that the scale of the galaxy built by Hello Games doesn't quite tally with the (prospective) length of the game. In this case we'll have to wait and see what the future brings, but it's still an interesting question and the answer will change depending on who you ask. As someone who loved the super-short Thirty Flights of Loving just as much as the timesink that is Destiny, I'm going to sit on the fence on this one and say \"how long is a piece of string?\" Who Won E3? Written by <mark>Mike Holmes</mark> on the 15th of June 2016 at 18:36 Two very different companies pitched us two very different shows during E3 this year. Sony and Microsoft, not for the first time, went head to head in unveiling their latest wares. Microsoft had an ace up their collective sleeve, but Sony were able to show a line-up of games that had the audience purring. Let's get it out of the way now and say there wasn't a clear winner, although if I was pushed into making a call, I might say that Sony edged it. The why is perhaps a little more complicated, and were it not for leaks and (potential) absentees, I might well have been singing a very different song. Let's face it, we knew practically everything about the Microsoft presser before it even happened. You can't help but think that maybe Sony knew too, and that their conference would have been ten minutes longer and would have included a hardware reveal of their own. Perhaps the power of Scorpio forced the PlayStation team to hold fire on their own announcement because they knew they were bested. Speculation on our part, fuelled by whispers, but certainly plausible. Either way, it was good work across the board, with Microsoft continuing the process of rebuilding their reputation, and Sony continuing to deliver great software for their all-conquering console. And while nobody is talking about Nintendo in the same breath as its rivals this time around, it's worth noting that a study shows that The Legend of Zelda: Breath of the Wild was the most talked about game at the show (so far). That's got to count for something. Finally, let's also shout out for the PC crowd (that includes me), who got another PC Gaming show, as well as a bunch of cross-buy and cross-platform announcements during Microsoft's event. It's a good time to do your gaming on PC. On top of all that, if you throw in a bunch of games on show at EA Play, Bethesda and Ubisoft, and everything else in between, and you've got a solid E3 all round. It might not have the stellar game that has everyone buzzing (perhaps, possibly, with the exception of Zelda), but we've still seen some big reveals and a few fascinating trailers. Covering it from here in the UK has been largely enjoyable (chaotic, but enjoyable) and, from where I'm sitting, nearly everyone has come out this year's show a bit better off. Parental Guidance Written by <mark>Mike Holmes</mark> on the 17th of April 2016 at 08:19 As the father of two young boys, games are on my radar in one more than one sense. Not only do I have my own gaming habits to consider, but I have to think about the games that my sons consume too. Given my profession, there's no getting away from this, and because I play and write about games all the time, it's only natural that the boys find them fascinating. Monkey see, monkey do. Given what I do for a living, as you might expect, other parents often talk to me about what they let their children play, and while I'll either agree or disagree with what they consider age appropriate, one thing is constant throughout each discussion, and that's a shared appreciation that kids today have it so good when it comes to games. They really are spoiled for choice. Whether we're talking about cleverly made tablet titles that take advantage of the intuitive touch screen controls (something that we now take for granted), or educational offerings on the desktop PC that test the grey matter, or even console games that develop coordination and reflexes (for example, my kids, like so many others, are partial to a bit of Lego-based gaming); there's so many great games for the younger generation to enjoy. Of course there's some total shite out there too, and with kids being easy to please and an impressionable audience, it's often parents like yours truly that are left to pick up the tab for questionable pieces of programming. However, once you ignore all the rubbish and start to seek out real quality, it becomes abundantly clear that there's plenty of decent stuff for them to play. The starting point for this blog came yesterday, Saturday, walking through town on the way to the local swimming pool, bumping into a friend and fellow parent, and talking about Disney Infinity and how impressed he was with the depth of the offering. It got me thinking about the difference in quality between what I played as a youngster, and what my children have to enjoy nowadays. Of course, back then, a lot more games were universal in terms of age appeal, and as a whole the game-consuming audience was less mature and it was less socially acceptable (remember when it wasn't really normal to play games?), but I still think it's fair to say that youngsters have never been served better than they are today. My kids enjoy Lego games (we're currently playing Lego Jurassic World at the moment), Steamworld Dig is another favourite, we're all partial to classic Sonic, and of course Nintendo makes great family friendly titles that we enjoy playing together. We've not got into full-on Minecraft mode just yet, but it's edging ever closer; I fear that addiction is just around the corner. There's a nice range of titles for the boys to choose from, and I know other parents think the same, even if we don't always agree on when it's suitable to let the little ones start playing games made for a slightly older audience. One thing we all agree on, though, is the online element, and I'm not alone in keeping my kids away from the interwebs and limiting (almost completely) their online interactions. Because while we can trust our kids to play nicely - most of the time - the same can't be said of everyone else, and I think it prudent parenting to be extremely careful about what, and who, they're exposed too. To sum up this rambling blog post: kids have never had it better. But like most parents, I think it pays to limit the time they can spend playing, as well as being extremely careful about what/who they're exposed to. There's a world of amazing digital experiences out there waiting to be discovered and enjoyed, but as a parent I personally think that we have a responsibility to our children, to expose them to certain games when they're ready for them, which isn't always when they might want to play them. My Private Army Written by <mark>Mike Holmes</mark> on the 4th of February 2016 at 09:46 Xcom 2 is here tomorrow, and I for one am looking forward to personalising my cadre of elite marines and taking on the alien scum. One of my favourite things about Xcom, and the reason I love the series so much, is the bond you form with your soldiers, this because of the permadeath feature, but equally because of the range of customisation options on offer. In particular, being able to name your soldiers makes such a difference. But who to name them after? My last play of the original game (well, the reboot) saw me name my soldiers after popular sci-fi movie characters, which worked better than my first play, where I named them after my friends. Watching your buddies die is less fun. So which way will I go this time? Name them after the players at my beloved Arsenal FC? No, they'd just bottle it and finish in fourth. Name them after musicians? I'd be worried they'd all check out aged 27. What about video game characters? That might work...Hmmmm. Decisions, decisions. What I don't want to do is spend too many hours of my initial play through customising my troopers, because you know, there's aliens to kill! Regardless of what I call the troopers in my private army, I can't wait to see how this next game plays out. Expect my thoughts on Xcom 2 in the nearish future.", "articleID": "2018121917_00369868_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}}, {"date": "2018-12-20", "url": "http://www.krcc.org/post/defense-secretary-mattis-retire-february-trump-says-amid-syria-tension", "content": "Defense Secretary <mark>Mattis</mark> To Retire In February, <mark>Trump</mark> Says, Amid Syria Tension By Philip Ewing • 32 minutes ago Tweet Share Google + Email View Slideshow 1 of 2 Defense Secretary Jim Mattis, one of President <mark>Trump</mark>'s most important early advisers, is the latest to depart the administration. Jacquelyn Martin / AP View Slideshow 2 of 2 Joint Chiefs Chairman Gen. Joe Dunford (left) with <mark>Mattis</mark>, who is departing the administration. Jacquelyn Martin / AP Originally published on December 20, 2018 4:34 pm Updated at 5:46 p.m. ET Defense Secretary Jim Mattis, a living Marine Corps legend who made history by securing special permission from Congress to lead the Pentagon, is stepping down after a slow freeze-out by President <mark>Trump</mark>. The president made the announcement via Twitter Thursday evening. \"General Jim Mattis will be retiring, with distinction, at the end of February, after having served my Administration as Secretary of Defense for the past two years,\" <mark>Trump</mark> wrote. \"General <mark>Mattis</mark> was a great help to me in getting allies and other countries to pay their share of military obligations. A new Secretary of Defense will be named shortly. I greatly thank Jim for his service!\" t he president also wrote in a second tweet about the departure. <mark>Mattis</mark>' departure completes a near-wholesale shake-up of <mark>Trump</mark>'s initial national security team and follows a record-setting series of departures of administration leaders so early in a presidency. Of <mark>Trump</mark>'s initial top national security or diplomatic policy advisers, only Secretary of State Mike Pompeo, who began as CIA director, and United Nations Ambassador Nikki Haley remain--and Haley is set to depart the administration soon as well. The dismissal followed an abrupt decision by <mark>Trump</mark> this week to withdraw American troops from Syria, over the objections of many of the president's military and national security advisers. And it also followed the publication of a book by Bob Woodward that described <mark>Mattis</mark> as deeply frustrated with <mark>Trump</mark>, likening his understanding to that of a fifth - or sixth-grader, and being put into uncomfortable positions by the president's sometime outbursts. At one point, Woodward describes <mark>Trump</mark> calling <mark>Mattis</mark> and ordering him to assassinate Syrian President Bashar Assad; <mark>Mattis</mark>, according to the account, agreed to \"get right on that\" but ultimately brought about a much more measured low-level cruise missile attack. Following the reports, <mark>Mattis</mark> said, \"The contemptuous words about the president attributed to me in Woodward's book were never uttered by me or in my presence. While I generally enjoy reading fiction, this is a uniquely Washington brand of literature, and his anonymous sources do not lend credibility .\" But on Thursday, <mark>Mattis</mark> wrote in a resignation letter that he felt he could no longer continue to execute <mark>Trump</mark>'s policies. \"Because you have the right to have a secretary of defense whose views are better aligned with yours...I believe it is right for me to step down from my position,\" he wrote. <mark>Mattis</mark>' letter cited his support for America's \"unique and comprehensive system of alliances and partnerships .\" <mark>Trump</mark>'s brusque approach to those international relationships, <mark>Mattis</mark> wrote, is one reason the defense secretary feels he must step down. Departure of a major figure <mark>Mattis</mark>' departure is significant. He enjoyed outsize influence with <mark>Trump</mark> from his first day back in government and was, for example, credited with single-handedly changing <mark>Trump</mark>'s mind on the use of harsh interrogation with terrorism suspects. <mark>Trump</mark> campaigned in 2016 on the need to revive brutal techniques such as waterboarding and \"a lot worse,\" but he ceded that policy to <mark>Mattis</mark> after a conversation in which the former Marine general told him he could get better results by offering sympathy in interrogations. \"\"I've always found, give me a pack of cigarettes and a couple of beers and I do better with that than I do with torture,'\" as <mark>Trump</mark> described the conversation. So <mark>Trump</mark> backed away from his stance on torture and continued to lean on <mark>Mattis</mark> for advice about the toughest national security challenges in the early phase of his presidency. <mark>Trump</mark> relied on <mark>Mattis</mark> to execute his orders for two missile attacks on Syria in April in retaliation for the use of chemical weapons, and <mark>Mattis</mark> also played the good cop after <mark>Trump</mark>'s bad cop in dealing with allies in Europe and Asia. <mark>Mattis</mark>' long-standing enmity toward Iran also established a strong trend line in policy for <mark>Trump</mark>, although <mark>Mattis</mark> stopped short of telling members of Congress that the Iran nuclear deal wasn't working. It was working, he said--although <mark>Trump</mark> decided in May to abrogate America's participation in it. But <mark>Trump</mark> also grew frustrated with <mark>Mattis</mark> and the rest of his advisers--including then-national security adviser H.R. McMaster and then-Secretary of State Rex Tillerson--over the sputtering war in Afghanistan. <mark>Trump</mark>, who had at one time harbored ideas of simply cutting bait on Afghanistan and withdrawing nearly all American troops, found that <mark>Mattis</mark> and his military advisers counseled doubling down with increased deployments, again. The frustration appeared to go both ways. <mark>Mattis</mark> and Joint Chiefs Chairman Gen. Joe Dunford were blindsided by <mark>Trump</mark>'s spur-of-the-moment announcement last summer that the military would ban transgender troops, a policy they opposed. President comes into his own <mark>Trump</mark> grew more confident in his role over time. As the rare president with no experience in elective office or the military, <mark>Trump</mark> had relied on <mark>Mattis</mark> and other advisers of his vintage for on-the-job orientation about America's global security posture and what was considered feasible and not feasible in various regions around the globe. With more time in the job, <mark>Trump</mark> felt more comfortable going his own way, meaning the role that <mark>Mattis</mark> played as a mentor-adviser was diminished. <mark>Trump</mark> was said to have smarted at the notion that there was a \"Committee to Save America,\" comprising <mark>Mattis</mark>, Tillerson and others, which was fencing a feckless <mark>Trump</mark> safely away from serious mistakes. The \"committee,\" if there ever really was one, now is mostly gone--McMaster, Tillerson, former chief economic adviser <mark>Gary Cohn</mark> and several others all have left the administration. According to reports, <mark>Mattis</mark> was cut out of <mark>Trump</mark>'s decision on the Iran deal and also was not aware that <mark>Trump</mark> planned to commit to freezing U.S. and South Korean military exercises as part of nuclear negotiations with North Korea. The overall impression was that <mark>Trump</mark>, at some point along the line, stopped listening to <mark>Mattis</mark> in the way he once had. Myth of \"Mad Dog\" <mark>Mattis</mark> is a three-war veteran with service in Afghanistan and two Iraq wars, first in the 1991 Desert Storm campaign and then again following the 2003 invasion. The Marine Corps ground commander was revered perhaps more than any of his contemporaries--he is the subject of memes, quote pages and other devotional treatments. But when he rose to become head of U.S. Central Command, the military combatant command responsible for the Middle East, he fell out with President Barack Obama's administration, likely over Iran policy. <mark>Mattis</mark> retired and said at the time he did not expect to return to public service. U.S. law barred former commanders of his stature from serving as secretaries of defense until after a cooling-off period, a practice designed to preserve civilian control of the military. But <mark>Mattis</mark> came to the attention of <mark>Trump</mark> after his election, in part because of a nickname he'd picked up in Iraq: \"Mad Dog .\" <mark>Mattis</mark> didn't like the nickname and it was mostly the province of newspaper headlines, but the impression, for <mark>Trump</mark>, was made. President-elect <mark>Trump</mark>, as he then was, invited <mark>Mattis</mark> to join him onstage at a rally in December 2016. <mark>Trump</mark> later sought, and received, a waiver from Congress that permitted <mark>Mattis</mark> to take over the Defense Department, even though he was still technically within the window barring him from a civilian leadership position. If <mark>Trump</mark> thought \"Mad Dog\" <mark>Mattis</mark> was going to be a snarling martinet, however, he did not know his man. The cerebral, often soft-spoken <mark>Mattis</mark> told reporters he preferred the nickname \"Jim .\" He told Congress that his study of history meant he was seldom surprised by world events. All along, however, <mark>Mattis</mark> was aware of his reputation as a \"warrior monk\" and, to the degree that he could in the shadow of a headline-jealous <mark>Trump</mark>, continued cultivating it. John Dickerson of CBS News, for example, asked <mark>Mattis</mark> in an interview what scared him or kept him up at night. \"Nothing,\" he responded. \"I keep other people up at night .\" Copyright 2018 NPR. To see more, visit https: //www.npr.org. Tags: <mark>James Mattis</mark> <mark>Donald Trump</mark> Tweet Share Google + Email", "articleID": "2018122023_00779112_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Gary Cohn": ["Q5524866", "Q5524867", "Q5524868"], "James Mattis": ["Q1680776", "Q267902"]}}, {"date": "2018-12-21", "url": "http://wivb.com/news/local-news/former-operators-of-emerald-south-to-sue-mark-poloncarz-for-defamation/1669891624", "content": "Former operators of Emerald South to sue Mark Poloncarz for defamation Former operators of Emerald South to sue Mark Poloncarz for defamation By: Posted: Dec 20, 2018 10:54 PM EST Updated: Dec 20, 2018 10:54 PM EST BUFFALO, N.Y. (WIVB) - The former operators of Emerald South nursing home are planning to sue Erie County Executive Mark Poloncarz for statements he made during a news conference and on social media back in August. During the August 23 news conference, Poloncarz called on the State Department of Health to force another company to take over running the troubled nursing home after two patients died and claims surfaced about an administrator sexually molesting a patient. \"This is very serious, if I had the power to shut it down I would. Force the sale of Emerald South from its current deadbeat downstate owners who neither care about the patients and residents nor the employees at this facility,\" said Poloncarz at the August news conference. That same day, Poloncarz took to Twitter, saying, \"The Emerald South Nursing Facility is a danger to its residents, employees and now the public. The New York State Department of Health must immediately put the facility into receivership and force the sale of it from the downstate, deadbeat owners .\" Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Tweet from Mark Poloncarz on August 23 Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Tweet from Mark Poloncarz on August 23 The comments made by Poloncarz in the news conference and on social media are now landing the county executive in a potential legal battle. Benjamin and Judy Landa, the former operators of Emerald South, recently filed a notice of claim against Poloncarz. They are planning to sue him for false and defamatory statements about them and their business. They say his comments were deliberately reckless and negligent and claim he hurt their reputation, income and caused humiliation and emotional distress. If the notice of claim turns into a lawsuit, it could cost Erie County taxpayers a lot of money. \"Potential litigation against Erie County is serious because it could cost us a significant amount of money. Taxpayers are footing the bill either way,\" said Erie County Comptroller Stefan Mychajiliw. Erie County Legislator Joe Lorigo says taxpayers should not have to pay for a lawsuit if the Twitter account Poloncarz used is a personal account. In a tweet last month, Poloncarz said his Twitter page is a personal page. Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Tweet from Mark Poloncarz November 28 Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Tweet from Mark Poloncarz November 28 \"Why are Erie County taxpayers expected to defend the county executive for statements he made on his personal Twitter account, he should be covering the cost of his own defense,\" said Lorigo. Legal Analyst Barry Covert told News 4 it's unlikely this notice of claim will materialize into a lawsuit. According to Covert, the county executive's statements are protected under the first amendment. He's also protected by stating facts supported by other information. Covert also says, as a public official, Poloncarz has limited qualified immunity. \"If you are making statements that are in furtherance of your office, you can't be sued for liable or slander just because those comments can somehow injure somebody. It's a very high standard to overcome,\" said Covert, News 4 legal analyst and criminal defense attorney for Lipsitz, Green, Scime, Cambria. The Erie County Executive's Office responded to the notice of claim in a statement: \"While we will not comment on the factual or legal aspects of the pending litigation, the county stands ready to fully defend against this frivolous lawsuit. Additionally, County Executive Poloncarz and the Department of Senior Services are extremely pleased to see that action has been taken by New York State to resolve the serious issues that have plagued EmeraldSouth Rehabilitation and Care Center .\" - <mark>Daniel Meyer</mark>, Deputy Press Secretary, Erie County Executive's Office News 4 reached out to the attorneys for the Landa's, but they did not return our phone calls.", "articleID": "2018122104_00138451_W", "names": {"Daniel Meyer": ["Q5218149", "Q57313557"]}}, {"date": "2018-12-24", "url": "http://www.gamereactor.eu/games/39904/Red", "content": "RED DEAD REDEMPTION 2 REVIEW. Written by Magnus Groth-Andersen on the 25th of October 2018 at 12 \"A watershed moment, an instant classic, another high point for a studio which has constantly delivered them for decades .\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 17th of December 2018 at 12:58 A ton of games have had sales boosts this past week, meaning a bit of a shake-up at the higher end of the charts. 0 NEWS. Written by Christian Gaca on the 13th of December 2018 at 10:45 Rockstar has released title update 1.04 for Red Dead Redemption 2, which is great news of course, and even better is the fact that it also impacts the Red Dead Online...0 NEWS. Written by Christian Gaca on the 12th of December 2018 at 10:34 Due to the Switch's hybrid capabilities, it's always nice to have the big releases launch on Nintendo's platform as well, and Red Dead Redemption 2 is certainly one we...0 NEWS. Written by Arya W. Wibowo on the 11th of December 2018 at 11:20 It's been almost two weeks since Red Dead Online first launched in its beta form, and now someone might have just discovered a new mode coming to the game, which could be ...", "articleID": "2018122416_00861721_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2018-12-24", "url": "https://www.businessinsider.in/elon-musk-revealed-his-favorite-character-in-super-smash-bros-ultimate/articleshow/67236721.cms", "content": "Elon Musk revealed his favorite character in \"Super Smash Bros.. Ultimate' <mark>Kevin Webb</mark> Dec 24, 2018, 11.29 PM Facebook Linkedin WhatsApp Twitter Google + Reddit Read full story Nintendo/Kiichiro Sato/AP Tesla CEO Elon Musk says he's playing bounty hunter Samus Aran in\" Super Smash Bros.. Ultimate \"Tesla CEO Elon Musk says he's playing Zero Suit Samus as his main character in\" Super Smash Bros.. Ultimate. \"\"Super Smash Bros.. Ultimate\" is a fighting game for the Nintendo Switch featuring an all-star lineup of characters from different video game franchises. The game has sold more than three million copies in the US since its December 7 release. Bounty hunter Samus Aran first debuted in \"Metroid\" (1986). Samus usually wears armor for space travel; the Zero Suit is her last defense when her armor is destroyed. With more than three million copies sold in the US in less than two weeks, \"Super Smash Bros.. Ultimate\" is one of the most popular video games of 2018 - and Nintendo can count Tesla CEO Elon Musk as one of its many players. At its core, the Super Smash Bros. series is Nintendo's love letter to video games. It's a massive crossover between historic franchises that lets players battle each other with their favorite characters. Seeing Nintendo's iconic characters duking it out side by side is the gaming equivalent of watching The Avengers assemble on screen. When a Smash fan tweeted at Musk to ask which character he was playing in the new game, Musk responded with Zero Suit Samus, the protagonist of Nintendo's Metroid series. \"Super Smash Bros.. Ultimate\" / Nintendo Samus in her power suit. \"Metroid\" introduced bounty hunter Samus Aran in 1986, but it's not until the end of the game that her face, and more notably her gender, are revealed. As a space adventurer Samus understandably spends most of her time in her power suit, which also appears in \"Super Smash Bros.. Ultimate .\" Zero Suit refers to the rare occassions where Samus is forced to fight without her suit, equipped with rocket boots and her paralyzer pistol. For dedicated players, choosing a \"main\" character to play in Smash often says something about your identity as a player. Your character dictates your strategy and also reflects your aesthetic taste. Read more: What are Elon Musk's favorite video games? In her skintight outfit, Zero Suit Samus seems ripe for objectification, but she also reflects a cool confidence with a fighting style that remains both lithe and lethal after she's been (literally) stripped of her powerful arsenal of missiles, bombs, and energy cannons. She also happens to be pretty darn good in the game. There are plenty of reasons for Musk to choose Zero Suit Samus as his favorite \"Super Smash Bros.. Ultimate\" character, and plenty of fun to be had speculating just how much he knows about the femme fatale. Musk's general love of video games is no secret, so maybe someday we'll see just how well he can smash with Samus. Zero Suit � � - Elon Musk (@ elonmusk) December 14, 2018 maybe i should still play zss hmm pic.twitter.com/5qDcVNst3y - zac (@ KIMB0RAS) December 14, 2018 NOW WATCH: I cut Google out of my life for 2 weeks, but the alternatives prove why Google is so much better {{}} Facebook Linkedin WhatsApp Twitter Google + Reddit Next Story Zuck reportedly approached Evan Spiegel about a possible acquisition less than a year before Snap went public More from this author These are the 11 best \"Super Smash Bros....The world's most popular video game chat...The founder of one of the most successful...Olivia Munn is reportedly dating Tucker R.. . The Wall Street Journal's website was hac...Related Stories I asked 3 social-media influencers what it takes t.. . UBS: Turkey could be heading into a balance-of-pay...India's Supreme Court approves round-the-clock wit...Promoted Stories Shave without a mess with using these 5 tips MENSXP A perfect date night gift for your partner IDIVA Tips for dark men to look more stylish MENSXP", "articleID": "2018122418_00103070_W", "names": {"Kevin Webb": ["Q18387930", "Q29643764"]}}, {"date": "2018-12-25", "url": "https://www.brotherlygame.com/2018/12/25/18152134/south-jersey-bucks-county-native-lauren-brown-caps-college-career-with-third-national-title", "content": "Email After four seasons in college, two national titles and only four losses, the final game of <mark>Lauren Brown</mark>'s soccer career at Williams College came down penalty kicks in the driving rain against arch rival Middlebury. <mark>Brown</mark>, who is originally from Shamong, N.J. and moved to Yardley, Pa. with her family when she started high school at Pennington School, was in line to take a kick but didn't need to take a spot kick in the end. A save by goalkeeper Olivia Barnhill in the fifth round ended the game and made <mark>Brown</mark> a Division III national champion for the third time. \"That moment was pretty surreal, I pretty much just broke down in tears, just so happy and overwhelmed,\" she said. \"When I saw my family in the stands I got even more emotional, they've been the rocks throughout my career .\" <mark>Lauren Brown</mark> (middle) with her brother and sister both dressed in cow suits (the Ephs mascot is a purple cow) after winning her third national title with Williams College. <mark>Brown</mark> was a reserve midfielder her first season, making only five appearances during the first national title run, but became a regular her sophomore season when the team lost in the national final to Messiah and played every game of her junior and senior seasons. The only other losses during her time in Massachusetts all came against Middlebury, including a 1-0 loss in the conference championship in November. \"Being able to play Middlebury in the final was a big send off,\" she said. Some key injuries threatened to derail the team's journey back to the final this year, but that was where the experience of <mark>Brown</mark> and her six classmates came into play, leading the team back to the pinnacle of college soccer. The senior class ended their time at Williams with an 80-4-9 record. \"This year was pretty much the best and most difficult year of my career,\" <mark>Brown</mark> said. \"Difficult in that we had plenty of injuries and because of that had to change up our lineup a lot and deal with some small dynamic issues because of that. There were really just problem solving pieces along the whole way and I definitely at times thought\" wow, it's going to take a lot for us to get back there. \"' The lone player from the Philadelphia area on the squad, <mark>Brown</mark>'s soccer journey is one with deep ties on both sides of the Delaware River. She started out playing for Indian Mills Soccer Club in New Jersey with her dad, <mark>Ken Brown</mark>, as one of her coaches and later played for Millville SC and FC Bucks while also participating in the New Jersey Olympic Development Program. She starred at Pennington School in high school, where she was on teams that won three state championships. She credits her dad, who played at Lehigh University in the early\" 90s, with passing on his love of the game and her whole family for the many sacrifices made and the long hours commuting to training--about 90 minutes to training with FC Bucks twice a week and games on weekends when they still lived in Shamong. \"He tried having a soccer ball at our feet when we were young,\" <mark>Brown</mark> said of her dad. \"But both my parents and my entire family have been so supportive; they watch every one of my games, are the first to text me or call me after each game and my dad and siblings were able to come down to UNCG for the final four, which was an amazing experience .\" <mark>Ken Brown</mark> experienced a wide range of emotions himself the night of the final. \"The range of emotions was unbelievable, from sadness knowing her career was coming to a end, to nervousness over her last collegiate game coming down to PKs for a national championship, to complete joy that I got to experience such a wonderful ride from an amazing career,\" <mark>Ken Brown</mark> said. He was also relieved because of some nagging injuries his daughter has dealt with over her time in college. \"For the last four years (she) has endured a blood circulatory issue, tendonitis in both Achilles and shin splints,\" he said. \"Lu had to rehab before every practice and game for her entire collegiate career so she could play for her coach and teammates at Williams .\" She already has a job as a quantitative data analyst lined up in Boston when she graduates in May so with soccer over now her focus has shifted to finishing out her final semester. Looking back on her successful playing career that ended the way so many players can only dream, she said she'll have way more than just the three national titles to cherish. \"Even beyond all this success there's these lifelong relationships I've been able to cultivate,\" she said. \"I'm really just so so thankful but also sad that I can't be on this journey anymore with this second family I've been able to have here at Williams .\" More From Brotherly Game", "articleID": "2018122519_00098526_W", "names": {"Ken Brown": ["Q11738692", "Q1179662", "Q18638192", "Q18685067", "Q20807058", "Q2391812", "Q48801774", "Q6387385", "Q6387386", "Q6387388", "Q6387389", "Q6389898"]}}]