[{"date": "2018-12-28", "url": "http://muppet.wikia.com/wiki/Season_19_(1987-1988)?diff=1133830&oldid=1126309", "content": "Revision as of 02:46, November 27, 2018 (view source) Aleal (wall | contribs) m ← Older edit Revision as of 02:08, December 28, 2018 (view source) FortheSesameFans (wall | contribs) Newer edit → Line 17: Line 17: * [[Episode 2357]] * [[Episode 2357]] * [[Episode 2358]]--<mark>David</mark> hires [[Gina]] to work at Hooper's * [[Episode 2358]]--<mark>David</mark> hires [[Gina]] to work at Hooper's + * [[Episode 2359]] + * [[Episode 2360]] + * [[Episode 2361]] * [[Episode 2362]]--The Count's suitcases * [[Episode 2362]]--The Count's suitcases * [[Episode 2363]]--[[Big Bird]] practices magic * [[Episode 2363]]--[[Big Bird]] practices magic + * [[Episode 2364]] * [[Episode 2365]]--[[Forgetful Jones]] joins the Birdketeers * [[Episode 2365]]--[[Forgetful Jones]] joins the Birdketeers * [[Episode 2366]]--Night time on Sesame Street (repeat) * [[Episode 2366]]--Night time on Sesame Street (repeat) * [[Episode 2367]]--Jiffy the turtle / Barkley the cow (repeat) * [[Episode 2367]]--Jiffy the turtle / Barkley the cow (repeat) + * [[Episode 2368]] + * [[Episode 2369]] + * [[Episode 2370]] + * [[Episode 2371]] + * [[Episode 2372]] + * [[Episode 2373]] + * [[Episode 2374]] * [[Episode 2375]]--Oscar writes poems (repeat) * [[Episode 2375]]--Oscar writes poems (repeat) * [[Episode 2376]]--A hot day on Sesame Street (repeat) * [[Episode 2376]]--A hot day on Sesame Street (repeat) + * [[Episode 2377]] + * [[Episode 2378]] + * [[Episode 2379]] + * [[Episode 2380]] + * [[Episode 2381]] + * [[Episode 2382]] + * [[Episode 2383]] * [[Episode 2384]] * [[Episode 2384]] * [[Episode 2385]]--Luis and Maria develop feelings for each other * [[Episode 2385]]--Luis and Maria develop feelings for each other * [[Episode 2386]] * [[Episode 2386]] + * [[Episode 2387]] + * [[Episode 2388]] + * [[Episode 2389]] + * [[Episode 2390]] + * [[Episode 2391]] + * [[Episode 2392]] * [[Episode 2393]] * [[Episode 2393]] * [[Episode 2394]]--[[Count von Count | The Count]] conducts Bob's band * [[Episode 2394]]--[[Count von Count | The Count]] conducts Bob's band * [[Episode 2395]]--[[Elmo]] plays with his new goldfish, Barkley * [[Episode 2395]]--[[Elmo]] plays with his new goldfish, Barkley * [[Episode 2396]]--Big Bird's day with keys * [[Episode 2396]]--Big Bird's day with keys + * [[Episode 2397]] * [[Episode 2398]]--Barkley's tricks * [[Episode 2398]]--Barkley's tricks * [[Episode 2399]]--Ronald Grump builds the Grump Tower * [[Episode 2399]]--Ronald Grump builds the Grump Tower Line 42: Line 67: * [[Episode 2407]]--The Count's paintings * [[Episode 2407]]--The Count's paintings * [[Episode 2408]] * [[Episode 2408]] + * [[Episode 2409]] * [[Episode 2410]]--Introducing Snuffy's sister Alice * [[Episode 2410]]--Introducing Snuffy's sister Alice * [[Episode 2411]]--Big Bird learns about love * [[Episode 2411]]--Big Bird learns about love * [[Episode 2412]]--Snuffy walks Barkley * [[Episode 2412]]--Snuffy walks Barkley + * [[Episode 2413]] * [[Episode 2414]]--Love in the [[Fix-It Shop]] * [[Episode 2414]]--Love in the [[Fix-It Shop]] * [[Episode 2415]]--Placido falls for Maria * [[Episode 2415]]--Placido falls for Maria − * [[Episode 2417]] + * [[Episode 2416]] + * [[Episode 2417]] + * [[Episode 2418]] * [[Episode 2419]] * [[Episode 2419]] + * [[Episode 2420]] + * [[Episode 2421]] * [[Episode 2422]]--Señor Zero strikes again! * [[Episode 2422]]--Señor Zero strikes again! * [[Episode 2423]]--Bob plays [[Name That Sound]] / The Count watches the Fix-It Shop * [[Episode 2423]]--Bob plays [[Name That Sound]] / The Count watches the Fix-It Shop * [[Episode 2424]]--Big Bird learns about sadness * [[Episode 2424]]--Big Bird learns about sadness * [[Episode 2425]] * [[Episode 2425]] + * [[Episode 2426]] + * [[Episode 2427]] + * [[Episode 2428]] * [[Episode 2429]] * [[Episode 2429]] + * [[Episode 2430]] * [[Episode 2431]]--Big Bird's gift for Luis / Elmo watches for stars * [[Episode 2431]]--Big Bird's gift for Luis / Elmo watches for stars * [[Episode 2432]] * [[Episode 2432]] + * [[Episode 2433]] + * [[Episode 2434]] + * [[Episode 2435]] + * [[Episode 2436]] + * [[Episode 2437]] * [[Episode 2438]] * [[Episode 2438]] + * [[Episode 2439]] * [[Episode 2440]]--The Count gives up counting * [[Episode 2440]]--The Count gives up counting + * [[Episode 2441]] + * [[Episode 2442]] * [[Episode 2443]]--Rooftop sing along (repeat) * [[Episode 2443]]--Rooftop sing along (repeat) + * [[Episode 2444]] + * [[Episode 2445]] + * [[Episode 2446]] * [[Episode 2447]]--Lovebirds at Birdland * [[Episode 2447]]--Lovebirds at Birdland * [[Episode 2448]]--Snuffy's store, etc.. * [[Episode 2448]]--Snuffy's store, etc.. * [[Episode 2449]]--Big Bird and Snuffy send a letter * [[Episode 2449]]--Big Bird and Snuffy send a letter * [[Episode 2450]]--Telly's magic pencil * [[Episode 2450]]--Telly's magic pencil + * [[Episode 2451]] + * [[Episode 2452]] * [[Episode 2453]]--Making rhythms with the Honker and Dinger * [[Episode 2453]]--Making rhythms with the Honker and Dinger * [[Episode 2454]] * [[Episode 2454]] * [[Episode 2455]]--Maria and Luis decide to get married * [[Episode 2455]]--Maria and Luis decide to get married * [[Episode 2456]]--Natasha joins clubs * [[Episode 2456]]--Natasha joins clubs + * [[Episode 2457]] * [[Episode 2458]]--Big Bird listens * [[Episode 2458]]--Big Bird listens * [[Episode 2459]]--Hiroshi visits from Japan * [[Episode 2459]]--Hiroshi visits from Japan * [[Episode 2460]]--Big Bird and Snuffy play games / Elmo sleeps over * [[Episode 2460]]--Big Bird and Snuffy play games / Elmo sleeps over + * [[Episode 2461]] + * [[Episode 2462]] + * [[Episode 2463]] + * [[Episode 2464]] + * [[Episode 2465]] + * [[Episode 2466]] + * [[Episode 2467]] + * [[Episode 2468]] + * [[Episode 2469]] + * [[Episode 2470]] + * [[Episode 2471]] + * [[Episode 2472]] + * [[Episode 2473]] * [[Episode 2474]] * [[Episode 2474]] * [[Episode 2475]] * [[Episode 2475]] Revision as of 02:08, December 28, 2018 Sesame Street Premiere November 16, 1987 (2356) Finale May 13, 1988 (2485) Episodes 130 Said Oscar of Maria's wedding, \"Yes, I was there--I threw some of the rice. But they weren't too happy because I had cooked it first .\" [1] \"African Alphabet\" \"Bert's Blanket\" Jay Leno plays a challenging game with Big Bird. Spaceship Surprise, a Star Trek - inspired science-fiction series. \"Don't Sing This Song\" Sesame Street Season 19 aired from November 16, 1987 to May 13, 1988. Contents [show] Episodes Episodes 2356 - 2485 (130 episodes) Episode 2356--19th season premiere; Gordon brings Elmo and Miles to the zoo Episode 2357 Episode 2358--<mark>David</mark> hires Gina to work at Hooper's Episode 2359 Episode 2360 Episode 2361 Episode 2362--The Count's suitcases Episode 2363--Big Bird practices magic Episode 2364 Episode 2365--Forgetful Jones joins the Birdketeers Episode 2366--Night time on Sesame Street (repeat) Episode 2367--Jiffy the turtle / Barkley the cow (repeat) Episode 2368 Episode 2369 Episode 2370 Episode 2371 Episode 2372 Episode 2373 Episode 2374 Episode 2375--Oscar writes poems (repeat) Episode 2376--A hot day on Sesame Street (repeat) Episode 2377 Episode 2378 Episode 2379 Episode 2380 Episode 2381 Episode 2382 Episode 2383 Episode 2384 Episode 2385--Luis and Maria develop feelings for each other Episode 2386 Episode 2387 Episode 2388 Episode 2389 Episode 2390 Episode 2391 Episode 2392 Episode 2393 Episode 2394--The Count conducts Bob's band Episode 2395--Elmo plays with his new goldfish, Barkley Episode 2396--Big Bird's day with keys Episode 2397 Episode 2398--Barkley's tricks Episode 2399--Ronald Grump builds the Grump Tower Episode 2400 Episode 2401--Big Bird's Happy Meter Episode 2402--Maria can't get Irvine to go back to sleep Episode 2403--Planet Zingo Episode 2404--Maria and Luis realize they're in love Episode 2405--Maria and Luis love each other Episode 2406--Oscar's School for Worms Episode 2407--The Count's paintings Episode 2408 Episode 2409 Episode 2410--Introducing Snuffy's sister Alice Episode 2411--Big Bird learns about love Episode 2412--Snuffy walks Barkley Episode 2413 Episode 2414--Love in the Fix-It Shop Episode 2415--Placido falls for Maria Episode 2416 Episode 2417 Episode 2418 Episode 2419 Episode 2420 Episode 2421 Episode 2422--Señor Zero strikes again! Episode 2423--Bob plays Name That Sound / The Count watches the Fix-It Shop Episode 2424--Big Bird learns about sadness Episode 2425 Episode 2426 Episode 2427 Episode 2428 Episode 2429 Episode 2430 Episode 2431--Big Bird's gift for Luis / Elmo watches for stars Episode 2432 Episode 2433 Episode 2434 Episode 2435 Episode 2436 Episode 2437 Episode 2438 Episode 2439 Episode 2440--The Count gives up counting Episode 2441 Episode 2442 Episode 2443--Rooftop sing along (repeat) Episode 2444 Episode 2445 Episode 2446 Episode 2447--Lovebirds at Birdland Episode 2448--Snuffy's store, etc.. Episode 2449--Big Bird and Snuffy send a letter Episode 2450--Telly's magic pencil Episode 2451 Episode 2452 Episode 2453--Making rhythms with the Honker and Dinger Episode 2454 Episode 2455--Maria and Luis decide to get married Episode 2456--Natasha joins clubs Episode 2457 Episode 2458--Big Bird listens Episode 2459--Hiroshi visits from Japan Episode 2460--Big Bird and Snuffy play games / Elmo sleeps over Episode 2461 Episode 2462 Episode 2463 Episode 2464 Episode 2465 Episode 2466 Episode 2467 Episode 2468 Episode 2469 Episode 2470 Episode 2471 Episode 2472 Episode 2473 Episode 2474 Episode 2475 Episode 2476--Shelly the Turtle and Gordon race Episode 2477--Telly and Alice practice saying hello and goodbye Episode 2478 Episode 2479 Episode 2480 Episode 2481--Don Music's song of \"AMOR\" Episode 2482--The Big Zero Game Episode 2483--Maria and Luis hold a pre-wedding party for Maria's mother and Luis' uncle Episode 2484--Maria and Luis prepare for their wedding Episode 2485--19th season finale; Maria and Luis get married Notes This was Alaina Reed's final season as Olivia. This is also the final seasons where the number sponsors only go from 2 through 12. Cast Muppet Characters Alice Snuffleupagus, The Amazing Mumford, Anything Muppets, Baby Natasha, Barkley, Bert, Big Bird, Buster the Horse, Cookie Monster, Count von Count, Elmo, Ernie, Gladys the Cow, Grover, Grundgetta, Herry Monster, Mr. Honker, Honkers, Hoots the Owl, Juliet, Kermit the Frog, The Martians, Meryl Sheep, Dr. Nobel Price, the Oinker Sisters, Oscar the Grouch, Ruby, Mr. Snuffleupagus, Telly Monster, Two-Headed Monster Other Characters Gordon, Susan, Maria, Luis, Linda, Bob, <mark>David</mark>, Uncle Wally, Olivia, Gina, Miles, Mr. Macintosh Muppets of Sesame Street Caroll Spinney, Pam Arciero, Camille Bonora, Kevin Clash, Fred Garbo, Jim Henson, <mark>Richard Hunt</mark>, <mark>Jerry Nelson</mark>, Frank Oz, Martin P. Robinson, <mark>David Rudman</mark>, Judy Sladky, Bryant Young Actors Alison Bartlett-O'Reilly, Linda Bove, Northern Calloway, Emilio Delgado, Loretta Long, <mark>Sonia Manzano</mark>, Bill McCutcheon, Bob McGrath, Roscoe Orman, Miles Orman, Alaina Reed Guest Stars José Ferrer, Keith Hernandez, Pee-Wee Herman, Lillian Hurst, Jay Leno, Mookie Wilson Credits Executive Producer: Dulcy Singer Producer: <mark>Lisa Simon</mark> Director: <mark>Jon Stone</mark>, Emily Squires Head Writer: Norman Stiles Writers: Nancy Sans, Luis Santeiro, Cathi Rosenberg-Turow, Belinda Ward, <mark>Sonia Manzano</mark>, <mark>Jeff Moss</mark>, Sara Compton, Judy Freudberg, <mark>David</mark> Korr, <mark>John Weidman</mark>, Tony Geiss, Emily Perl Kingsley, Mark Saltzman, Jocelyn Stevenson, Christian Clark, Tom Dunsmuir, <mark>Jon Stone</mark> Supervising Film Producer: Edith Zornow Coordinating Producer: Arlene Sherman Muppets by: Kermit Love, Caroly Wilcox, Connie Peterson, Peter MacKennan, Stephen Rotondaro, Mark Zeszotek, Jitka Exler, <mark>Richard</mark> Termine Music Director: Joe Raposo Special Songs: Joe Raposo, <mark>Jeff Moss</mark>, <mark>Christopher Cerf</mark>, Cheryl Hardwick Associate Music Director: Dave Conner Music Coordinator: Danny Epstein Production Supervisor: Frieda Lipp Editing Supervisor: Robert J. Emerick Associate Directors: Ted May, Diane P. Mitchell, Eulogio Ortiz, Jr.. Production Designer: Victor DiNapoli Costume Designer: Bill Kellard Graphic Artist: Mike Pantuso Set Decorator: Nat Mongioi Production Stage Manager: Chet O'Brien Stage Manager: Mortimer J. O'Brien Curriculum Coordinator: Diane P. Mitchell Production Assistants: Cheryl Ann Jung, Ruthie E. Hiatt, Carol D. Mayes, Rudy Vallecillo Assistant to the Producers: Danette DeSena Script Coordinator: Thelma Moses Children's Casting: Martha O'Connor, Gabrielle Howard Unit Manager: Eleanor McIntosh Technical Director: Ralph Mensch Lighting Director: Dick Weiss Sound Effects: Dick Maitland Audio: Blake Norton, <mark>Tim Lester</mark> Cameras: Frank Biondo, Dave Driscoll Videotape Editor: Evamarie Keller Make-Up: Lee Halls Hair Stylist: Karen Specht Wardrobe: Grisha Mynova Vice President for Research: Keith W. Mielke, Ph.D.. Director of Research: Valeria Lovelace, Ph.D.. Curriculum Specialist: Margarita Perez Chairman, Board of Advisors: Gerald S. Lesser, Ph.D.. Vice Presidents for Production: <mark>David</mark> D. Connell, Al Hyslop Facilities by Unitel Video, Inc.. Sources ↑ \"The Reflections of Oscar the Grouch\" , Oscar the Grouch, Guest editor, November 5, 2009. Life Magazine. Previous season: Next season: Season 18 (1986-1987) Season 20 (1988-1989) Retrieved from \"http: //muppet.wikia.com/wiki/Season_19_ (1987-1988)? oldid = 1133830\" Categories: Sesame Street Seasons", "articleID": "2018122802_00158377_W", "names": {"John Weidman": ["Q57768392", "Q6263373"], "Jon Stone": ["Q18392764", "Q37839943"], "Lisa Simon": ["Q16226405", "Q51026810"], "Richard Hunt": ["Q54556031", "Q7323687", "Q7326608", "Q7326609", "Q7326613", "Q7326615"], "Sonia Manzano": ["Q6132224", "Q7561732"], "Tim Lester": ["Q2434130", "Q7803830"]}}, {"date": "2018-12-30", "url": "http://www.insidehighered.com/blogs/world-view/slippery-business-plagiarism", "content": "A blog from the Center for International Higher Education Title The Slippery Business of Plagiarism Students, especially those who come from corrupt environments where plagiarism is prevalent, but ignored, or seen as a trivial offense, need better guidance. By Plagiarism is a widespread problem around the world. It can take various forms--copying and pasting text without acknowledging its source, \"recycling\" or self-plagiarism (presenting the same paper several times as original), purchasing papers from an agency or a ghostwriter and submitting them as one's own. With the benefit of new technologies, cheating is booming, such that some countries are describing a \"plagiarism epidemic'. [1] In the United Kingdom, for example, almost 50,000 university students were caught cheating from 2012 to 2015. This is only the reported cases--how many more cases remain undetected? Students, especially those who come from corrupt environments where plagiarism is prevalent but ignored or seen as a trivial offense, need better guidance about the consequences of violating the rules of academic integrity. For example, during the academic year 2014-2015, the Department of Immigration in Australia cancelled 9,250 international student visas--plagiarism was one of the reasons cited in addition to other forms of academic misconduct [2]. Students need to understand that plagiarism during the course of their university studies could have significant repercussions--not only in the short-term, but also for their future careers. Some famous politicians have been implicated in plagiarism scandals. Following the public scandal revolving around plagiarism identified in their dissertations, German Defense Minister Karl-Theodor zu Guttenberg resigned in 2011 and German Education Minister Annette Schavan in 2013. Evidence of plagiarism was found in the dissertation of Ursula von der Leyen, the current German Defense Minister. Igor Danchenko and Clifford Gaddy, scholars at the Brookings Institute, found extensive plagiarism in the dissertation of Russian President, Vladimir Putin,\" Strategic Planning of the Reproduction of the Mineral Resource Base of a Region under Conditions of the Formation of Market Relations (St. Petersburg and Leningrad Oblast), \"which he'd successfully defended at the St. Petersburg Mining Institute in 1997. U.S. Vice President Joe Biden was thwarted by a plagiarism scandal that dated back to his law school years and that ended his 1988 presidential campaign. Can undetected plagiarism during a person's studies embolden the inclination to cheat in a future profession? High profile personalities including <mark>Timothy Parker</mark>, the crossword puzzle editor for USA Today, and Fareed Zakaria, CNN anchor, have been caught in recent plagiarism scandals. Are more students cheating now than before? Not according to the recent study by Curtis and Vardanega (2016) [3], who actually observed a downward trend among students at Australian universities in 2004-2014. At least since some forms of plagiarism can now be detected. Scholars have raised the alarm, however, indicating that about 70% of students do not consider all types of plagiarism (see Table) to be wrong. In another study, Curtis et al. (2013) [4] found that only 25% of first-year students at Murdoch University recognize all practices considered to be plagiarism; this number increased to 50% after completing courses on academic integrity. Curtis and Vardanega (2013) argue that text-matching software and educational interventions help to protect standards of academic integrity and are among the most successful mechanisms for positively change. Denisova-Schmidt et al. (2016) [5] discovered that the frequency of use of some forms of cheating might increase significantly during university studies. Comparing first-year students with more advanced students at selected Russian universities, the scholars found that copying off during exams or tests increases by 25%; downloading term papers (or other papers) from the internet by 15%; and purchasing term papers (or other papers) from special agencies or from other students by 12.5%. The scholars also voiced concern about the students' lack of awareness of what constitutes cheating. Copying and pasting from the Internet without any acknowledgement of source seems to be business as usual for many students at Russian universities. Many unprepared students are sent to universities all around the world. If secondary school education is failing to address this problem, then higher education institutions must acknowledge this issue by developing a better understanding of why students resort to plagiarism and addressing these motivations specifically. In addition to various anti-plagiarism policies and procedures, incorporating the use of special software programs like Turnitin or Unicheck, and developing ratings of universities based on their tolerance of plagiarism, [6] the faculty should present assignments and expectations more clearly to students. All of these remedies might still be insufficient when plagiarism is the only way that some students feel they can succeed or when plagiarism is a plea for help [7]. Table: Types of Plagiarism", "articleID": "2018123005_00222107_W", "names": {"Timothy Parker": ["Q7804094", "Q7807451"]}}, {"date": "2018-12-31", "url": "http://aninews.in/videos/national/agustawestland-case-sonia-rahul-gandhi-never-interfered-deals-procurement-says-ak-antony/", "content": "AgustaWestland case: Sonia & Rahul Gandhi never interfered in deals & procurement, says AK Antony Updated: 0 min ago IST New Delhi, Dec 31 (ANI): Speaking on the AgustaWestland case, former Defence Minister AK Antony said, \"AgustaWestland took place in my tenure. I would like to say, categorically, that Sonia Gandhi and Rahul Gandhi never interfered in deals and procurement. AgustaWestland was selected after evaluation by team of officials .\" He added that the moment report came from Italy that there is corruption in this case, he only ordered CBI enquiry, not this government. Share Top Videos Updated: 3 weeks, 5 days ago IST India vs Australia: Virat Kohli, Tim Paine pose with Border--Gavaskar trophy Updated: 1 month ago IST Trump blames Schwarzenegger for The Apprentice's failure to win Emmy Updated: 2 months, 3 weeks ago IST Deepika Padukone to play acid attack survivor for Meghna Gulzar's next Updated: 1 year ago IST Watch: Rahul Gandhi takes charge as Congress President Updated: 1 year, 3 months ago IST Operation \"All-Out' is a success, will continue it to bring peace: Lt Gen J.S. Sandhu Updated: 1 year, 3 months ago IST Cooperatives can change demographics of our state: CM Raman Singh Related Video Updated: 0 min ago IST AgustaWestland case: Sonia & Rahul Gandhi never interfered in deals & procurement, says AK Antony New Delhi, Dec 31 (ANI): Speaking on the AgustaWestland case, former Defence Minister AK Antony said,\" AgustaWestland took place in my tenure. I.. . Updated: 1 min ago IST Security forces free to initiate operations as per ground reality: <mark>Jitendra Singh</mark> on Mufti's warning New Delhi/Pulwama (J & K), Dec 31 (ANI): Peoples Democratic Party (PDP) president Mehbooba Mufti paid a visit to a suspected terrorist's sister in...Updated: 45 min ago IST Triple Talaq Bill: Opposition parties in Rajya Sabha will oppose the bill, says Kharge New Delhi, Dec 31 (ANI): Senior Congress leader Mallikarjun Kharge is confident that the Triple Talaq Bill set to be tabled before Rajya Sabha...Updated: 50 min ago IST 1984 anti-Sikh riots: Today Sajjan Kumar is going to his right place, says eyewitness Amritsar (Punjab), Dec 31 (ANI): Bibi Jagdish Kaur, family member of victims and a key eyewitness to the 1984 anti-Sikh riots expressed...Updated: 2 hours, 4 min ago IST Triple Talaq Bill: BJP is entering our houses, says Mehbooba Mufti Srinagar (Jammu and Kashmir), Dec 31 (ANI): While briefing a press conference in Srinagar on Triple Talaq Bill, Former Chief Minister of Jammu and...Updated: 2 hours, 5 min ago IST Ghazipur violence shouldn't be linked with law & order situation in UP: Mahesh Sharma New Delhi, Dec 31 (ANI): Union Minister of State for Culture Mahesh Sharma, while talking about the Ghazipur stone pelting incident, said, \"It is...Updated: 2 hours, 37 min ago IST AIADMK continues protest against construction of dam across Cauvery River New Delhi, Dec 31 (ANI): AIADMK MPs continued their protest on Monday against the construction of Mekedatu dam across Cauvery River. The MPs...Updated: 2 hours, 37 min ago IST Lord Hanuman dressed up as Santa Claus in a temple in Gujarat Botad (Gujarat), Dec 31 (ANI): Lord Hanuman was dressed up as Santa Claus at Sarangpur temple. The temple is situated in Gujarat's Botad. The...Updated: 2 hours, 38 min ago IST Kanaka Durga Temple to implement dress code for devotees Vijayawada (AP), Dec 31 (ANI): Come 2019, Kanaka Durga Temple or Indrakeeladri Temple in Vijayawada will see visitors donning uniforms. The temple...Updated: 3 hours, 42 min ago IST UTS Mobile app: Easy ways to get rail tickets भारतीय रेलवे अपने वायदे के मुताबिक़ आपके सफ़र को आरामदायक और झंझट से राहत दिलाने के प्रति कृतसंकल्प है...यूटीएस मोबाइल एप को इंट्रोड्यूस करना उसी की...Updated: 4 hours, 12 min ago IST Sajjan Kumar's surrender will push Jagdish Tytler & <mark>Kamal Nath</mark>'s arrest: Manjinder Sirsa New Delhi, Dec 31 (ANI): Shiromani Akali Dal (SAD) leader Manjinder Singh Sirsa on Monday said that the convict in 1984 anti-Sikh riots, Sajjan...Updated: 4 hours, 13 min ago IST Leaders of Opposition hold meeting in Rajya Sabha New Delhi, Dec 31 (ANI): A meeting was held between leaders of Opposition parties in Rajya Sabha on Monday. The meeting was held in the chamber of...Updated: 4 hours, 19 min ago IST 1984 riots case: Sajjan Kumar expected to surrender today New Delhi, Dec 31 (ANI): The 73-year-old Congress leader, Sajjan Kumar, who was awarded life sentence by the Delhi High Court in a 1984 anti-Sikh...Updated: 4 hours, 58 min ago IST Fire breaks out at cloth factory in Thane Thane (Maharashtra), Dec 31 (ANI): A massive fire broke out in a cloth factory in Bhiwandi city of Maharashtra's Thane district on Monday. No...Updated: 6 hours, 40 min ago IST Security tightened near border areas ahead of New Year Rajouri (J & K), Dec 31 (ANI): Security has been tightened up near border areas ahead of New Year. Security personnel have been deployed at several...Updated: 7 hours, 6 min ago IST Delhi continues to reel under cold waves New Delhi, Dec 31 (ANI): Cold waves intensify in the national capital as the year comes to an end. At India Meteorological Department (IMD), the...Updated: 9 hours, 36 min ago IST Tourists throng Goa ahead of New Year celebrations Panaji (Goa), Dec 31 (ANI): Goa is all set to welcome New Year with extravaganza as tourists thronged various beaches. Both Indian and foreign...Updated: 9 hours, 37 min ago IST Cities light up ahead of New Year celebrations Bengaluru/Mumbai, Dec 31 (ANI): With only a day left for the arrival of New Year, streets of cities like Bengaluru and Mumbai light up with...Updated: 11 hours, 15 min ago IST BJD workers join BJP in presence of Dharmendra Pradhan in Bhubaneswar Bhubaneswar (Odisha), Dec 31 (ANI): Several workers of Biju Janata Dal (BJD) joined the Bharatiya Janata Party (BJP) in Odisha's Bhubaneswar on...Updated: 11 hours, 15 min ago IST Poor couple runs orphanage with funds & donations in Odisha's Kalahandi Kalahandi (Odisha), Dec 31 (ANI): It is rightly said that where there is will there is way. This has been proven by a poor and uneducated couple ...", "articleID": "2018123110_00280711_W", "names": {"Jitendra Singh": ["Q24005532", "Q44749762", "Q6203273", "Q6203277"], "Kamal Nath": ["Q1287413", "Q57327046"]}}, {"date": "2018-12-31", "url": "http://www.thenorthernecho.co.uk/sport/17327961.gooch-signs-sunderland-contract-until-2022/", "content": "Sport Gooch signs Sunderland contract until 2022 By <mark>Paul Fraser</mark> paulfraserecho Chief Football Writer / Golf Writer Gooch signs contract at Sunderland until 2022 0 comment LYNDEN GOOCH has paid tribute to <mark>Jack Ross</mark> for the role the Sunderland manager has played in getting him to sign a new three-and-a-half-year contract. The USA international, who celebrated his 23rdbirthday last week, has put pen to paper on a deal which will extend this stay on Wearside until at least 2022. Gooch has progressed through the ranks at the Stadium of Light since joining six years ago, making his first-team debut in 2015 in the League Cup against Exeter City. He has now become an integral part of the first-team squad, making 57 league appearances in the last three seasons. He has already notched five goals and provided seven assists in League One, making him one of the league's most productive players. Gooch said: \"I am glad to get it all done because the manager has given me a lot of opportunities. He has shown faith in me when I haven't been playing well at times, but I'm delighted to be in this first team and playing because that's the most important thing at my age .\" The club has completely changed since the summer and the manager was a big reason for me wanting to stay. \"He has had a big impact on me this season and given me the license to do what I do best. Hopefully I can continue to show the form I have done in the first-half of the season and help us get promoted .\" Sunderland boss <mark>Ross</mark> said: \"Lynden's contribution to the season has been evident in terms of his form and what he has given us with goals and assists. I hope it is a reflection of how young players see the club, as a platform for them to progress their career .\" Lynden can get to where he wants in the game with us, so we're delighted, and I'm delighted for him because I've forged a close relationship with him in a short period of time. \"His hard work has been rewarded and hopefully now he can be a big part in the club's future as well .\" 0 comment", "articleID": "2018123114_00268525_W", "names": {"Jack Ross": ["Q30600781", "Q3805645", "Q6114913"]}}]