[{"date": "2018-12-31", "url": "http://www.thenorthernecho.co.uk/sport/17327961.gooch-signs-sunderland-contract-until-2022/", "content": "Sport Gooch signs Sunderland contract until 2022 By <mark>Paul Fraser</mark> paulfraserecho Chief Football Writer / Golf Writer Gooch signs contract at Sunderland until 2022 0 comment LYNDEN GOOCH has paid tribute to <mark>Jack Ross</mark> for the role the Sunderland manager has played in getting him to sign a new three-and-a-half-year contract. The USA international, who celebrated his 23rdbirthday last week, has put pen to paper on a deal which will extend this stay on Wearside until at least 2022. Gooch has progressed through the ranks at the Stadium of Light since joining six years ago, making his first-team debut in 2015 in the League Cup against Exeter City. He has now become an integral part of the first-team squad, making 57 league appearances in the last three seasons. He has already notched five goals and provided seven assists in League One, making him one of the league's most productive players. Gooch said: \"I am glad to get it all done because the manager has given me a lot of opportunities. He has shown faith in me when I haven't been playing well at times, but I'm delighted to be in this first team and playing because that's the most important thing at my age .\" The club has completely changed since the summer and the manager was a big reason for me wanting to stay. \"He has had a big impact on me this season and given me the license to do what I do best. Hopefully I can continue to show the form I have done in the first-half of the season and help us get promoted .\" Sunderland boss <mark>Ross</mark> said: \"Lynden's contribution to the season has been evident in terms of his form and what he has given us with goals and assists. I hope it is a reflection of how young players see the club, as a platform for them to progress their career .\" Lynden can get to where he wants in the game with us, so we're delighted, and I'm delighted for him because I've forged a close relationship with him in a short period of time. \"His hard work has been rewarded and hopefully now he can be a big part in the club's future as well .\" 0 comment", "articleID": "2018123114_00268525_W", "names": {"Paul Fraser": ["Q2059630", "Q7150728"]}}, {"date": "2018-12-31", "url": "http://wweek.com/news/state/2018/12/31/dennis-richardson-says-hell-seek-re-election/#disqus_thread", "content": "<mark>Dennis Richardson</mark> says He'll Seek Re-Election Oregon's only Republican statewide officeholder has been battling brain cancer since May. <mark>Dennis Richardson</mark> (Oregon National Guard) Published 1:48 PM Updated 1:48 PM Secretary of State <mark>Dennis Richardson</mark>, Oregon's only Republican statewide officeholder, has been battling brain cancer since May. He's reduced his public schedule to almost nothing and no longer attends meetings of the State Land Board in person. But last week, in a rare interview, <mark>Richardson</mark> told Jim Pasero, publisher of the conservative Oregon Transformation newsletter, he's optimistic about his future and his ability to hold onto a position Democrats covet. \"With God's help, I'll complete this term in office, and with the voters' help, I'll win re-election,\" <mark>Richardson</mark> told Pasero. \"My 2020 campaign engine is fired up and moving forward. In fact, last week, I sent my first fundraising letter for the 2020 election .\" ", "articleID": "2018123122_00544527_W", "names": {"Dennis Richardson": ["Q13572036", "Q5258898", "Q5258899"]}}, {"date": "2019-01-02", "url": "http://www.morningstaronline.co.uk/article/hunt-under-fire-after-report-reveals-kidnapped-women-forced-to-pay-his-department-to-be-rescued", "content": "Lamiat Sabin Wednesday, January 2, 2019 <mark>Hunt</mark> under fire after report reveals kidnapped women forced to pay his department to be rescued Labour's shadow foreign secretary Emily Thornberry demands the Foreign Office scraps the charges and end this \"morally repugnant' situation × You can read 19 more articles this month Please help support the Morning Star by subscribing here UNDER-PRESSURE Foreign Secretary <mark>Jeremy Hunt</mark> said today that he will investigate reports that his department charged British women forced into marriages abroad hundreds of pounds for their own rescue. His declaration followed a Times report revealing that such women have had to either pay for plane tickets, basic food and shelter themselves or, if they are over 18, take out emergency loans with the department. Tottenham Labour MP David Lammy likened the situation to the Windrush scandal as an indication of how Britons from ethnic minority backgrounds are treated by officialdom .\" A white woman who had been kidnapped, sold into slavery and raped would never have been asked to pay for her freedom, \"he said. It is understood that the forced marriage unit, jointly run by the Foreign & Commonwealth Office (FCO) and the Home Office, does not profit from the repatriations. A spokeswoman of the FCO, which claims to be a\" world leader in the fight to tackle the brutal practice of forced marriage, \"said that it has a duty to recover costs paid by public funds. The department helped 27 victims of forced marriage return to Britain in 2017 and 55 the year before, according to figures obtained under freedom of information laws. In the past two years the FCO has lent £ 7,765 to at least eight forced marriage victims who could not pay for repatriation. Debts of more than £ 4,500 are outstanding. Under FCO terms and conditions a surcharge of 10 per cent is added if an emergency loan is not repaid within six months. Last year four young British women sent by their families to a\" correctional school \"in Somalia, where they were imprisoned and physically abused, were charged £ 740 each, The Times said. Left destitute by the loans, two are living in refuges and two have become addicted to drugs since returning to Britain, they told the paper. Shadow foreign secretary Emily Thornberry said the situation is\" morally repugnant \"and accused PM Theresa May and Home Secretary Sajid Javid of\" rank hypocrisy \"given their statements made in the past about tackling forced marriages .\" The Foreign Office must immediately scrap these charges and write off all outstanding debts owed by women brought home in recent years, \"Ms Thornberry said. Mr <mark>Hunt</mark> told BBC Radio 4's Today programme that he wanted to\" get to the bottom \"of the issue .\" Any interventions that I have had on these consular matters, I have always stressed to embassies and posts abroad that they need to use discretion, \"he said. Others liked Sunday 30th Dec 2018 Firefighters slam former Merseyside chief who boasts of proper funding in new Australia role Wednesday 02nd Jan 2019 Veterans' protest outside PTSD treatment centre hit by health scare Tuesday 01st Jan 2019 Millions join\" women's wall' against oppression in Kerala Wednesday 02nd Jan 2019 Australian activists alarmed by Britain's response to refugee boats Friday 28th Dec 2018 An inconvenient truth: the enduring popularity of socialism in the post-Soviet states Join the 501 Club You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by joining the 501 club. Just £ 5 a month gives you the opportunity to win one of 17 prizes, from £ 25 to the £ 501 jackpot. By becoming a 501 Club member you are helping the Morning Star cover its printing, distribution and staff costs--help keep our paper thriving by joining! Join here \"Buy Shares You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by become a member of the People's Printing Press Society. The Morning Star is a readers' co-operative, which means you can become an owner of the paper too by buying shares in the society. Shares are £ 1 each--though unlike capitalist firms, each shareholder has an equal say. Money from shares contributes directly to keep our paper thriving. Some union branches have taken out shares of over £ 500 and individuals over £ 100. Buy here\" Donate to the Fighting Fund You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by donating to the Fighting Fund. The Morning Star is unique, as a lone socialist voice in a sea of corporate media. We offer a platform for those who would otherwise never be listened to, coverage of stories that would otherwise be buried. The rich don't like us, and they don't advertise with us, so we rely on you, our readers and friends. With a regular donation to our monthly Fighting Fund, we can continue to thumb our noses at the fat cats and tell truth to power. Donate today and make a regular contribution. Donate here \"", "articleID": "2019010217_00541368_W", "names": {"Jeremy Hunt": ["Q333533", "Q929730"]}}, {"date": "2019-01-05", "url": "http://www.gamereactor.eu/games/69413/FIFA", "content": "FIFA 18 REVIEW. Written by Ricardo C. Esteves on the 30th of May 2018 at 14 \"The free update isn't quite as good as a game created from the ground up especially for the World Cup, but it comes very close .\" 0 REVIEW. Written by Ricardo C. Esteves on the 29th of September 2017 at 12 \"Unlike FIFA 13 on Wii U, this version of FIFA 18 is far from being a disappointment .\" ESPORTS. Written by <mark>Sam Bishop</mark> on the 20th of August 2018 at 10 Actors and esports pros celebrated the charity initiative. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 17th of August 2018 at 11 He spoke with the British Esports Association recently. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 14th of August 2018 at 10 The digital viewership saw a major increase. 0 ESPORTS. Written by <mark>Mike Holmes</mark> on the 6th of August 2018 at 10 The new FIFA 18 world champ crowned at the O2 in London.", "articleID": "2019010502_00140873_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-01-06", "url": "http://newsok.com/seminars-prove-need-for-education-about-senior-living/article/5619370?custom_click=rss", "content": "NewsOK BrandInsight Connecting local experts and business leaders with the NewsOK audience. What is this? NewsOK BrandInsight provides a place for local organizations and companies to connect directly with the NewsOK audience by publishing sponsored native advertising articles of interest on the NewsOK digital platforms and to participate in the resulting conversation. BrandInsight content is produced by the organizations and included in this special section as a service to NewsOK readers. Read more about BrandInsight here. To learn how to participate in BrandInsight, email us at brand-insight @ opubco.com. Seminars prove need for education about senior living by Eddie Roach Published: Sun, January 6, 2019 1:59 PM Updated: Sun, January 6, 2019 1:59 PM shares email Spanish Cove Retirement Village BrandInsight How to pay for senior living Planning for senior living is vital Spanish Cove can help take the stress out of retirement downsizing Seminar to explore little-known ways to pay for senior living Show More Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] In January 2016, a group of about 40 people made their way to the Northwest Library expecting yet another bland seminar ending in a sales pitch. However, what this group of optimistic, learning-based senior adults experienced was something much different. \"The most surprising thing that happened was actually what didn't happen--a sales pitch,\" said Oliver Delaney. \"There wasn't one .\" \"The presentation was straight forward, highly organized, and candid, offering far more than simply facts and features, added Joy Jones, who at 92 years old said she looks forward to the seminars each month and only missed one last year. Now, three years later, the educational talks known as the Senior Living Truth Series continue to grow. With nearly 200 in attendance each month, a new venue has been added serving homeowners living in the south metro area .\" We chose the Moore-Norman Technology Center as our south location because several residents from Moore, Norman, Mustang, and the Tri-City areas have expressed an interest in attending but prefer not to drive so far north, \"said Chris Buckelew, one of the main organizers of the events. The 2019 calendar includes content designed to help retired\" truth seekers \"gain information about topics that are otherwise hard to research .\" Unfortunately information found on the internet, while a helpful starting point, is often designed to sell and sway opinions. For instance, if you want to learn more about senior living options and you google it, you are bombarded with ads and misinformation from a variety of places. It can be both confusing and frustrating, \"said Nikki Buckelew, the moderator and host of the series .\" The series has been good for attendees who are looking for honest and candid information, \"she said. Regular attendees to the series, Pat and Debra Lynch of Nichols Hills, agree with her .\" We didn't know where to start. After attending the Truth Series, we met with several of the sponsors and toured a number of 55 + communities, \"Pat Lynch said .\" They were all very helpful. Now we feel both informed and equipped to move forward with our plans. \"The Senior Living Truth Series, referred to by organizers as simply SLTS, was inspired by Nikki Buckelew, a veteran real estate broker, after experiencing her own struggle to gather information about local services for seniors .\" It was extremely difficult for me, and I feel I am personally pretty tech savvy, \"Buckelew said .\" I came across other professionals who felt the same way and who wanted to help make getting information easier and less intimidating. Many became sponsors and ambassadors of the series. It's a group effort. \"While the series is the result of a team effort, sponsors point to Buckelew's signature presentation style as integral in the overall growth of the program .\" Nikki doesn't hold back. She tells it like it is and ensures that everyone involved does the same. There is no gray area. It's either complete truth or nothing to be said at all, \"said <mark>Julie Davis</mark>, marketing director for Concordia Life Care Community. Sponsors and panelists are held to strict standards. They are required to participate in pre-event orientations and regular seminar debriefings. They sign off on agreements about standards of conduct .\" I believe in education, \"said Jill Huff, marketing director at Spanish Cove Retirement Village .\" My goal at Spanish Cove is to educate everyone I talk to and to help them find the option that's right for them. Sponsors of SLTS are not allowed to sell at the seminars. Since this method of education aligns with our values and goals, it just makes sense to support SLTS. \"It isn't surprising that the seminars tend to differ from the traditional approach. Buckelew, a long-time Oklahoma real estate agent specializing in retirement moves, also holds a degree from Southern Nazarene University in gerontology and recently completed her doctorate in psychology from Northcentral University .\" I chose to get a doctorate to deepen my understanding of the issues our clients face, \"Buckelew said .\" As I found myself having more conversations with people making tough decisions late in life, I set out to gain knowledge that would empower and equip those I serve. The best way for me to do that is through offering free public seminars. \"January's topic is\" The Truth about Retirement Communities. \"Here attendees will get an inside perspective about various senior living options, as well as best practices for touring, selecting, and moving to a senior living community .\" While we have done similar talks to this one before, on January 10 and January 22 we are going to really dive deep into the world of senior living, debunk some myths, and expose some little known truths about the industry, \"Buckelew said. Both sessions begin at 10 a.m. Future monthly topics include dealing with legal and financial issues, healthcare, estate liquidation, and downsizing, among others. Pre-registration is required to attend due to limited seating and can be done online at seniorlivingtruthseries.com or by calling 405-563-7501. This article is sponsored by Concordia Life Care Community and Spanish Cove Retirement Village. Related Photos Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] <figure> <img src =\" / / cdn2. newsok. biz/cache/r960-e 0e83038f6bac5de52c47e4c993d4e77. jpg \"alt =\" Photo - Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] \"title =\" Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] \"> <figcaption> Nikki Buckelew is moderator and host of the Senior Living Truth Series. [PHOTO PROVIDED] </ figcaption> </ figure> Eddie Roach Read more' Spanish Cove Retirement Village Spanish Cove is an adult senior retirement community located in the metropolitan Oklahoma City area, in the suburb of Yukon. We are a Continuing Care Retirement Community (or\" CCRC, \"sometimes known as a\" Continuum of Care Retirement Community \"), offering amenities and programs for every phase of retirement, from independent living to home health care, skilled nursing, assisted living, and nursing care. Residents enjoy a lifestyle that is maintenance-free and carefully customized to meet the needs of each individual. Read more' NewsOK BrandInsight provides a place for local organizations and companies to connect directly with the NewsOK audience by publishing articles of interest on the NewsOK digital platforms in a special section. Comments Comments Seminars prove need for education about senior living × Commenting on NewsOK requires a NewsOK Pro or Oklahoman subscription. Log in or subscribe to read and leave comments.", "articleID": "2019010620_00561565_W", "names": {"Julie Davis": ["Q1712168", "Q5954191"]}}, {"date": "2019-01-08", "url": "https://www.commondreams.org/views/2019/01/08/instead-ending-shutdown-senators-plan-encourage-punishment-israel-boycotts?cd-origin=rss", "content": "In the middle of a government shutdown, the Senate leadership's first order of business in the 116th Congress is not legislation to reopen the government. Instead, and incredibly, the Senate is again trying to slip a measure intended to suppress protected political expression past public scrutiny. The bill is the \"Combatting BDS Act,\" which would express federal approval of state laws that place restrictions on boycotts of Israel and its settlements, as part of an effort to weaken the Boycott, Divestment, and Sanctions (BDS) movement against Israel. The bill is included in S. 1, which the Senate plans to vote on this week. On Monday, the ACLU sent a letter to senators expressing opposition to the bill. To their credit, Sens. Ben Cardin (D-Md .), Chris Van Hollen (D-Md .), and Bernie Sanders (D-Vt .) have urged the Senate not to consider any bills, other than those that would reopen the government, until the shutdown ends. We agree. The Combatting BDS Act represents yet another covert attempt by the Senate to enact legislation that would burden fundamental free expression rights without proper consideration on the heels of a failed attempt last month to pass a different law criminalizing boycotts of Israel. But moreover, voting on it now, amid a partial government shutdown, would be, as Sen. Cardin noted, \"a fundamental failure to govern .\" The Combating BDS Act would attempt to give legal cover to states that enact laws penalizing businesses and individuals who participate in boycott activities against Israel and Israeli-controlled territories. The Combating BDS Act would attempt to give legal cover to states that enact laws penalizing businesses and individuals who participate in boycott activities against Israel and Israeli-controlled territories. These state laws, dozens of which exist in many different forms, generally compel state contractors and any entity in which the state invests--for example, through a state-run pension, retirement, or endowment fund--to sign oaths promising not to boycott Israel as a requirement of maintaining their relationship with the state. However, as courts found in the McCarthy era, the government can't fire its employees or contractors just because they refuse to sign an oath promising not to engage in disfavored expression or association. And two federal courts have already held state requirements to swear not to participate in boycotts of Israel be unconstitutional. While we take no position on Israel boycotts, the BDS movement or the Israeli-Palestinian conflict, we do maintain that states should not be sanctioning businesses on the basis of First Amendment-protected expression and association. We have consistently--and successfully--argued this position in situations where government entities have threatened to boycott a company based upon its constitutionally protected speech and associational choices. This is especially true where the ideological position has no connection whatsoever with the business relationship at stake. Math teachers in Kansas and newspapers in Arkansas should not have to disavow participation in protected expression and association in order to do their jobs or engage in business relationships with the state. With the Combatting BDS Act, Congress would be approving state laws imposing such unconstitutional requirements. On Monday, Sen. <mark>Marc Rubio</mark> (R-Fla .), the lead sponsor of the bill, tweeted: This is a lie. My bill doesn't punish any political activity. It protects the right of local & state govts that decide to no longer do business with those who boycott #Israel. So boycotting #Israel is a constitutional right, but boycotting those participating in #BDS isn't? https: //t.co/kY9MSmBkkh--Marco Rubio (@ marcorubio) January 7, 2019 However, as we responded, the government, under the Constitution, does not have the right to punish people for their views. The First Amendment protects the people, not the government. Even setting aside our fundamental disagreement about the wisdom of the Combatting BDS Act, it is abundantly clear that the Senate should not be considering this legislation, or any other legislation, until it fulfills its first duty: maintaining a functioning government. The Senate should vote first to open the government and alleviate the pain of this interminable shutdown that disrupts people's lives and livelihoods every second that it continues.", "articleID": "2019010818_00559664_W", "names": {"Marc Rubio": ["Q57610577", "Q5995382"]}}, {"date": "2019-01-09", "url": "https://www.npr.org/2019/01/09/683552107/eu-group-blasts-harmful-white-house-approach-to-trans-atlantic-relations?utm_medium=RSS&utm_campaign=national", "content": "Europe EU Group Blasts \"Harmful' White House Approach To Trans-Atlantic Relations Facebook Twitter Flipboard Email January 9, 2019 3:00 PM ET Daniella Cheslow Enlarge this image <mark>David O'Sullivan</mark>, who heads the EU Mission to Washington, D.C., speaks in Brussels in February 2014. Yves Logghe/AP hide caption toggle caption Yves Logghe/AP <mark>David O'Sullivan</mark>, who heads the EU Mission to Washington, D.C., speaks in Brussels in February 2014. Yves Logghe/AP A European Union legislative group has sent a letter of protest to members of the U.S. Congress blasting\" the increasingly harmful approach from the White House \"to relations across the Atlantic. The letter came after news reports revealed that the State Department had quietly downgraded the status of the EU's Mission to the U.S., making it an international organization, rather than a national delegation. The EU's ambassador in Washington, <mark>David O'Sullivan</mark>, was not notified of the change in status, but he did notice that he hadn't been invited to certain affairs in recent weeks, the German broadcaster Deutsche Welle reports. It became apparent at the state funeral of the late President George H.W. Bush in December 2018. Prior to the change, <mark>O'Sullivan</mark> would have been among the first 20 or 30 ambassadors to be called up, in line with his seniority as a diplomat serving since 2014. DW reports he was called up last .\" This is no way to treat partners, \"the letter notes .\" Such moves play into the hands of rival global powers and can only lead to greater fragmentation rather than much needed increased cooperation. \"National Security\" They Conveniently Forgot To Notify Us': EU Diplomat Downgraded In D.C.. The letter was signed by European Parliament members Christian Ehler of Germany, Jeppe Kofod of Denmark and Marietje Schaake of the Netherlands. They are the chair and two vice chairs, respectively, of the parliament's Delegation for Relations with the United States of America. \"We've seen a series of very, very confrontational and frankly insulting...approaches from the Trump administration,\" Schaake tells NPR. \"And now on top of that, the status of the EU delegation in Washington has suddenly been downgraded without the EU even being informed ....That really puts the EU last in line, behind all other countries. And I think it is absolutely necessary that the new Congress speaks out against this .\" Schaake says she has written to Congress on subjects such as net neutrality, but this is the first time the three delegation leaders have issued a joint appeal to U.S. lawmakers. She says the letter was sent to newly minted House Speaker Nancy Pelosi, D-Calif ., as well as every other member of Congress. Pelosi's office did not respond to NPR's request for an interview. The U.S. State Department also did not respond to requests for comment. Relations between the EU and the U.S. have been strained during President Trump's term in office. Europe Trump's Criticisms Of NATO Not Apparent As It Holds Largest War Games Since Cold War Brussels has bristled over U.S. tariffs on European exports, slapping retaliatory duties on American motorcycles, bourbon and other goods. The White House has withdrawn from the Iran nuclear deal, which the EU remains committed to, and has announced that the U.S. plans to pull out of the Paris climate agreement. At a NATO summit in July 2018, Trump berated European countries for not spending more on their military defense--although the U.S. recently participated in the largest war games with NATO since the Cold War, as NPR has reported. Some European countries are trying to bolster ties with the U.S.. In October, Germany announced a year-long initiative called Wunderbar Together that will feature about 1,000 events in all 50 U.S. states. In launching the program, Germany appealed to the heavens--summoning a greeting from the first German commander of the International Space Station, Alexander Gerst, who said, \"A strong relationship between both sides of the Atlantic is fundamental for successful cooperation--be it on Earth or in space .\" Schaake of the European Parliament says she sees the relationship between her bloc and the U.S. as \"a relationship ending badly .\" \"The EU still believes we should stay together but the U.S. partner is, you know, maybe looking around elsewhere,\" she says. \"I wish the Trump administration could see that a strong transatlantic relationship is in the American self-interest .\" Ambassador <mark>O'Sullivan</mark> has not publicly commented on his downgraded status. His Twitter account still refers to him as the EU's ambassador to the United States, though technically the State Department now considers him the head of a delegation. Recently, <mark>O'Sullivan</mark> tweeted about how the U.S. is the largest supplier of soy beans to the EU. And he pointed to a report that his bloc is stable: \"Happy to note we are very much alive and kicking in 2019!\" NPR International Affairs Correspondent Jackie Northam contributed to this report. Marietje Schaake <mark>David O'Sullivan</mark> European Union Congress Facebook Twitter Flipboard Email", "articleID": "2019010920_00491250_W", "names": {"David O'Sullivan": ["Q3018548", "Q5238159", "Q5238161", "Q5238163"]}}, {"date": "2019-01-11", "url": "http://www.advertiser-tribune.com/news/local-news/2019/01/landfill-stink-residents-voice-odor-concerns/", "content": "Landfill stink: Residents voice odor concerns Staff Writer vjohnson @ advertiser-tribune.com PHOTO BY VICKI JOHNSON Workers in trucks and heavy equipment work on a hill at the landfill. Odor emanating from Sunny Farms Landfill is causing a stink. Area residents are concerned about the smell and the effect hydrogen sulfide gas may be having on their health, and the company that owns the landfill has begun putting together new measures to control the gas. Hydrogen sulfide is the byproduct of the decomposition of construction materials, which is the main waste product that goes into the landfill. Specifically, the company said the gypsum in wall board gives off the gas as it decomposes, which is similar to the smell of rotten eggs. Because of the ongoing issue, a group of residents--the Greater Fostoria Environmental Coalition--is making its concerns known to public officials. At its December meeting, the Seneca County General Health District health board was to vote on renewing the operating license of Sunny Farms Landfill, a Tunnel Hill Partner, 12500 W. CR 18, Fostoria. However, at least 80 residents crowded the meeting room, spilling into the hallway, to voice their opposition to renewing the license, said Tim Wasserman, director of Ottawa Sandusky Seneca Joint Solid Waste District. Wasserman said he attended the meeting because the OSS district works with the health department, providing funds for landfill inspections. He said OSS has no regulatory authority, but receives funding based on the waste that goes into the landfill. Wasserman said <mark>Jim Young</mark>, the health board chairman, tried to give everybody an opportunity to speak about their concerns. \"They were even in the hallway,\" Wasserman said. \"He just realized this wasn't the best way to accomplish what they wanted to do .\" The vote was postponed. The health department has scheduled a public meeting for 6 p.m. Jan. 30 at Fostoria High School to collect input from the public and other agencies. \"The odor has been significantly worse the last few months,\" Wasserman said. \"We have gotten calls. I think the people are frustrated that they're not getting answers and that they haven't been heard .\" He said the OSS office refers calls to the Ohio Environmental Protection Agency's odor hotline. \"We have no regulatory authority,\" Wasserman said. \"We provide funding to the Seneca County Health Department for inspection of the facility as part of the allowable use of our money .\" He said funding me meant to provide inspection and enforcement to ensure the facility is following the rules. The health department and Ohio EPA work together to provide inspections. \"Basically, our only role is a good part of our funding comes from the tipping fees that are paid by the facility,\" he said. However, Wasserman said there's an ongoing issue between OSS and the company regarding classification of materials going into the landfill. \"There have been issues since 2004 or 2005 and a consent order in 2008,\" he said. The company is required to take photos of each load of material that arrives to determine if it's solid waste or construction materials. Wasserman said the two classifications have different requirements. \"We've lost a significant amount of revenue because of it to the point where it's having a significant effect on our budget,\" Wasserman said. He said the matter has not been finalized by Ohio EPA. \"In the meantime, we disagree with how they're classifying, but EPA has never finalized the dispute resolution process,\" he said. Wasserman said there is new management at the landfill, and he hopes the issue will be resolved. Back to the odor issue, Wasserman said he gives the health department credit for putting together the meeting. \"The meeting will be a good opportunity to provide everyone with the facts so there isn't this doubt about what's going on,\" he said. \"If everybody's there, they can get answers to their questions .\" The residents' perspective The six members of the Greater Fostoria Environmental Coalition have taken on the task of getting answers for everyone who suffers from the hydrogen sulfide smell, said Nate Heiser, one of the members. He said the other members are Doug Lear, Myra Spires, Lori Wolph, <mark>Nick</mark> VanGiesen and <mark>Nick Buchanan</mark>. Heiser said the group discovered the health board was going to vote on license renewal and decided to attend the meeting. \"We didn't want a renewal without knowing things were going to be corrected,\" Lear said. \"You can smell the issue,\" Heiser said. \"We needed to make sure our voices were being heard .\" \"What it came down to is a lot of us knew there were certain corrections that were supposed to be made in the past,\" Lear said. \"We want our questions answered from Seneca County Health Department, Ohio EPA and so on, and that it's been extremely hard to get these questions answered .\" It's not only the odor that is causing concern, Heiser said. \"Two or three years ago it was a nuisance once in a while,\" he said. \"Now it's affecting our quality of life .\" Heiser and Lear said the problem has gotten worse during the past year. They have suffered headaches, burning eyes and sore throats when the odor is at its worst, and they have received reports from many other people who say they have been physically affected in similar ways. They said it's not only Fostoria that's affected. People in Arcadia, Bascom and many other areas have been commenting on the group's Facebook page--Sunny Farms Landfill Complaint Group. Because of past violations by the landfill company, Lear said the group is concerned about the environmental impact the landfill is having on soil and water as well as air quality. \"We want multiple testing done,\" Lear said. \"Water, soil and sediment, air, not just wells as it's been in the past. He said toxins already could be in topsoil and surface water and it could take many years to get into the ground water. At the Jan. 30 meeting, Heiser said the group wants to\" do a question and answer session \"with landfill representatives, Ohio EPA, the health department, Seneca County commissioners and Fostoria administrators .\" We're going to ask the tough questions, \"he said .\" Enough is enough. \"In the interim, the coalition is attending public meetings such as the county commissioners, Fostoria city council and township trustees .\" We had a meeting with (Rep.) Bill Reineke (Wednesday), \"Heiser said .\" He said he's going to make this his No. 1 issue. \"The company's perspective\" We are working to address concerns about odors at Sunny Farms, \"said Matt Neeley, vice president of operations for Tunnel Hill. He said he's been working for Tunnel Hill since February 2018, and has worked in the waste industry for 35 years .\" We recognized several months ago that we needed to improve our gas collection and treatment system, \"Neeley said .\" We started a process where we went out and took a look at what technologies were available. \"Neeley said gases are formed by decomposing waste material, and the gypsum in wallboard breaks down into hydrogen sulfide .\" It's detectable in really minute quantities, \"he said. A lot of factors affect hydrogen sulfide odor, he said, such as wind direction, temperature, atmospheric conditions .\" We actually ordered the system back in October, \"he said .\" It's being installed onsite currently. We turned on the first phase of it the first week in January, and we are going to expand that system. \"Neeley said it's too soon to tell if the system is working better .\" It's been a week, \"he said .\" It's hard to tell. \"Ben Nutter, regional sales manager, said he has worked for the company since 2013. He said past gas control was a system that burned off gas with flares .\" As the company created a new cell, they were producing a lot more gas and started putting a plan in place, \"he said .\" We wanted to make sure we got the right system. The pieces are coming together. \"In the new system, Neeley said the company drills wells into the landfill and draws gases into vertical and horizontal collectors .\" And then we have a network of pipes that are connected to the extraction devices, \"he said .\" So we are able to suck the gases out of the landfill and create negative pressure. \"In addition to the new, more sophisticated, system which pipes gas to the flares, Neeley said the company is placing a geomembrane cover over 20 acres of the facility this spring or summer. He said the company plans to present the plan to Ohio EPA next week, and he's confident it will be approved. Later this year, he said more well and collectors are to be added to more areas of the landfill .\" That work is also going to be started in the first quarter and we'll be doing that continuously through fall, \"he said .\" The long-term fix is that we are improving our gas collection system, adding in a hydrogen sulfide treatment system, and we think the addition of these systems will result in improved control of natural gasses at the site, \"Neeley said .\" We're not oblivious, \"Nutter said .\" We not only monitor our gas, but we have monitoring wells for ground water. \"He said monitored information is provided to the health department and EPA .\" We are working hard to address the community concerns about odors at Sunny Farms and we regularly check the odors in the landfill and outside of the landfill every day, \"Neeley said .\" When we receive a complaint, we go out and investigate to find out where the odor is and if it's coming from the landfill. If we find the source, we'll maximize our gas collection system and provide additional cover or take whatever measure we can at the site. \"\"We're investing a lot of resources to make sure that happens,\" Nutter said. \"In the years since I've worked here, this new management team is the most aggressive we've had. They're not going to stop, and will continue to put resources toward this issue .\" ", "articleID": "2019011106_00145223_W", "names": {"Jim Young": ["Q55436204", "Q6199064", "Q6199066", "Q6199069"], "Nick Buchanan": ["Q28043413", "Q7026824"]}}]