[{"date": "2019-01-11", "url": "http://feeds.businessinsider.com.au/~/591710770/0/businessinsideraustralia~of-the-weirdest-facts-you-didnt-know-about-the-Real-Housewives-franchises", "content": "17 of the weirdest facts you didn't know about the \"Real Housewives' franchises Louis Baragona Bravo\" Real Housewives of Miami .' The \"Real Housewives\" franchise make up some of Bravo's most popular shows, spanning from New York to <mark>Beverly Hills</mark> and beyond. What goes on behind the scenes may be even more dramatic than what you see on television. These are 17 things you probably didn't know about the \"Real Housewives\" franchise. From the outside, Bravo's \"Real Housewives\" appears ultra-glam. There are luxurious trips, fancy cars, and designer clothes, all appearing among drama-packed feuds as well as silly, meme-worthy moments. Sometimes, it's hard to know what exactly is real about the popular reality show. Are those phone calls happening in real time? Is the drama organic? These 17 strange, little-known facts prove that sometimes the truth behind the glamorous world of reality television is much stranger than fiction--and the lines between the two are often blurry. The \"Real Housewives\" franchise isn't limited just to the United States. Slice \"Real Housewives of Vancouver .' Though the show has seen hundreds of wives in its iterations across the country, spanning from <mark>Beverly Hills</mark> and Orange County to New York and New Jersey, those aren't the only wives on TV screens. International versions of the show, including\" Real Housewives of Vancouver, \"\"Real Housewives of Athens,\" and \"Real Housewives of Israel,\" are broadcast in their respective countries. Vicki Gunvalson is the first (and longest-running) housewife in the original franchises. Gunvalson was a member of the original \"Real Housewives of Orange County\" cast, which made up the very first version of the show. Over nearly 13 years, fans have seen Gunvalson in just about any and every situation, from screaming about \"never having been with multiple partners\" on a ski slope to screaming about being forced to ride in a \"family van\" to the airport. \"Real Housewives of Atlanta\" scores the highest ratings most consistently. Bravo Nene Leakes on \"Real Housewives of Atlanta .' The wives of Atlanta tend to garner the most consistent ratings. Nene Leakes was, at one point, considered the\" highest rated \"castmate in the franchise. At its peak,\" RHOA \"captured an audience of nearly 4 million live viewers. Recently, though,\" Real Housewives of Orange County \"came out on top in terms of ratings. Currently, it's the most-watched version of the series. Bethenny Frankel may be a millionaire now, but she made way less her first season. Rodin Eckenroth/Getty Images Bethenny Frankel. Bethenny Frankel is known as one of the show's biggest breakout stars, having used her fame to create major wealth for herself and her business, SkinnyGirl Cocktails. In 2015, Frankel told INSIDER she made only $US7,250 total for her first season as a castmate on the show. The first castmate to ever throw a glass of wine was Tamra Judge. Bravo The moment the wine was thrown. Wine throwing has become a\" Real Housewives \"signature move, all thanks to the originator of the action:\" Real Housewives of Orange County \"star, Tamra Judge. At the time, Judge was fighting with a former cast member, Jeana Keough, and threatening her with a\" cyst and deceased. \"After things got heated, Judge threw red wine in Keough's face. Eventually, Judge apologised. Since then, Brandi Glanville, Danielle Staub, and many other wives have taken to chucking vino during heated arguments. And the first wife to ever walk off a reunion was Ramona Singer. Reunion walk-offs have become par for the course, with wives bolting due to sadness, anger, or just for dramatic effect .\" Real Housewives of New York \"castmate Ramona Singer was the first to walk off at a reunion, simply because she didn't want to continue the conversation. As the rest of the cast discussed fellow wife Alex McCord's nude photos, Singer made her exit. At the time, she said she had to use the restroom, but it was later revealed Singer was uncomfortable with the racy subject manner and the possibility of her daughter being somehow affected by the topic. Cast members have claimed that some on-camera phone calls are staged. Bravo Teresa Guidice on\" Real Housewives of New Jersey .' According to the aforementioned McCord, scenes in which the shows' stars are using the phone are usually doctored. According to accounts, producers will instruct castmates to call each other at pivotal moments of high emotion, usually when the timing is ripe for drama. And those dining scenes can apparently be filmed during very weird hours. Bravo \"The Real Housewives of Orange County .' Turns out\" Real Housewives \"stars don't eat in the emptiest restaurants in their respective cities. Instead, McCord revealed, producers arrange for the stars to eat at off-peak hours in restaurants. Why? The answer is surprisingly technical. A crowded restaurant means more people could end up on film. For people to appear on television, they must sign release forms. The more people there are in a restaurant, the more releases production is responsible for procuring. To avoid losing track of all the extra paperwork, production asks the wives to eat meals before or after typical times. For example, the cast might grab lunch at 10:00 a.m. as opposed to noon. Reunions take a ton of time to film. Bravo\" Real Housewives of Atlanta' reunion. Reunions typically air in two-to-three-part specials, all broken up into around an hour per special episode. Filming the reunion actually takes up to twelve hours, according to E! Online. The idea for \"Real Housewives\" came from a not-so-real television show. ABC \"Desperate Housewives .' According to former\" Real Housewives of Orange County \"cast member Gretchen Rossi, the inspiration behind the franchise was the fictional television drama\" Desperate Housewives. \"\"[Desperate Housewives] inspired the\" Real Housewives' franchise, \"Rossi told Hollywood.com in 2012 .\" Honestly, I feel I owe a lot to [\"Desperate Housewives\" creator Marc Cherry] for creating a show that inspired a real-life version. One of the show's greatest villains may have paid for his spot on the series. Bravo Slade Smiley and Gretchen Rossi. Slade Smiley was known for dating multiple members of the \"Real Housewives of Orange County\" cast, but Smiley's role on the Bravo show may have started with a $US2,500 donation. According to then-girlfriend Jo De La Rosa, he paid $US2,500 in a charity auction for the prize of landing a small part on an unnamed reality show. Eventually, Smiley and Rosa ended up on the cast of \"RHOC .\" \"It was something that he wanted to do, we were engaged and as corny as it sounds, I did it for love,\" Rosa said on the 100th episode anniversary special. Smiley went on to date another wife, Gretchen Rossi, with whom he's now expecting a child. The two are no longer on the show. \"Real Housewives of New Jersey\" has a strange connection to a Jonas Brother. In 2014, Former \"Real Housewives of New Jersey\" star Kathy Wakile enlisted the help of Kevin Jonas to build her New Jersey mansion. Jonas served as the contractor for the project, and runs his own business based out of the state. \"Kevin has an extensive knowledge of home automation and electronic features for the home,\" Wakile said. The shows apparently weren't always going to be known as \"Real Housewives .\" Flickr/Tony Hisgett <mark>Beverly Hills</mark>. According to a lawsuit filed against Bravo, the original idea for \"Real Housewives of Orange County\" was a show allegedly called \"Behind the Gates .\" The title came from the gates surrounding Coto de Caza, a private neighbourhood in Orange County, California, where some of the cast lives. For its part, \"Real Housewives of New York\" was allegedly going to be known as \"Manhattan Mums\" when it first came to development in 2007, according to Alex McCord. Teresa Giudice served her prison sentence in a location that may sound familiar. In 2015, \"Real Housewives of New Jersey\" breakout star Teresa Giudice was sentenced to serve a 15-month stint at Danbury, a correctional institution in Danbury, Connecticut. The prison was the inspiration for the facility featured in \"Orange Is the New Black .\" According to a former cast member, Housewives sign contracts to prevent them from suing each other. Bravo It is in their Bravo contract not to sue each other, according to a former cast member. \"Real Housewives of New York\" cast member Carole Radziwell said in 2014 that she was unable to sue fellow \"RHONY\" star Aviva Drescher for accusing her of using a ghostwriter on her book because she had signed away the right. \"There were people who were saying,\" Why don't you sue?' It's not an easy answer, \"Radziwell told BuzzFeed .\" There were several reasons. One is we sign contracts, so we can't sue each other. So you'd have to break the Bravo contract. \"Wives are able to sue, according to Radziwell, but only if they're willing to break a contract with the network. In her case, Radziwell said she didn't want to take on Bravo. Housewives are reportedly instructed not to discuss being on the show while they're on the show. Bravo Lisa Vanderpump in a confessional. In 2014, Radziwell also told BuzzFeed that she was unable to refer to any behind-the-scenes or production-based incidents that might break the fourth wall .\" We can't say that on the show because it refers to the show, \"Radziwell said. Instead, confessionals are filmed in the present tense, with the women discussing events that likely happened months ago, sitting in rooms designed to look like their homes, according to former\" Real Housewives of New York \"castmate Aviva Drescher. Aviva Drescher alleged that wives who bring the drama are rewarded. Bravo Drescher and her prosthetic leg. Drescher appeared on two seasons of\" RHONY \"and was known for her feuds with several castmates, which culminated in Drescher throwing her prosthetic leg during a finale episode. In explaining herself, Drescher revealed that producers reward castmates who stir things up. According to Drescher, she was given an eight-week contract and told that, if she\" delivered drama \"during that time, her contract would be extended. Drescher accused the aforementioned Radziwell of hiring a ghostwriter, and according to Drescher, her contract was extended. Visit INSIDER's homepage for more. NOW WATCH: Briefing videos", "articleID": "2019011123_01065540_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}, {"date": "2019-01-12", "url": "http://kron4.com/news/national/jayme-closs-was-missing-for-3-months-her-hometown-never-gave-up-hope/1699089025", "content": "Jayme Closs was missing for 3 months. Her hometown never gave up hope Jayme Closs was missing for 3 months. Her hometown never gave up hope By: Posted: Jan 12, 2019 07:49 AM PST Updated: Jan 12, 2019 07:49 AM PST Jayme Closs was missing for 3 months. Her hometown never gave up hope Video (CNN)--On Friday, the signs changed in Barron, Wisconsin, from \"Pray for Jayme\" to \"Welcome Home Jayme .\" People in the town of about 3,400 people celebrated the best news they could imagine: Jayme Closs, 13, had been found, three months after she went missing from a bloody crime scene. \"There's so much love and hugs in our district today,\" Diane Tremblay, the administrator for Wisconsin's Barron County School District, said Friday at a news conference. \"Jayme has been found safe and reunited with her family and friends. There is truly nothing in the world better than that .\" \"Jayme: Aunt Jen can't wait to give you that big hug and hold you tight,\" <mark>Jennifer Smith</mark>, Jayme's aunt and godmother, told CNN affiliate WCCO, \"because we're not going to let you go .\" In a nightmare scenario, law enforcement authorities received a 911 call October 15 and went to a country home where Jayme lived with her parents. James Closs, 56, and Denise Closs, 46, were found shot to death. Their daughter, Jayme, was nowhere to be found. She was 5 feet tall and weighed 100 pounds. Authorities said they had no idea who killed her parents or what happened to the teen. Two days after the killings, Barron County Sheriff Chris Fitzgerald told reporters, \"I'll be honest. I'm struggling with this because I don't have some of those answers that I want to give you .\" \\ A small town comes together Despite the lack of clues, law enforcement kept searching. And the people of Barron never gave up hope, proving that in ways symbolic and practical. They helped look for Jayme. On October 22, a week after her disappearance, 2,000 volunteers showed up to assist law enforcement in a search of the countryside. That crowd was the equivalent of two-thirds of the population of Barron. Timeline of Jayme Closs case They congregated to share their hopes and fears. The same day as the search, people poured into the Barron High School football stadium for \"A Gathering of Hope,\" an event to honor Jayme. <mark>Smith</mark>, Jayme's aunt, put out a message to the girl: \"Jayme, we need you here with us to fill that hole we have in our hearts. We all love you to the moon and back. And we will never stop looking for you ....Your dog, Molly, is waiting for you. She's sleeping in one of your sweatshirts .\" A reward of $25,000 was offered, and it soon grew to $50,000. Signs popped up with messages of faith and hope: \"Bring Jayme Home\" and \"We Are Praying For Jayme .\" As the Christmas season arrived, the missing teen was not forgotten. A \"Tree of Hope\" for Jayme was put up at a middle school. The Barron County Clerk of Courts Office dedicated its Christmas tree in the justice center to her. The tree was decorated with green bulbs and ribbons--green being the color often used to raise awareness for missing children. \"Jayme is safe' Jayme was discovered walking alone Thursday afternoon two counties to the north, outside the rural community of Gordon, authorities said. Her accused abductor--<mark>Jake Thomas</mark> Patterson, 21, of Gordon--was arrested shortly afterward, when a law enforcement officer pulled him over in a vehicle after neighbors called 911 to report Jayme's emergence, authorities said. Investigators now believe Patterson shot Jayme's parents and abducted Jayme, and that it appears he went there with the precise intention of taking the girl, Fitzgerald said. He'd apparently kept her inside his house for months. Authorities didn't say how she escaped or provide a motive. Fitzgerald finally was able to deliver a happy message at a news conference Friday, .\" For 88 days I have said we would work tirelessly to bring Jayme Closs home. We have done just that, \"he said .\" Jayme is safe. \"CNN's Faith Karimi, Jason Hanna, Meg Wagner, Brian Ries, Amanda Wills and Veronica Rocha contributed to this report.", "articleID": "2019011216_00013169_W", "names": {"Jake Thomas": ["Q17182107", "Q380180", "Q58828193"], "Jennifer Smith": ["Q10306654", "Q14322421", "Q3177108", "Q3177109"]}}, {"date": "2019-01-12", "url": "http://www.wirralglobe.co.uk/sport/national/17354137.hodgson-hurting-after-palace-pipped-by-watford/", "content": "Crystal Palace v Grimsby Town--Emirates FA Cup--Third Round--Selhurst Park 0 comments Roy Hodgson rued Crystal Palace's missed opportunities after Watford fought from behind to secure a 2-1 victory at Selhurst Park. Hornets defender Craig Cathcart scored at either end, before Tom Cleverley sealed all three points for the visitors with a fine volley just six minutes after coming on as a substitute. The win moved Watford back above West Ham in the table, after their earlier victory against Arsenal. Palace they will be looking over their shoulder once more despite heading into Saturday's fixture hoping for a third consecutive win. \"Of course it hurts,\" said Hodgson. \"It is tough to lose any game, tough to lose at home, and it is even tougher because we have done well lately .\" I hoped this would provide the chance to get that elusive third consecutive victory to lift us to a more comfortable place in the table, and I am feeling very sad that we couldn't do it. \"But, if you want to win games, you need to take the chances that come your way .\" Cathcart's own goal, following a goalmouth scramble, afforded Palace the lead heading into the interval, and the hosts had chances to put the game to bed. Wilfried Zaha, who now has not scored or laid on an assist in 13 matches, was probably the most culpable, after hitting <mark>Ben Foster</mark>'s out-stretched leg, and then blazing high and wide after neat footwork in Watford's box early on in the second period. Palace's scoring troubles are well-documented, with just six goals to their name at home this season, and only four from open play. \"We started the second half brightly, and we had the opportunities to increase our lead which would have made life very difficult for Watford, but we were not as effective as them,\" Hodgson added. Watford stemmed Palace's speedy second-half start and were back on level terms after 67 minutes when Cathcart made amends for putting through his own net after leaping above <mark>James Tomkins</mark> and heading home Jose Holebas' corner. Seconds later, Cleverley was introduced, and within six minutes the game turned on its head following his fine volley. The former Manchester United and Everton midfielder has only recently returned from a near year-long injury lay-off. His appearance here at Selhurst Park was just his fourth in the Premier League this season. Watford have now won 16 points away from Vicarage Road which is a greater haul than they managed on the road throughout the entirety of their last campaign. \"I am proud of all my players, not only for today but other games where we have competed well, with good and bad results, but always kept a good level,\" said boss Javi Gracia. \"After the own goal it was more difficult for us, but in that moment the team showed character, ambition .\" Tom scored an amazing goal, and to be able to turn the result around was important. \"0 comments", "articleID": "2019011219_00105352_W", "names": {"Ben Foster": ["Q10585", "Q2895425", "Q311804", "Q4885664"], "James Tomkins": ["Q1681200", "Q1681210"]}}, {"date": "2019-01-13", "url": "https://www.breitbart.com/news/trump-says-us-will-hurt-turkey-economically-if-it-hits-kurds/", "content": "WASHINGTON (AP)--President Donald Trump warned Sunday that if Turkey attacks U.S.-backed Kurdish forces in Syria, the United States will \"devastate Turkey economically .\" Trump's decision to pull American troops out of Syria has left the United States' Kurdish allies vulnerable to an attack from Turkey. Ankara views the Kurdish forces as terrorists aligned with insurgents inside Turkey. In a tweet, Trump also warned the Kurdish forces not to \"provoke Turkey .\" The U.S. withdrawal has begun with shipments of military equipment, U.S. defense officials said. But in coming weeks, the contingent of about 2,000 troops is expected to depart even as the White House says it will keep pressure on the IS network. Once the troops are gone, the U.S. will have ended three years of organizing, arming, advising and providing air cover for Syrian, Kurdish and Arab fighters in an open-ended campaign devised by the Obama administration to deal the militants, also known as ISIS, a lasting defeat. \"Starting the long overdue pullout from Syria while hitting the little remaining ISIS territorial caliphate hard, and from many directions,\" Trump tweeted. \"Will attack again from existing nearby base if it reforms. Will devastate Turkey economically if they hit Kurds .\" Trump's decision to leave Syria, which he initially said would be rapid but later slowed down, shocked U.S. allies and angered the Kurds in Syria. It also prompted the resignation of Defense Secretary Jim Mattis and drew criticism in Congress. Sen. <mark>Jack Reed</mark>, a Rhode Island Democrat, called the decision a \"betrayal of our Kurdish partners .\" ", "articleID": "2019011405_00234497_W", "names": {"Jack Reed": ["Q528979", "Q6114777", "Q6114779", "Q6114783"]}}, {"date": "2019-01-15", "url": "http://kfgo.com/news/articles/2019/jan/15/confederate-monuments-pedestal-ordered-removed-at-university-in-north-carolina/", "content": "Confederate monument's pedestal ordered removed at university in North Carolina Monday, January 14, 2019 11:25 p.m. CST FILE PHOTO: Students and protesters surround plinth where the toppled statue of a Confederate soldier nicknamed Silent Sam once stood, on th By Alex Dobuzinskis (Reuters) - The pedestal for a Confederate monument called Silent Sam that has been a flashpoint for demonstrations at a North Carolina university will be removed, the school's president said on Monday, nearly five months after protesters toppled the statue. The plan to remove the statue's base and commemorative plaques was outlined by University of North Carolina at Chapel Hill chancellor Carol Folt, in a statement that also said she would resign after this academic year's graduation ceremonies. \"The base and tablets will be preserved until their future is decided,\" Folt said in a statement. The effort to eliminate Confederate monuments gained momentum in the United States after avowed white supremacist Dylann Roof in 2015 murdered nine black people at a church in Charleston, South Carolina. The rampage ultimately led to the removal of a Confederate flag from the statehouse in Columbia. Silent Sam was erected in 1913 to honor soldiers of the pro-slavery Confederacy killed during the U.S. Civil War. Protesters used ropes to pull down the statue on Aug. 20. Opponents of Confederate monuments say they glorify the South's legacy of slavery and racism. Supporters view the memorials as emblems of American history. Some University of North Carolina students celebrated the plan to take away the pedestal and plaques on Monday, according to Raleigh television station WTVD. Folt announced her resignation on the same day University of North Carolina's board of governors was meeting in closed session to discuss leadership issues at her Chapel Hill campus, board chairman <mark>Harry Smith</mark> said in a statement. The board was not advised of Folt's plan to remove the pedestal and plaques and was disappointed by her action, <mark>Smith</mark> said, and he added, \"It lacks transparency and it undermines and insults the board's goal to operate with class and dignity .\" Folt, in her statement, acknowledged the decision to remove the objects could upset some people, but said her goal was to preserve public safety and \"begin the healing process .\" In December, officials at Chapel Hill, which is the flagship campus for the University of North Carolina system, recommended that Silent Sam be relocated to a more than $5 million facility to house historical artifacts. But the University of North Carolina board of governors rejected the plan. (Reporting by Alex Dobuzinskis; editing by Darren Schuettler) More From National No clear path for California as massive PG & E utility nears bankruptcy Alaska officials probing BP oil, gas wells at Prudhoe Bay after spill Burgers by candlelight: Trump lays out fast food for college football champs \"El Chapo' dreamed of biopic for years before capture, says trial witness Stormy Daniels sues over Ohio strip club arrest, calling it political New Illinois governor promises balanced budget for state Comments", "articleID": "2019011505_02876324_W", "names": {"Harry Smith": ["Q10379814", "Q11326841", "Q15492881", "Q15968052", "Q16094193", "Q16225166", "Q16889948", "Q21166778", "Q2496152", "Q25171870", "Q27830837", "Q379471", "Q5672434", "Q5672465"]}}, {"date": "2019-01-15", "url": "https://www.washingtontimes.com/news/2019/jan/15/mueller-rick-gates-still-cooperating/?utm_source=RSS_Feed&utm_medium=RSS", "content": "Mueller: <mark>Rick Gates</mark> still cooperating with \"several ongoing investigations' Follow Us Who will win the Super Bowl? Question of the Day Print By Alex Swoyer - The Washington Times - Tuesday, January 15, 2019 Special counsel Robert Mueller asked a federal court Tuesday to delay sentencing for former Trump campaign official <mark>Rick Gates</mark>, saying he's still cooperating in ongoing investigations. Mr. Mueller asked for a 60-day delay, suggesting they come back to the court in mid-March. Gate's attorney also signed on to the filing .\" <mark>Gates</mark> continues to cooperate with respect to several ongoing investigations, and accordingly the parties do not believe it is appropriate to commence the sentencing process at this time, \"Mr. Mueller's one-page filing said. <mark>Gates</mark> pleaded guilty early last year to conspiring against the U.S. as well as lying to federal investigators. He worked with former Trump campaign chairman Paul Manafort, who was convicted of several federal crimes including bank fraud and tax evasion.", "articleID": "2019011523_00168714_W", "names": {"Rick Gates": ["Q42429771", "Q92901"]}}, {"date": "2019-01-16", "url": "https://www.warwickdailynews.com.au/news/boxing-trainer-gareth-williams-says-justin-hodges-/3624091/", "content": "Former Broncos captain Justin Hodges during boxing training at The Boxing Shop gym, Nathan. Photo: Liam Kidston. News The boxing trainer helping \"underdog' Hodges by Kristy Muir & Joe McDonough 16th Jan 2019 8:19 PM premium_icon Subscriber only 0 WELL-KNOWN Brisbane boxing trainer <mark>Gareth Williams</mark> has been working with former Brisbane Bronco Justin Hodges for about nine years. So when Hodges steps in the ring next month for his first professional fight, the Boxing Shop owner will be there in the rugby league star's corner. Mr <mark>Williams</mark>, a former Australian national amateur coach, said he couldn't be more proud of Hodges' efforts .\" I've been coaching him all these years, \"Mr <mark>Williams</mark> said .\" He's a champion, a great guy who's always got time for people. \"He's definitely an underdog .\" <mark>Gareth Williams</mark> from The Boxing Shop. (AAP Image/Richard Walker) Mr <mark>Williams</mark> said Hodges was the \"most high-profile\" person he had coached. \"He just wants to have a go - he told me\" the one thing I don't want to do is disrespect the sport', \"Mr <mark>Williams</mark> said .\" As an athlete, losing is not something he talks about - he says' I am here to win'. \"Mr <mark>Williams</mark> said Hodges had ramped up his training from one session daily, to two ahead of his February 8 fight .\" He's committed, \"Mr <mark>Williams</mark>. He said there was a\" lot to improve \"but his charge had certainly shown a natural ability in the ring, including\" good hand speed \". Former Broncos captain Justin Hodges during boxing training at The Boxing Shop gym, Nathan. Photo: Liam Kidston .\" I noticed once we made our mind up that this fight was going to happen, I saw the training and the attitude change from training generally just for health and fitness, and a bit of fun with the boys, to \"right, it's business time now' .\" He's got a good jab, he's got some pop in his shots too, and he's got a bit of mongrel in him, as the NSW team would know. \"Mr <mark>Williams</mark> said it had taken a while for Hodges to get his mum and wife on side for him to go pro but it finally happened\" He is a family man and is well-respected, \"he said 0 broncos Read More Login to follow editors picks Read More Login to follow justin hodges Read More Login to follow nrl Read More Login to follow broncos editors picks justin hodges nrl", "articleID": "2019011611_00052061_W", "names": {"Gareth Williams": ["Q16232033", "Q18411896", "Q195021", "Q266062", "Q27051587", "Q3098316", "Q44219721", "Q45623541", "Q47125916", "Q5247441", "Q5522999", "Q5523000", "Q5523001", "Q5523002", "Q5523003", "Q5523004", "Q5523005", "Q56654342", "Q56948825"]}}, {"date": "2019-01-16", "url": "http://www.keyc.com/story/39797855/the-latest-uks-may-wins-vote-to-keep-job-brexit-chaos", "content": "The Latest: UK's <mark>May</mark> wins vote to keep job, Brexit chaos 11 hrs 7 mins ago Updated: LONDON (AP) - The Latest on Brexit (all times local): 7:20 p.m. British Prime Minister Theresa May's government has survived a no-confidence vote called after <mark>May</mark>'s Brexit deal was overwhelmingly rejected by lawmakers. The House of Commons expressed confidence in the government by 325 votes to 306, meaning <mark>May</mark> can remain in office. Had the government lost, Britain would have faced an election within weeks while preparing to leave the European Union on March 29. Despite the reprieve, <mark>May</mark> faces a monumental struggle to find a way out of her country's Brexit impasse. She has until Monday to come up with a new blueprint for Britain's EU exit after the deal she reached with the EU went down to a crushing defeat in Parliament on Tuesday. ___ 6:10 p.m. France's parliament has adopted a law allowing for emergency measures to deal with Britain's March 29 exit from the EU. The National Assembly voted Wednesday on the final reading of a special law drafted to handle a \"no-deal\" Brexit. The law includes things like extra customs officers after Brexit day, and a temporary rule allowing Britons employed in France to keep their jobs after March 29 even though they will no longer be EU citizens. European Affairs Minister Nathalie Loiseau called for calm, but stressed the importance of having a contingency plan. Supporters argued the French law was especially necessary after the British Parliament on Tuesday overwhelmingly rejected a divorce deal negotiated between the U.K. government and the EU. That deal had laid out ways to smooth over the transition. Without a deal, it's unclear how both sides will handle cross-border trade, finance and travel when Britain leaves. ___ 4:45 p.m.. A top French border police official says checks of the English Channel for illegal immigration won't change after Britain leaves the European Union on March 29. Franck Toulliou, the second-in-command of France's Air and Frontier Police, said French authorities will continue monitoring freight trucks that migrants try to hop in Calais before the vehicles enter the tunnel that leads to England. French maritime authorities are also cracking down on boats carrying migrants, which the area has seen a recent spike in. In an interview with The Associated Press on Wednesday Toulliou warned that Brexit will affect travelers with British passports seeking to enter France since they will no longer be EU residents. He spoke after British lawmakers rejected a divorce deal laying out rules for Britain's transition out of the EU. ___ 2: 30 p.m. French fishermen are expressing fear that seafood supplies would be hard-hit if Britain leaves the European Union without a deal on post-Brexit relations with the EU. Gerard Romiti, president of France's national committee for fisheries, said in a statement issued Wednesday: \"We are navigating through troubled waters .\" Fishermen from northwestern France heavily rely on access to British waters in the Atlantic Ocean, English Channel and North Sea, which now is granted and regulated by EU rules. The French committee urged European and French authorities to take \"all necessary actions\" to anticipate the potential impacts of a no-deal Brexit on fishing fleets and the sustainability of fisheries resources. ___ 1:30 p.m. British lawmakers have begun debating a motion of no-confidence in Prime Minister Theresa May's government. Opposition Labour Party leader Jeremy Corbyn called for a confidence vote after the House of Commons overwhelmingly rejected <mark>May</mark>'s Brexit deal with the European Union. Opening the debate, Corbyn said the defeat was the biggest in British history and called on the government to \"do the right thing and resign .\" He said that \"if a government cannot get its legislation through Parliament, it must go to the country for a new mandate .\" <mark>May</mark> has refused to resign, and is likely to win Wednesday's vote with backing from her Conservative Party and its Democratic Unionist Party allies. If she loses, the country likely faces a snap general election. ___ 12:40 p.m. Irish leader Leo Varadkar says that it is now up to the British government to come up with alternatives to avoid an exit from the European Union without an agreement. Varadkar says that if Prime Minister Theresa May's government is willing to shift some of its so-called red lines in negotiations, then the position of negotiators in the EU would also change. The Irish prime minister says that \"the onus is on Westminster\" to come up with solutions. Varadkar says \"we've always said that if the United Kingdom were to evolve its red lines on the customs union and the single market, that the European position would evolve also .\" EU negotiator Michel Barnier also said Wednesday that if <mark>May</mark> shifts the red lines they will open the political declaration on future relations. ___ 11:35 a.m. Finnish Prime Minister Juha Sipila is urging all British citizens living the Nordic country to immediately register at Finland's immigration service to make sure they receive a living permit in case of no-deal Brexit. Sipila told Finnish news agency STT Wednesday that the temporary permit will be issued so that the 5,000 Britons currently living in the country of 5.5 million can continue their stay if Britain exits the European Union without a deal. He said the likelihood of a no-deal Brexit has increased as a result of the British parliament's decision to reject Prime Minister Theresa May's Brexit deal Tuesday. The Finnish government's social benefits office Kela said there <mark>may</mark> be major changes to what social benefits British citizens in Finland <mark>may</mark> be entitled to in case of a Brexit without an agreement, but did not provide details. ___ 11:10 a.m. French wine and spirits makers are warning that Britain crashing out of the European Union without a deal could hurt trade. A day after British Prime Minister Theresa May suffered an overwhelming defeat over her Brexit deal, the federation of French wine and spirits exporters said Tuesday that \"the specter of a\" no deal' could have serious consequences for the economy and the citizens of both parties. \"According to the federation, called FEVS, Britain is France's second-biggest destination for exports of spirits and wine and France imports a large quantity of British spirits. FEVS President Antoine Leccia said:\" This vote is prejudicial to the historical and fruitful commercial relationship between our countries. \"___ 11 a.m.. A top official at the French presidency said Europeans would make no concessions on Brexit that would damage the European Union's core principles, including the integrity of the single market. The French official said that any request by Britain to seek an extension to the Brexit timetable would need to come with a new plan and a strategy from the British government. The official was speaking anonymously in line with the French presidency's customary practice. He added that\" nobody believes \"the European Union would now be\" weak and febrile. \"\"And I don't think <mark>Theresa May</mark> believes it\" , he added. The French parliament votes on Wednesday afternoon to adopt preparatory measures to get the country ready in case of no deal. - By Sylvie Corbet ___ 10:50 a.m. Russia's foreign minister says Moscow isn't taking any sides in the controversy over Britain's exit from the European Union. Sergey Lavrov was speaking Wednesday at a news conference a day after the British parliament overwhelmingly rejected British Prime Minister Theresa May's Brexit deal. He rejected allegations that Russia was gloating in the turmoil, saying that Russia is interested in seeing a \"united, strong and, most importantly, independent European Union .\" Lavrov reaffirmed that Russia would stand ready to develop ties with Britain and the EU irrespective of the outcome of talks on British departure from the EU. ___ 10:10 a.m. German Chancellor Angela Merkel says there's still time for negotiations between the European Union and Britain over its departure from the bloc. Merkel says that she regretted the decision by British lawmakers to oppose the agreement negotiated by British Prime Minister Theresa May and the EU. Merkel told reporters in Berlin that \"we will of course do everything to find an orderly solution, but we are also prepared if there is no orderly solution .\" Merkel said \"we still have time to negotiate, but we are now waiting to see what the British prime minister proposes .\" ___ 9:45 a.m. Bank of England Governor Mark Carney says financial markets appear to have taken a fairly benign view of the big defeat of Prime Minister Theresa May's Brexit deal and seem to believe Brexit <mark>may</mark> be delayed. Addressing lawmakers on the Treasury Select Committee, Carney said Wednesday that the market reaction since Tuesday evening's vote indicates that investors think the \"prospect of no deal <mark>may</mark> have diminished .\" Carney made clear that wasn't necessarily his view and that he wouldn't put too much stock on short-term movements in financial markets. But he also said the move higher in the pound could be an indication that investors think the date when Britain leaves the European Union will be extended. He said the market interpretation of <mark>May</mark>'s 230-vote defeat reflects \"some expectation the process of resolution would be extended .\" At present the country is due to leave on March 29 but the government could ask the EU to extend that date. On Wednesday, the pound was up 0.2 percent at $1.2888. ___ 9:35 a.m. Germany's foreign minister says \"the time for little games is now over\" on Brexit because the clock is ticking to avert a hard rupture between the U.K. and the European Union. Heiko Maas suggested British lawmakers who voted against the deal negotiated by Prime Minister Theresa May should recognize the importance of the issue, adding that \"we need a solution, and we need it quickly .\" Maas told Deutschlandfunk radio that British lawmakers in London so far had only shown \"what they don't want, and that's not enough .\" He dismissed the notion that <mark>May</mark> might get a substantially better deal if she goes back to Brussels, saying \"if there was anything else one could have offered Britain it would have had to have been done in the last weeks .\" Maas wouldn't rule out extending the March 29 deadline for Brexit, but noted that \"this won't really be easy, because we have the European elections in <mark>May</mark>.\" ___ 9:15 a.m. U.K. financial markets have taken the overwhelming defeat of Prime Minister Theresa May's Brexit deal in stride. The pound was up 0.1 percent at $1.2869 in early morning trading, while the FTSE 100 index of leading British shares was down 0.1 percent at 6,888. Though uncertainty surrounding Britain's exit from the European Union remains elevated, many in the markets think <mark>May</mark>'s defeat by lawmakers Tuesday evening makes it less likely the country will crash out of the bloc on March 29 with no deal. <mark>James Smith</mark>, an economist at ING, says the \"calm market response\" suggests investors think at the very least that the government will end up having to seek an extension to the Brexit timetable. Traders will remain focused on developments in Parliament later, where lawmakers will vote on whether they have confidence in the government. ___ 9:10 a.m.. The head of an influential German business lobby group says the U.K. Parliament's vote against the Brexit deal with the European Union shows \"hysteria has won .\" <mark>Joachim Lang</mark>, chief executive of the Federation of German Industries, says that lawmakers' rejection of the deal is \"dramatic\" and \"the chance to find a way out of this chaos has been passed up for now .\" The group, known by its German acronym BDI, warned that Britain is getting closer to a disorderly departure from the EU and \"the responsibility for avoiding this lies solely with the government and opposition in London .\" The BDI said trade in goods and services between Germany and Britain amounts to about 175 billion euros ($200 billion) a year. It said \"any uncertainty would endanger tens of thousands of companies and hundreds of thousands of jobs in Germany and especially in the United Kingdom .\" ___ 9 a.m. Britain's envoy to Germany says the European Union might help avert a \"no-deal\" Brexit if it's prepared to shift its position on the terms of future border controls with Ireland. Britain's ambassador in Berlin, <mark>Sebastian Wood</mark>, says that the current \"backstop\" solution is opposed both by U.K. lawmakers who want the country to leave the EU, and those who don't. In an interview with German public broadcaster ARD, <mark>Wood</mark> noted that Britain wouldn't have the right to get out of the backstop unilaterally \"and many have noticed this .\" He said \"this might be the most important question in the coming days and weeks, and the EU can perhaps be a little helpful in that area .\" ___ 8:50 a.m. British Prime Minister Theresa May faces a no-confidence vote a day after Parliament rejected her Brexit deal by an historic margin. <mark>May</mark> is battling to save her job after staking her political reputation on a last-ditch effort to win support for the divorce agreement she negotiated with the European Union. Though defeat was widely expected, the scale of the rout - 432-202 - was devastating for <mark>May</mark>'s leadership. Immediately after the vote, Labour leader Jeremy Corbyn tabled a no-confidence motion, saying it will give Parliament a chance to give its verdict \"on the sheer incompetence of this government .\" Still, most analysts predict <mark>May</mark> will survive because her Conservative Party and the Democratic Unionist Party, which supports it, are expected to vote against the motion. ___ 8:15 a.m. European Union Brexit negotiator Michel Barnier says the bloc is stepping up preparations for a chaotic no-deal departure of Britain from the bloc after the rejection of the draft withdrawal deal in London left the EU \"fearing more than ever that there is a risk\" of a cliff-edge departure. Barnier regretted Westminster's massive rejection of the deal he negotiated with the government of British Prime Minister Theresa May and said that any future deal would still have to include approving the withdrawal agreement. He said Wednesday that \"whatever happens, ratification of the withdrawal agreement is necessary. It is a precondition .\" He said that a linked political declaration offered \"possible options\" for further talks. Copyright 2019 The Associated Press. All rights reserved. This material <mark>may</mark> not be published, broadcast, rewritten or redistributed.", "articleID": "2019011620_00201845_W", "names": {"James Smith": ["Q1027519", "Q10464386", "Q16534411", "Q16885746", "Q20738160", "Q2389622", "Q37615128", "Q3808437", "Q39395048", "Q39502042", "Q43911922", "Q52440", "Q54557216", "Q56724422", "Q57903671", "Q5925871", "Q6143308", "Q6143312", "Q6143324", "Q6143330", "Q6143331", "Q6143337", "Q6143352", "Q6201315"]}}]