[{"articleID": "2017073013_01077649_W", "names": {"Steve King": ["Q37084447", "Q749710", "Q7613030", "Q7613031", "Q7613033", "Q7613034", "Q7613037"], "Pete King": ["Q2073269", "Q953554"], "Susan Rice": ["Q23848423", "Q50612"], "David Pressman": ["Q2530341", "Q26707115", "Q5238702"]}, "date": "2017-07-30", "url": "http://www.pennlive.com/nation-world/2017/07/republicans_still_want_to_inve.html#comments", "content": "Republicans still want to investigate Hillary Clinton Comment Updated on July 30, 2017 at 9:49 AMPosted on July 30, 2017 at 9:45 AM FILE - In this June 5, 2017 file photo, former Secretary of State Hillary Clinton speaks in Baltimore. Clinton lost the 2016 election to President Donald Trump, but some Republicans in Congress are intensifying their calls to investigate her and other Obama administration officials. FILE - In this June 5, 2017 file photo, former Secretary of State Hillary Clinton speaks in Baltimore. Clinton lost the 2016 election to President Donald Trump, but some Republicans in Congress are intensifying their calls to investigate her and other Obama administration officials. (AP Photo/Patrick Semansky, File By Associated Press WASHINGTON--Democrat Hillary Clinton lost the 2016 election to President Donald Trump, but some Republicans in Congress are intensifying their calls to investigate her and other Obama administration officials. As investigations into Russian meddling and possible links to Trump's campaign have escalated on both sides of the Capitol, some Republicans argue that the investigations should have a greater focus on Democrats. Democrats who have pushed the election probes \"have started a war of investigative attrition,\" said GOP Rep. <mark>Steve King</mark> of Iowa, a member of the House Judiciary Committee. Several officials from former President Barack Obama's administration and Clinton's campaign have appeared before or been interviewed by the House and Senate Intelligence Committees as part of the Russia investigation, along with Trump campaign officials. The GOP-led committees are investigating whether Trump's campaign had any links to Russian interference in last year's election. The chairman of the House Intelligence Committee, Rep. Devin Nunes, R-Calif ., has continued a separate investigation into whether Obama administration officials inappropriately made requests to \"unmask\" identities of Trump campaign officials in intelligence reports. The House Judiciary Committee, which has declined to investigate the Russian meddling, approved a resolution this past week to request documents related to the FBI's now-closed investigation of Clinton's emails. In addition, Republican on that committee wrote the Justice Department on Thursday and asked for a second special counsel, in addition to Special Counsel Robert Mueller, to investigate \"unaddressed matters, some connected to the 2016 election and others, including many actions taken by Obama administration.\" \"The American public has a right to know the facts--all of them--surrounding the election and its aftermath,\" the lawmakers wrote. Republicans want to investigate the unmasking issue and also Clinton's email scandal that figured prominently in the campaign. They also frequently bring up former Attorney General Loretta Lynch, and former FBI Director James Comey's testimony that she told him to call the Clinton email investigation a \"matter\" instead of an investigation during the campaign. Nunes wrote his own letter to Director of National Intelligence Dan Coats last week, saying that his committee has learned that one Obama administration official had made \"hundreds\" of the unmasking requests. Even though he remains committee chairman, Nunes stepped back from the Russia investigation earlier this year after he was criticized for being too close to the White House. Rep. Mike Conaway, R-Texas, took over the leading role. The committee has conducted bipartisan interviews of witnesses; Trump son-in-law Jared Kushner appeared on Tuesday, a day after talking to Senate staff. But partisan tensions have been evident. GOP Rep. <mark>Pete King</mark> of New York, who's on the House Intelligence Committee, said after the Kushner interview that the committee investigation into Russian meddling is a \"sham.\" \"To me there is nothing to this from the beginning,\" he said of his committee's own probe. \"There is no collusion...it's the phoniest investigation ever.\" Both the Senate and House committees have interviewed or expressed interest in interviewing a series of Democratic witnesses, including Obama's former national security adviser, <mark>Susan Rice</mark>, and former U.N. Ambassador Samantha Power--both of whom Republicans have said may be linked to the unmasking. <mark>Rice</mark> met with staff on the Senate Intelligence Committee earlier this month, and Power met with the panel Friday. \"Ambassador Power strongly supports any bipartisan effort to address the serious threat to our national security posed by Russia's interference in our electoral process, and is eager to engage with the Senate and House committees on the timeline they have requested,\" Power's lawyer, <mark>David Pressman</mark>, said in a statement. View Comments"}, {"articleID": "2012092117_00015312_W", "names": {"John Baker": ["Q12633672", "Q15109473", "Q18379494", "Q26220645", "Q26220647", "Q28946020", "Q3180978", "Q42871706", "Q51585141", "Q55990560", "Q59155019", "Q59201610", "Q6007104", "Q6111119", "Q6220376", "Q6220386", "Q6220388", "Q6220400", "Q6220402"]}, "date": "2012-09-21", "url": "http://bloodhorse.com/horse-racing/articles/72950/changes-made-to-grand-national-course?source=rss", "content": "the associated press updated: friday, september 21, 2012 12:45 pm mounting concerns over the safety of the grand national at aintree racecourse in england have forced organizers to make modifications to the course following a review of the world's most grueling race after two horses died this year. however, while there will be changes to fence design, landing areas, and course irrigation, the size of the field will remain at 40 horses. also, becher's brook? the much-feared fence criticized for its severity? will keep the same drop and dimensions. the changes, announced sept. 20 by aintree and the british horseracing authority, will be implemented for the 2013 race scheduled for april 6. ten horses having died in the past 12 years of the national, sparking criticism from animal welfare groups. \"balancing the grand national's enduring appeal while working to reduce risk in the race is a delicate but important balance to strike,\" said <mark>john baker</mark>, who runs the liverpool racecourse, in a release. \"in recent years, we have made significant investments in safety and believe today's announcement demonstrates we will continue to do so.\" organizers have attempted to address the recent problems surrounding the beginning of the race. recommendations include moving the start 90 yards forward, away from the noise of the crowd in the grandstand. that will shorten the distance of the race to 4 miles, 3 1/2 furlongs. last year, the favorite synchronised and according to pete were euthanized after sustaining injuries. only 15 of the 40 runners finished the race, with many horses colliding with those that fell at the famous high fences. some critics called for an end to the race. the congested, 40-horse field is the biggest criticism leveled at the national, yet the review said the \"course and fences allow enough racing surface to accommodate this number of runners.\" becher's brook, where synchronised and according to pete fell, has undergone \"further leveling of the wider landing zone\" but the drop of between five feet, two inches and five feet, eight inches remains. \"these latest changes reinforce the fact that we have never stood still when it comes to safety and welfare,\" <mark>baker</mark> said. \"however, we are fully aware in racing that you cannot remove risk altogether.\" other changes to be implemented to the grand national start are as follows:? the \"no-go\" zone defined by a line on the track will be extended from 15 yards to around 30 yards from the starting tape .? starter's rostrum moved to a position between starting tape and \"no-go\" zone to reduce potential for horses get on top of the starting tape prematurely .? more user-friendly start tapes to be used, with increased visibility .? an concerted drive to redress the sometimes much faster approaches toward the tape which can occur in bigger races as the jump season progresses .? a specific briefing between the starters' team and jockeys on the day of the grand national .? additional measures put in place to minimize the possibility of a rider-less horse traveling an extended distance before being caught prior to the start. \"our objective in recommending changes to the start is to identify ways in which we can create a calmer and more controlled environment for both horse and rider,\" said jamie stier, director of race day operations and regulation for the bha, in a statement. \"we recognize that there is pressure and tension before the race and we want to alleviate that where possible.\" it is possible that a more controlled environment at the start, along with reducing the distance between the start and the first fence, could have the effect of reducing the early speed of the race. if this were to be the case, it would be an added benefit. \""}, {"articleID": "2008111212_00008848_W", "names": {"Robert Gibbs": ["Q28869465", "Q935136"]}, "date": "2008-11-12", "url": "http://twocircles.net/2008nov12/obama_not_attend_g20_summit.html", "content": "by nnn-pti, washington: us president-elect barack obama will not attend the g20 summit scheduled for this weekend as he believes that there is \"only one president at a time\" , his aides have said. it was widely speculated that obama will join the g20 summit on november 15 in which leaders from various countries, including india, will participate to discuss ways to overcome the financial crisis across the world. although invited to the global financial summit, obama has opted to stay in chicago and will not meet any of the leaders separately, the \"new york times' reported today.\" while some may say it's awkward that he's not there, it would be far more problematic to be there. we firmly believe there is only one president at a time, \"<mark>robert gibbs</mark>, a senior adviser to obama, said. instead, the obama team is scrambling to arrange for surrogates to meet with visiting foreign officials while emphasising that bush remains the nation's leader until january 20.\" it's not appropriate for two people to show up for this meeting, \"john d podesta, co-chairman of obama's transition team was quoted as saying by the new york times. foreign affairs veterans told the paper that obama was trying to play it safe and avoid being forced to take positions on matters he is not authorised to decide, much less take ownership for the problems and decisions of bush.\" i sort of understand why he can't go to that meeting, \"said howard l. berman, democrat of california and chairman of the house foreign affairs committee.\" what if the administration makes a suggestion that he doesnt agree with? should he pop up and say something? is his silence acquiescence? i think hes making the right call, \"he said."}, {"articleID": "2009111102_00115004_W", "names": {"Jorge Gonzalez": ["Q1703833", "Q1703834", "Q420803", "Q4391915", "Q56599977", "Q6278068"]}, "date": "2009-11-11", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=24758596&blogId=517402474", "content": "status: single city: n. hollywood,' is awarded a latin grammy for \"best the fillmore at irving plaza (new york, ny)\" [los amigos invisibles] bridge language barriers by making relentlessly accessible...non-stop propulsion makes this the simple fact is, just about anyone who hears [\"commercial'] will like something about it. their songs are melodic, funky as hell, and are pretty much guaranteed to get dance floors pumping...one part '70s crime-drama keyboards, two parts porno flick bass-lines, a dash of groovy funk guitar riffs and a glaze of hip shakin' latin beats...los amigos invisibles make their triumphant return won their first career latin grammy last night as their latest release,' commercial,' won\" best alternative album. \"it was the band's fifth career grammy nomination. los amigos recently completed an extensive tour through the southeast u.s., including the austin city limits festival. they have major shows in los angeles and their hometown new york city over the next couple weeks. los amigos invisibles are notorious for their electrifying live sets.\" being a touring band is a great way to test songs and to try out new ideas, \"primary songwriter/lead guitarist jose luis pardo says.\" we now write most of our music with the purpose of fitting them into our live sets. playing so much live makes you really aware of what kind of stuff gets people this way or that way. aside from testing songs, we can't hold new tracks for that long. as soon as we think a song is ready to be played, we let loose. it's like having a new weapon, a funky weapon. \"with new album\" commercial, \"the group has tightened their hooks and focused their songs, recording their most accessible work yet. the album features a variety of special guests from <mark>jorge gonzalez</mark> (of chilean rock legends los prisioneros) and mexican songstress natalia lafourcade to senor coconut vocalist argenis brito and los tetas' c-funk. los amigos also enlisted production work from friends like dimitri from paris and cachorro lópez (belanova, miranda).\" along the way we have met many musicians we admire and in the best scenario we always end our conversations saying, \"we should do something together one day,'\" pardo says. \"there is an added value in sending the tracks away, then getting them back from guests, producers or engineers and just being blown away. i love surprises.\" los amigos invisibles spent two years working on' commercial' during breaks in their heavy tour schedule. \"the title of the album came out of our desire to make a more accessible record for even bigger crowds,\" pardo explains. \"at first, we were hesitant to use the word but eventually we decided to come straight and use it as a concept. in a world where almost no one listens to an entire album and everyone has their thumb ready to press\" next' in their ipods, we just wanted to be more focused without taking out what we love about playing. \""}, {"articleID": "2018082122_00044491_W", "names": {"Jimmy Smith": ["Q14951154", "Q24008625", "Q28055448", "Q3808437", "Q6141730", "Q6201309", "Q6201315", "Q6201317", "Q764582"]}, "date": "2018-08-21", "url": "http://www.cbssports.com/nfl/news/ravens-jimmy-smith-suspended-four-games-after-nfl-finds-evidence-of-abusive-behavior/", "content": "Baltimore Ravens cornerback <mark>Jimmy Smith</mark> will miss the first month of the season after being suspended four games by the league. The suspension, due to a violation of the league's personal conduct policy, was announced Tuesday. According to the Ravens' statement, \"the NFL found evidence of threatening and emotionally abusive behaviors by <mark>Jimmy</mark> toward his former girlfriend that showed a pattern of improper conduct.\" \"Our player's behavior was inappropriate and wrong,\" the team wrote. In November, The Baltimore Sun reported that the mother of <mark>Smith</mark>'s young son accused <mark>Smith</mark> of substance abuse, illicit drug usage, and a history of being physically violent toward her. At the time, <mark>Smith</mark> denied the allegations. In their statement, the Ravens said they \"consulted with relationship and domestic violence experts for their perspectives\" in addition to weighing the opinions of \"Ravens women and men executives, not directly involved with our football operations,\" and speaking with <mark>Smith</mark>. The Ravens condemned <mark>Smith</mark>'s behavior, but said they would allowed him to return after he serves his suspension because he \"has acknowledged his behaviors were wrong and accepts full responsibility for them,\" finished a \"clinical evaluation,\" and agreed to \"follow-up care or treatment that may be recommended.\" \"Through our conversations with <mark>Jimmy</mark>, we believe he is taking the proper steps to improve and that he can change,\" the team wrote. \"<mark>Jimmy</mark> has assured us that he is fully dedicated to making this change. He also understands the consequences if he does not.\" The #Ravens say in part: \"\"The NFL found evidence of threatening and emotionally abusive behaviors by <mark>Jimmy</mark> toward his former girlfriend that showed a pattern of improper conduct. Our player's behavior was inappropriate and wrong.\" pic.twitter.com/j0vcusCji7--Tom Pelissero (@ TomPelissero) August 21, 2018 In his own statement, <mark>Smith</mark> apologized for his behavior. \"I would like to sincerely apologize to my former girlfriend, the NFL, the Ravens organization, my coaches, my teammates, my fiancée and all our fans. I'm very disappointed that my past actions have led to this suspension. I promise that I have already learned much and will continue to learn more from this experience. I believe I am, and will continue to try to be, a better person and a better father because of this. I am committed to being the best I can be, both on and off the field.\" I take full responsibility for my past conduct. Moving forward, I will work with the NFL and the Ravens to ensure that what happened in the past will never happen again. I will take all necessary steps to be a positive role model for both my sons, for the NFL and for the entire Ravens community. \"<mark>Smith</mark> will miss games against the Bills (home), Bengals (away), Broncos (home), and Steelers (away). He'll be eligible to return in time for the Ravens' Week 5 road game against the Browns on Oct. 7. In terms of strictly football, it's a brutal loss for the Ravens. <mark>Smith</mark>, who has been with the team since they made him a first-round pick in 2011, has racked up 11 interceptions during his career. According to Pro Football Focus, <mark>Smith</mark> allowed the fourth-lowest passer rating in coverage among cornerbacks last season. Over the past two seasons, the Ravens have been a completely different team (for the worse) without him. <mark>Jimmy Smith</mark> (BAL DB) set to be suspended\" multiple weeks \". His impact on the Ravens defense the last 2 yrs? ► With: • 41.7% success (#4) • 4.53% Int rate (#1) • 76.1 passer rtg (#1) ► Without: • 47.9% success (#29) • 1.53% Int rate (#31) • 91.5 passer rtg (#18)--Warren Sharp (@ SharpFootball) August 21, 2018 But <mark>Smith</mark> has often missed games during his career. <mark>Smith</mark> was suspended four games last season for a performance-enhancing drug violation, and he's also coming off a torn Achilles. In his career, he's played in 86 of 112 possible regular-season games. He'll miss at least four games again during the upcoming season, but the suspension was nearly longer. According to The Athletic's Jeff Zrebiec, <mark>Smith</mark> and the Ravens initially feared the suspension would be for six games, but <mark>Smith</mark> got two games taken off after meeting with league officials Monday."}, {"articleID": "2018112221_00319843_W", "names": {"Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}, "date": "2018-11-22", "url": "http://kplctv.com/2018/11/22/maryland-football-players-charged-with-rape-adults-alleged-broomstick-hazing/", "content": "Football players charged with rape as adults in alleged broomstick hazing Maryland high school players charged with rape as adults in alleged broomstick hazing November 22, 2018 at 3:37 PM CST - Updated November 22 at 3:40 PM (WJLA/CNN) - Four high school football players in Maryland accused of sodomizing a teammate with a broomstick <mark>will</mark> be charged as adults. Three weeks ago, to the day, four Damascus High School JV football players were sexually assaulted with a broomstick. The attack described by Montgomery County Public School leaders as \"hazing\" happened in a school locker room. Police initially charged five fellow teammates as juveniles. But, four of the five accused teens were bumped up to adult court. The players, all 15-years-old identified as; J-C Abedi, Kristian Lee, <mark>Will Smith</mark> and Caleb Thorpe. Sources say Abedi attended Clarksburg High School last year, but transferred to Damascus this school year due to, \"poor conduct.\" \"They had total control of what they were doing. They knew what they were doing. It wasn't just like a stupid kid thing, they knew what they were doing so i feel like they should be properly charged,\" Kylie Sumner, Damascus high school sophomore. The four players have been booked at the Montgomery County Jail in Rockville. Their bond review is set for Monday, which means they'll be spending Thanksgiving weekend locked up. Copyright 2018 WJLA via CNN. All rights reserved. 65"}, {"articleID": "2016071618_00234058_W", "names": {"Jose Castro": ["Q3032186", "Q5604912", "Q6291888", "Q6291890"], "David Reed": ["Q10514791", "Q1176289", "Q20737746", "Q3018673", "Q5238951", "Q5238952"]}, "date": "2016-07-16", "url": "http://fairfieldcitizenonline.com/local/article/Stamford-s-West-Side-tries-to-sober-up-8382133.php", "content": "http: //www.stamfordadvocate.com/local/article/Stamford-s-West-Side-tries-to-sober-up-8382133.php Stamford's West Side tries to sober up By Liz Skalka Published 1:36 pm, Saturday, July 16, 2016 Photo: Michael Cummo / Hearst Connecticut Media Image 1of/9 Caption Close Image 1 of 9 An ambulance waits at Stamford Hospital. An ambulance waits at Stamford Hospital. Photo: Michael Cummo / Hearst Connecticut Media Image 2 of 9 An ambulance waits at Stamford Hospital on Tuesday, July 5, 2016. An ambulance waits at Stamford Hospital on Tuesday, July 5, 2016. Photo: Michael Cummo / Hearst Connecticut Media Image 3 of 9 An ambulance waits at Stamford Hospital. An ambulance waits at Stamford Hospital. Photo: Michael Cummo / Hearst Connecticut Media Image 4 of 9 <mark>Jose Castro</mark>, of Stamford, says he chases away intoxicated individuals from Smith Street frequently and is fed up with it. Photographed on Thursday, July 14, 2016. <mark>Jose Castro</mark>, of Stamford, says he chases away intoxicated individuals from Smith Street frequently and is fed up with it. Photographed on Thursday, July 14, 2016. Photo: Michael Cummo / Hearst Connecticut Media Image 5 of 9 A no loitering sign sits outside of Royal Salon, on Smith Street, and is meant for residents who get drunk and wander the area. Photographed on Thursday, July 14, 2016. A no loitering sign sits outside of Royal Salon, on Smith Street, and is meant for residents who get drunk and wander the area. Photographed on Thursday, July 14, 2016. Photo: Michael Cummo / Hearst Connecticut Media Image 6 of 9 The corner of Smith St. and Stephen St., which is where Smith Liquor Store is located, is a frequent hangout of intoxicated residents. Photographed on Thursday, July 14, 2016. The corner of Smith St. and Stephen St., which is where Smith Liquor Store is located, is a frequent hangout of intoxicated residents. Photographed on Thursday, July 14, 2016. Photo: Michael Cummo / Hearst Connecticut Media Image 7 of 9 Increased police enforcement has recently helped to reduce loitering and public drunkenness on Stamford's West Side. Increased police enforcement has recently helped to reduce loitering and public drunkenness on Stamford's West Side. Photo: Michael Cummo / Hearst Connecticut Media Image 8 of 9 An empty nip bottle lays discarded on Smith St. on Thursday, July 14, 2016. An empty nip bottle lays discarded on Smith St. on Thursday, July 14, 2016. Photo: Michael Cummo / Hearst Connecticut Media Image 9 of 9 <mark>Jose Castro</mark>, of Stamford, says he chases away intoxicated individuals from Smith Street frequently and is fed up with it. Photographed on Thursday, July 14, 2016. <mark>Jose Castro</mark>, of Stamford, says he chases away intoxicated individuals from Smith Street frequently and is fed up with it. Photographed on Thursday, July 14, 2016. Photo: Michael Cummo / Hearst Connecticut Media Stamford's West Side tries to sober up 1 / 9 Back to Gallery STAMFORD--One West Side man has been taken by ambulance to Stamford Hospital for alcohol poisoning and related injuries about 50 times over the past eight months, police say. This is an acute example of a problem that residents, community leaders and business owners say has afflicted parts of the West Side for at least a year--men drinking on city sidewalks and becoming so intoxicated at times they hurt themselves or endanger others. Part of the issue is the interpretation of a city ordinance regarding alcohol consumption on municipal properties. Police officers until recently had not enforced drinking on city sidewalks. With more vigilant enforcement, the problem has improved, according to those in the area, but it is still far from solved. Near Smith and Alden streets, an area where public drinking is most pronounced, business owners are frustrated. \"People don't come here sometimes because they're over there,\" said Royal Salon owner Myra Quitel, gesturing to sooty concrete steps a few feet from the entrance of her Smith Street beauty shop. \"They have their beer right there.\" Vin Tufo, CEO of Charter Oak Communities, the city's public housing authority and a major stakeholder in the area, said the situation has escalated in recent months. \"Our observation is that people loitering on street corners in front of certain establishments seems to be getting worse,\" he said. \"It was not something we observed even as recently as two years ago. Maybe we weren't focused on it at the time, but we're focused on it now.\" A focus, however, doesn't automatically lead to a solution. Many agree addiction is complicated and addressing it on a community level takes time and resources. \"This basic pattern of congregation in a business area is not a new phenomenon,\" said Alan Mathis, CEO of Liberation Programs, which operates a substance abuse and mental health treatment center on Main Street, less than a mile from Smith and Alden. \"It tends to happen when the economy isn't so good for everybody,\" he said. \"What I witnessed in the late\" 80s and \"90s in parts of New York City is that when people didn't have something to do--whether they were white or black or people who were undocumented--you would see a pattern of folks congregating and drinking alcohol, and that's what they would do to occupy time.\" One of the biggest neighborhood complaints has been the number of ambulances called in response to alcohol-related injuries or people who have passed out in the street--often in the scorching heat or bitter cold. The hospital is usually only blocks away. The West Side is home to Stamford Hospital and its soon-to-be new headquarters, a shimmering, 11-story glass building that cost $450 million and backs up to several streets that are some of the area's most troubled. A spokesman for the hospital said he could not comment on whether there has been a spike in emergency-room visits resulting from public alcohol consumption on the West Side. But the hospital said it often refers people who are frequent ER visitors to a Community Care Team, a group that draws members from the hospital and community to help its neediest patients obtain primary health care and other resources. \"The goal is a better quality of life for them and a better outcome,\" said Dr. <mark>David Reed</mark>, the hospital's medical director for care management. In the streets The West Side is plagued not only by loitering and public intoxication. Gun violence here and in neighboring areas has declined in recent weeks, but has nonetheless resulted in six serious injuries during 14 shootings since March. Some whose city roots span generations argue the West Side has always been a troubled, yet resilient neighborhood. It has historically been a landing spot for immigrants, from Italians in the early 20th century, to African Americans, Latinos and Caribbean immigrants. In the \"80s and\" 90s, the neighborhood yielded to drugs, crime and the failed urban renewal policies that befell other local neighborhoods and cities across the nation. West Side stakeholders have recently argued the police department's policies on loitering and drinking worsened the problem and harmed the neighborhood. Police have a different take. Assistant Police Chief Tom Wuennemann said the department had been trying to determine whether sidewalks qualify as city streets or municipal property in relation to an ordinance that permits beer drinking on city land, including parks, but prohibits any alcohol consumption on city streets. A prosecutor recently told police they are able to issue tickets for imbibing on sidewalks. But a slap on the wrist only does so much. Wuennemann said people spotted sipping from brown paper bags are often directed to nearby parks, where beer drinking is legal. \"We're looking for voluntary cooperation,\" Wuennemann said. He added there's a difference between residents who live in multi-family dwellings and quietly drink outside, and groups who congregate in the streets. \"This is where community policing comes in, knowing the residents and understanding when someone is having a beer in front of their house and it's not a big deal, as opposed to 15 or 20 people sitting on a corner drinking,\" Wuennemann said. When addressing ingrained behaviors, police say they try to work with community groups when possible. \"The problem is deeper than police just issuing a ticket,\" he said. \"We can't provide rehab--all we can do it enforce the law when it fits. I can't give everyone a job. I can't give everyone a house. And I can't solve everyone's substance abuse problem.\" \"Totally solvable' That's when an organization like Liberation House plays a role.\" What it really takes is a small group of outreach workers who are able to come across without a heavy hand to begin to shift their habits and get them engaged in taking care of themselves, \"said Mathis, whose organization was founded in Stamford in the early\" 70s. \"This is totally solvable,\" he said, \"but like anything else in life, it takes effort and resources.\" Resources can be hard to come by, although Rafael Pagan, executive director of Pacific House, formerly Shelter for the Homeless, said Connecticut is leading the nation in providing services for homeless people. The South End emergency shelter is one of the few in the state with a 12-bed substance-abuse recovery unit. However, \"because you're intoxicated on the street doesn't mean that you're homeless necessarily,\" Pagan said. Ingrid Gillespe, executive director of Communities 4 Action, said her group provides Stamford with substance abuse outreach. \"A lot of people don't understand addiction, and when you see somebody on the street, you don't know their story,\" she said, adding that people who begin drinking before age 15 have a 1-in-4 chance of developing a problem with alcohol. Charter Oak's Tufo said what he sees happening on the West Side has escalated beyond social drinking. \"It's almost a lifestyle,\" he said. \"People undergoing significant injury or medical emergencies--these things are frankly very concerning, and they are a use of our precious resources.\" Progress Some business owners say they've seen progress since they began speaking out. \"Police presence is more consistent and the mayor also seems to be taking heed to the needs of the West Side, starting with implementing an ordinance prohibiting drinking on the sidewalks,\" said Toni Lupinacci, an owner of Pellicci's Ristorante, which at one point had ambulances flying past their business on Stillwater several times a day. \"This is an open door for much needed improvements and quality of life issues, thereby giving me incentive to make things happen for our community,\" she said. Joe <mark>Castro</mark> was outside in the sticky heat on Thursday painting the exterior of the barbershop next to Royal Salon a chalky white. \"We still get a lot of complaints over here,\" he said. On the eastern corner of the block is Smith Liquor, which has customers shuffling in and out with paper bags. Several linger a few feet from the corner on Stephen Street. Across the road at Scotty's Fish and Chips, owner Eupert Scotland said he's noticed more police in the area over the past few weeks. \"There used to be a congregation of elements, characters getting drunk and whatnot,\" Scotland said. \"This is my livelihood,\" he said. \"I'm not going to let it affect that.\" eskalka @ scni.com; Twitter: @ lizskalka Most Popular 1 Fairfield, cop sued in teen's death after high speed pursuit 2 Shelton infant's death being investigated as a homicide by...3 Fairfield Property Transfers 4 Drought triggers Aquarion call for water conservation 5 A chat with...Carla Miklos 6 The Latest: Lawyer says cleric suspected in coup plot 7 Bronson Road housing proposal denied again 1 Hillary Clinton, the candidate we know so well--and don't View Comments & copy; 2016 Hearst Communications, Inc. ."}, {"articleID": "2014061104_00071221_W", "names": {"Clive Palmer": ["Q5134643", "Q550879"]}, "date": "2014-06-10", "url": "http://news.ninemsn.com.au/sitecore/content/news/news/national/2014/06/11/07/25/govt-again-pleads-with-senate-over-budget", "content": "Govt again pleads with Senate over budget Treasurer Joe Hockey has again called on non-government MPs in the Senate to support the coalition government's budget, otherwise they will be \"allowing money to walk out the door\" . Drunks turned into human billboards In an opinion piece in The Australian Financial Review, Mr Hockey and Finance Minister Mathias Cormann write it's the Senate's responsibility to support the government's economic plans. Several budget measures - including a $7 GP co-payment, changes to the dole and a rise in the pension age face defeat - in the Senate, with Labor and the Australian Greens vowing to try to block the measures. There's also been rumblings from <mark>Palmer</mark> United Party leader <mark>Clive Palmer</mark>, whose cohort of four senators will hold significant influence from July 1 when the upper house changes over. Mr Hockey and Mr Cormann said only two past Australian governments had held a majority in both the upper and lower houses. But \"almost every government has been able to pass major elements of its budget\" . The opinion piece was peppered with calls for the Senate to work with the government and warned against blocking government plans to scrap the minining and carbon taxes. \"The Senate is allowing money to walk out the door,\" the ministers said."}, {"articleID": "2014032409_00032703_W", "names": {"Christopher Stevens": ["Q21464245", "Q21464732", "Q294536", "Q5113277", "Q56199338"], "Sean Smith": ["Q23900490", "Q3247404", "Q7441439", "Q7441440", "Q7441441", "Q7441442", "Q9334692"], "David Brock": ["Q19560146", "Q47543790", "Q5231759", "Q58160607"], "David Kirkpatrick": ["Q5236047", "Q5236050"], "Patrick Kennedy": ["Q16105663", "Q17541361", "Q247915", "Q7146936", "Q7146939"], "Jonathan Allen": ["Q22095231", "Q48801723", "Q6272416"]}, "date": "2014-03-24", "url": "http://www.onenewspage.com/n/US/750cnbgtp/On-Benghazi-Hillary-Clinton-Lied-and-Four-Americans.htm", "content": "On Benghazi, Hillary Clinton Lied and Four Americans Died Tuesday, 18 March 2014 (6 days ago) The September 11th attack on the Benghazi Mission is an indictment of Hillary Clinton's capacity to serve as Commander in Chief. The Senate Select Committee's Benghazi Report (The Report) makes clear that the deaths of Amb. <mark>Christopher Stevens</mark>, State Information Officer <mark>Sean Smith</mark>, and Navy Seals Glen Doherty and Tyrone S. Woods could have been prevented on the day of the attack. Above all, their deaths would not have occurred but for Obama and Clinton's dangerous, Islamist-friendly, and unconstitutional military action against Qadhafi. Even worse, it is clear that Hillary put political \"optics\" above the security of American lives on the eve of a Presidential election. In that sense it's a bigger cover-up than Watergate. Yet former conservative and now infamous Clinton sycophant <mark>David Brock</mark>, founder of the George Soros-funded front group Media Matters, would have the public believe that Hillary's deadly failures in Benghazi are non-existent and any criticisms of her, even taken directly out of the bi-partisan, year-long investigation Senate Report, are simply smears. Along with <mark>David Kirkpatrick</mark>'s shameful New York Times story, which was thoroughly debunked a day later by Fox News from witnesses \"who were on the ground\" the night of the Islamist attack, it is clear that the Clintonistas are in cahoots to protect Clinton from facing any scrutiny during her 2016 White House bid. The Report is prima facie evidence that Hillary failed to answer the 3:00 PM call she faced on September 11, 2012 once the attack started on the Mission. Finding #1 of The Report makes clear that Clinton ignored the \"ample strategic warning that [the] security situation in eastern Libya was deteriorating and that U.S. facilities and personnel were at risk in Benghazi.\" On September 5th, six days before the attack, AFRICOM produced a report stating Disarray in Libya and a likely focus by authorities on pursuit of Qadhafi loyalists is likely allowing jihadists in Libya freedom to recruit, train, and facilitate the movement of fighters and weapons. The threat to Western and U.S. interests and individuals remains high, particularly in northeast-Libya. \"[p. 11] Benghazi is the largest city in northeast Libya. The Report also makes clear that Clinton directly denied Amb. <mark>Stevens</mark>'s requests for greater security at the Benghazi Mission. Finding #2 of The Report states that\" (t) he State Department should have increased its security posture more significantly in Benghazi based on the deteriorating security situation...including two incidents at the Temporary Mission Facility on April 6 and June 6, 2012. \"[p. 12] Both of these attacks included IEDs being directed by Islamists at the Mission. The Report explains that Amb. <mark>Stevens</mark> and other State Department officials outlined\" concerns via cables to State Department headquarters about the security of the Mission compound and made several requests for additional resources. \"[p. 14] Yet Clinton's State Department was filled with\" confusion over who, ultimately, was responsible and empowered to make decisions on both policy and security concerns. \"[p. 16] Simply stated, Clinton was too incompetent to run a proper Department whose bureaucracy could prioritize the safety of her subordinates. Not only did Hillary's incompetence bungle the Mission's security, but direct evidence exists which proves that Clinton was intent on denying the Mission proper safety protocols. Internal State Department memos unearthed by Fox News show that Clinton's Under Secretary <mark>Patrick Kennedy</mark> signed off on an action memo\" that green-lighted the Benghazi operation \"with the caveat that the Mission be\" exempted...from mandatory physical security standards \"of a Consulate. It strains credulity to believe that Hillary was not aware of the action memo, especially since Clinton misled the public on a\" diplomatic victory \"in Libya as early as November 2011 when she\" was quick to announce that the U.S. committed $40 million to help Libya secure and recover its weapons stockpiles. \"This would be the same month when The Telegraph reported that the Al Qaeda flag was pictured\" flying above the Benghazi courthouse building...alongside the Libyan national flag. \"Hillary would have the public believe that her Benghazi incompetence could be washed away in her\" bias for action, \"as the carefully crafted introduction of <mark>Jonathan Allen</mark> and Amie Parnes's HRC quotes an unnamed source. Yet the same introduction quotes Hillary telling <mark>Kennedy</mark>,\" the undersecretary who oversaw diplomatic operations, \"that\" she want (s) to see \"to brief\" her team \"on the April 5, 2010 assault on an American compound in Peshawar. That would be twenty months before <mark>Kennedy</mark> signed the deadly Benghazi action memo. The Report also makes clear that the Senate Select Committee on Intelligence\" found no evidence that significant actions were taken by the State Department between August 15, 2012, and September 11, 2012, to increase security at the Mission (.) \"[p. 16] Yet The Report redacts eleven security upgrades\" quickly \"made by the CIA in its Annex\" due to the threat of continued attacks against Western personnel in Benghazi (.) \"[pp. 19-20] The CIA Annex would repel an attack with loss of US lives the same night our mission was stormed in a precise, military-style attack and four Americans died. Clinton's Benghazi Mission did not even install additional surveillance cameras it had received\" because the State Department has not yet sent out the technical team necessary to install them. \"Further, the camera monitor in the guard force booth\" was inoperable on the day of the attacks due to a needed repair by a technical team. \"The Report makes clear that\" the lack of security enhancements contributed to the security breakdown at the Temporary Mission Facility the night of the attacks. \"[p. 21] While it is no surprise that Hillary or her husband would have any qualms on lying to the American public about the cause of Benghazi attack, or anything else for that matter, it is disconcerting that someone who believes she is capable of serving as Commander in Chief would lie directly to the father of the fallen Navy Seal Tyrone S. Woods on the cause of his son's unnecessary death. Yet in a memorial service days after the Islamist attack, Hillary approached Tyrone's father Charles and assured him that the Obama administration was going to\" arrest and prosecute \"the man that made the scapegoated YouTube video critical of Islam. The Report does not mention the video once. The Report makes clear in FINDING #9 that any report of a\" protest at the Mission facility \"was\" erroneous \"and\" caused confusion and influenced the public statements of policymakers. \"[p. 34] In fact,\" there were no protests outside the Temporary Mission Facility prior to the attacks (.) \"[p. 35] The attack was a multi-pronged, sophisticated assault which was coordinated by Ahmad Abu Khattallah, who is a leading member of the Al Qaeda-affiliated group Ansar al-Sharia. A Fox News source who was on the ground describes the Khattallah' s operation as a\" direct action planned attack \"with\" (o) ne guy...shooting, one guy...running. There (were) guys watching the gates...The bosses on the ground were pointing, commanding and coordinating. \"450 days after the attack, Khattallah walks freely around Benghazi. The final RECOMMENDATION of The Report demands that\" the U.S. Government must swiftly bring the attackers to justice, in spite of the unwillingness or lack of capacity of the Libyan government to assist in this effort. \"[p. 43] The government which Obama and Clinton installed is prohibiting the FBI from operating in Libya. Fifteen Libyans who were cooperating with the FBI have been assassinated. And the FBI's $10 million reward was not even publicized the first eleven months after it was issued. Clearly, the Obama administration does not consider the attackers a high priority. One last question remains open from The Report: was the attack on the Benghazi Mission carried out with U.S. weapons? The Intelligence Committee's press release states that\" the U.S. government cannot rely on local security in areas where the United States has facilities under high threat or where the host nation is not capable of providing adequate security. \"We know that Amb. <mark>Stevens</mark> was forced to hire local security militias for protection due to Hillary's denials of his security requests. The Report explains that Amb. <mark>Stevens</mark> believed that the local Libyan militia members would provide the\" least bad option. \"[p. 41] Fire chief says death toll from large landslide in WASHINGTON WASHINGTON STATE mudslide: Officials say 18 people still missing (video) Blocked river trickling through massive mud wall in deadly WASHINGTON LANDSLIDE March Madness 2014: Social media reacts after DAYTON goes all Cinderella on Syracuse Oil spill cleanup efforts continue off TEXAS Gulf shore following collision University of Dayton: Riot Police Respond as Students Fill Streets After Win Over France releases satellite data, could be linked to Malaysia Airlines RUSSIA reset? Obama heads to Europe with Ukraine very much on his mind (+ video) @ Gas8128: Reminder: Hillary Clinton lied about Benghazi while standing in front of the victims' caskets - http: //t.co/uo8X7hEutD Glenn Stoyan Reminder: Hillary Clinton lied about Benghazi while standing in front of the victims' caskets - http: //t.co/uo8X7hEutD Ralph M. Cefalo Do you think Hillary Clinton and Barack Obama lied? http: //t.co/Z46rm0vDSA"}, {"articleID": "2011021301_00035989_W", "names": {"Jerry Brown": ["Q152451", "Q717620"]}, "date": "2011-02-13", "url": "http://mercurynews.com/san-mateo-county/ci_17373739?source=rss", "content": "whooping cough vaccine mandatory for san mateo county kids in grades 7-12 gun-toting 84-year-old who illegally feeds birds threatens to shoot...redwood city--gov. <mark>jerry brown</mark>'s proposal to thin the state's prison population could mean an up to 40 percent increase in the number of prisoners in san mateo county's lockups by the end of a year, the sheriff said. \"it would be a true crisis,\" said sheriff greg munks. \"we can't hold that many people.\" san mateo county's jails were already at 120 percent over capacity in january with an average of 1,001 inmates housed in facilities that are supposed to hold 834, according to a report munks is slated to deliver to the board of supervisors criminal justice committee on monday. he said the governor's proposal to transfer state prisoners to county jails would put public safety at risk because there wouldn't be enough money and space to keep all the inmates behind bars. but how many new prisoners might be added to county jails is far from certain. munks said local law enforcement officials are pushing the governor to reconsider his plan or give them more funding. and <mark>brown</mark> is working with the leaders of california's counties to find a plan they can live with, said oscar hidalgo spokesman for the california department of corrections and rehabilitation. as part of his plan to plug california's $25.4 billion budget hole, <mark>brown</mark> has proposed making prisoners convicted of offenses that aren't serious, violent or sex-related the responsibility of county jails. at present anyone who gets a sentence of a year or more is sent to state prison. according to state figures, about 37,000 inmates per year fall into this category. san mateo county's share would be about 33 more prisoners month. but because each of the inmates would be serving, on average, 21 months behind bars, that number would compound each month. so that after 12 months, san mateo county would be housing an extra 396 prisoners, munks said. that could lead to the county having to consider releasing some inmates in order to make room for others. \"the governor's proposal, as it currently stands, is not workable absent some significant assistance from the state to house these new prisoners,\" said munks. \"it would adversely affect public safety.\" hidalgo, the department of corrections spokesman, said keeping prisoners close to home could actually improve safety and save money. he said an inmate who is sent back to state prison for a minor parole violation might only be there for four months. that time is long enough for the state to spend money on medical and psychological tests for a new prisoner. it also means pulling someone out of whatever social services they are enrolled in at the time. \"you take them away from what they have started doing,\" hidalgo said. munks agreed with the idea of keeping prisoners close to local services, at least in theory. he said the jail population can be reduced in part by providing services that keep people out of prison. the other means of handling more prisoners would be more jail space in san mateo county, he said. but the proposed new jail won't open for at least three years and funding for the $155 million project must still be worked out. the sheriff would like to see some of the money for it come from the state. \"if you are going give us these inmates, you've got to help us,\" said munks. the criminal justice committee meets at 11:30 a.m. monday in the board conference room in the hall of justice at 400 county center in redwood city. contact joshua melvin at 650-348-4335. with an average of 1,001 inmates housed in facilities intended to hold a maximum of 834, county jails were already 120 percent over capacity in january. here's what would happen on the peninsula if gov. <mark>brown</mark>'s proposal to move state prisoners into county jails were implemented: more prisoners: san mateo county jails alone would be required to take an estimated 33 more prisoners per month under the governor's plan."}]