[{"date": "2019-01-16", "url": "http://www.keyc.com/story/39797855/the-latest-uks-may-wins-vote-to-keep-job-brexit-chaos", "content": "The Latest: UK's <mark>May</mark> wins vote to keep job, Brexit chaos 11 hrs 7 mins ago Updated: LONDON (AP) - The Latest on Brexit (all times local): 7:20 p.m. British Prime Minister Theresa May's government has survived a no-confidence vote called after <mark>May</mark>'s Brexit deal was overwhelmingly rejected by lawmakers. The House of Commons expressed confidence in the government by 325 votes to 306, meaning <mark>May</mark> can remain in office. Had the government lost, Britain would have faced an election within weeks while preparing to leave the European Union on March 29. Despite the reprieve, <mark>May</mark> faces a monumental struggle to find a way out of her country's Brexit impasse. She has until Monday to come up with a new blueprint for Britain's EU exit after the deal she reached with the EU went down to a crushing defeat in Parliament on Tuesday. ___ 6:10 p.m. France's parliament has adopted a law allowing for emergency measures to deal with Britain's March 29 exit from the EU. The National Assembly voted Wednesday on the final reading of a special law drafted to handle a \"no-deal\" Brexit. The law includes things like extra customs officers after Brexit day, and a temporary rule allowing Britons employed in France to keep their jobs after March 29 even though they will no longer be EU citizens. European Affairs Minister Nathalie Loiseau called for calm, but stressed the importance of having a contingency plan. Supporters argued the French law was especially necessary after the British Parliament on Tuesday overwhelmingly rejected a divorce deal negotiated between the U.K. government and the EU. That deal had laid out ways to smooth over the transition. Without a deal, it's unclear how both sides will handle cross-border trade, finance and travel when Britain leaves. ___ 4:45 p.m.. A top French border police official says checks of the English Channel for illegal immigration won't change after Britain leaves the European Union on March 29. Franck Toulliou, the second-in-command of France's Air and Frontier Police, said French authorities will continue monitoring freight trucks that migrants try to hop in Calais before the vehicles enter the tunnel that leads to England. French maritime authorities are also cracking down on boats carrying migrants, which the area has seen a recent spike in. In an interview with The Associated Press on Wednesday Toulliou warned that Brexit will affect travelers with British passports seeking to enter France since they will no longer be EU residents. He spoke after British lawmakers rejected a divorce deal laying out rules for Britain's transition out of the EU. ___ 2: 30 p.m. French fishermen are expressing fear that seafood supplies would be hard-hit if Britain leaves the European Union without a deal on post-Brexit relations with the EU. Gerard Romiti, president of France's national committee for fisheries, said in a statement issued Wednesday: \"We are navigating through troubled waters .\" Fishermen from northwestern France heavily rely on access to British waters in the Atlantic Ocean, English Channel and North Sea, which now is granted and regulated by EU rules. The French committee urged European and French authorities to take \"all necessary actions\" to anticipate the potential impacts of a no-deal Brexit on fishing fleets and the sustainability of fisheries resources. ___ 1:30 p.m. British lawmakers have begun debating a motion of no-confidence in Prime Minister Theresa May's government. Opposition Labour Party leader Jeremy Corbyn called for a confidence vote after the House of Commons overwhelmingly rejected <mark>May</mark>'s Brexit deal with the European Union. Opening the debate, Corbyn said the defeat was the biggest in British history and called on the government to \"do the right thing and resign .\" He said that \"if a government cannot get its legislation through Parliament, it must go to the country for a new mandate .\" <mark>May</mark> has refused to resign, and is likely to win Wednesday's vote with backing from her Conservative Party and its Democratic Unionist Party allies. If she loses, the country likely faces a snap general election. ___ 12:40 p.m. Irish leader Leo Varadkar says that it is now up to the British government to come up with alternatives to avoid an exit from the European Union without an agreement. Varadkar says that if Prime Minister Theresa May's government is willing to shift some of its so-called red lines in negotiations, then the position of negotiators in the EU would also change. The Irish prime minister says that \"the onus is on Westminster\" to come up with solutions. Varadkar says \"we've always said that if the United Kingdom were to evolve its red lines on the customs union and the single market, that the European position would evolve also .\" EU negotiator Michel Barnier also said Wednesday that if <mark>May</mark> shifts the red lines they will open the political declaration on future relations. ___ 11:35 a.m. Finnish Prime Minister Juha Sipila is urging all British citizens living the Nordic country to immediately register at Finland's immigration service to make sure they receive a living permit in case of no-deal Brexit. Sipila told Finnish news agency STT Wednesday that the temporary permit will be issued so that the 5,000 Britons currently living in the country of 5.5 million can continue their stay if Britain exits the European Union without a deal. He said the likelihood of a no-deal Brexit has increased as a result of the British parliament's decision to reject Prime Minister Theresa May's Brexit deal Tuesday. The Finnish government's social benefits office Kela said there <mark>may</mark> be major changes to what social benefits British citizens in Finland <mark>may</mark> be entitled to in case of a Brexit without an agreement, but did not provide details. ___ 11:10 a.m. French wine and spirits makers are warning that Britain crashing out of the European Union without a deal could hurt trade. A day after British Prime Minister Theresa May suffered an overwhelming defeat over her Brexit deal, the federation of French wine and spirits exporters said Tuesday that \"the specter of a\" no deal' could have serious consequences for the economy and the citizens of both parties. \"According to the federation, called FEVS, Britain is France's second-biggest destination for exports of spirits and wine and France imports a large quantity of British spirits. FEVS President Antoine Leccia said:\" This vote is prejudicial to the historical and fruitful commercial relationship between our countries. \"___ 11 a.m.. A top official at the French presidency said Europeans would make no concessions on Brexit that would damage the European Union's core principles, including the integrity of the single market. The French official said that any request by Britain to seek an extension to the Brexit timetable would need to come with a new plan and a strategy from the British government. The official was speaking anonymously in line with the French presidency's customary practice. He added that\" nobody believes \"the European Union would now be\" weak and febrile. \"\"And I don't think <mark>Theresa May</mark> believes it\" , he added. The French parliament votes on Wednesday afternoon to adopt preparatory measures to get the country ready in case of no deal. - By Sylvie Corbet ___ 10:50 a.m. Russia's foreign minister says Moscow isn't taking any sides in the controversy over Britain's exit from the European Union. Sergey Lavrov was speaking Wednesday at a news conference a day after the British parliament overwhelmingly rejected British Prime Minister Theresa May's Brexit deal. He rejected allegations that Russia was gloating in the turmoil, saying that Russia is interested in seeing a \"united, strong and, most importantly, independent European Union .\" Lavrov reaffirmed that Russia would stand ready to develop ties with Britain and the EU irrespective of the outcome of talks on British departure from the EU. ___ 10:10 a.m. German Chancellor Angela Merkel says there's still time for negotiations between the European Union and Britain over its departure from the bloc. Merkel says that she regretted the decision by British lawmakers to oppose the agreement negotiated by British Prime Minister Theresa May and the EU. Merkel told reporters in Berlin that \"we will of course do everything to find an orderly solution, but we are also prepared if there is no orderly solution .\" Merkel said \"we still have time to negotiate, but we are now waiting to see what the British prime minister proposes .\" ___ 9:45 a.m. Bank of England Governor Mark Carney says financial markets appear to have taken a fairly benign view of the big defeat of Prime Minister Theresa May's Brexit deal and seem to believe Brexit <mark>may</mark> be delayed. Addressing lawmakers on the Treasury Select Committee, Carney said Wednesday that the market reaction since Tuesday evening's vote indicates that investors think the \"prospect of no deal <mark>may</mark> have diminished .\" Carney made clear that wasn't necessarily his view and that he wouldn't put too much stock on short-term movements in financial markets. But he also said the move higher in the pound could be an indication that investors think the date when Britain leaves the European Union will be extended. He said the market interpretation of <mark>May</mark>'s 230-vote defeat reflects \"some expectation the process of resolution would be extended .\" At present the country is due to leave on March 29 but the government could ask the EU to extend that date. On Wednesday, the pound was up 0.2 percent at $1.2888. ___ 9:35 a.m. Germany's foreign minister says \"the time for little games is now over\" on Brexit because the clock is ticking to avert a hard rupture between the U.K. and the European Union. Heiko Maas suggested British lawmakers who voted against the deal negotiated by Prime Minister Theresa May should recognize the importance of the issue, adding that \"we need a solution, and we need it quickly .\" Maas told Deutschlandfunk radio that British lawmakers in London so far had only shown \"what they don't want, and that's not enough .\" He dismissed the notion that <mark>May</mark> might get a substantially better deal if she goes back to Brussels, saying \"if there was anything else one could have offered Britain it would have had to have been done in the last weeks .\" Maas wouldn't rule out extending the March 29 deadline for Brexit, but noted that \"this won't really be easy, because we have the European elections in <mark>May</mark>.\" ___ 9:15 a.m. U.K. financial markets have taken the overwhelming defeat of Prime Minister Theresa May's Brexit deal in stride. The pound was up 0.1 percent at $1.2869 in early morning trading, while the FTSE 100 index of leading British shares was down 0.1 percent at 6,888. Though uncertainty surrounding Britain's exit from the European Union remains elevated, many in the markets think <mark>May</mark>'s defeat by lawmakers Tuesday evening makes it less likely the country will crash out of the bloc on March 29 with no deal. <mark>James Smith</mark>, an economist at ING, says the \"calm market response\" suggests investors think at the very least that the government will end up having to seek an extension to the Brexit timetable. Traders will remain focused on developments in Parliament later, where lawmakers will vote on whether they have confidence in the government. ___ 9:10 a.m.. The head of an influential German business lobby group says the U.K. Parliament's vote against the Brexit deal with the European Union shows \"hysteria has won .\" <mark>Joachim Lang</mark>, chief executive of the Federation of German Industries, says that lawmakers' rejection of the deal is \"dramatic\" and \"the chance to find a way out of this chaos has been passed up for now .\" The group, known by its German acronym BDI, warned that Britain is getting closer to a disorderly departure from the EU and \"the responsibility for avoiding this lies solely with the government and opposition in London .\" The BDI said trade in goods and services between Germany and Britain amounts to about 175 billion euros ($200 billion) a year. It said \"any uncertainty would endanger tens of thousands of companies and hundreds of thousands of jobs in Germany and especially in the United Kingdom .\" ___ 9 a.m. Britain's envoy to Germany says the European Union might help avert a \"no-deal\" Brexit if it's prepared to shift its position on the terms of future border controls with Ireland. Britain's ambassador in Berlin, <mark>Sebastian Wood</mark>, says that the current \"backstop\" solution is opposed both by U.K. lawmakers who want the country to leave the EU, and those who don't. In an interview with German public broadcaster ARD, <mark>Wood</mark> noted that Britain wouldn't have the right to get out of the backstop unilaterally \"and many have noticed this .\" He said \"this might be the most important question in the coming days and weeks, and the EU can perhaps be a little helpful in that area .\" ___ 8:50 a.m. British Prime Minister Theresa May faces a no-confidence vote a day after Parliament rejected her Brexit deal by an historic margin. <mark>May</mark> is battling to save her job after staking her political reputation on a last-ditch effort to win support for the divorce agreement she negotiated with the European Union. Though defeat was widely expected, the scale of the rout - 432-202 - was devastating for <mark>May</mark>'s leadership. Immediately after the vote, Labour leader Jeremy Corbyn tabled a no-confidence motion, saying it will give Parliament a chance to give its verdict \"on the sheer incompetence of this government .\" Still, most analysts predict <mark>May</mark> will survive because her Conservative Party and the Democratic Unionist Party, which supports it, are expected to vote against the motion. ___ 8:15 a.m. European Union Brexit negotiator Michel Barnier says the bloc is stepping up preparations for a chaotic no-deal departure of Britain from the bloc after the rejection of the draft withdrawal deal in London left the EU \"fearing more than ever that there is a risk\" of a cliff-edge departure. Barnier regretted Westminster's massive rejection of the deal he negotiated with the government of British Prime Minister Theresa May and said that any future deal would still have to include approving the withdrawal agreement. He said Wednesday that \"whatever happens, ratification of the withdrawal agreement is necessary. It is a precondition .\" He said that a linked political declaration offered \"possible options\" for further talks. Copyright 2019 The Associated Press. All rights reserved. This material <mark>may</mark> not be published, broadcast, rewritten or redistributed.", "articleID": "2019011620_00201845_W", "names": {"Joachim Lang": ["Q126071", "Q15433775", "Q15821061", "Q28260740"], "Sebastian Wood": ["Q4128233", "Q57033046"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2019-01-17", "url": "http://feeds.inquisitr.com/~r/google/yDYq/~3/kiwmalcB6ro/", "content": "Nathan Francis Public sentiment has turned sharply against Trump as the shutdown drags on. Public sentiment has been turning sharply against <mark>Donald Trump</mark> as the government shutdown stretched on beyond its third week, and even one of the most Trump-friendly cable news outlets is no longer giving the president any cover. This week, Fox News published an op-ed on the front page of its website claiming that Democratic leaders Chuck Schumer and Nancy Pelosi are schooling Trump when it comes to the shutdown and that the public has turned against the president. Written by <mark>Leslie Marshall</mark>, the story noted that most Americas seem to agree with the Democrats that Trump's border wall would be an ineffective way to combat illegal immigration and address border security. <mark>Marshall</mark> needled Trump even more by pointing out that Pelosi, one of his main adversaries, is more popular with voters than he is at this point. \"While most voters believe there is a border crisis, they don't feel Trump's border wall will solve the problem, echoing the sentiments of the Democratic leadership,\" she wrote. \"Add in that Trump's approval ratings stand at 41 percent, the lowest since September, while his disapproval rating is 54 percent, the highest it's been since September. Plus the fact that for the first time in his presidency, he is less popular than Nancy Pelosi, his main adversary .\" The shutdown began just before Christmas after Trump rejected a bipartisan funding measure and insisted that Congress provide funding for the border wall. Democrats have remained steadfast in their stance not to offer any funding, and the shutdown has become the longest in American history. With the shutdown keeping more than 800,000 federal employees out of work and out of a paycheck, public opinion polls show that the majority of Americans blame Trump, and that number is growing. A recent poll from the Washington Post/ABC News found that 53 percent of respondents blamed Trump and Republicans, while another from CBS News / YouGov poll found that 47 percent blamed Trump, and a CNN poll found that 55 percent blamed <mark>Donald Trump</mark> for the shutdown. President Trump has insisted that he is not going to compromise with Democrats to end the government shutdown, and that he is comfortable in his unbendable position. But privately, it's sometimes a different story. https: //t.co/v4dLdtLwxm--Khashoggi's Ghost (@ UROCKlive1) January 17, 2019 <mark>Donald Trump</mark> may have himself to blame for the public sentiment. In the days before the shutdown began, he said during a televised meeting with Democratic leaders that he would \"proudly\" shut down the government in his demand for border wall funding and that he alone would take the blame. Trump quickly shifted away from that position, taking to Twitter to lay blame at the feet of Democrats, but the majority of Americans do not agree.", "articleID": "2019011703_00151932_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Leslie Marshall": ["Q27996208", "Q6531003"]}}, {"date": "2019-01-17", "url": "http://europe.newsweek.com/rudy-giuliani-i-never-said-there-was-no-collusion-trump-campaign-1295066", "content": "Rudy Giuliani:' I Never Said There Was No Collusion' With <mark>Trump</mark> Campaign On 1/17/19 at 12:27 AM Share U.S. Rudy Giuliani said Wednesday that President <mark>Donald Trump</mark> didn't collude with the Russians during the 2016 presidential campaign, but never denied the campaign colluded with the Russian government. In an interview with CNN's <mark>Chris Cuomo</mark>, Giuliani said he can't speak for anyone who worked for the campaign, including former campaign chairman Paul Manafort. \"I never said there was no collusion between the campaign or people in the campaign,\" Giuliani said on <mark>Cuomo</mark> Prime Time. \"I said the President of the United States. There is not a single bit of evidence the President of the United States committed the only crime you can commit here, conspiring with the Russians to hack the DNC .\" The president and his closest allies have maintained they never had collusion between the campaign and the Russian government. A report says an insider close to the <mark>Trump</mark> campaign admits that Manafort tried swapping polling data to Ukrainian associates tied together with Russian intelligence officials. Giuliani told <mark>Cuomo</mark> that his client, <mark>Trump</mark>, only learned of such accusations through the news, and that the president never shared polling data. CNN \"<mark>Donald Trump</mark> wasn't giving polling data to anyone,\" Giuliani said. \"He did not know about it until it was revealed a few weeks ago in an article .\" The president has repeatedly denied any link between his campaign and the Russian government--at least 13 times through tweets. \"Democrats can't find a Smocking (sic) Gun tying the <mark>Trump</mark> campaign to Russia after James Comey's testimony. No Smocking (sic) Gun...No Collusion .' @ FoxNews. That's because there was NO COLLUSION. So now the Dems go to a simple private transaction, wrongly call it a campaign contribution,\" <mark>Trump</mark> tweeted on Dec. 13. The president has often said the Democrats are on a \"witch hunt\" in efforts to find any evidence of corruption, including the court case against former attorney <mark>Michael Cohen</mark> and his payment of hush money to two women in 2016 for alleged extramarital affairs with the future president. \"Which it was not (but even if it was, it is only a CIVIL CASE, like Obama's - but it was done correctly by a lawyer and there would not even be a fine. Lawyer's liability if he made a mistake, not me),\" <mark>Trump</mark> said. \"<mark>Cohen</mark> just trying to get his sentence reduced. WITCH HUNT!\" ", "articleID": "2019011705_00248118_W", "names": {"Chris Cuomo": ["Q16728305", "Q5112179"], "Donald Trump": ["Q22686", "Q27947481"], "Michael Cohen": ["Q16728129", "Q18038631", "Q1930523", "Q22277395", "Q28868110", "Q6829330", "Q6829331", "Q6829332", "Q6829335", "Q6829336"]}}, {"date": "2019-01-18", "url": "https://www.dallasnews.com/arts/classical-music/2019/01/18/response-shutdown-dallas-symphony-offering-free-tickets-federal-employees", "content": "Special Contributor Get Daily Dallas News Headlines Sign Up Don't miss a story. Like us on Facebook. Like Dallas News' Facebook Page Get Unlimited Digital Access Your first month is less than a dollar. $0.99 for first 4 weeks Subscribe Now In what it's calling an effort \"to ease the burden of the current government shutdown,\" the Dallas Symphony Orchestra is offering two free tickets to federal employees now through mid-February. Tickets for an employee and guest may be obtained in person at the Guest Services Center at the Morton H. Meyerson Symphony Center. Those interested must come to the box office in person and show a federal ID. Should the shutdown end today, for instance, DSO officials say they will still be happy to welcome federal employees through mid-February. The last concerts available are Feb. 10 in Denton with the full orchestra performing and an organ recital taking place in the Meyerson on Feb 17. Donald Runnicles leads the Dallas Symphony Orchestra in dramatic, vividly characterized Mozart, Mahler Concerts during the \"free\" period include:--Jan. 20, 6 p.m.: DSO on the Go, Frisco, will host Dvořák's New World Symphony. This event takes place at Stonebriar Community Church at 4801 Legendary Drive in Frisco. Conductor <mark>Krzysztof Urbański</mark> and Concert Pianist Jan Lisiecki come to Frisco with the DSO .--Jan. 25 to Jan. 27: The Music of ABBA. Finnish artist Rajaton joins the DSO to perform ABBA's greatest, including \"Mamma Mia,\" \"Gimme! Gimme! Gimme!,\" \"Waterloo\" and \"Dancing Queen .\" --Jan. 31 to Feb. 2: <mark>John Adams</mark>, whom the DSO describes as \"one of the world's greatest living conductors,\" conducts Short Ride in a Fast Machine and Concerto for the Violin. Works by Debussy and Respighi round out the program .--Feb. 8 to Feb. 9: Concertmaster <mark>Alexander</mark> Krr and Co-Concertmaster Nathan Olson join up for a program of Mozart, Arvo Pärt and Bartók .--Feb. 10: Concertmaster <mark>Alexander Kerr</mark> and Co-Concertmaster Nathan Olson team up in Denton for a program of Mozart, Arvo Pärt and Bartók--Feb. 17: Organist <mark>James O'Donnell</mark> performs a recital with works from J.S. Bach, Duruflé and more. Login to Comment or create an account Email Password Login Forgot your password? Create an Account or login First Name Last Name Email Display Name Only letters, numbers, - (dashes) and _ (underscores) Cannot start with a - (dash) or _ (underscore) Minimum 6 characters, maximum 250 characters By submitting, you agree to our Terms of Service and Privacy Policy. Get Started Please choose a display name Only letters, numbers, - (dashes) and _ (underscores) Cannot start with a - (dash) or _ (underscore) Minimum 6 characters, maximum 250 characters Display Name Submit", "articleID": "2019011808_00039817_W", "names": {"Alexander Kerr": ["Q30122595", "Q47513756"], "James O'Donnell": ["Q58034955", "Q6140476"]}}]