[{"date": "2019-01-18", "url": "https://www.dallasnews.com/arts/classical-music/2019/01/18/response-shutdown-dallas-symphony-offering-free-tickets-federal-employees", "content": "Special Contributor Get Daily Dallas News Headlines Sign Up Don't miss a story. Like us on Facebook. Like Dallas News' Facebook Page Get Unlimited Digital Access Your first month is less than a dollar. $0.99 for first 4 weeks Subscribe Now In what it's calling an effort \"to ease the burden of the current government shutdown,\" the Dallas Symphony Orchestra is offering two free tickets to federal employees now through mid-February. Tickets for an employee and guest may be obtained in person at the Guest Services Center at the Morton H. Meyerson Symphony Center. Those interested must come to the box office in person and show a federal ID. Should the shutdown end today, for instance, DSO officials say they will still be happy to welcome federal employees through mid-February. The last concerts available are Feb. 10 in Denton with the full orchestra performing and an organ recital taking place in the Meyerson on Feb 17. Donald Runnicles leads the Dallas Symphony Orchestra in dramatic, vividly characterized Mozart, Mahler Concerts during the \"free\" period include:--Jan. 20, 6 p.m.: DSO on the Go, Frisco, will host Dvořák's New World Symphony. This event takes place at Stonebriar Community Church at 4801 Legendary Drive in Frisco. Conductor <mark>Krzysztof Urbański</mark> and Concert Pianist Jan Lisiecki come to Frisco with the DSO .--Jan. 25 to Jan. 27: The Music of ABBA. Finnish artist Rajaton joins the DSO to perform ABBA's greatest, including \"Mamma Mia,\" \"Gimme! Gimme! Gimme!,\" \"Waterloo\" and \"Dancing Queen .\" --Jan. 31 to Feb. 2: <mark>John Adams</mark>, whom the DSO describes as \"one of the world's greatest living conductors,\" conducts Short Ride in a Fast Machine and Concerto for the Violin. Works by Debussy and Respighi round out the program .--Feb. 8 to Feb. 9: Concertmaster <mark>Alexander</mark> Krr and Co-Concertmaster Nathan Olson join up for a program of Mozart, Arvo Pärt and Bartók .--Feb. 10: Concertmaster <mark>Alexander Kerr</mark> and Co-Concertmaster Nathan Olson team up in Denton for a program of Mozart, Arvo Pärt and Bartók--Feb. 17: Organist <mark>James O'Donnell</mark> performs a recital with works from J.S. Bach, Duruflé and more. Login to Comment or create an account Email Password Login Forgot your password? Create an Account or login First Name Last Name Email Display Name Only letters, numbers, - (dashes) and _ (underscores) Cannot start with a - (dash) or _ (underscore) Minimum 6 characters, maximum 250 characters By submitting, you agree to our Terms of Service and Privacy Policy. Get Started Please choose a display name Only letters, numbers, - (dashes) and _ (underscores) Cannot start with a - (dash) or _ (underscore) Minimum 6 characters, maximum 250 characters Display Name Submit", "articleID": "2019011808_00039817_W", "names": {"John Adams": ["Q15241538", "Q15501272", "Q16147832", "Q16149461", "Q16646023", "Q19819745", "Q22937675", "Q23302617", "Q27914979", "Q47545565", "Q48294679", "Q51586570", "Q54932731", "Q6218170", "Q6218173", "Q7224739", "Q788469", "Q84114"], "Krzysztof Urbański": ["Q11749773", "Q11749775"]}}, {"date": "2019-01-18", "url": "http://www.watfordobserver.co.uk/sport/national/17369435.shane-lowry-retains-lead-heading-into-final-round-in-abu-dhabi/", "content": "<mark>Shane Lowry</mark> remains at the head of the Abu Dhabi HSBC Championship leaderboard. 0 comments Ireland's <mark>Shane Lowry</mark> remains on course to claim the Abu Dhabi HSBC Championship as he tops the scoreboard heading into the final round. <mark>Lowry</mark>, who had hit a course record-equalling 62 on day one, followed that up with a second-round of 70 before hitting a five under-par 67 on Friday. That leaves him on 17 under and three shots clear of South Africa's <mark>Richard Sterne</mark>, who matched third-placed man Ian Poulter in carding a 69 for his third round. Leader by three ✍?? @ ShaneLowryGolf extends his lead heading into tomorrow's final round. #ADGolfChamps #RolexSeries pic.twitter.com/DIh2xSZMuq--The European Tour (@ EuropeanTour) January 18, 2019 Poulter is two shots further back, with Spaniard Pablo Larrazabal also in contention in fourth, six shots behind <mark>Lowry</mark>. As he had on Thursday, <mark>Lowry</mark> started slowly and dropped a shot on the fourth to momentarily lose his outright lead of the £ 5.4 million tournament. He recovered to birdie six, seven and eight but an eagle for <mark>Sterne</mark> on the par-five 10th kept him close enough to pounce if <mark>Lowry</mark> slips up on Saturday. After 54 holes at the #ADGolfChamps...#RolexSeries pic.twitter.com/arvGbC3HxI--The European Tour (@ EuropeanTour) January 18, 2019 Poulter, meanwhile, remains in with a slim chance of victory as he adjusts his preparations after a long-haul flight to the United Arab Emirates. \"I haven't hit any balls after the round and I haven't done what I would normally do,\" he told europeantour.com. \"So I've been resting up a lot and hopefully that helps tomorrow. To finish with a three is great and, you know, hopefully I can have a little run up the board tomorrow. Ian Poulter remains in the running after an impressive third round. (Owen Humphreys/PA)\" It was a good sleep last night. I haven't felt too bad so I think I've kind of got over most of the jet lag. \"While Poulter remains in the running, fellow Englishman Lee Westwood fired a round of 71 to drop out of contention on nine under overall, with Scotland's <mark>Scott Jamieson</mark> tied for fifth, one shot clear of Westwood. 0 comments", "articleID": "2019011816_00385540_W", "names": {"Richard Sterne": ["Q1772666", "Q52086302"], "Scott Jamieson": ["Q2662865", "Q516535"], "Shane Lowry": ["Q2067337", "Q2736966"]}}, {"date": "2019-01-19", "url": "http://kesq.com/lifestyle/missing-link-in-human-history-confirmed-after-long-debate/981903935", "content": "\"Missing link' in human history confirmed after long debate Finding detailed in journal\" Paleoanthropology' By: Posted: Jan 19, 2019 08:24 AM PST Updated: Jan 19, 2019 09:08 AM PST The remains were first unveiled in 2010, and have sparked debate among scientists ever since. Alexander Joe/Getty Images The remains were first unveiled in 2010, and have sparked debate among scientists ever since. Related Content Saturn's rings haven't always been there (CNN) - Early humans were still swinging from trees two million years ago, scientists have said, after confirming a set of contentious fossils represents a \"missing link\" in humanity's family tree. The fossils of Australopithecus sediba have fueled scientific debate since they were found at the Malapa Fossil Site in South Africa 10 years ago. And now researchers have established that they are closely linked to the Homo genus, representing a bridging species between early humans and their predecessors, proving that early humans were still swinging from trees 2 million years ago. The Malapa site, South Africa's \"Cradle of Humankind,\" was famously discovered by accident by nine-year-old Matthew Berger as he chased after his dog. That stroke of luck eventually led to this week's finding, detailed in the journal \"Paleoanthropology .\" The findings help fill a gap in humankind's history, sliding in between the famous 3-million-year-old skeleton of \"Lucy\" and the \"handy man\" Homo habilis, which was found to be using tools between 1.5 and 2.1 million years ago. They show that early humans of the period \"spent significant time climbing in trees, perhaps for foraging and protection from predators,\" according to the study in the journal \"Paleoanthropology .\" \"This larger picture sheds light on the lifeways of A. sediba and also on a major transition in hominin evolution,\" said lead researcher <mark>Scott Williams</mark> of New York University. \"Still so much to discover' Two partial australopith skeletons--a male and a female - were found in 2008 at a collapsed cave in Malapa, in South Africa's\" Cradle of Humankind. \"\"Australopithecus\" means \"southern ape,\" a genus of hominins which lived between around 4 and 2 million years ago. Their discovery set off years of debate in the scientific community, with some rejecting the idea that they were from a previously undiscovered species with close links to the homo genus and others floating the idea that they were from two different species altogether. But the new research has laid those suggestions to rest, and outlined \"numerous features\" the skeletons share with fossils from the homo genus. Australopithecus sediba's hands and feet, for instance, show it was spending a good amount of time climbing in trees. The hands have grasping capabilities, which are more advanced than those of Homo habilis, suggesting it, too, was an early tool-user. The researchers of the paper to highlight the remarkable story of how the fossils were found, pointing out that other dramatic clues to humanity's history are still waiting to see the light of day. \"The first fossil of Au. Sediba was discovered by Matthew Berger, then a nine-year-old, who happened to stop and examine the rock he tripped over while following his dog Tau away from the Malapa pit,\" they wrote. \"Imagine for a moment that Matthew stumbled over the rock and continued following his dog without noticing the fossil,\" they added. \"If those events had occurred instead, our science would not know about Au. sediba, but those fossils would still be there, still encased in calcified clastic sediments, still waiting to be discovered .\" \"The fortuitous discovery of the Malapa fossils and other similarly fortuitous recent finds should be reminders to us all that there is still so much to discover about our evolutionary past,\" the authors concluded. Copyright 2019 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Download the KESQ News Channel app on iTunes or Google Play for up-to-the-minute breaking news alerts & more", "articleID": "2019011917_00092936_W", "names": {"Scott Williams": ["Q16228906", "Q2331415", "Q3399819", "Q59392591", "Q7437512", "Q7437514", "Q7437515", "Q7437517", "Q7437518"]}}, {"date": "2019-01-21", "url": "https://www.yorkshirepost.co.uk/sport/football/rotherham-united/big-match-verdict-rotherham-united-show-their-fighting-spirit-but-brentford-prove-too-strong-1-9547185", "content": "York Big Match Verdict--Rotherham United show their fighting spirit but Brentford prove too strong Sorry, we're having problems with our video player at the moment, but are working to fix it as soon as we can Waiting for Video...Updated: 06:47 Monday 21 January 2019 Share this article Sign Up To Our Daily Newsletter Sign up Have your say THE DRINK of choice was Champagne after Rotherham United's feted home victory over Brentford to clinch promotion on a heady, unforgettable Spring afternoon in April 2001. The beverage on offer on a raw winter's day on Saturday was coffee and its pungent aroma was discernible throughout a sobering occasion. The Millers--whose squad's market value was reportedly set at £ 6.44 m in figures revealed last week--are taking on the rest of their Championship rivals with the equivalent of one arm tied behind their backs. Rich in spirit, competitiveness and energy they may be, but in the unforgiving second-tier, such qualities can only take you so far. Competing against a club--a traditionally comparable one at that--whose squad's own market value was registered at £ 46.22 m, the chasm in class was a yawning one on the second-half evidence. It exposed just what the Millers are up against this season as they suffered at the hands of a Brentford side whose game changers all came to the party once again after inflicting a 5-1 first-day humbling upon Paul Warne's side. Rotherham's Matt Crooks celebrates after his side's second goal against Brentford. That United still find themselves out of bottom three is laudable. Anyone who begged to differ could have done worse than listen to Brentford head coach <mark>Thomas Frank</mark> after the match. Unprovoked and before being asked any questions on the game, the Dane complimented his team's opponent and opposite number for their achievement so far in keeping out of the relegation zone, despite having the lowest budget in the Championship. It was a moment of class--in keeping with his side's stylish efforts on the pitch. Rather less endearing was the reaction of a section of Millers supporters who ironically cheered when loan full-back Zac Vyner--a young defender still making his way in the game--was substituted in the second half. We speak to all the managers after games and they appreciate that the gulf between League One and this division is a massive gulf. Paul Warne A club and set of supporters who need to stay together on and off the pitch if they are to retain their Championship status this season--which would be a remarkable feat--it was a moment which will have hurt many fans and most definitely Warne. On the treatment of Vyner, the Millers chief said: \"It is disgusting. I do not understand it. Fans possibly see games differently to me. It summed it up when Zak came off that all the coaches went to thank him for his efforts .\" I did not take him off because he was having a stinker in my eyes. I took him off because I went three at the back. I have done that loads of times this season. You could see Will Vaulks clapping him and saying: \"Zak, well done .' He put loads of crosses in .\" It is disappointing for me. Zak has been great for us and I do not think any player should be singled out for abuse. \"Rotherham's Will Vaulks wins a header against Brentford on Saturday. On support for what he is up against from his opposing number, Warne added:\" Everyone in football knows the challenge we have, but we've taken it on every week with a smile on our face and tried to be the best we can be. The lads give everything. \"We speak to all the managers after games and they appreciate that the gulf between League One and this division is a massive gulf. Realistically, my team is virtually the same as last year .\" The early signs were ominous for the hosts on Saturday. An instinctive, rapier-like move orchestrated by Rico Henry and Said Benrahma--who both had afternoons to savour--undressed the Millers and it was left to Kamohelo Mokotjo to coolly tuck away a second-minute opener. It was to the Millers' credit that they overcame a rough start to impose their own will upon the visitors and it really should have seen them lead at the break. <mark>Jon Taylor</mark>'s leveller, a super strike after <mark>Anthony Forde</mark>'s corner was not cleared--was a head-turning one and the winger was inches away from a second following Vyner's sweet centre. The hosts continued to press with Ajayi somehow missing from a few yards out after Daniel Bentley's instinctive reaction save to keep out Clark Robertson's point-blank header--and it proved a fateful moment. On the resumption, the quality of Brentford--swift in thought and movement with poise on the ball--wore the Millers down, while <mark>Michael Smith</mark> ploughed the loneliest of furrows on his own up front at the other end. A clever effort which flew just wide from the Bees' top-scorer Neal Maupay signalled Brentford's intent before a superb move was started and clinically finished by the buoyant Benrahma, with Ollie Watkins and Romaine Sawyers also involved. Once more, the Millers' character was unquenchable and they hauled themselves back up again when a cross from Richie Towell was met with a glancing header from Robertson, which went in off Bees defender Ezri Konsa. This time, Brentford did not panic and the marauding Henry soon set up Mokotjo for another unerring low finish and this time, there was no home fightback. Maupay chipped over before having his moment after the increasingly besieged hosts were opened up again as the Bees bagged their first league away win since April with a hint of swagger. Rotherham United: Rodak, Vyner (Yates 78), Ajayi, Robertson, Mattock, Vaulks, <mark>Forde</mark> (Vassell 86), Towell, Wiles (Crooks 59), <mark>Taylor</mark>, <mark>Smith</mark>. Unused substitutes: Wood, Price, Raggett, Jones. Brentford: Bentley, Konsa, Jeanvier, Barbet, Dalsgaard, Sawyers, Mokotjo (Da Silva 88), Henry, Watkins (Ogbene 88), Maupay, Benrahma (Canos 76). Unused substitutes: Odubajo, McEachran, Daniels, Sorensen. Referee: Tony Harrington (Cleveland).", "articleID": "2019012110_00167783_W", "names": {"Anthony Forde": ["Q3618491", "Q4772527"], "Jon Taylor": ["Q19518141", "Q6271673"], "Michael Smith": ["Q15637781", "Q1620255", "Q16207164", "Q16225563", "Q1627389", "Q16976514", "Q1720858", "Q18325554", "Q18325556", "Q18344457", "Q1929419", "Q1982423", "Q21175251", "Q3856267", "Q52907019", "Q56394971", "Q58870848", "Q6829665", "Q6831697", "Q6834460", "Q6834463", "Q6834464", "Q6834465", "Q6834468", "Q6834469", "Q6834471", "Q6834472", "Q6834473", "Q6834474", "Q6834475", "Q6834476", "Q6834478", "Q6834480"], "Thomas Frank": ["Q13469562", "Q1497420", "Q2744752", "Q57481970"]}}]