[{"date": "2019-01-10", "url": "http://chron.com/life/society/article/Lynn-Wyatt-and-Lauren-Anderson-name-remaining-13523999.php?cmpid=hpctp", "content": "https: //www.chron.com/life/society/article/Lynn-Wyatt-and-Lauren-Anderson-name-remaining-13523999.php Lynn Wyatt and <mark>Lauren Anderson</mark> name remaining Texas Medal of Arts Awards honorees at Houston Ballet Austin gala to celebrate Matthew McConaughey, Mark Seliger, <mark>Brandon Maxwell</mark> and Trenton Doyle Hancock and more benefiting Texas Cultural Trust By Amber Elliott Updated 2:36 pm CST, Thursday, January 10, 2019 Former Texas Medal of the Arts Award recipients Lynn Wyatt and <mark>Lauren Anderson</mark> pose for a photo with Texas Cultural Trust Executive Director Heidi Marquez Smith on Thursday, Jan. 10, 2019. Former Texas Medal of the Arts Award recipients Lynn Wyatt and <mark>Lauren Anderson</mark> pose for a photo with Texas Cultural Trust Executive Director Heidi Marquez Smith on Thursday, Jan. 10, 2019. Photo: Elizabeth Conley, Staff Photographer Photo: Elizabeth Conley, Staff Photographer Image 1 of / 22 Caption Close Image 1 of 22 Former Texas Medal of the Arts Award recipients Lynn Wyatt and <mark>Lauren Anderson</mark> pose for a photo with Texas Cultural Trust Executive Director Heidi Marquez Smith on Thursday, Jan. 10, 2019. Former Texas Medal of the Arts Award recipients Lynn Wyatt and <mark>Lauren Anderson</mark> pose for a photo with Texas Cultural Trust Executive Director Heidi Marquez Smith on Thursday, Jan. 10, 2019. Photo: Elizabeth Conley, Staff Photographer Lynn Wyatt and <mark>Lauren Anderson</mark> name remaining Texas Medal of Arts Awards honorees at Houston Ballet 1 / 22 Back to Gallery A tony group of well-heeled Texans gathered at Houston Ballet on Thursday morning. There wasn't a ballet slipper or pointe shoe in sight. Even <mark>Lauren Anderson</mark>, one of the first African-American ballerinas to become a principal for a major dance company, rocked a patent stiletto. Her task, alongside fellow state treasure Lynn Wyatt, was to unveil this year's three remaining Texas Medal of Arts Awards honorees. The Texas Cultural Trust usually divulges its full roster all at once. Most times, the big reveal happens during a semiformal announcement party. But with bold-face recipients including Matthew McConaughey, Mark Seliger, <mark>Brandon Maxwell</mark> and Trenton Doyle Hancock headlining the 10th biennial list, the Austin-based nonprofit couldn't wait that long--or resist a little early name-dropping. Fellow Texans Stephen Harrigan, Elaine Molinar and Craig Dykers have also been tapped, as has Laredo's Vidal M. Trevino School of Communications and Fine Arts. On Thursday, Texas Cultural Trust's board members traveled from across the state to hear the final trio - Boz Scaggs, Stephen Harrigan and <mark>Jennifer Holliday</mark> - receive their due, bringing the total headcount to 11. Why the extended drumroll? \"We want to garner as much support and celebrate these legends for as long as possible,\" said Heidi Marquez Smith, Texas Cultural Trust's executive director who also feted the early press conference. She told onlookers from the blue-screened stage, \"For artists and those in creative fields, a Texas Medal of Arts Award is the highest honor in the land .\" Houston Ballet's executive director <mark>Jim Nelson</mark> also shared brief remarks. He observed how fitting it was for <mark>Anderson</mark>, who danced with the company from 1983 to 2006, to return for the occasion. Afterward, the crowd posed for photos with <mark>Anderson</mark> and Wyatt. The women, both TMAA winners in 2017, got along famously. \"Lynn, if I'm in the picture, you're in the picture,\" <mark>Anderson</mark> said, coaxing her ally to join her at center stage. It's good practice for the River Oaks cocktail party scheduled in their honor later that evening, and the main event, next month in Austin. Texas Cultural Trust's two-day celebration Feb. 26 - 27 promises quite the show - especially if it's announcement style is any indication. Lifestyle In just 35 minutes, you can have this silky, spicy take on a.. . Major fashion moments steal the show at Winter Ball honoring...Celebrity couples you forgot dated in the '90s Legendary rocker Janis Joplin would have turned 76 this weekend Famous central Texas BBQ spot opens Houston location this weekend Most Popular 1 Mother grieves for teen son killed as friend showed off gun 2 Local business spotlight: Demand high for Crosby Crawfish Shack's well known taste 3 She scammed dozens out of savings so she could stay at the Ritz 4 First Buc-ee's outside of Texas opens today 5 State Bar drops probe into ex-prosecutor accused of withholding evidence in Texas death row case 6 3 dead after East Houston home invasion triggers shootout 7 \"Boss Life Ball' pulls hot crowd for charity 8\" Fox & Friends' Apologizes for Graphic Mistakenly Announcing Ruth Bader Ginsburg's Death (Video) 9 Memes mock gut-wrenching playoff losses by Saints, Chiefs 10 Pearland's iconic rice silos are officially gone, but you can still say goodbye View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019012119_00080215_W", "names": {"Brandon Maxwell": ["Q23766302", "Q30122593"], "Jennifer Holliday": ["Q3062952", "Q439626"], "Jim Nelson": ["Q17370723", "Q6197142", "Q6197145", "Q6197147", "Q6197149"], "Lauren Anderson": ["Q459868", "Q57431632", "Q6500115"]}}, {"date": "2019-01-22", "url": "https://ivebeenmugged.typepad.com/my_weblog/2019/01/google-eu-privacy-canada.html", "content": "Google To EU Regulators: No One Country Should Censor The Web Internationally. Poll Finds Canadians Support \"Right To Be Forgotten' Tuesday, January 22, 2019 For those watching privacy legislation in Europe, MediaPost reported:\" ...Maciej Szpunar, an advisor to the highest court in the EU, sided with Google in the fight, arguing that the right to be forgotten should only be enforceable in Europe--not the entire world. The opinion is non-binding, but seen as likely to be followed. \"For those unfamiliar, in the European Union (EU) the right to be forgotten:\" ...was created in 2014, when EU judges ruled that Google (and other search engines) must remove links to embarrassing information about Europeans at their request...The right to be forgotten doesn't exist in the United States...Google interpreted the EU's ruling as requiring removal of links to material in search engines designed for European countries but not from its worldwide search results...In 2015, French regulators rejected Google's position and ordered the company to remove material from all of its results pages. Google then asked Europe's highest court to reject that view. The company argues that no one country should be able to censor the web internationally. \"No one corporation should be able to censor the web internationally, too. Meanwhile, Radio Canada International reported:\" A new poll shows a slim majority of Canadians agree with the concept known as the \"right to be forgotten online .\" This means the right to have outdated, inaccurate, or no longer relevant information about yourself removed from search engine results. The poll by the <mark>Angus Reid</mark> Institute found 51 percent of Canadians agree that people should have the right to be forgotten...\"Consumers should have control over their information. If that control is limited to only the country of their residence, then the global nature of the internet means that control is very limited--and probably irrelevant. What are your opinions? Posted at 10:15 AM in Canada, Europe, Government, Legislation, Privacy, Surveys | Permalink | Comments (0) Reblog (0)", "articleID": "2019012215_00360958_W", "names": {"Angus Reid": ["Q4764230", "Q4764232"]}}, {"date": "2019-01-23", "url": "https://wtop.com/latin-america/2019/01/many-latin-american-governments-support-venezuelas-guaido/", "content": "Home \"Latin America News\" Many Latin American governments...Many Latin American governments support Venezuela's Guaido By The Associated Press January 23, 2019 5:59 pm 01/23/2019 05:59 pm Share Anti-government protesters cheer after Juan Guaido, head of Venezuela's opposition-run congress, declares himself interim president of the South American country until new elections can be called, at a rally demanding the resignation of President Nicolas Maduro, in Caracas, Venezuela, Wednesday, Jan. 23, 2019. (AP Photo/Boris Vergara) Numerous governments in the Western Hemisphere quickly recognized Venezuelan opposition leader Juan Guaido as the interim president of his crisis-torn country Wednesday. The United States and all but one member of the Lima Group of regional nations threw their support behind Guaido after he declared himself interim president in a defiant speech before masses of anti-government demonstrators. The declaration by the Lima Group, which has been vocal in denouncing Venezuelan President Nicolas Maduro, was signed by Argentina, Brazil, Canada, Chile, Colombia, Costa Rica, Guatemala, Honduras, Paraguay and Peru. Mexico was the only member to not sign. The group said it supported the beginning of the process of a democratic transition in Venezuela following its constitution with aim of carrying out new elections as soon as possible. It also condemned acts of violence in Venezuela and made a call for peace. U.S. President Donald Trump called on Maduro to resign and said the U.S. would use the \"full weight\" of its economic and diplomatic power to push for the restoration of Venezuela's democracy. Venezuelans have been suffering from an economic and governance crisis that has led millions to flee hyperinflation and severe shortages of food and medicine. Paraguay was the first regional country to express support after Guaido took an oath before thousands of supporters. \"Count on us to embrace freedom and democracy again,\" Paraguayan President Mario Abdo Benitez said on Twitter. Brazilian President Jair Bolsonaro said Latin America's largest nation also would support the 35-year-old lawmaker \"so that peace and democracy return to Venezuela .\" There was no immediate reaction from Cuba, which is the top regional ally of Maduro, nor from Nicaragua, which is also close to Maduro's socialist government. Maduro was sworn into a contested second term two weeks ago in a move condemned by dozens of nations. Guaido has said it is his right under Venezuela's constitution to take over the presidency until new elections can be called. But not everyone backed his bold move. Bolivian President Evo Morales condemned what he called an imperialist attack. \"Our solidarity with the Venezuelan people and Nicolas Maduro, in these decisive hours when the claws of imperialism are once again trying to deal a death blow on democracy and self-determination on the peoples of South America,\" Morales tweeted. \"We will not be the backyard of the U.S. again .\" A spokesman for Mexican President Andres Manuel Lopez Obrador said Mexico continued to recognize Maduro as Venezuela's president. \"We maintain our position of neutrality in the Venezuelan conflict,\" <mark>Jesus Ramirez</mark> Cuevas told Mexico's Milenio news television channel. \"The Mexican government is analyzing the situation in Venezuela. Until now, there is no change in its diplomatic relations with that country nor with its government .\" Maduro responded to Guaido's move by cutting off diplomatic relations with the U.S., the largest importer of Venezuelan oil, and announced that American diplomats had 72 hours to leave his country. He also heaped much of the blame for developments on U.S. imperialism and Colombia's \"oligarchy .\" Colombian President Ivan Duque said his nation would accompany Guaido \"in this process of transition toward democracy so that the Venezuelan people can free themselves from the dictatorship .\" Copyright © 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, written or redistributed. More News", "articleID": "2019012323_00082684_W", "names": {"Jesus Ramirez": ["Q1688370", "Q553050"]}}, {"date": "2019-01-24", "url": "https://www.highsnobiety.com/p/purses-for-men/", "content": "The crowds outside menswear shows in Paris are always a good hint of what's going to be the talk of the industry in the months to come. Last week we saw plenty of great' fits, but Frank Ocean and his large green Celine bag were a particular show-stealer. Snapped outside Louis Vuitton, the sleek leather Phoebe Philo-designed tote contrasted against the singer's casual combo of bright orange puffer, jeans, and beanie. It showed how the attitude toward bags in menswear is changing. You don't have to look femme or overdressed to sport a sizable accessory traditionally associated with women's fashion. In recent years, bags for men have gone from something almost taboo to one of the hottest trends, and the biggest industry players are keen to jump on board. In Milan, Fendi presented men's versions of the label's signature Baguette and Peekaboo bags, and a collaboration with Japanese luggage expert PORTER. A hybrid of a side bag and handbag in red, blue, and champagne-colored nylon with a golden F clasp, the Baguette is certain to be a sought-after model. At <mark>Kim Jones</mark>' Dior in Paris, almost every outfit was complemented by a bag: the new cross-body men's version of Dior's Saddle bag in silky nylon; neck wallets and small hard-case tube-shaped bags; soft fur bags; and more understated messenger-style numbers with metal buckles by <mark>Matthew Williams</mark> of ALYX. Highsnobiety / Eva Al Desnudo 4 more Highsnobiety / Eva Al Desnudo Highsnobiety / Eva Al Desnudo Highsnobiety / Eva Al Desnudo Highsnobiety / Eva Al Desnudo Previous Next At Prada, meanwhile, there were already covetable black nylon backpacks, and Loewe had sleek crocodile clutch bags, large leather totes, and variations of the label's hit Puzzle bag. For Fall/Winter 2019, almost every major fashion house had an updated it-bag for men, but few had worked on theirs as thoroughly as Virgil Abloh. In less than a year at Louis Vuitton, he has given us numerous versions of the Keepall: glow-in-the-dark; iridescent; semi-transparent neon pink and yellow; soft gray, and oversized black monogram-embossed in puffer material. This season also also gave us medium and purse-like mini versions of Louis Vuitton's signature retro travel trunks. Historically, men and bags have had a complicated relationship. Google the two words together and you'll find anxiety-laden questions along the lines of \"Are man bags acceptable?\" \"Can a man carry a purse?\" \"How to wear a man bag?\" and \"What do you put in a man bag?\" In the past, the rigid idea of masculinity allowed a backpack, a briefcase, or ideally nothing at all, stuffing your essentials into one's pockets. In fact, the very term \"man bag\" is an awkward attempt at emasculation. Louis Vuitton 4 more Louis Vuitton Louis Vuitton Louis Vuitton Louis Vuitton Previous Next Attitudes started to shift a few years ago. That went hand in hand with the rise of streetwear and was influenced by street culture references and ’90s fashion. First fanny packs and then side bags became a menswear staple. It was a no-brainer, a combination of simple utilitarian design and practicality. The overwhelming success of outdoor and skate brands' versions were perhaps a turning point--think Patagonia, The North Face, Supreme, and Palace. It proved that in the menswear and streetwear markets, a bag can be a token of hype and obsession as much as the Birkin bag was for the Sex and the City generation of women. The side bag trend is still going strong, with the likes of Gucci, A-COLD-WALL *, and Burberry continuing to expand the range. The popularity of side bags was followed by the growing influence of even more masculine workwear and military designs: chest rigs (pioneered by ALYX), harnesses, and belt bags. The designs often played with fetish elements and added a bit of structure to relaxed sportswear silhouettes. The shift we witnessed on this season's runways, however, is bigger. Previously, men's bags were worn mostly as yet another garment and left hands-free, but now we're talking handbags and shoulder bags, styled and worn exactly as women do. As seen with Ocean's Celine tote, women's bags and purses are becoming more acceptable in men's wardrobes. Highsnobiety / Julien Tell 4 more Highsnobiety / Eva Al Desnudo Highsnobiety / Eva Al Desnudo Highsnobiety / Julien Tell Highsnobiety / Julien Tell Previous Next \"I can't believe men/guys/boys are wearing girly stuff and I actually couldn't be happier. We are in some fun times,\" photographer Mordechai Rubinstein wrote recently on Instagram. \"A while back I posted a guy wearing a women's LV purse cross body. He took the strap from any old bag and put it on his mother's old purse .\" As a major driving force in contemporary fashion expression, hip-hop culture plays an integral part in this process. Tyler, the Creator has been rocking classic Chanel purses for a couple of years (check out dusty pink here or pale blue here). It feeds into the broader gender-bending fashion experimentation happening in hip-hop right now--think A $AP Rocky's Gucci babushka scarf or Young Thug's frilly blouses. Hip-hop culture has come a long way in challenging toxic masculinity while continuously incorporating an obsession with luxury fashion labels. If rappers are carrying Chanel purses, it's going to end up on the street soon enough. At the same time, the rise of the men's it-bag is also simply business. Bags are one of the largest sources of revenue for global luxury labels, so the math is simple: get men to buys bags and you'll sell twice as many bags. With consumption habits increasingly shaped by the more gender-neutral space of streetwear, the younger generation is becomes more comfortable with genderless shopping when it comes to accessories. View this post on Instagram Fendi might have been founded by Adele Casagrande & Edoardo Fendi, but it was Karl Lagerfeld who created the iconic inverted Zucca (or Double F) that everyone recognizes today. \"I drew the Double F in 3 seconds,\" he recalls in a 2013 documentary. \"It became the acronym of the house .\" ??: @ asap__r1cky @ highsnobietystyle #hsfacts A post shared by HIGHSNOBIETY (@ highsnobiety) on Jan 15, 2019 at 9:25 am PST Today, labels are trying to grasp the shifting meaning of luxury. The gender binaries of luxury fashion are blurring, but that can mean a curious migration of status symbols from womenswear to menswear and back again. \"Last year, we argued that sneakers had replaced handbags as the biggest status symbol in women's fashion,\" wrote Highsnobiety senior staff writer Lia McGarrigle recently. \"Looking to flex? A hard-to-get pair of kicks will impress a lot more than an off-the-rack <mark>Alexander Wang</mark> bag. It's not crazy to think the opposite could soon become true for men .\" In these uncertain times, luxury is a fluid business. Sometimes it's about inventing something new, sometimes it's about picking up something old like a classic Chanel purse and giving it a new spin. It seems the only thing that's left is deciding what to call it. Subscribe a cold wall alyx asap rocky burberry fendi frank ocean Louis Vuitton porter tyler the creator 1232 Shares Share Tweet Email WhatsApp Comments Words by Anastasiia Fedorova anastasiia_f anastasiia_fedorova Anastasiia Fedorova is a writer and curator based in London, contributing to Dazed, i-D, 032c, GARAGE, BoF, SHOWstudio and The Guardian among other titles. Read Full Article", "articleID": "2019012416_00152399_W", "names": {"Alexander Wang": ["Q251068", "Q705844"], "Kim Jones": ["Q25249302", "Q30122482", "Q6408927", "Q6408928", "Q6408929", "Q6408931", "Q6408932"], "Matthew Williams": ["Q11881525", "Q16214685", "Q1646990", "Q20795041", "Q24041573", "Q30317038", "Q3299581", "Q47813338", "Q48815671", "Q57424282", "Q6789527", "Q6789532", "Q6791433"]}}, {"date": "2019-01-24", "url": "https://www.thesun.co.uk/video/news/emiliano-salas-sister-romina-begs-authorities-to-keep-searching-for-her-brother/", "content": "Emiliano Sala's sister, Romina, begs authorities to keep searching for her brother 00:46 Shocking moment car sends baby pram flying as mum walks over zebra crossing 00:55 ARREST Former First Minister of Scotland Alex Salmond gives statement after being arrested and charged by police 03:49 Speedboat killer <mark>Jack Shepherd</mark> hands himself in to police in Georgia 01:03 Emiliano Sala--Final WhatsApp call reveals Cardiff City striker was terrified doomed plane...02:49 Mum claims she narrowly avoided DEATH on holiday after being \"squashed by an obese...03:09 Sun goes undercover in Chelsea Cloisters and finds prostitution is still rife in the block 02:53 NTA Awards--An evening of gaffes and hilarious highlights from Holly Willoughby, Piers Morgan...02:16 Man destroys Travelodge with digger in furious rampage after\" not being paid £ 600' 01:11 \"They Will be black' Tanning addict Martina Big says she\" could give birth to a black baby' on This Morning 02:05 Brainless youths spark major emergency after scaling massive crane for social media stunt 01:44 Ant McPartlin reveals Declan Donnelly was furious over drink-drive crash but that now they're...01:14 Emiliano Sala's sister, Romina, begs authorities to keep searching for her brother 00:51 Busted Matt Willis crashes into a car and spins it around as he pulls out of turning in his Mercedes SUV 01:50 SING A RAINBOW The Turkish tourist resort town of Kuşadası has been painted in rainbow colours as part of a charity p...00:34 \"TUMOUR IS BACK' YouTuber Simone Giertz reveals that brain tumour has returned less than a year after surgery to...00:30 Miracle escape for British businessmen in car smashed by train in Davos 01:08 Doomsday Clock remains stuck on two minutes to apocalyptic\" midnight' hour 00:46 Shocking moment car sends baby pram flying as mum walks over zebra crossing 00:58 \"Put another Dime in the jukebox'\" Harry's Honey' Natasha Timms dances on the bar for the crowd at...01:36 Mum sees stranger's bedroom through baby monitor 00:30 Mum releases shocking footage of autistic son being battered by bully in Ellesmere Port 00:27 Emiliano Sala search pilot says \"absolutely no chance of finding anybody alive' 02:23 TREASURE HUNT Looted Machu Picchu death mask made from METEORITES found on Florida beach could lead treasure hunters...02:20 Pornhub star Mia Khalifa reveals ball skills while in UK to watch West Ham 00:50 Mona-Go Monaco are reportedly set to fire Thierry Henry just three months into his first managerial role 00:52 Arsenal vs Manchester United: Live-stream, TV channel, kick-off time and team news 00:35 PROBLEM FOR PSG Neymar goes off in tears after nasty ankle injury makes him a doubt for Manchester United clash 01:46 Barcelona players travel for Copa Del Rey clash against Sevilla 00:40 Gonzalo Higuain full of praise from Chelsea boss Maurizio Sarri as he claims move is imminent 00:59 Mauricio Pochettino pays tribute to Emiliano Sala after plane disappears 00:34\" HE HAS TO DO MORE' Maurizio Sarri says Eden Hazard is \"not a leader' as Real Madrid rumours swirl around...01:56\" THE CLUB IS WORKING' Unai Emery frustrated with his defensive options as he looks to make TWO signings in transfer...01:05 Mario Balotelli joins Marseille on-loan after avoiding West Ham move 00:48 Gonzalo Higuain signs for Chelsea on-loan until the end of the season from Juventus 01:10 <mark>Michael Jackson</mark> impersonator has spent over $30,000 on cosmetic procedures to look like his idol 01:07 Victoria Beckham launches a workout range in collaboration with Reebok 01:37 Meghan Markle gives her best fashion tips in 2016 video for Reitmans TV 02:05 multi-tasker mum Melody Blackwell calls for more offices to be baby-friendly after her boss allows her to bring...01:15 Stay-at-home mother-of-one Gylisa Jayne who has been financially dependent on her partner, shares...02:22 Megan McKenna plays Have You Ever? with Fabulous Magazine 01:01 Mum Jennifer Mancuso defiantly shares clips of breastfeeding her twins to \"normalise'...01:11\" They Will be black' Tanning addict Martina Big says she \"could give birth to a black baby' on This Morning 01:13 OHH MY I got a controversial £ 1.2 k O-shot injection because I'd never had an orgasm...and boy did it work! 02:00 BRAVE SURVIVOR Woman who was dumped in a bath of scalding water as a baby is having laser treatment to so she can...00:31 Bikini designer Karina Irby shows her eczema in candid Instagram post 00:55 WWE star Sasha Banks has major wardrobe malfunction on Raw and bares all 00:35 Pornhub star Mia Khalifa reveals ball skills while in UK to watch West Ham 00:49 Is this the Posh and Becks of tennis? Greek pair Stefanos Tsitsipas and Maria Sakkari 00:50 Mona-Go Monaco are reportedly set to fire Thierry Henry just three months into his first managerial role 00:52 Arsenal vs Manchester United: Live-stream, TV channel, kick-off time and team news 00:35 PROBLEM FOR PSG Neymar goes off in tears after nasty ankle injury makes him a doubt for Manchester United clash 01:46 Barcelona players travel for Copa Del Rey clash against Sevilla 00:40 Gonzalo Higuain full of praise from Chelsea boss Maurizio Sarri as he claims move is imminent 00:59 Mauricio Pochettino pays tribute to Emiliano Sala after plane disappears 00:34\" HE HAS TO DO MORE' Maurizio Sarri says Eden Hazard is \"not a leader' as Real Madrid rumours swirl around...01:56\" THE CLUB IS WORKING' Unai Emery frustrated with his defensive options as he looks to make TWO signings in transfer...01:05 00:47 DON'T TEASE ME Asda now sells a giant Malteser cake--and you can smash it open to reveal more treats 01:42 HOLDING COURT <mark>Martin Lewis</mark> chokes back tears as he talks about innocent victims who were scammed out of money from...01:02 <mark>William Hill</mark> to close almost half of betting shops putting 4,500 jobs at risk 03:12' I FEEL LIKE JUMPING OFF A BRIDGE' Harry Dent, who can't read or write, claims Universal Credit led to...02:07 How two teens started £ 270k cash machine empire ZZap while still at uni 00:38 NICE TO KNOW Ben and Jerry's is launching a NEW brown sugar ice cream with cookie swirls for Valentine's Day 00:36 McVitie's now does Jaffa Cakes nibbles and we can't wait to try them 01:45 I have to live in a caravan after Universal Credit left me with no cash 00:33 PRETTY PENNY Do you have any of these rare 2p coins worth up to £ 56 in your pocket? 00:43 WHAT WOULD YOU SAY? Poundland is selling \"bling' engagement rings and some women say they are the\" best idea ever' 01:02 BABY GAGA Lidl baby sale starts on Thursday and it includes baby bouncers, prams and Tommee Tippee sets 00:47 01:59 SCOT A CHANCE Jessie Buckley stars in Wild Rose as a Glaswegian single mum with dreams of being a country singer 03:28 THE NOMINEES ARE...Lady Gaga and Olivia Colman go head to head for Best Actress at the 91st Oscars as nominations...02:21 Beautiful Boy trailer starring Timothée Chalamet and Steve Carell 02:43 \"Let's go for a ride' The official teaser trailer for Spider-Man: Far From Home 02:44 Jake Gyllenhaal stars in Netflix movie\" Velvet Buzzsaw' about paintings that...02:12 The Front Runner movie trailer starring Hugh Jackman 01:37 Marvel-ous Take a look at the latest Captain Marvel trailer starring Brie Larson, Samuel L. Jackson and Jude Law 01:12 Detainment trailer: Vincent Lambe film about the Bulger killers <mark>Robert Thompson</mark> and <mark>Jon</mark> Venables 04:41 Golden Globes 2019: Show highlights as Bohemian Rhapsody wins big prize 02:35 BASED ON A TRUE STORY Full trailer for Welcome to Marwen starring Steve Carell and Leslie Mann 01:14 Fembots make their first appearance in Austin Powers: International Man of Mystery 02:22 UFC star Fabricio Werdum saves two teens shouting \"help' drowning in sea 00:32 UFC star <mark>Mike Perry</mark> drops girlfriend with body shot in sparring session 01:10 MMA fighter T.J. Dillashaw shows his moves in intense workout in the ring 00:33 Conor McGregor confronts Paulie Malignaggi before a press-conference last year as he goads his rival 00:32 <mark>Eric Chavez</mark> faceplants into cage after being KO'd in mid-air 01:04 UFC star Polyana Viana beats up robber who threatened her with a cardboard gun 00:39 TERRIFYING INJURY MMA fighter <mark>Jonathan King</mark> suffers horrific broken leg at American Kombat Alliance: Rite of Passage 6 00:35 Conor McGregor announces birth of second child with girlfriend Dee Devlin 00:35 Conor McGregor works out with his infant son in cute play fight 01:18 <mark>Jon Jones</mark> reacts after huge UFC 232 win against <mark>Alexander Gustafsson</mark> 00:53 Conor McGregor trains for UFC comeback after Khabib Nurmagomedov loss 00:58 Lil Wanye reveals first look at XXXTentacion-featuring Don't Cry video--7 months after...00:32 BECAUSE YOU LOVE ME Celine Dion announces she's coming to the UK for her only European date of 2019 02:05 Azealia Banks banned from Aer Lingus after airport meltdown 01:13 Tom McGuire and The Brassholes' hilarious music video tribute to Ric Flair 03:09 Finnish singer and Dancing on Ice contestant Saara Aalto offered the role of\" fifth Spice...03:57 EASY TIGER Cardi B twerks in a skintight tiger onesie for raunchy new music video \"Twerk' ft City Girls 00:44 Zoe Ball says\" she hasn't slept' because she was so excited about hosting...03:34 Westlife--Hello My Love music video 03:10 Fleur East--Favourite Thing music video 00:48 Foo Fighter's Dave Grohl crashes offstage in dramatic fall after downing beer 03:57 Kevin Fret--Soy Asi music video 03:12 Kingsman The Golden Circle trailer 2 starring Colin Firth and Taron Egerton 02:34 First trailer drops for Michael Fassbender's serial killer thriller The Snowman 02:36 Path to paradise begins in hell Chaos reigns in latest trailer for the upcoming blockbuster Alien: Covenant 01:44 Ryan Gosling and Harrison Ford star in the much anticipated Blade Runner sequel 01:02 Keanu Reeves talks tough in violent trailer for John Wick: Chapter 2 02:23 <mark>Jason Isaacs</mark>, Dane DeHaan and Mia Goth in new trailer for A Cure for Wellness 03:10 The Fate of the Furious Family are turned against one another in Fast and Furious 8 trailer 02:10 Man Vs Apes New trailer for \"War For The Planet Of The Apes' teases the final showdown for the world 00:40\" Did you look at my boobs? \"Sexy action-packed trailer for new Baywatch movie with The Rock 02:06 Preview the brand-spanking new Fifty Shades Darker trailer 01:41 Watch Emma Watson in trailer for The Circle with Tom Hanks 02:19 Disney's abandoned River Country water park 01:39 Universal Orlando's newest hotel Endless Summer Resort has rooms starting from less than £ 15pp 00:41 Fire ravages award-winning luxury resort Gili Lankanfushi on a private island in the Maldives 01:19 Ex-flight attendant Shawn Kathleen reveal worst airline habits she has ever seen 02:21 NOT SO FAR, FAR AWAY Disney's behind the scenes shows Star Wars park is almost finished 00:36 Passenger spotted giving her sleeping neighbour a pedicure on a flight 02:06 Atlantic voyage Titanic will be able to be explored by tourists in Titan submersible by OceanGate for £ 83,537 01:00 Wrapped up easyJet A320 Airbus aircraft creates\" world's biggest'...06:05 So moving BA Christmas tear-jerker sees four Brit children live like Kevin in Home Alone 2 on a magical trip to New...01:38 Etihad Airways promo for \"world's most exclusive cabin in the sky'...00:36 STORMING IT Watch from cockpit as pilot lands Boeing 737 plane in thunderstorm at Palma de Mallorca airport 03:26", "articleID": "2019012417_00365505_W", "names": {"Alexander Gustafsson": ["Q20680376", "Q723744"]}}]