[{"date": "2019-01-25", "url": "https://www.news18.com/news/buzz/jaipur-literature-festival-2019-live-updates-hinduism-and-music-engage-the-masses-at-the-kumbh-of-literature-2013023.html?ref=hp_ht_pos_1", "content": "JLF 2019 LIVE Updates: Hinduism and Music Engage the Masses at the Kumbh of Literature News18. com | January 25, 2019, 10:42 AM IST Event Highlights Tech Talk And we're back, boys and girls, readers and tweeters. The second day of the 12th edition of the world's largest literature festival has begun and the sun is shining, weather is sweet, make you want to move your dancing feet (copyright: Bob Marley). In case you're wondering about why we're so giddy, \"tis because the day began with a performance by Usha Uthup. Then, Nasreen Munni Kabir began today's first session with Gulzar on\" Jiya Jale: Stories Behind The Songs .' Another interesting session that is happening simultaneously at Charbagh is on Adi Shankaracharya, Hinduism's greatest thinker, in which Pavan K Varma is in conversation with Malashri Lal. The line-up of Jaipur Literature Festival boasts Man Booker-winner <mark>Ben Okri</mark>; Pulitzer-awardee Colson Whitehead; Yale Professor and renowned astrophysicist Priyamvada Natarajan; best-selling author Alexander McCall Smith; Man Booker-winning Yann Martel; writer and essayist André Aciman whose Call Me by Your Name inspired the movie which made the world fall in love with Timothée Chalamet; Andrew Sean Greer, New York Times bestselling-author and 2018 Pulitzer Prize-winner; Germaine Greer, writer, academic, and feminist first; Sohaila Abdulali, journalist and prolific writer; Anuradha Roy, winner of the DSC Prize for Fiction 2016, and longlisted for the Man Booker 2015; Chitra Banerjee Divakaruni, award-winning novelist, poet, activist and teacher of writing; British novelist and journalist Hari Kunzru; former Newsnight anchor Jeremy Paxman, one of Britain's best-known journalists and author of nine books; Jeffrey Archer, master of the twist-in-the-tale; NoViolet Bulawayo, the first black African woman and Zimbabwean to be shortlisted for the Man Booker; and Alvaro Enrigue, one of Spanish literature's most accomplished writers. Read More Jan 25, 2019 10:42 am (IST) br /> Nasreen Munni Kabir begins today's first session with Gulzar on \"Jiya Jale: Stories Behind The Songs .' Another interesting session that is happening simultaneously at Charbagh is on Adi Shankaracharya, Hinduism's greatest thinker, in which Pavan K Varma is in conversation with Malashri Lal .--ZEE Jaipur Lit Fest (@ ZEEJLF) January 25, 2019 Here's what the second day of the\" greatest literary show on Earth' has in store for you. Tune in to @ ZEEJLF and catch all these exciting panel sessions and others live on Twitter! #ZEEJLF 2019 pic.twitter.com/ufUuWQTfVl Jan 25, 2019 10:39 am (IST) br /> #overheardatJLF: \"This place is therapeutic but cheaper than therapy...I have been away from books for so long that I needed this\" Jan 24, 2019 Meanwhile, it seems the rain Gods are not answering the pleas of the JLF crowd. Very boring launch of The Long March. Audience praying for rain @ JLF--پرندوں کی نظر (@ birdseyeview) January 24, 2019 Jan 24, 2019 5:14 pm (IST) Time for some election talk Taking a dig at Prime Minister Narendra Modi, Shashi Tharoor says the title of his book \"Paradoxical Prime Minister' is apt .\" Initially, Mr Modi was saying all the correct things. He was talking about sabka vikas, He was saying I will be a prime minister for all Indians, he was saying that constitution was my holy book and so on and on. So I said we not only have to welcome these statements but by welcoming them we are putting up a yardstick against which we will judge him in future. If I had criticized him even when he was saying the right things, it undermines our credibility to criticise him when he does a wrong thing, \"Tharoor said. Six months after PM Modi came to power, Tharoor said he started writing his book\" Paradoxical Prime Minister'. \"I was able to begin it with words, I told you so,\" he said. \"He says all these liberal things and makes all these pronouncements. But he rests for his own political importance for his electoral viability across the country on the most liberal elements in the Indian society,\" the Congress leader said. \"Unfortunately, Mr Modi has spent the last four and a half year proving me right .\" Jan 24, 2019 4:16 pm (IST) Shashi Tharoor on what kind of \"liberal' he is:\" I think of myself as an instinctive liberal, not just ideologically but also in my attitude in life. In that sense that I think why should the government tell someone whom to love in the bedroom or what to eat? \"Jan 24, 2019 4:04 pm (IST) Shashi Tharoor's session on Tharoorism begins. Despite light showers at Diggi Palace, the session is packed. We already know #Tharoorism is a winner at JLF. Tharoor's farrago threatening to bring cold rain to #JLF 3:15 pm (IST) Damn it, Nirav. One needs to snack in order to snark. Nirav idk about you buddy can we have some damn lunch? Snark is hard work https: //t.co/hngsUYkGij--JLF Insider (@ JLFInsider) January 24, 2019 Jan 24, 2019 3:04 pm (IST) Juergen Boos spoke to Urvashi Butalia about\" So many books, so little time \". And we couldn't agree more with the sentiment/topic of discussion .--ZEE Jaipur Lit Fest (@ ZEEJLF) January 24, 2019 So Many Books, So Little Time: Juergen Boos in conversation with Urvashi Butalia https: //t.co/8IG8etZGsR Jan 24, 2019 2:31 pm (IST) While Sachin Pilot spoke to Sreenivasan Jain about democracy and the political process, and noting that he doesn't believe young people should be able to whatever they like, these young students were intently noting down his every word. We hope the deputy chief minister is okay with that. Jan 24, 2019 2:10 pm (IST) About time, no? Germaine Greer, author of the bestseller\" The Female Eunuch', speaks about her latest book \"On Rape', and argues that we need to rethink the discourse around rape. She and @ BeeRowlatt are in conversation at the @ NexaExperience Front Lawn #ZEEJLF 2019 pic.twitter.com/RQmCQf7ixT--ZEE Jaipur Lit Fest (@ ZEEJLF) January 24, 2019 Jan 24, 2019 1:49 pm (IST) Debroy on what the Puranas say about infant mortality:\" There is a story in the puranas that there was a demoness who devoured every third child. That tells us that the infant mortality rate in those days were 333 out of 1000, which was extremely high compared to today's India. \"--HarperCollins India (@ HarperCollinsIN) January 24, 2019. @ bibekdebroy in conversation with @ PushpeshPant on The Puranas at #ZeeJLF 2019 #HCIatZeeJLF. Arguably the most popular purana is the Bhagvad Purana. Many of the Puranas haven't been translated to English. My intent is to translate all 18 Puranas. pic.twitter.com/y4F5xnxLHv Jan 24, 2019 1:38 pm (IST) Nobel laureate and keynote speaker Venki Ramakrishnan:\" Art, literature and science are all ways of capturing essential truths about the world, but science has some distinctive aspects encapsulated in the Royal Society's motto is Nullius in verba, or \"On nobody's word .\" In science, it does not matter who you are or where something is written, but an idea is accepted because it is testable by experiments that can be reproduced by anyone anywhere in the world with the required training and expertise. Today, science is more important than ever. We live in a world in which science and technology are ubiquitous. Decisions are constantly made by governments, corporations, educators and others that affect us in profound ways. \"Jan 24, 2019--JLF Insider (@ JLFInsider) January 24, 2019 Jan 24, 2019 1:28 pm (IST) Bibek Debroy discussed The Puranas with Pushpesh Pant. Ancient Indian history and Hindu texts seem to be popular with many people at JLF with the masses flocking to Charbagh, Diggi Palace to hear Debroy speak .\" The puranas as well as the Ramanyanas and Mahabharatas suggests that all technologies like pushpak rath or brahmastras were always received from the god. Never invented by human beings. So people who suggest that India had all the science and technologies in ancient times must first read the puranas, \"said the author. Jan 24, 2019 12:56 pm (IST) A hit, a palpable hit. @ JLFInsider so that every time u use a cuss word it falls on your head! https: //t.co/4OSZbfB0eJ 12:06 pm (IST) Say what? Young politician thinks young people shouldn't be allowed to do whatever they want. Sachin Pilot on freedom of expression:\" I don't think young people should be allowed to do whatever they want. There is a limit. \"Wah wah--JLF Insider (@ JLFInsider) January 24, 2019 Jan 24, 2019 12:02 pm (IST) Pilot:\" Vasundhara ji promised 15 lakh new jobs in Rajasthan. There aren't that many jobs in entire Rajasthan even today. I do not want to make such promises which I cannot keep. \"Jan 24, 2019 11:53 am (IST) Sachin Pilot on Sabarimala:\" Generally we believe that women should be allowed to worship in any religious place. But in the particular instance of Sabarimala, there is a different set of sentiments that we also have to respect. \"Sure we do, especially ahead of elections. Jan 24, 2019 11:46 am (IST)\" I wasn't born a father. I wasn't born a mother. It's because of Meghna that I became a father and a mother. \"- Gulzar about Meghna. Jan 24, 2019 11:44 am (IST) Psst, the Vasu referred to here is Sreenivasan Jain Vasu asking Sachin how a young modern progressive foreign-educated person like himself can stand to be in a feudal, dynastic party like the Congress. Sachin's like MY PARTY IS THE BEST PARTY", "articleID": "2019012505_00105930_W", "names": {"Ben Okri": ["Q315362", "Q52898244"]}}, {"date": "2019-01-25", "url": "https://www.miragenews.com/farm-labour-arrangements-what-you-should-know/", "content": "Farm labour arrangements: what you should know Farm labour arrangements: what you should know Comments Off on Farm labour arrangements: what you should know GRDC Farm Business Updates are designed to enhance grower and adviser knowledge of farm business issues, to help with effective planning and management. Photo by GRDC. A series of farm business events in Western Australia in February will include a pragmatic focus on the area of farm labour arrangements--including compliance, risks and recommended actions. Pacer Legal director <mark>Stephen Park</mark> will be one of the presenters at Grains Research and Development Corporation (GRDC) Farm Business Updates in Tambellup on February 12, Lake Grace on February 13 and Moora on February 14. These events are designed to enhance grower and adviser knowledge of farm business issues, to help with effective planning and management. Mr <mark>Park</mark> will address the topic of \"Employing farm labour--practices, compliance and minimising risks' at each of the three Updates, where he will stress the need for proper planning and documentation by employers, as well as knowing your obligations and complying with them. He says farm business employers are expected to maintain and manage employment relationships in accordance with their statutory obligations .\" In this regard, they can be expected to be held to a high standard as they are expected to have the resources, as a reasonably sized enterprise, to ensure compliancy with statutory obligations. Ignorance will not be excused, \"he said. Read more: Six Australian projects selected to screen at Berlinale\" Employment issues tend to surface in periods of high stress, such as seeding or harvest time, and this is when policies and procedures are especially important to avoid disruptions to farm operations. \"Mr <mark>Park</mark> says the engagement of farm employees is undertaken primarily to drive farm profits and to relieve the workload on owners of farm businesses, and their family members .\" However, I often hear business owners say: \"given the hassles of compliancy obligations, I wish I had not taken on so many staff',\" he said. \"Yet the sourcing of labour from outside the family group is now often unavoidable given the scale of operations, and it is obviously advisable to minimise the instances of disruption caused by disaffected employees and the consequences that can arise from an unfair dismissal claim .\" Pacer Legal director <mark>Stephen Park</mark> will be one of the presenters at Grains Research and Development Corporation (GRDC) Farm Business Updates being held in WA in early February. To minimise these risks, Mr <mark>Park</mark> encourages farm business employers to: Know and comply with their employment obligations Have a concise set of employment practices and procedures Maintain a comprehensive set of employment records for seven years. He will delve deeper into the topic, including a \"drill down' session using a grower case study example, at the Update events. Areas covered will include how to identify the jurisdiction under which to engage employees, and unfair dismissal claims. Read more: Canada supports W̱SÁNEĆ Nation efforts to rebuild their nation Other speakers at the 2019 WA GRDC Farm Business Update events include: Saul Eslake, economist: Trade wars, Trump politics and Banking Royal Commissions--what's the fall-out for agriculture? The economist's view Cam Nicholson, Nicon Rural: Decisions, decisions: stress testing your farm decision thinking by building your own practical decision matrix RSM Australia personnel Jo Gilbert (Tambellup event); Cameron Taylor (Lake Grace event) and Keiran Sullivan (Moora event): Tax Tips--essential tax management strategies for grain growers Advisers Rod Grieve, agricultural consultant (Tambellup event); Steve Curtin, ConsultAg, (Lake Grace event); and <mark>David Williams</mark>, BJW Agribusiness, (Moora event): Farming to Profit--focusing on the drivers and breaking down the barriers to profit Susan Brumby, National Centre for Farmer Health: Sustaining farm family businesses--your health is critical. Each of the GRDC Farm Business Updates in WA will be held from 9.25 am to 4.25 pm. To register or f / Public Release. View in full here. Tags: Australia, Australian Government, business, Donal Trump, Grains Research and Development Corporation, GRDC, Lake Grace, Moora, Nicholson, Tambellup, Western Australia, <mark>Williams</mark> Do you want to support us? Why? Well, unlike many news organisations, we have no sponsors, no corporate or ideological interests. We don't put up a paywall--we want to keep our citizen journalism as open as we can. Although underresourced & primarily volunteer-based, we do our best to provide the community with access to quality and true unfiltered news. Our goal and mission is to provide free and alternative access to impartial information, fighting media monopolization and adhering to honesty, neutrality, fairness, transparency and independence in collection and dissemination of information. It is a bumpy road with all sorties of difficulties. (Media ownership in Australia is one of the most concentrated in the world. Since the trend of consolidation is and has historically been upward, fewer and fewer individuals or organizations control increasing shares of the mass media in our country. According to independent assessment, about 98% of the media sector is held by three conglomerates. This tendency is not only totally unacceptable, but also to a degree frightening) We can only achieve this goal together. Our website is open to any citizen journalists who want to contribute, publish high-quality articles or insights to improve public access to impartial information. You and we have the right to know, learn, read, hear what and how we deem appropriate. If you like what we do & would like to buy us a coffee (or lots of coffees), well thank you! All donations are kept completely private and confidential. Thank you very much in advance!", "articleID": "2019012506_00171453_W", "names": {"David Williams": ["Q1177200", "Q1177203", "Q1177205", "Q1177206", "Q1177211", "Q15993658", "Q18285462", "Q18921621", "Q19668225", "Q19979283", "Q21067351", "Q21191045", "Q27909752", "Q27909753", "Q28935607", "Q29643799", "Q3018997", "Q3703373", "Q39070773", "Q471380", "Q5241129", "Q5241130", "Q5241132", "Q5241135", "Q5241140", "Q5241142", "Q5241145", "Q5241146", "Q5241148", "Q5241151", "Q5241153", "Q5241155", "Q5241156", "Q5241379", "Q53147193", "Q55090089", "Q56596997", "Q56604607", "Q56650695", "Q56650757", "Q56660359", "Q56928356", "Q57161824", "Q57430588", "Q58186825"], "Stephen Park": ["Q7610192", "Q7613550"]}}, {"date": "2019-01-25", "url": "http://www.mynews13.com/fl/orlando/news/2019/01/25/trump-ally-roger-stone-released-on-bond-after-fbi-arrest", "content": "Trump Ally <mark>Roger Stone</mark> Released on Bond After FBI Arrest By Spectrum News Staff & Associated Press Orlando PUBLISHED 12:37 PM ET Jan. 25, 2019 PUBLISHED 12:37 PM EST Jan. 25, 2019 SHARE ORLANDO, Fla.--Former Trump campaign adviser <mark>Roger Stone</mark> is out on bond after his arrest Friday by the FBI on charges of witness tampering, making false statements, and obstructing an official proceeding. <mark>Roger Stone</mark> free on $250,000 bond Grand jury indicted him on 7 charges Accused of communicating with Wikileaks regarding DNC emails RELATED: READ the indictment by the Special Counsel's office <mark>Stone</mark> walked out of federal court in Fort Lauderdale after noon Friday, after a judge set a personal surety bond of $250,000. Critics booed and chanted \"lock him up\" outside the courthouse, while supporters told <mark>Stone</mark> they were behind him. \"As I have always said, the only thing worse than being talked about, is not being talked about,\" <mark>Stone</mark> quipped. <mark>Stone</mark> and his attorney said <mark>Stone</mark> was innocent of the charges, which they called politically motivated, and said <mark>Stone</mark> would win in the end. \"I am falsely accused of making false statements to the House Intelligence Committee, that is incorrect,\" <mark>Stone</mark> said. \"Any error I made in my testimony would be both immaterial, and without intent .\" A grand jury indicted <mark>Stone</mark> on a total of seven counts. The 24-page indictment by the Special Counsel's Office accuses <mark>Stone</mark> of communicating with Wikileaks, at the direction of senior Trump campaign officials, on information Wikileaks might have that was potentially damaging to the Clinton campaign during the 2016 election. According to the indictment: \"After the July 22, 2016 release of stolen DNC emails by Organization 1 [WikiLeaks], a senior Trump Campaign official was directed to contact <mark>STONE</mark> about any additional releases and what other damaging information Organization 1 had regarding the Clinton Campaign .\" The indictment also claims that <mark>Stone</mark> had knowledge of Wikileaks email releases in October and communicated about them with a high-ranking member of the Trump campaign. The document also accuses <mark>Stone</mark> of trying to keep New York radio host Randy Credico from contradicting <mark>Stone</mark>'s testimony to the House intelligence committee, even repeatedly telling Credico to \"do a Frank Pentangeli,\" a reference to a character that lies to a Congressional committee in \"The Godfather: Part II .\" The indictment says <mark>Stone</mark> also threatened Credico, called him a \"rat\" or a \"stoolie\" and accused him of backstabbing his friends. <mark>Stone</mark> was arrested by the FBI in a raid early Friday morning at his Fort Lauderdale home. In video that aired on CNN, agents can be heard banging on the door and shouting \"FBI, open the door!\" <mark>Stone</mark>'s attorney railed against the FBI for the raid. \"The spectacle this morning with a SWAT team breaking into the house, searching the house, scaring his wife, scaring his dogs, completely unnecessary. A telephone call would have done the job, and Mr. <mark>Stone</mark> would have appeared .\" <mark>Stone</mark>'s indictment and arrest culminates months of speculation about whether <mark>Stone</mark> would be impacted by the Robert Mueller investigation into Russian meddling in the 2016 election. <mark>Stone</mark> has long denied he did anything wrong, has publicly criticized the Mueller investigation and said he would never turn on President Trump. <mark>Stone</mark>, a lawyer and self-proclaimed \"dirty trickster\" who has been involved with Republican politics since the Nixon administration, has known President Trump since 1979. In 2017, he told Spectrum News anchor Ybeth Bruzual that his discussions with a Wikileaks intermediary, now identified by the FBI as Guccifer 2.0, were innocuous. \"It's a fraud, there is nothing there,\" <mark>Stone</mark> said. \"There have never been any meaningful contacts between me, the Russian state, Russian intelligence, or anyone fronting for them, and I'm anxious to say that under oath .\" In February 2018, an indictment by the Special Counsel's Office found Guccifer 2.0 to be a persona operated by Russian intelligence. The Russian government denies this. READ MORE", "articleID": "2019012518_00324556_W", "names": {"Roger Stone": ["Q19653753", "Q7358961"]}}, {"date": "2019-01-25", "url": "http://www.fox13memphis.com/news/politics/trump-backs-down-on-shutdown-agrees-to-fund-government-for-3-weeks/909924780?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Trump backs down on shutdown, agrees to fund government for 3 weeks Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Trump backs down on shutdown, agrees to fund government for 3 weeks By: Jamie Dupree Jan 25, 2019 - 12:36 PM Loading...Trump backs down on shutdown, agrees to fund government for 3 weeks Hours after flight delays attributed to a 35 day partial government shutdown began to slow airline travel at major airports on the East Coast, President Donald Trump agreed to sign off on a bill to fund and re-open the government through February 15, ensuring that 800,000 federal workers would get back pay after missing a pair of paychecks, and giving lawmakers extra time to negotiate a spending package on border security. \"I am very proud to announce today that we have reached a deal to end the shutdown and reopen the federal government,\" the President said in the White Hous Rose Garden. While the President sought to put the best light on the developments, it was a major shift for Mr. Trump, who had repeatedly refused to open the government, and allow for negotiations on border security to go forward--as his decision on Friday basically accepted what Democrats had called for since before Christmas. The President finished his remarks by saying if there's no deal by February 15 on a border wall, then he would use his powers to declare a national emergency, and move money around in the federal budget to build a wall. President Trump: \"I am very proud to announce today that we have reached a deal to end the shutdown and reopen the federal government .\" --CSPAN (@ cspan) January 25, 2019 The announcement came on the 35th day of the partial government shutdown, which began before Christmas when the President rejected a plan which he had previously agreed to--a short term plan to keep the government open until February 8--sparking a standoff over funding for the President's plan to build a border wall. Democrats said the bottom line of the President's announcement was simple--President Trump had backed down, unable to convince House Speaker Nancy Pelosi and Democrats in the Congress to give him money for his border wall. \"After he said,\" re-open the government, \"I think everyone stopped listening,\" said Rep. Rick Larsen. \"This is a recognition by Pres Trump that his forced shutdown is hurting America and is the wrong way to try to change policy,\" said Sen. <mark>Jack Reed</mark> (D-RI). \"This is not a major legislative achievement, and the President should never have inflicted pain on America for 35 days, but this is a first step,\" said Sen. Brian Schatz (D-HI). \"It's about damn time,\" said Rep. Earl Blumenauer (D-OR). As for Congressional Republicans, some quickly pointed the finger of blame at more conservative GOP lawmakers in the House, who pressed the President to force this shutdown fight. Senior R: \"I hope the president remembers this when the Freedom Caucus types tell him what to do next time. They only have a first move--start a fight. They never have a second move .\" --John Bresnahan (@ BresPolitico) January 25, 2019 \"It's long past time to open our government again,\" said Rep. Fred Upton (R-MI), one of a group of more moderate Republicans who had expressed public disdain for the shutdown strategy. Just yesterday, the President had demanded a \"down payment' on a border wall in any short term funding deal--but that fell flat as well with Democrats. The only agreement the White House was able to get was that the House and Senate would proceed to negotiations on a bill to fund border security .\" Democrats don't usually remain this firm, but thanks to Pelosi, they did, \"said Democratic strategist <mark>Brian Fallon</mark>.\" And they won. \"Next Up:", "articleID": "2019012519_00398388_W", "names": {"Brian Fallon": ["Q2503485", "Q27656993", "Q4963711"], "Jack Reed": ["Q528979", "Q6114777", "Q6114779", "Q6114783"]}}, {"date": "2019-01-25", "url": "http://www.kob.com/news/analysis-trumps-shutdown-retreat-reveals-weakness/5223321/?cat=649", "content": "Analysis: Trump's shutdown retreat reveals weakness Donald Trump | Photo: AP By ZEKE MILLER January 25, 2019 07:22 PM WASHINGTON (AP)--President Donald Trump will emerge from the longest government shutdown in U.S. history politically weakened, his reputation questioned and his signature campaign promise still glaringly unfulfilled. Advertisement The 35-day partial shutdown over the president's demand for billions of dollars to build a wall along the U.S.-Mexico border was, in the end, futile. Facing defections within his own party, sagging poll numbers and public criticism for interrupted services, the self-proclaimed master dealmaker accepted an agreement that he had previously spurned and set an ignominious record that will remain part of his legacy. Days after Trump marked the midpoint of his term, the shutdown highlighted the disquieting side effects of his unconventional governing style and the trials that lie ahead for him in dealing with emboldened Democrats. The folly of the effort was readily apparent inside the White House, where aides had warned Trump even before the shutdown began that there was no avenue to success in the showdown with Capitol Hill. Democrats ran for office on preventing Trump from building the wall--and it's hardly a popular idea even among Republican lawmakers. Advisers watched in shock as Trump declared in a December meeting with lawmakers that he would be \"proud\" to shut down the government. And when he ultimately did just that, they feared the messaging war had already been lost. \"He was playing double-A ball against major leaguers,\" said former Republican Rep. <mark>Tom Davis</mark> of Virginia, who once headed the House GOP's campaign arm. By backing himself into the shutdown with no way out, <mark>Davis</mark> said, Trump displayed a lack of discipline from the start. The strategic deficit was only magnified by what allies saw as tactical errors. Trump spent the holidays tweeting from the White House rather than making public appearances to showcase his readiness to negotiate. He didn't deliver a public address or visit the border to make his case until weeks had already gone by. Perhaps most crucially, he underestimated House Speaker Nancy Pelosi and the unity of congressional Democrats, thinking the Californian would be more amenable to a deal on the wall once she won the speakership. Trump's message zigzagged sometimes by the hour. He maintained he was proud of shutting down the government and then tried to pin the blame on Democrats. One moment he signaled he was ready to concede the wall in favor of other barriers on the border, and the next he tweeted he was fighting for the wall as strongly as ever. It was emblematic of the dysfunctional White House culture he has fostered and the challenges that have been manifest on decisions big and small for two years. By the end of the shutdown, West Wing aides and outside allies of the president began to look at the seminal promise of Trump's 2016 campaign as an immense--and unachievable--burden on his presidency. It was complaints that Trump appeared to be passing up his last, best opportunity to make good on his build-the-wall pledge that led Trump into the shutdown to begin with. Conservative commentators and House Freedom Caucus members fired off warnings that Trump's base would sour on him if he didn't use the last days of unified GOP control of Washington last year to try to get money for the barrier. But in his quest to appease his base, the president tarnished his standing with the American public. Overall, 34 percent of Americans approve of Trump's job performance in a survey released this week by The Associated Press-NORC Center for Public Affairs Research. That's down from 42 percent a month earlier and nears the lowest mark of his two-year presidency. \"Hopefully now the president has learned his lesson,\" Senate Democratic leader Chuck Schumer said in a gloating press conference with Pelosi. The impasse was an early test for Pelosi after her return to the speakership, one that she appeared to pass handily. Democrats remained unified against White House efforts to divide the caucus, and they head into the next round of debate over border security funding determined to make good on their own 2018 promises to block Trump's wall. As White House aides suggested that the shutdown had brought Democrats to embrace border \"barriers,\" Pelosi make clear her party remained resolved against the wall. \"Have I not been clear?\" she said. \"No, I have been very clear .\" Trump, characteristically, refused to concede that he'd conceded. Instead, he insisted he hadn't caved to Democrats, and he threatened yet another shutdown even while bemoaning the last one's impact on Americans. \"This was in no way a concession,\" Trump tweeted late Friday. \"It was taking care of millions of people who were getting badly hurt by the Shutdown with the understanding that in 21 days, if no deal is done, it's off to the races!\" ___ Associated Press writer Alan Fram contributed to this report. ___ EDITOR'S NOTE: Zeke Miller has covered the White House and politics in Washington since 2011. Follow him at http: //twitter.com/zekejmiller Credits Updated: January 25, 2019 07:22 PM Created: January 25, 2019 06:56 PM Copyright 2019 The Associated Press. All rights reserved. Advertisement", "articleID": "2019012602_00196556_W", "names": {"Tom Davis": ["Q14371530", "Q19957326", "Q22814855", "Q2366977", "Q7815530", "Q7815532", "Q7815534", "Q7815535", "Q7815536"]}}, {"date": "2019-01-26", "url": "https://www.fool.com/investing/2019/01/26/heres-how-starbucks-is-driving-us-same-store-sales.aspx?source=iedfolrf0000001", "content": "Here's How Starbucks Is Driving U.S. Same-Store Sales Growth The company has a three-pronged approach. Daniel B. Kline (TMFDankline) Jan 26, 2019 at 10:46 AM Starbucks (NASDAQ: SBUX) has a three-step plan to drive same-store sales improvement in the United States. This includes enhancing the in-store experience, delivering beverage innovation, and driving digital relationships. Basically, the coffee chain wants to cut wait times in stores--especially during peak times--create new drinks or food items that entice consumers to either spend more or make an extra visit, and sign more people up for its loyalty programs. Those efforts are succeeding; the company is delivering 4% comparable-store sales growth in the U.S. \"We are particularly pleased with the sequential improvement in quarterly comparable store transactions in the U.S., underpinned by our digital initiatives and improved execution of our in-store experience,\" said CEO <mark>Kevin Johnson</mark> on the first-quarter earnings release. Starbucks is working to take non-customer-facing work away from baristas. Image source: Starbucks. What is Starbucks doing? The chain's efforts to enhance the in-store experience focus on serving customers faster while continuing to build the connection between the consumer and in-store staff. To make that happen, Starbucks has been working to free up employee time to focus on customers. \"Our Starbucks store partners who proudly wear the green apron are at the center of connecting with customers and we are on a mission to support them by simplifying work and reducing some of the non-customer-facing tasks that historically have taken up to 40% of their time,\" said <mark>Johnson</mark> during the Q1 conference call. The changes made include shifting some cleaning tasks to after the stores have closed. in addition, Starbucks has automated \"product planning and replenishment which reduces store clutter and time away from customers .\" These changes will take multiple quarters to be fully implemented, but <mark>Johnson</mark> said that they are already paying off. \"Our customer connection scores continue to improve in Q1 on both a sequential and year-over-year basis. And importantly, across both, the morning and afternoon dayparts,\" he said. The company has also expanded its delivery pilot program. Ultimately, this should allow U.S. stores to increase comp sales, assuming the company can manage workflow to not impact in-store visitors. When it comes to beverage innovation, the company has focused on its cold drinks. <mark>Johnson</mark> said that cold beverages had gained momentum across multiple dayparts. \"The focus of our latest beverage innovation revolves around iced espresso, draft nitro beverages, and refreshers,\" he said. \"We have expanded the deployment of our nitro offering from about one-third of U.S. company-operated stores last quarter to 40% in just one quarter. And we remain on track to reach our goal of 100% penetration by the end of fiscal 2019 .\" Digital relationships, the third growth driver, have been increasing as well. The company has collected 13 million customer registrations from people who use its WiFi but are not Rewards program members. The chain also added 1 million members to its Starbucks Rewards program, a 14% increase that brings total membership to 16.3 million. \"This result was driven by leveraging our increased digital reach, as well as a more seamless customer onboarding experience, greater mobile order and pay adoption, and enhanced personalization features,\" said <mark>Johnson</mark>. \"Between digitally registered and active reward customers, we are now approaching 30 million digital connections in the U.S.\" Steady as she goes <mark>Johnson</mark> has shown that Starbucks can continue to grow sales in a mature market. He also has a clear plan to continue doing that, though it's important to note that he has largely backed away from his predecessor's plans to add premium products to up to 20% of stores. That plan hasn't gone away, but it has been scaled back into more of a test. In theory, that leaves the company with another potential growth driver in its back pocket once it exhausts its current three-tiered approach. Daniel B. Kline has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends Starbucks. The Motley Fool has a disclosure policy. Author", "articleID": "2019012616_00021441_W", "names": {"Kevin Johnson": ["Q16197018", "Q1740182", "Q18630838", "Q18921997", "Q203286", "Q25413017", "Q28806784", "Q39070237", "Q448375", "Q6396616", "Q6396617", "Q6396618", "Q6396620", "Q6396621", "Q6396622", "Q6396623"]}}, {"date": "2019-01-27", "url": "http://www.readingeagle.com/drivetime/article/readings-annual-automobile-exhibition-was-perfect-for-industry-eager-to-make-cars", "content": "Share Adjust font size: A A A Ron Devlin | Reporter/columnist 610-371-5030 Ron Devlin covers Kutztown and Brandywine Heights School Districts for the Reading Eagle. Follow Ron Friday January 25, 2019 04:30 PM Reading's Annual Automobile Exhibition was perfect for industry eager to make cars Reading auto dealers had their motors revving full speed when the eight-day-long Third Annual Automobile Exhibition opened in the Bechtel Building at Fourth and Penn streets on Feb. 22, 1919, 100 years ago next month. Written by Ron Devlin Reading auto dealers had their motors revving full speed when the eight-day-long Third Annual Automobile Exhibition opened in the Bechtel Building at Fourth and Penn streets on Feb. 22, 1919, 100 years ago next month. World War I had ended three months earlier, and manufacturers and dealers were gearing up for returning soldiers. \"From four years of world-shattering war, with its consequent financial and economic disasters, the motor car emerges bigger, stronger, more useful and more appreciated than ever before,\" said a show advertisement in the Reading Times on Feb. 24, 1919. \"It comes now to the world in all its glory, with all the people bowing in acknowledgement to its achievements .\" The automobile industry contributed more than $600 million in munitions to the war effort, and was eager to get back to making cars. A shortage of 700,000 units was forecast, primarily because of shortages of steel and manpower during the war. The war had a positive effect on the development of the truck, the industry reported. French generals credited the versatility of trucks in delivering supplies and munitions to the battlefield with playing a critical role in winning the war. Schwartz Motor Truck Co., which built trucks at Pearl and Chestnut streets in Reading, promised better service and a complete line of parts in a Times ad. Industry development The Reading show committee reflected the broad development of the industry in Berks County. H.O. Keller of Reading Automobile Co. was president. Others included H. B. Schwartz of Schwartz Motor Co., A. N. Kline of Studebaker Co., H. G. Lutz of Fisk Tires and W. <mark>J.</mark> Memmert of Taylor Motor Garage Co.. America was undergoing major social and cultural change in post-World War I. Women, who would gain the right to vote with the ratification of the 19th Amendment to the U.S. Constitution in August 1920, were behind the steering wheel in increasing numbers in 1919. \"Men must drive cars built for women,\" a Times story said. \"Men's pretense that the motor car is an intricate piece of machinery that a mere woman's untechnical mind can't understand is gone forever .\" Cars exhibited at the Reading show reflected the broader social change. They were more stylish, powerful and affordable. The Chandler, available at <mark>J. Miller</mark> Kalbach Co. in Reading, offered six body styles ranging in price from $1,795 to $3,095. \"Gracefully designed, splendidly furnished and upholstered, roomy and comfortable, it is a car of exceptional refinement,\" its ad bragged. Converted into headquarters Overland Harper Co had taken over the former Rajah Temple in the 500 block of Franklin Street and converted it into headquarters for sale of the Overland and Willys-Knight motor cars. The Daniels 8, built in Reading and sold by Reading Automobile Co., was featured at the show. Characterized as a distinguished luxury car with \"a little more power than you'll ever need,\" it was the brainchild of George E. Daniels. He would become the first president of General Motors and general manager of Oakland and Locomobile cars. The Standard 8 Hupmobile, available at C.C. Snyder in Reading, bragged that its two-speed sliding gear transmission would deliver \"no shifting of gears in traffic or on hills .\" Built with Standard Steel, is sold at a \"remarkable\" price of $2,750. Barbey Automobile Co. at Third and Spruce, \"the service station with a conscience,\" sold Exide batteries that were standard equipment in Cadillac, Pierce-Arrow, Hudson and Buick autos. Heydt Motor Car Co. would exhibited Hudson and Essex cars, seen in Reading for the first time. The 35 car and 11 truck models, which had economy to luxury price tags, were illuminated by large red, white and blue electric globes. The name of each car was displayed on the globe. The Specht Orchestra and Dusenberry's Jazz Band provided entertainment to the thousands who visited the show. The Reading Automobile Dealers Association, show sponsors, said it reflected all that had been learned in car building to date. \"The Reading show reflects what has been accomplished,\" an association ad in the Times said, \"notwithstanding the fact that the resources of the automobile industry have been diverted in the last few years to help winning the war .\" Contact Ron Devlin: 610-371-5030 or rdevlin @ readingeagle.com. Ron Devlin | Reporter/columnist 610-371-5030 Ron Devlin covers Kutztown and Brandywine Heights School Districts for the Reading Eagle. Follow Ron Share this article Trending Stories Full bellies and warm hearts on Penn Street Couple meets, later marries at mall Berks County real estate transactions for January 27, 2019 Writing for kids isn't simple Maroon 5's PJ Morton on Super Bowl and Grammy noms What's got you wondering \"what's that about?\" in the Berks County area? Ask us your burning questions and we'll investigate. Please note that questions may be edited for clarity or brevity. More Drive Stories", "articleID": "2019012705_00077175_W", "names": {"J. Miller": ["Q18730558", "Q56239397"]}}, {"date": "2019-01-29", "url": "http://localnews8.com/news/national-world/pge-files-for-bankruptcy-after-california-wildfires/994149092", "content": "PG & E files for bankruptcy after California wildfires Utility faces billions of dollars in claims By: ROB MCLEAN AND CHRIS ISIDORE CNN BUSINESS Posted: Jan 29, 2019 03:25 AM MST Updated: Jan 29, 2019 03:25 AM MST The Camp Fire burns in the hills on Nov. 11, 2018, near Oroville, California. Justin Sullivan/Getty Images The Camp Fire burns in the hills on Nov. 11, 2018, near Oroville, California. Related content Lawsuit: Utility caused wildfire that preceded mudslides (CNN) - Pacific Gas and Electric has filed for bankruptcy protection after coming under pressure from billions of dollars in claims tied to deadly wildfires. California's largest power company said in a statement Tuesday that it had submitted a Chapter 11 bankruptcy filing in the Northern District of California. PG & E said it was committed to maintaining services for customers during the bankruptcy process. <mark>John Simon</mark>, the company's Interim CEO, said he would work \"to create a more sustainable foundation for the delivery of safe, reliable and affordable service .\" \"We have heard the calls for change and we are determined to take action throughout this process to build the energy system our customers want and deserve,\" he said in the statement. PG & E has been linked to a series of wildfires in California, including the Camp Fire, which caused 86 deaths and destroyed 14,000 homes, along with more than 500 businesses and 4,300 other buildings. PG & E announced on January 14 that it intended to file for bankruptcy, but it had to wait 15-day period required by California law. The company needs to use the bankruptcy process--which will allow it to shed some of its debt--to pay for damages and stay in business. PG & E said Tuesday it was seeking approval for a $5.5 billion debtor-in-possession financing agreement. Previously, it said in a filing that it has only about $1.5 billion in cash and cash equivalents on hand. The company has cited at least $7 billion in claims from the Camp Fire. It is believed that the Camp Fire was started when a PG & E power line came in contact with nearby trees. PG & E reported \"an outage\" on a transmission line in the area where the blaze began, about 15 minutes before it started. Within the massive burn area, PG & E found power equipment and a fallen power pole riddled with bullet holes, according to a letter it sent to regulators. The company also reported that it found a downed line with tree branches on it. In addition, a series of wildfires in 2017--many of which were also blamed on PG & E--caused $10 billion in damages and 44 deaths. In 11 of those fires, state investigators found the company violated codes regarding brush clearance near its power lines or had made related violations. Copyright 2019 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2019012911_00160211_W", "names": {"John Simon": ["Q14917949", "Q17090371", "Q174650", "Q5480013", "Q56597927", "Q6257894", "Q6257900", "Q6257904"]}}]