[{"date": "2019-01-29", "url": "https://www.theepochtimes.com/lawsuit-filed-against-california-county-fair-over-gun-show-ban_2779309.html", "content": "Guns for sale at a gun show on Nov. 24, 2018, in Naples, Fla. (Spencer Platt/Getty Images) Lawsuit Filed Against California County Fair Over Gun Show Ban By Zach Li January 29, 2019 Updated: January 29, 2019 Share LINKEDIN PINTEREST REDDIT TUMBLR STUMBLEUPON A Southern California county fair is being sued by the California Rifle & Pistol Association (CRPA) over its controversial ordinance prohibiting firearm vendors from continuing a gun show that has been held there for 30 years. The lawsuit, which was filed on Jan. 21, says that a gun show ban passed by the board members of Del Mar Fair in 2018 is unconstitutional and has violated the plaintiffs' Second Amendment rights and others. \"The 41-page complaint alleges that the Del Mar action has purposely violated the First Amendment free speech rights of the plaintiffs and constitutes a prior restraint on speech, along with the equal protection of the plaintiffs,\" said a written statement from the CRPA. Crossroads of the West, one of the plaintiffs, has held gun shows about five times a year at the fairground over the past 30 years, according to Fox 5. In September 2018, the 22nd District Agricultural Association, a nine-member board operating the Del Mar Fairgrounds on behalf of the state, decided to stop renewing the contract with the Crossroads of the West Gun Show for 2019. Lots of people at the Del Mar Fairgrounds Board of Directors meeting voicing support & opposition for the Crossroads of the West Gun Show. With so many speakers, board went straight to public comment. Next gun show here is May 19-20. Board isn't taking action on this today. pic.twitter.com/Sb3V6M2zC7--Matt Hoffman (@ MHoffmam) April 24, 2018 The board voted 8-1 to put the gun show on hold while the board develops a comprehensive policy, which includes converting the show to one that only serves educational and safety training purposes as well as enhancing its security plan, according to a statement the board released in September 2018. Board President Steve Shewmaker said at a meeting that he's concerned about safety issues after several arrests were made in the fairground as felony offenders sent \"their wives and girlfriends in to buy ammunition and guns\" at the gun show. More pics: https: //t.co/mLZVqybJ8w As the two-day Crossroads of the West Gun Show was going on inside the Del Mar Fairgrounds, about 80 supporters from NeverAgainCa protested the gun show from outside the fairgrounds. @ sdut @ sdutPhotography pic.twitter.com/ivjgnByIn0--Howard Lipin (@ hlipin) March 18, 2018 The new policy regarding the gun show is expected to be established by December 2019. However, the board's decision didn't convince everyone. \"It sounds like a nice,\" here is our olive branch,' but it's really nothing. It means we're going to do whatever we can to make sure you can't do your business model the way you normally operate, \"Tracy Olcott, president of Crossroads of the West, told Fox 5. Olcott also said the Crossroads shows typically brought the fairgrounds between $500,000 and $700,000 a year. Vendors display hunting rifles for sale at the Crossroads of the West Gun Show at the Pima County Fairgrounds on Jan. 15, 2011, in Tucson, Ariz. (Kevork Djansezian/Getty Images) The CRPA indicated in its statement that the ban is one of the campaigns aiming at annihilating gun shows at\" several state-owned fairgrounds \"across the state led by anti-gun activists who are trying to eliminate the\" gun culture. \"In 2018, then Gov. <mark>Jerry Brown</mark> vetoed a bill that would prohibit gun shows at the Cow Palace, which is a state-owned fairground at the Bay Area. Crossroads of the West is also the gun show organizer at the Cow Palace .\" In fact, the Fairground's own head of security noted that the gun shows are operating in full compliance with the law and that there are no safety concerns with the show, \"the statement reads .\" Nonetheless, the Del Mar Fair Board bowed to the political pressure of anti-gun activists and gave in to those Board members with a particularly strong bias against the tens of thousands of individuals who attend these shows. \"Share this article RECOMMENDED TOP VIDEOS Videos of the Day: US Acting Defense Secretary Meets NATO Secretary General in Pentagon 9hr By Epoch Newsroom Videos of the Day: Border Patrol Working to Stop Sickness at the Border 1d By Epoch Newsroom Videos of the Day: Pompeo Urges International Community to Financially Disconnect From Maduro Regime 2d By Epoch Newsroom US News November 8, 2018 What We Know About Ian David Long, California Bar Shooter By <mark>Jack Phillips</mark> Former U.S. Marine Ian David Long has been named as the suspect who shot and killed 12 people in a Southern California bar before turning the gun...Southern California November 28, 2018 Thousand Oaks Shooter\" Ambushed' First Officers on Scene, Say Police By Sarah Le, Epoch Times Officials have revealed new details to the public into the investigation of the Nov. 7 shooting at the Borderline Bar and Grill in Thousand Oaks, California that...US News January 22, 2019 Supreme Court to Hear Biggest Gun Rights Case Since 2010 By Reuters WASHINGTON--The Supreme Court took up its biggest gun rights case in nearly a decade on Jan. 22, agreeing to hear a challenge to New York City's strict...US News January 24, 2019 Supreme Court Green-lights NYC Gun Law Appeal By Matthew Vadum The Supreme Court has decided to take up a gun rights case for the first time in nine years, this time a challenge to New York City's...Southern California January 29, 2019 Insurance Claims From Deadly California Wildfires Top $11.4 Billion By The Associated Press SACRAMENTO, Calif.--Insurance claims from California's deadly November 2018 wildfires have topped $11.4 billion, making the series of fires some of the most expensive in state history, officials...Southern California January 26, 2019 California Election Watchdog Hopes to Set Up Town Hall With President Trump By Sarah Le, Epoch Times The Election Integrity Project California (EIPCa) hopes to set up a meeting with President Donald Trump to discuss safeguarding the integrity of the election process. \"We believe...US News January 25, 2019 US Returns Asylum Seekers to Mexico By Reuters TIJUANA/MEXICO CITY, Mexico--The United States was expected to send a first group of 20 Central American asylum seekers back to Mexico through the border city of Tijuana...US News January 25, 2019 California Couple and Dogs Rescued After Two-Week Mountain Ordeal By Tom Ozimek Members of the Special Enforcement Bureau tactical squad and sheriff's deputies rescued two California campers and their dogs, trapped by snow for two weeks in the mountains...Companies January 25, 2019 Suspicious Website Publishes False Press Release, Claiming to Be PG & E By Ilene Eng A suspicious website that imitates the official Pacific Gas and Electric Company (PG & E) site issued a false press release on January 23 and fooled several media outlets. The...Southern California January 24, 2019 Smart Home Device Falsely Alarmed California User, Saying Incoming North Korea Missile By Zach Li A Northern California resident was pranked by a hacker who manipulated her Nest camera into sending warnings that ballistic missiles were launched from North Korea and headed...Northern California January 24, 2019 New California State Movement Challenges Supreme Court Decision on Reynold v. Sims By Nathan Su More than a year after the New California state movement claimed its independence, it's become clear that the movement may have a real chance in challenging the...Southern California January 23, 2019 Man Arrested After Allegedly Stealing Money From Donation Box at Buddhist Temple By Zach Li A man linked to a theft at a Buddhist temple was taken into custody on Jan. 18, according to the Chino Hills Police Department. The suspect, 32-year-old <mark>Daniel Lee</mark>... Chinese Regime January 28, 2019 Undercover Phone Call Reveals Chinese Embassy Pressure to Cancel <mark>Shen Yun</mark> in Spain By Janita Kan A top-level official from the Chinese embassy in Spain admitted in a recent phone call that he made a personal visit to the general manager of the...China-US News January 28, 2019 US Charges Huawei and CFO With Iran Sanctions Violations, Stealing Trade Secrets By Cathy He, Epoch Times The U.S. Department of Justice (DOJ) unsealed two indictments against China's Huawei Technologies Co., its chief financial officer (CFO), Meng Wanzhou, and several of the company's subsidiaries, in a...US News January 28, 2019 Lawyer Names Those to Be Sued for Comments About Covington Students By Petr Svab Lawyer <mark>Robert Barnes</mark> named several celebrities and media personalities he intends to sue for libel against some students of the Covington Catholic High School, whom he represents ....US News January 28, 2019 President Trump to Give State of the Union Address on Feb 5 By <mark>Jack Phillips</mark> President Donald Trump has said he will be giving the State of the Union address on Feb. 5, according to an announcement from the White House following...Politics January 28, 2019 New California State Movement Sends Letter to Trump By Ilene Eng ROSEVILLE, California--The New California State movement held its third Constitutional event at Veterans Memorial Hall in Roseville, California, on Jan. 26. The self-governed legislature is a statewide grassroots...US News January 28, 2019 US Sanctions Put Chinese Chipmaker on the Brink of Shutdown By Emel Akan WASHINGTON--U.S. sanctions on Chinese firms that steal U.S. technology are yielding results. State-owned chipmaker Fujian Jinhua is reportedly poised to cease operations as a result of Washington's...US News January 28, 2019 US Hits Venezuela State-Owned Oil Company With Sanctions By The Associated Press WASHINGTON--The Trump administration imposed sanctions Monday on the state-owned oil company of Venezuela, a potentially critical economic move aimed at increasing pressure on President Nicolas...Americas January 28, 2019 Israel, Australia Join Growing List of Countries Recognizing Venezuela's Opposition Leader By Bowen Xiao and Luke Taylor CUCUTA, Colombia--Israel and Australia on Jan. 27 joined a growing list of countries pledging their support for Juan Guaidó, Venezuela's opposition leader. At the same time, socialist dictator Nicolas...Trump Presidency January 28, 2019 House Democrats Likely to Go Too Far in Investigating Trump, Poll Indicates By Petr Svab Americans tend to think that Democratic legislators in the House of Representatives will go too far in investigating President Donald Trump, according to a Washington Post-ABC News poll ....Canada January 28, 2019 The Man Behind <mark>McCallum</mark>'s Controversial Press Conference That Led to His Removal as Canada's Ambassador to China By Limin Zhou and Omid Ghoreishi News Analysis TORONTO/OTTAWA--For <mark>John McCallum</mark>, Canada's former ambassador to China and self-proclaimed\" son-in-law of China, \"the fiasco that culminated in his resignation started with a now-infamous press...US News January 28, 2019 Extreme Wind Chills Expected in Chicago, Midwest as\" Polar Vortex' Moves In By <mark>Jack Phillips</mark> A so-called \"polar vortex\" is slated to descend on the United States, potentially impacting the Midwest. Some weather forecasters are saying it could minus 45 to minus...US News January 28, 2019 Trump Donates $100,000 From Salary to Fight Alcoholism By Zachary Stieber President Donald Trump donated his entire salary from the third quarter of 2018 to fight alcoholism. The $100,000 went to the National Institute on Alcohol Abuse and...Better Life January 28, 2019 9 Organic DIY Shampoos for Healthy Hair and Prevent Hair Loss--#2 Is Jennifer Aniston's Favorite Hair Product By Ruby Mey If you are experiencing hair loss, hair thinning, or brittle hair, one way to improve the condition of your hair is to avoid harmful shampoo chemicals like...Fitness & Nutrition January 27, 2019 6 Keys to Living Longer, According to Fitness Guru <mark>Jillian Michaels</mark> By Cathy Cassata, Healthline At 44 years old, renowned fitness and nutrition expert <mark>Jillian Michaels</mark> defines aging gracefully. To some, she even makes the process look easy. In fact, she took...Performing Arts January 28, 2019 <mark>Shen Yun</mark> Principal Dancer Kaidi Wu's Ethereal Grace By Irene Luo, Epoch Times In a bustling restaurant of excited chatter and shouting toddlers, Kaidi Wu is the opposite of her surroundings. Her voice is like a spring breeze--gentle and slow,...Arts & Culture January 25, 2019 The Tale of President Lincoln's Act of Compassion Toward a Wounded Soldier Before He Died By Li Yen, Epoch Times The Civil War broke out shortly after President Abraham Lincoln become the United States' 16th president. The following heart-rending tale, retold and circulated in books and on...Entertainment News January 28, 2019 <mark>Michael Jackson</mark>'s Family Speaks Out After \"Leaving Neverland' Documentary Alleges Sex Abuse By Colin Fredericson The family of <mark>Michael Jackson</mark> have issued a statement in response to sexual abuse allegations in the documentary\" Leaving Neverland \"after it screened at the Sundance Film Festival ....Entertainment News January 28, 2019 Essay Published by Top Chef's Fatima Ali Days After Her Death By <mark>Jack Phillips</mark> An essay penned by\" Top Chef \"contestant Fatima Ali, who died of cancer last week, was released following her death, detailing her attitude in the face of...Foodstuffs January 28, 2019 Make an Intense and Buttery Molten Chocolate Cake at Home By The Associated Press Fallen chocolate cake, or molten chocolate cake, is an undercooked-in-the-center mound of intense, buttery chocolate cake. We wanted to turn this restaurant-menu standard into a practical recipe...Better Life January 26, 2019 10 Drinks That Can Help Shed Some Weight While You Sleep--#1 Is a Surprisingly Potent Belly Fat Burner By GQ Pan For many people, losing weight is a daunting challenge to take on. If exercising and changing your diet seem like a tall order, you may want to...Travel January 28, 2019 A Visit to Phnom Penh's Vibrant Night Market By <mark>John</mark> M. Smith While we were docked in Phnom Penh on our Viking River Cruise, my wife and I decided to check out the Cambodian capital's famous Night Market. After...Travel News January 27, 2019 Tribal Land Known for Waterfalls Won't Allow Tour Guides By The Associated Press FLAGSTAFF, Ariz.--The thousands of tourists who travel to a remote Native American reservation deep in the Grand Canyon each year to camp near a series of picturesque,...Life January 26, 2019\" Coolest Day Ever:' Deaf Baby Hears Mom and Dad for the First Time in Life By <mark>Chris Ford</mark> A world of silence is something hard for most of us to comprehend, and the delight of these parents and their deaf baby is palpable when you...Life January 26, 2019 Grandpa Shunned By Family, but a 4-Year-Old Makes Parents Regret Their Actions By Li Yen, Epoch Times Words of Wisdom aims to highlight important morals, which we feel our readers will benefit from reading. We hope you enjoy this fable. \"How one generation loves,...TOP NEWS Undercover Phone Call Reveals Chinese Embassy Pressure to Cancel <mark>Shen Yun</mark> in Spain 9hr By Janita Kan US Charges Huawei and CFO With Iran Sanctions Violations, Stealing Trade Secrets 12hr By Cathy He, Epoch Times Lawyer Names Those to Be Sued for Comments About Covington Students 12hr By Petr Svab President Trump to Give State of the Union Address on Feb 5 12hr By <mark>Jack Phillips</mark> New California State Movement Sends Letter to Trump 12hr By Ilene Eng US Sanctions Put Chinese Chipmaker on the Brink of Shutdown 12hr By Emel Akan US Hits Venezuela State-Owned Oil Company With Sanctions 13hr By The Associated Press Israel, Australia Join Growing List of Countries Recognizing Venezuela's Opposition Leader 13hr By Bowen Xiao and Luke Taylor House Democrats Likely to Go Too Far in Investigating Trump, Poll Indicates 14hr By Petr Svab The Man Behind <mark>McCallum</mark>'s Controversial Press Conference That Led to His Removal as Canada's Ambassador to China 16hr By Limin Zhou and Omid Ghoreishi", "articleID": "2019012912_00200237_W", "names": {"Chris Ford": ["Q2733760", "Q5189144"], "Daniel Lee": ["Q2215646", "Q41065588", "Q42313359", "Q43085242", "Q5217896", "Q706142", "Q9430586"], "Jack Phillips": ["Q21622368", "Q6114605"], "Jerry Brown": ["Q152451", "Q717620"], "Jillian Michaels": ["Q2971799", "Q6193168"], "John Mccallum": ["Q3182037", "Q3182039", "Q41805358", "Q51874515"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Robert Barnes": ["Q20751527", "Q21293016", "Q9310720"], "Shen Yun": ["Q45457380", "Q45457386", "Q45555929", "Q45653546", "Q45696161"]}}, {"date": "2019-01-29", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/may-urges-mps-to-give-her-strong-mandate-to-renegotiate-brexit-37761521.html", "content": "Northern Ireland <mark>May</mark> urges MPs to give her strong mandate to renegotiate Brexit The Prime Minister was addressing the House of Commons ahead of a crucial set of votes on the way ahead for EU withdrawal. <mark>May</mark> urges MPs to give her strong mandate to renegotiate Brexit BelfastTelegraph. co. uk <mark>Theresa May</mark> has urged MPs to give her \"the clearest possible mandate\" to go back to Brussels and reopen Brexit negotiations with the aim of replacing the controversial backstop. https: //www.belfasttelegraph.co.uk/news/northern-ireland/may-urges-mps-to-give-her-strong-mandate-to-renegotiate-brexit-37761521.html Email <mark>Theresa May</mark> has urged MPs to give her \"the clearest possible mandate\" to go back to Brussels and reopen Brexit negotiations with the aim of replacing the controversial backstop. Opening a crucial day of debate in the House of Commons, Mrs <mark>May</mark> said MPs had made clear what they did not want when they rejected her Withdrawal Agreement by a 230-vote margin earlier this month, but now it was time for them to tell Brussels what they do want. She called for them to send an \"emphatic message\" to the EU by backing an amendment tabled by Tory grandee Sir Graham Brady which would require her to replace the backstop with \"alternative arrangements\" to avoid a hard border in Ireland. And she told them: \"If you want Brexit, you have to vote for Brexit .\" Despite what she acknowledged was a \"limited appetite\" in Europe for reopening talks, she insisted: \"I believe with a mandate from this House...I can secure such a change in advance of our departure from the EU .\" The amendment from Sir Graham--the chair of the influential Tory backbench 1922 Committee--was one of seven selected by Commons Speaker John Bercow for consideration and possible votes on Tuesday evening. Also up for debate is a cross-party proposal from Labour MP Yvette Cooper and Tory Nick Boles--backed by the Labour frontbench--which would hand control over the Brexit process to Parliament, potentially delaying departure day from March 29 to the end of the year. Mr Bercow also selected Jeremy Corbyn's own amendment--which would allow debate on Labour's preferred plan or a second referendum--as well as others which would rule out a no-deal Brexit, extend the two-year negotiation under Article 50 or permit a series of \"indicative votes\" to establish the will of the Commons. The Commons chamber was packed as the day's debate on Brexit began (PA) In an attempt to fend off possible rebellion by Tories seeking to avoid a no-deal departure, Mrs <mark>May</mark> promised that Tuesday's votes would not be MPs' final chance to pass judgment on EU withdrawal. She told the Commons she aims to return to the House \"as soon as possible\" with a revised deal, which will be subject to a \"meaningful vote\" of MPs. If defeated, she will table another amendable motion for debate the following day. If no new deal is reached by February 13, the PM will make a statement to Parliament that day and table an amendable motion for debate the following day. Mrs <mark>May</mark> acknowledged that the Commons defeat of the Withdrawal Agreement she agreed with EU leaders last November had been \"decisive\". And she told MPs: \"I listened .\" It was in the interests of the whole House to back the Brady amendment, which would resolve the main obstacle to Britain securing a smooth and orderly exit from the EU, she said. A cross-party amendment tabled by Yvette Cooper was selected for debate (PA) Mrs <mark>May</mark> said it was time for Parliament to \"speak as one\". \"I will never stop battling for Britain, but the odds of success become much longer if this House ties one hand behind my back,\" she said. \"I call on this House to give me the mandate I need to deliver a deal this House can support .\" Do that and I can work to reopen the Withdrawal Agreement. Do that and I can fight for a backstop that honours our commitments to the people of Northern Ireland in a way this House can support. Do that and we can leave the EU with a deal that honours the result of the referendum. \"So the time has come for words to be matched by deeds. If you want to tell Brussels what this House will accept, you have to vote for it. If you want to leave with a deal, you have to vote for it. If you want Brexit, you have to vote for Brexit .\" She warned those considering voting for the \"cacophony\" of rival amendments to rule out no-deal: \"Unless we are to end up with no Brexit at all, the only way to avoid no-deal is to agree a deal .\" That is why I want to go back to Brussels with the clearest possible mandate to secure a deal that this House can support. That means sending the clearest possible message not about what this House does not want but what we do want. \"Mrs <mark>May</mark>'s hopes of securing a majority for the Brady amendment were boosted when former foreign secretary and Brexit figurehead Boris Johnson said he would\" gladly \"vote for it, if it meant legally binding changes to the backstop. We can't have some codicil or letter or joint declaration. We need to go back into the text of the treaty and solve the problem. That is the way to unite remainers and leavers in the Conservative party and across the country 2/2--Boris Johnson (@ BorisJohnson) January 29, 2019 But the chances of the Commons derailing her plans were also heightened when Labour confirmed it will back the Cooper-Boles plan. Mrs <mark>May</mark> is expected to have phone discussions with key EU leaders over the course of the day, with votes taking place in the early evening. Brussels has been adamant that it will not reopen the Agreement, and Ireland's European affairs minister, Helen McEntee, cautioned:\" There can be no change to the backstop. It was negotiated over 18 months with the UK and by the UK. A bit of realism is needed at this stage. \"But Mrs <mark>May</mark>'s official spokesman said:\" There is a very clear message from the EU's leaders that they want the UK to leave with a deal and that they understand this is in the best interests of the EU as well as the UK. \"(PA Graphics) Tory MPs were told at a meeting with Mrs <mark>May</mark> on Monday evening that they would be whipped to support the Brady amendment. But it was far from clear whether this instruction would be followed by enough of the 118 Conservatives who rebelled against Mrs <mark>May</mark>'s deal on January 15. Remain-backing Tories <mark>may</mark> rally behind the Cooper-Boles amendment, while other proposals <mark>may</mark> gain cross-party support, including a plan by Conservative Caroline Spelman and Labour's Jack Dromey to rule out a no-deal Brexit. MPs rejected <mark>Theresa May</mark>'s EU withdrawal deal by a record margin of 230 votes earlier this month (Mark Duffy/UK Parliament/PA) Meanwhile, a compromise drafted by Conservative MPs from both the Remain and Leave sides of the party won the crucial backing of the Democratic Unionist Party. Drawn up in meetings co-ordinated by housing minister Kit Malthouse, the compromise recasts the backstop as a\" free trade agreement-lite \", with a commitment on all sides there should be no hard border and an extended transition period to December 2021. DUP leader Arlene Foster--whose 10 MPs prop up the minority Conservative administration in the Commons--said it provided a\" feasible \"alternative to the backstop .\" If the Prime Minister is seeking to find a united front, both between elements in her own party and the DUP, in the negotiations which she will enter with the European Union, then this is a proposition which she should not turn her back on, \"said Mrs Foster. Press Association", "articleID": "2019012916_00141238_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}}]