[{"date": "2019-01-30", "url": "https://www.nzherald.co.nz/opinion/news/article.cfm?c_id=466&objectid=12198612&ref=rss", "content": "Political Roundup: KiwiBuild - fix it or ditch it? 30 Jan, 2019 2:03 pm Share on Reddit reddit COMMENT: Given the ongoing problems with the Government's flagship housing policy, it seems inevitable that a major change of direction is required for KiwiBuild. A consensus is growing that the policy either needs to be revamped or replaced with something more effective and ambitious. Today the New Zealand Herald has called for the Government to \"think again about KiwiBuild\" --see its editorial: KiwiBuild not only weapon in armoury. Advertisement Advertise with NZME. The newspaper emphasises that there are other options for dealing with the housing crisis, some of which the Government has already been successfully utilising: \"Tax proposals, tenancy laws, banning foreign buyers, state house building and infrastructure bonds were all just as important .\" The problem with KiwiBuild lies at its very core, as it has not been well thought out: \"Not much market research appears to have been done before KiwiBuild was adopted. Some should be done if the Government is determined to press on with the programme .\" For the most rigorous and important ideas about fixing KiwiBuild, it's worth looking at what economist Shamubeel Eaqub proposes. He wrote the original book, \"Generation Rent\" , about the housing crisis, and especially how it's impacting on those at the bottom. Two days ago, his strong views about how \"KiwiBuild is not fit for purpose\" were published in Catherine Harris and Bonnie Flaws' article, Kiwibuild should build more rental properties economist Shamubeel Eaqub says. Eaqub argues that it's time for the Government to shift to building rental properties--and perhaps even more state housing. He claims that KiwiBuild's core focus on increasing home ownership is simply misguided, especially given that the Labour-led Government isn't willing to adequately fund the programme. The economist says that even if KiwiBuild meets its target of 100,000 houses, and if the private market also builds 250,000 homes, New Zealand will still be short of 200,000 homes. So however you look at it, the Government's current plans are inadequate: \"Not only are we not keeping up with population growth we are not even meeting current need. We need to much more ambitious about scaling it up massively .\" Related articles: Quick Read Rental housing has traditionally been the best way to deal with a housing crisis according to Eaqub: \"The reason why I think build to rent has to be the answer is because that is how they solved the housing crisis post-war in Europe .\" To achieve a big increase in rental housing, the Government has to go beyond the current KiwiBuild plans: \"Eaqub said that the problem is too big to be able to fix with $2 billion, the size of KiwiBuild's fund. Instead he said we could partner with institutional investors to build rental properties or use the deep pool of money in Kiwisaver .\" Back in December, Eaqub also made the case for the Government to move more into providing rental accommodation rather than the less-affordable KiwiBuild houses, saying that the market doesn't have the capacity to provide much social housing. \"At the moment there is no one who can really do that, but if the Government says we're in the market to essentially procure X thousand units of\" build to rents,' and we're going to underwrite the rent at some kind of indexation, the stuff would be built \"--see Catherine Harris' Kiwibuild could\" underwrite rental and social housing'. For further critiques of KiwiBuild by Eaqub, see Dan Satherley's KiwiBuild: Government \"recalibrating' targets for under-fire housing scheme. In this, the economist argues that KiwiBuild is currently the wrong solution to the problem. He says it was\" never going to fix the underlying problems of the housing market \", which include\" planning rules, infrastructure and funding for local government \". Phil Twyford announcing new housing policy at the home of Stephanie Belcher in Tamatea, Napier. Share on Reddit reddit He reiterates that just trying to get prospective homeowners into brand new houses is the wrong approach:\" The new houses are expensive. In reality, what we really want to do is increase the supply of rental stock. That's what New Zealand desperately needs--good quality rental stock that's owned by institutions and well-managed. \"Also questioning the focus on brand new houses is Massey University economist Oscar Lau, who says:\" Why do the homes have to be brand sparkling new? New properties inevitably attract high bids and poorer families who just want to own a modest home will miss out. Instead of building new homes, the Government could buy a wide range of existing properties of different sizes, ages and in different neighbourhoods--and auction them off to qualified buyers \"--see: An alternative to KiwiBuild that makes economic sense. Therefore, KiwiBuild could be selling existing homes rather than building new ones, and leave the expensive new homes to the private market. Lau explains further:\" This way the Government doesn't need to meddle in property development. It doesn't need to struggle with construction schedules. To avoid exciting the market, it would need to buy gradually and orderly, rather than splurge. More importantly, it could release some KiwiBuild land to the market for development, so new supply will balance its purchases. \"If the Government is determined to focus on home ownership, then it's going to have to get more ambitious, and find some bigger and better ways of delivering. One such way is to use mass prefabrication, which the Government has so far been reluctant to invest in with KiwiBuild, probably because of the initial cost outlays. How it works overseas Other countries have, however, successfully used mass prefabrication to solve housing crises. For the best outline of this, see Catherine Harris' The key to Sweden's million houses target--and Kiwibuild's. Here's the key part of the article:\" If you think the Government's KiwiBuild target to fix the housing shortage is overly ambitious, just look at Sweden. In 1965, with a population of 8 million, the Nordic country began its \"Million Homes' plan to build 10 times as many houses as New Zealand's target within 10 years. By the end of 1974, it had exceeded its target by 6000...How did they do it? Largely through prefabrication .\" In this story Harris says, \"Research suggests offsite manufacturing can slash 15 per cent off the cost of building and speed up the time it takes by 60 per cent .\" One person with an interest in this is The Warehouse founder Sir Stephen Tindall, who says \"You can construct houses for almost half the price that they cost here\" --see the Herald's If anyone can bring house prices down, it's him: REINZ welcomes Tindall's KiwiBuild interest. According to this story, \"The Real Estate Institute has backed Warehouse founder Sir Stephen Tindall's interest in KiwiBuild, indicating that if anyone can bring down house prices in this country, it's him. Bindi Norwell, REINZ chief executive, welcomed Tindall's announcement that he was assisting one of the 102 off-site manufacturing KiwiBuild tender parties\". Perhaps, therefore, the Government just needs to contract one big company to progress KiwiBuild. This is the view of \"construction industry expert\" John Tookey, who is reported as arguing that KiwiBuild \"would have been more efficient to award a large scale contract to one company\" --see Emma Hatton's Building industry not surprised KiwiBuild won't hit target. The same article also suggests that the current KiwiBuild bureaucratic processes need streamlining. Property Council chief executive Leonie Freeman is reported explaining why developers haven't been more involved in KiwiBuild: \"Some of the feedback we've received is that from then on the process has been slow and very bureaucratic .\" Others in the construction industry are forecasting some big changes to KiwiBuild. For example, Property Institute chief executive Ashley Church outlines expected alterations: \"This will take the form of changes to eligibility criteria, a coordinated Government\" charm offensive' to private developers, or some form of state subsidisation or delayed payment, or any combination of these \"--see Catherine Harris and Bonnie Flaws' article, Kiwibuild should build more rental properties economist Shamubeel Eaqub says. The same article also draws attention to the Government's progress on establishing Urban Development Authorities (\"UDAs have the power like the NZ Transport Authority to use the Public Works Act if necessary to confiscate land\" ), and the promise to establish some sort of \"shared equity scheme\" for new home buyers. In terms of possible rent-to-own schemes, it's worth reading Stephen Forbes' The Labour-Greens confidence & supply agreement promotes \"progressive' housing ownership models. Here's the key part:\" Under the confidence and supply agreement between the Greens and Labour, both parties agreed to develop a rent-to-own scheme, or a similar progressive ownership model, as part of the KiwiBuild programme. Despite comments from minister for housing and urban development Phil Twyford last year that the Government was looking at the feasibility of shared equity housing, no details have been officially announced to date. \"But is the problem of the housing affordability crisis even one of supply? This is apparently what KiwiBuild is predicated on, and <mark>Peter Lyons</mark> challenges this in his column, Housing issue more complex than Govt might have thought. Finally, is the Labour-led Government even inclined to fix KiwiBuild? Chris Trotter has written an extensive and insightful column about how the KiwiBuild scheme was created specifically within Labour to uphold neoliberal or conservative policy settings, and therefore there will be little appetite amongst the\" Labour right \"to bring about a housing programme based on\" transformation \"or\" kindness \"--see: On how middle class housing subsidies overwhelmed the social housing priorities of the Labour Party's rank-and-file members.", "articleID": "2019013002_00251294_W", "names": {"Peter Lyons": ["Q16731736", "Q42763596"]}}, {"date": "2019-01-31", "url": "https://www.thegardenisland.com/2019/01/31/news/the-latest-michigan-man-found-dead-outside-in-frigid-cold/", "content": "The Latest: Michigan man found dead outside in frigid cold By Bill Buley The Garden Island | Thursday, January 31, 2019, 7:59 a.m. Share this story <mark>John C. Anderson</mark>, 74, of Silvis, braves minus 27 windchill to do shirtless pull-ups on a tree branch outside Warren Tower Wednesday, Jan. 30, 2019, in Silvis, Ill. \"It's going to be a historically cold day and I wanted to do something nobody else dare do,\" said <mark>Anderson</mark>, who is known for his fitness stunts. \"A lot of people think all old people are cold, they got cold blood...I wanted to show them not all old people are that cold blooded, certainly I'm not,\" said <mark>Anderson</mark>. (Todd Mizener/The Dispatch - The Rock Island Argus via AP) People enjoy at the Lake Michigan at 31st Street Harbor, Wednesday, Jan. 30, 2019, in Chicago. A deadly arctic deep freeze enveloped the Midwest with record-breaking temperatures on Wednesday, triggering widespread closures of schools and businesses, and prompting the U.S. Postal Service to take the rare step of suspending mail delivery to a wide swath of the region. (AP Photo/Nam Y. Huh) A sign shows the current outdoor temperature in Glenview, Ill., Wednesday, Jan. 30, 2019. A deadly arctic deep freeze enveloped the Midwest with record-breaking temperatures on Wednesday, triggering widespread closures of schools and businesses, and prompting the U.S. Postal Service to take the rare step of suspending mail delivery to a wide swath of the region. (AP Photo/Nam Y. Huh) A harbor light is covered by snow and ice on the Lake Michigan at 39th Street Harbor, Wednesday, Jan. 30, 2019, in Chicago. A deadly arctic deep freeze enveloped the Midwest with record-breaking temperatures on Wednesday, triggering widespread closures of schools and businesses, and prompting the U.S. Postal Service to take the rare step of suspending mail delivery to a wide swath of the region. (AP Photo/Nam Y. Huh) Photographers set up tripods along the shore of Lake Michigan before sunrise, Thursday, Jan. 31, 2019, in Chicago. The painfully cold weather system that put much of the Midwest into a historic deep freeze was expected to ease Thursday, though temperatures still tumbled to record lows in some places. (AP Photo/Kiichiro Sato) Ice forms on the eyelashes of Aubreyanne Edwards, of Rock Island, Ill., as she braves minus 27 windchill while walking to The Fort Armstrong apartments Wednesday, Jan. 30, 2019, in Rock Island, Ill.. A blast of polar air enveloped much of the Midwest on Wednesday, cracking train rails, breaking water pipes and straining electrical systems across the Rust Belt with some of the lowest temperatures in a generation. (Todd Mizener/The Dispatch - The Rock Island Argus via AP) CHICAGO--The Latest on a major snowstorm and frigid weather in the Midwest (all times local): 10:25 a.m. Police say a 60-year-old Michigan man has been found dead outdoors amid frigid temperatures. Police say the man's body was discovered in east Lansing on Wednesday. An autopsy will determine the cause of death, although police say foul play is not suspected. The deaths of at least two other Michigan residents have been connected to the extreme cold weather. In Ecorse, police identified a 70-year-old victim as Gary Sammons, a former city council member and teacher. He was found Tuesday outside his home .------10:05 a.m. Officials say a suburban Detroit fundraiser in which people were to sleep outdoors to raise awareness about homelessness has been replaced with a drive to get people indoors during the extreme cold. The Detroit News reports Roseville police on Thursday cancelled the \"Sleep Out for the Homeless\" event scheduled for Friday night. The group organizing it, Macomb Feeding The Need, instead will open a temporary shelter. The change in plans comes amid bitterly cold weather. The National Weather Service says minus 13 degrees (minus 25 degrees Celsius) was recorded Thursday morning in the Detroit area, breaking the record for Jan. 31 of minus 7 degrees (minus 27 degrees Celsius) set in 1920. Meteorologist Alex Manion tells the Detroit Free Press people should stay inside if possible and wear multiple layers .------9:45 a.m.. The dangerously cold weather system that is enveloping much the Midwest has brought an icy record low to a northern Indiana city. The National Weather Service says the temperature fell to minus 20 degrees (minus 29 Celsius) Thursday morning in South Bend, setting a record low for Jan. 31. The previous record was minus 11 (minus 24 Celsius), set in 1936. National Weather Service meteorologist Chris Roller says South Bend's record low is \"odd\" because when temperature records are set they're usually within a few degrees of the previous record and not nine degrees different .------9:30 a.m.. A Michigan utility that warned residents that they risk brief interruptions of natural gas service for heat amid bitterly cold weather if they don't reduce energy use says efforts to conserve energy are making a difference. Consumers Energy said in a statement Thursday that it's \"cautiously optimistic\" its requests to curb natural gas use \"are having a positive effect .\" Auto plants and other big energy users throughout Michigan are joining residential customers in cutting back. Consumers Energy's CEO Patti Poppe made an appeal Wednesday following a fire at one of its suburban Detroit facilities that affected natural gas supplies. An emergency alert was sent late Wednesday to cellphones asking people to lower thermostats to 65 degrees (18 degrees Celsius) or below through Friday .------9:10 a.m.. About 1,700 flights in and out of Chicago's airports have been canceled in the last 24 hours amid the frigid weather in the Midwest, with experts saying the cold is affecting transit operations. The temperature Thursday morning at O’Hare International Airport was negative 20 degrees (negative 29 Celsius). About 1,450 flights were canceled at O’Hare, one of the nation's busiest airports. Midway International Airport had about 250 cancellations. Both airports were reporting delays of about 15 minutes. Airline experts say the double-digit subzero temperatures affect manpower, equipment and fueling at airports. United Airlines has brought in heated tents for its employees at O’Hare and added workers to increase shifts. The low temperatures also affected rail service in Chicago, the nation's third-largest city. Some commuter lines are shutting down or altering schedules amid the cold .------8:15 a.m. Officials are warning Michigan residents that they risk brief interruptions of natural gas service for heat amid bitterly cold weather if they don't help reduce energy. The warning comes after a fire at a utility's suburban Detroit facility that affected natural gas supplies. Consumers Energy's CEO Patti Poppe made an appeal Wednesday night for customers to reduce their natural gas usage. She later told The Detroit News that \"localized planned curtailments: for some homes and business if demand isn't reduced. An emergency alert was sent late Wednesday to cellphones asking people to lower thermostats to 65 degrees (18 Celsius) or below through Friday. Gov. Gretchen Whitmer asked everyone to\" to do your part. \"------8 a.m.. A good Samaritan offered to pay for hotel rooms for 70 homeless people in Chicago who were camped out in tents amid the bitter cold that blanketed Chicago. The offer came after the Chicago Fire Department on Wednesday confiscated nearly 100 propane tanks given the group to keep them warm as temperatures sank to negative 22 (negative 20 Celsius). The department acted after one of the donated tanks exploded. Salvation Army spokeswoman Jacqueline Rachev said city officials told the organization about their actions at the camp. The Salvation Army was about to move the people to a warming center when the city called again and informed them of the gesture. Rachev was not sure of the identity of the good Samaritan and only knew the hotel was on the city's South Side .------7:30 a.m. Temperature records have been broken in northern Illinois amid the arctic deep freeze enveloping the Midwest. The National Weather Service says the temperature Thursday morning in Rockford hit a record-breaking negative 30 degrees (negative 34 Celsius). The previous record of negative 27 degrees (negative 33 Celsius) was set on Jan. 10, 1982. The city's records date back to 1905. Rockford is about 80 miles (129 kilometers) northwest of Chicago. Meteorologists say warmer weather is on the way for the weekend .------7:20 a.m. Another day of dangerously cold weather in the Midwest is closing hundreds of schools, businesses and government offices in Wisconsin and Minnesota, but students are heading back to school in the Dakotas. Two of Wisconsin's largest school districts canceled classes again Thursday, when morning temperatures hovered around negative 20 degrees (negative 29 Celsius). In Minnesota, where wind chill readings could reach negative 55 degrees (negative 48 Celsius), several large school districts also called off classes. The extreme cold has also sent dozens of people to hospitals in Minnesota. Hennepin Healthcare in Minneapolis says it has treated 22 patients for frostbite since Friday, including 13 admitted to the hospital. But in North Dakota, students in Fargo and other nearby cities are heading back to school. Temperatures in the region dropped to minus 25 degrees (minus 31 Celsius) Thursday morning but forecasters are predicting a high of minus 2 degrees (minus 16 Celsius). It's a bit warmer in South Dakota, where the National Weather Service says the high temperature in Sioux Falls on Thursday is expected to be 12 degrees (minus 11 Celsius).------12 a.m.. The painfully cold weather system that put much of the Midwest into a historic deep freeze is expected to ease Thursday, though temperatures could still tumble to record lows in some places before the region begins to thaw out. Disruptions caused by the cold will persist, too, including power outages and canceled flights and trains. Before the worst of the cold begins to lift, the National Weather Service says Chicago could hit lows early Thursday that break the city's record of minus 27 set on Jan. 20, 1985. Temperatures should bounce back into the single digits later Thursday and into the comparative balmy 20s by Friday. More people are expected to return to work in Chicago, which resembled a ghost town Wednesday after most offices told employees to stay home.", "articleID": "2019013120_00597528_W", "names": {"John C. Anderson": ["Q47539904", "Q48743453"]}}, {"date": "2019-02-01", "url": "http://www.tvguide.com/news/shadowhunters-season-3b-everything-we-know-so-far/?rss=breakingnews", "content": "Share on WhatsApp It's been a long hiatus, hasn't it, fans? Shadowhunters The return of all of our favorite Shadowhunters, Downworlders and Mundanes is just around the corner, and we're just as eager as you are to find out if Clary (Katherine McNamara) is actually dead--yeah right--how Magnus (<mark>Harry Shum</mark> Jr.) will be coping with the loss of his powers, and how this epic series will begin to wrap itself up as enter the final stretch. To help keep track of the madness to come, TV Guide has compiled everything we know about Season 3B so far! It returns Monday, Feb. 25 at 8/7c on Freeform. We had to wait a while (OK, a lot longer than a while), but we finally have a date for the return of Shadowhunters Season 3. The show will be back on Mondays for the final 10 episodes of Season 3, and we'll get an additional 2-hour series finale too. Clary is still around...somehow. Though Clary seemed to meet her pretty nasty demise in the midseason finale last year, Katherine McNamara was obviously still filming for 3B and the 2-hour series finale. Whether she's been blasted to another dimension or she's a ghost/dream/hallucination, you can rest assured that Clary will be back. Executive producer Todd Slavkin told TV Guide that her story in 3B is \"a really cool spin on the books,\" so take that as you will. Subscribe: Apple Podcasts / Stitcher / Google Play / iHeartRadio / TuneIn The first episode back will be a bit of a downer. While we know Clary's fate is probably not as bleak as it's been made out to be, her friends from the Shadow World aren't so lucky. Darren Swimmer called the first episode \"emotional as hell\" as Clary's friends reflect back on her life and what she meant to them. Magnus (<mark>Harry Shum</mark> Jr.) will have to learn how to live without magic. While Magnus learning to live without his powers could provide some opportunities for positive growth, but it's also going to be a tough struggle, particularly when it comes to his own mortality. Malec could have some \"heartbreaking\" times ahead. Predictably, Magnus giving up his magic in order to save Alec's (Matthew Daddario) Parabatai, Jace (Dominic Sherwood) is a pretty monumental thing to happen in and to their relationship. Slavkin has told us to expect the Malec relationship to evolve in a really \"interesting, heartbreaking, beautiful way .\" Discover your new favorite show: Watch This Now! We'll finally get answers about the Mark of Cain. When the Seelie Queen burned that freaky symbol into Simon's (Alberto Rosende) forehead last year, we had so many questions about what it was, why she did it and what it means for Simon. We'll be getting a lot of those answers in the first three episodes of 3B, and we've been assured it will all make sense in time. Luke Baines will take over the role of Jonathan Morgenstern. Before her loft exploded, Lillith (Anna Hopkins) did achieve her goal of bringing her son, Jonathan, back to life. Gooey as he was, we did see that arm rise out of the casket and grab Clary. Seeing as he's been \"remade\" though, he won't look like Sebastien Verlac (Will Tudor), the form he took when we first met him. This time around, he'll wear his true face, which will look a whole lot like Luke Baines. Shadowhunters returns Feb. 25 at 8/7c on Freeform.", "articleID": "2019020114_00698689_W", "names": {"Harry Shum": ["Q16905622", "Q348649"]}}, {"date": "2019-02-01", "url": "http://www.gamereactor.eu/games/17281/Destiny/?sid=14b17f92d98cae8ec4f1b24e8040ac58", "content": "DESTINY REVIEW. Written by <mark>Paul Davies</mark> on the 26th of September 2016 at 10 \"It feels like the end of the road for Destiny before the true sequel. Having said that, it remains a road well worth travelling .\" 0 REVIEW. Written by <mark>Mike Holmes</mark> on the 21st of September 2015 at 14 \"It builds on the base game and improves it in almost every way, and while it might be pricey, it's an essential expansion for fans .\" NEWS. Written by <mark>Sam Bishop</mark> on the 16th of August 2017 at 15:09 DeeJ cleared the whole thing up for us. 0 NEWS. Written by Ford James on the 23rd of June 2017 at 17:08 But not if you plan to play on PC. 2 NEWS. Written by <mark>Sam Bishop</mark> on the 5th of June 2017 at 12:34 \"Our sole focus at this time is Destiny 2 .\" 1 NEWS. Written by <mark>Sam Bishop</mark> on the 29th of March 2017 at 13:28 Reddit users spotted it.", "articleID": "2019020116_00542838_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Paul Davies": ["Q16669255", "Q21131684", "Q535733", "Q7150145", "Q7150146", "Q7150147", "Q7150148", "Q7150149", "Q7150150", "Q976254"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-02-03", "url": "http://feeds.breakingnews.ie/~r/bntopstories/~3/kmVD3INSMJw/donald-trump-weighs-in-on-us-state-governor-controversy-901903.html", "content": "Donald Trump weighs in on US state governor controversy Sala and pilot David Ibbotson disappeared...Download our app 03/02/2019 - 07:01:00 Back to US Politics World Home US president Donald Trump has weighing in on the racist photo that appeared in the medical college yearbook of Virginia governor Ralph Northam. Democratic officials in Virginia and nationally urged Mr Northam to resign after news reports of the photo, which appeared in Mr Northam's 1984 medical school yearbook and showed a person in blackface and a person in Klan regalia. Mr Northam refused to resign, however, and said on Saturday that he was not either of the people pictured. In tweets on Saturday night, Mr Trump criticised Mr Northam over his recent comments on late-term abortion. Democrat Governor Ralph Northam of Virginia just stated, \"I believe that I am not either of the people in that photo .\" This was 24 hours after apologizing for appearing in the picture and after making the most horrible statement on \"super\" late term abortion. Unforgivable!--Donald J. Trump (@ realDonaldTrump) February 3, 2019 <mark>Ed Gillespie</mark>, who ran for Governor of the Great State of Virginia against Ralph Northam, must now be thinking Malpractice and Dereliction of Duty with regard to his Opposition Research Staff. If they find that terrible picture before the election, he wins by 20 points!--Donald J. Trump (@ realDonaldTrump) February 3, 2019 He also said that Mr Northam's Republican opponent in the 2017 governor election, <mark>Ed Gillespie</mark>, would have won had the photo turned up during their campaign. Earlier this week, abortion opponents accused Mr Northam of supporting infanticide. In a radio interview, the governor described a hypothetical situation in which an infant who is severely deformed or unable to survive after birth is left to die. Mr Trump tweeted after those comments that \"Democrats are becoming the Party of late term abortion\". As calls mounted on Saturday for Mr Northam to resign because of the photo, Mr Trump tweeted: \"Democrat Governor Ralph Northam of Virginia just stated,\" I believe that I am not either of the people in that photo .' This was 24 hours after apologizing for appearing in the picture and after making the most horrible statement on \"super' late term abortion. Unforgivable!\" In a second tweet, Mr Trump wrote: \"<mark>Ed Gillespie</mark>, who ran for Governor of the Great State of Virginia against Ralph Northam, must now be thinking Malpractice and Dereliction of Duty with regard to his Opposition Research Staff. If they find that terrible picture before the election, he wins by 20 points!\" - Press Association", "articleID": "2019020307_00877837_W", "names": {"Ed Gillespie": ["Q18686352", "Q5334860"]}}, {"date": "2019-02-05", "url": "https://www.washingtonexaminer.com/news/alexandria-ocasio-cortez-fires-back-at-dan-crenshaw-over-super-bowl-tax-tweet", "content": "Alexandria Ocasio-Cortez fires back at Dan Crenshaw over Super Bowl tax tweet Print this article R ep. Alexandria Ocasio-Cortez, D-N.Y., isn't having any of a fellow freshman's cheeky swipe at her idea to hike the marginal tax rate of the country's wealthiest people up to 70 percent. Ocasio-Cortez clashed with Rep. Dan Crenshaw, R-Texas, on Twitter on Monday when the SEAL veteran poked fun of the liberal firebrand's suggestion for taxing individuals earning more than $10 million in a Super Bowl-inspired tweet. \"Should someone propose a 70% tax on the Patriots so that NFL competition is more fair and equal? Asking for a friend,\" Crenshaw wrote. Ocasio-Cortez replied: \"The average NFL salary is $2.1 million, so most players would never experience a 70% rate. The owners who refuse to hire Kaepernick would, though .\" Colin Kaepernick is the former San Francisco 49ers quarterback who started a string of controversial protests over police brutality and racial injustice during the national anthem before NFL games. The average NFL salary is $2.1 million, so most players would never experience a 70% rate. The owners who refuse to hire Kaepernick would, though. https: //t.co/AnST2lCiU9--Alexandria Ocasio-Cortez (@ AOC) February 4, 2019 Ocasio-Cortez's take on taxes has sparked debate within the 2020 Democratic primary field as some candidates side with her position, while other contenders such as Sen. Elizabeth Warren of Massachusetts push their own stance. Warren is advocating for households with a net worth of more than $50 million to be taxed at a rate starting at a 2 percent, rising to 3 percent for billionaire households. Like Ocasio-Cortez, Crenshaw is one of the more high-profile freshman lawmakers seated as part of the 116th Congress. Share your thoughts with friends. More Washington Examiner Caitlin Yilek Tuesday February 05, 2019 Diamond, half of the outspoken Trump-supporting duo Diamond & Silk, won a coin toss to attend the State of the Union. Naomi Lim Tuesday February 05, 2019 Democratic presidential candidate Sen. Cory Booker said he believes his girlfriend, reportedly actress Rosario Dawson, is first lady material. Anna Giaritelli Tuesday February 05, 2019 The FBI arrested a total of 169 people during an 11-day operation targeting human traffickers who flooded Atlanta with sex workers ahead of the Super Bowl. Diana Stancy Correll Tuesday February 05, 2019 Virginia Gov. Ralph Northam--currently embroiled in a scandal after a racist photo from his medical school yearbook page was unearthed--was accused of racism two years ago. Caitlin Yilek Tuesday February 05, 2019 Ivanka Trump is unimpressed with an art exhibit that features a look-alike of her vacuuming up crumbs thrown at her. Madeline Fry Tuesday February 05, 2019 When rapper 21 Savage was arrested over the weekend for living in the U.S. illegally, fans were shocked to learn the hip-hop king of Atlanta was actually from the United Kingdom. The revelation launched a thousand memes, including some that made Demi Lovato laugh. Jamie McIntyre Tuesday February 05, 2019 The top American military commander in charge of Afghanistan told Congress Tuesday that reports of a tentative peace deal with the Taliban have been overstated. Tiana Lowe Tuesday February 05, 2019 Just as the emerging socialist superstars of the Democratic Party have begun to reveal their radical plans to radically tax the wealth, estates, and incomes of America's top earners, New York Gov. Andrew Cuomo has finally faced the music of his own wild taxes on the wealthy. James Langford Tuesday February 05, 2019 American retailers predict sales will climb as much as 4.4 percent this year, to $3.8 trillion, as long as Washington manages to avoid self-inflicted economic wounds. Anna Giaritelli Tuesday February 05, 2019 Hundreds of militarized Mexican police officers were standing guard Tuesday at the border between Piedras Negras, Coahuila, and Eagle Pass, Texas, to prevent nearly 2,000 Central American migrants from illegally crossing into the U.S. Jamie McIntyre Tuesday February 05, 2019 Gen. Joseph Votel, the most senior U.S. military commander overseeing operations in Syria, told Congress Tuesday that he was totally out of the loop when President Trump decided in December to pull all U.S. troops out of the country. Caitlin Yilek Tuesday February 05, 2019 The top Democrat on the House Judiciary Committee said Tuesday he plans to have a subpoena prepared out of an \"abundance of caution\" in case acting Attorney General <mark>Matthew Whitaker</mark> tries to \"dodge uncomfortable questions .\" Beverly Hallberg Tuesday February 05, 2019 At this year's State of the Union, the women are the ones to watch. A record number will fill the seats in Congress and are likely to make a splash on D.C.'s biggest night of the year. Whether in attendance, attire, speech, or body language, there will be a theme, however wrong, that only a progressive ideology can benefit women. Here's what we can expect to see. Naomi Lim Tuesday February 05, 2019 Presidential candidate Sen. Kamala Harris will deliver a speech of her own before President Trump's second State of the Union address on Tuesday. Caitlin Yilek Tuesday February 05, 2019 First lady Melania Trump is making a tradition out of traveling separately from her husband to his State of the Union address. David M. Drucker Tuesday February 05, 2019 Renegade Republicans determined to eject President Trump from the White House in 2020 share a commitment to the cause but are split on strategy and realistic about their inauspicious prospects.", "articleID": "2019020518_00161199_W", "names": {"Matthew Whitaker": ["Q48847394", "Q6790538"]}}, {"date": "2019-02-06", "url": "https://www.forbes.com/sites/robreischel/2019/02/06/jaire-alexander-provides-ray-of-hope-for-packers-secondary/", "content": "Jaire Alexander Provides Ray Of Hope For Packers' Secondary Opinions expressed by Forbes Contributors are their own. SportsMoney I report on the Green Bay Packers. Share to facebook Share to twitter Share to linkedin Green Bay Packers cornerback Jaire Alexander (23), shown here lineing up against Atlanta Falcons No. 1 wide receiver Julio Jones (11), was named to the NFL's all-rookie team in 2018. (Jeff Haynes/AP Images for Panini) This is the fifth story in a series examining Green Bay's positional groups. The Green Bay Packers mistakenly let defensive backs Casey Hayward and <mark>Micah Hyde</mark> walk in free agency in recent seasons. The Packers missed on their top two draft picks in 2015, cornerbacks Damarious Randall and Quinten Rollins. And it's looking like cornerback <mark>Kevin King</mark>, a second round pick in 2017, will be a bust, as well. But it certainly appears the Packers got it right in 2018 with first round cornerback Jaire Alexander. And today, Alexander is the top reason that there's hope for a Green Bay secondary that has struggled immensely in recent seasons. \"I mean the thing that really jumps out...is his consistency,\" Packers defensive coordinator Mike Pettine said of Alexander. \"It's just developed over time. He certainly earned our trust .\" With good reason. Alexander was named to the NFL's all-rookie team, becoming just the second Green Bay cornerback to receive that honor since the team was first selected in 1974. Hayward was the first Packers corner named to that team in 2012. Alexander, a bold and bombastic individual, played with a swagger that's been missing from Green Bay's defense for years now. The lightning-quick Alexander also competed with a rare fire and aggression level that more than compensated for his height (5-foot-10). In fact, by midseason, the Packers were lining Alexander up on No. 1 receivers and having him shadow them throughout the game. \"I enjoyed it. It was fun,\" Alexander said of facing No. 1 wideouts. \"That's something that every corner wants to follow the best. I don't know why you're playing the game if you don't want to. It was fun .\" I learned a lot, learned a lot of different things as far as being able to stay in there when I'm in press instead of running out--things like that. It was fun, though. It was pretty exciting. It got to a point where I'd come in for the installs and I had already figured I'd be on the best guy. That's how competitive it got. It was fun. \"Watching Alexander was fun for Packer Nation, as well. Alexander led the Green Bay's defensive backs in passes defensed per snap (one every 50.7). He was also second in tackles per snap (one every 10.0) and committed just two penalties. Alexander did allow a team-high 12 passes of at least 20 yards, though. At the end of the season, Alexander said he was surprised the jump to the NFL wasn't more difficult .\" I thought people would be much faster, \"he said .\" I thought the skill level would be like (Atlanta's) Julio (<mark>Jones</mark>) every week, you know what I'm saying? But there's receivers who aren't like that. There are running backs that aren't like <mark>Adrian Peterson</mark>. It's a good little mix. I just thought it would be hard. \"Alexander's play was a major reason the Packers jumped to 12 th in passing yards allowed after finishing 23 rd in 2017. But Green Bay also had just seven interceptions--the lowest total in franchise history--and the secondary still has far more questions than answers. The 6-foot-3 <mark>King</mark>, drafted in 2017 to be a shutdown corner, simply can't stay on the field due to a bevy of injuries. In two seasons, <mark>King</mark> has played in just 15 games, finished only 10 of those and has played just 32.4% of the defensive snaps. Cornerback <mark>Josh Jackson</mark>, a second round draft pick in 2018, had a rough rookie year. <mark>Jackson</mark> was picked on by opposing quarterbacks, benched for a stretch at midseason and struggled tackling all season. Veteran corner Bashaud Breeland, signed midway through the season, doesn't run well (4.60) and is unlikely to return. Green Bay's safety group is in even worse shape. The best safety was Tramon Williams, who moved from cornerback after the Packers traded Ha Ha Clinton-Dix at midseason. Williams, 36, is as smart as they get and remains an extension of Pettine on the field. But Williams also didn't have an interception for the first time in his 13-year career and would be best in a reserve role in 2019. The problem, of course, is Green Bay's roster is devoid of talent at the safety position. And the Packers need a substantial upgrade via the draft or free agency. <mark>Josh Jones</mark>, a second round draft pick in 2017, has had two extremely uninspiring seasons and will have to fight for a roster spot in 2019. Kentrell Brice was handed a starting safety spot in August, then proceeded to play the position as poorly as any Packer in recent memory. Brice, a restricted free agent, was torched for a string of deep balls early in the year, was benched at midseason and is unlikely to receive an offer from the Packers for 2019. While Alexander was an enormous bright spot in 2018, the Packers need to surround him with far better talent than they currently possess .\" Well, we have to get better, obviously, \"Williams said .\" It's one of those things to where you hear it all the time: Guys jump from Year 1 to Year 2. That's what you want to see. I think that's the next step. We've done some good things, but at the same time, we know we have a lot of room for improvement. I think that's the next step. \"", "articleID": "2019020616_00281743_W", "names": {"Adrian Peterson": ["Q1398352", "Q373983"], "Josh Jackson": ["Q19757619", "Q3185977", "Q39075458", "Q44749654", "Q6289014"]}}]