[{"date": "2019-02-06", "url": "https://www.forbes.com/sites/robreischel/2019/02/06/jaire-alexander-provides-ray-of-hope-for-packers-secondary/", "content": "Jaire Alexander Provides Ray Of Hope For Packers' Secondary Opinions expressed by Forbes Contributors are their own. SportsMoney I report on the Green Bay Packers. Share to facebook Share to twitter Share to linkedin Green Bay Packers cornerback Jaire Alexander (23), shown here lineing up against Atlanta Falcons No. 1 wide receiver Julio Jones (11), was named to the NFL's all-rookie team in 2018. (Jeff Haynes/AP Images for Panini) This is the fifth story in a series examining Green Bay's positional groups. The Green Bay Packers mistakenly let defensive backs Casey Hayward and <mark>Micah Hyde</mark> walk in free agency in recent seasons. The Packers missed on their top two draft picks in 2015, cornerbacks Damarious Randall and Quinten Rollins. And it's looking like cornerback <mark>Kevin King</mark>, a second round pick in 2017, will be a bust, as well. But it certainly appears the Packers got it right in 2018 with first round cornerback Jaire Alexander. And today, Alexander is the top reason that there's hope for a Green Bay secondary that has struggled immensely in recent seasons. \"I mean the thing that really jumps out...is his consistency,\" Packers defensive coordinator Mike Pettine said of Alexander. \"It's just developed over time. He certainly earned our trust .\" With good reason. Alexander was named to the NFL's all-rookie team, becoming just the second Green Bay cornerback to receive that honor since the team was first selected in 1974. Hayward was the first Packers corner named to that team in 2012. Alexander, a bold and bombastic individual, played with a swagger that's been missing from Green Bay's defense for years now. The lightning-quick Alexander also competed with a rare fire and aggression level that more than compensated for his height (5-foot-10). In fact, by midseason, the Packers were lining Alexander up on No. 1 receivers and having him shadow them throughout the game. \"I enjoyed it. It was fun,\" Alexander said of facing No. 1 wideouts. \"That's something that every corner wants to follow the best. I don't know why you're playing the game if you don't want to. It was fun .\" I learned a lot, learned a lot of different things as far as being able to stay in there when I'm in press instead of running out--things like that. It was fun, though. It was pretty exciting. It got to a point where I'd come in for the installs and I had already figured I'd be on the best guy. That's how competitive it got. It was fun. \"Watching Alexander was fun for Packer Nation, as well. Alexander led the Green Bay's defensive backs in passes defensed per snap (one every 50.7). He was also second in tackles per snap (one every 10.0) and committed just two penalties. Alexander did allow a team-high 12 passes of at least 20 yards, though. At the end of the season, Alexander said he was surprised the jump to the NFL wasn't more difficult .\" I thought people would be much faster, \"he said .\" I thought the skill level would be like (Atlanta's) Julio (<mark>Jones</mark>) every week, you know what I'm saying? But there's receivers who aren't like that. There are running backs that aren't like <mark>Adrian Peterson</mark>. It's a good little mix. I just thought it would be hard. \"Alexander's play was a major reason the Packers jumped to 12 th in passing yards allowed after finishing 23 rd in 2017. But Green Bay also had just seven interceptions--the lowest total in franchise history--and the secondary still has far more questions than answers. The 6-foot-3 <mark>King</mark>, drafted in 2017 to be a shutdown corner, simply can't stay on the field due to a bevy of injuries. In two seasons, <mark>King</mark> has played in just 15 games, finished only 10 of those and has played just 32.4% of the defensive snaps. Cornerback <mark>Josh Jackson</mark>, a second round draft pick in 2018, had a rough rookie year. <mark>Jackson</mark> was picked on by opposing quarterbacks, benched for a stretch at midseason and struggled tackling all season. Veteran corner Bashaud Breeland, signed midway through the season, doesn't run well (4.60) and is unlikely to return. Green Bay's safety group is in even worse shape. The best safety was Tramon Williams, who moved from cornerback after the Packers traded Ha Ha Clinton-Dix at midseason. Williams, 36, is as smart as they get and remains an extension of Pettine on the field. But Williams also didn't have an interception for the first time in his 13-year career and would be best in a reserve role in 2019. The problem, of course, is Green Bay's roster is devoid of talent at the safety position. And the Packers need a substantial upgrade via the draft or free agency. <mark>Josh Jones</mark>, a second round draft pick in 2017, has had two extremely uninspiring seasons and will have to fight for a roster spot in 2019. Kentrell Brice was handed a starting safety spot in August, then proceeded to play the position as poorly as any Packer in recent memory. Brice, a restricted free agent, was torched for a string of deep balls early in the year, was benched at midseason and is unlikely to receive an offer from the Packers for 2019. While Alexander was an enormous bright spot in 2018, the Packers need to surround him with far better talent than they currently possess .\" Well, we have to get better, obviously, \"Williams said .\" It's one of those things to where you hear it all the time: Guys jump from Year 1 to Year 2. That's what you want to see. I think that's the next step. We've done some good things, but at the same time, we know we have a lot of room for improvement. I think that's the next step. \"", "articleID": "2019020616_00281743_W", "names": {"Josh Jones": ["Q26269516", "Q29862025", "Q30122055", "Q6289030"], "Kevin King": ["Q12032914", "Q15707484", "Q29789611", "Q36695446", "Q52151815", "Q6396702", "Q6396703", "Q6396704"], "Micah Hyde": ["Q1032003", "Q14918180"]}}, {"date": "2019-02-07", "url": "https://www.allaboutthejersey.com/2019/2/7/18204701/gamethread-new-jersey-devils-new-york-islanders-surprisingly-bad-versus-surprisingly-good", "content": "Coleman! Nelson! Again! Tonight! Photo by Elsa/Getty Images Two teams with improbable seasons. This is the second time New York's More Tolerable Team will be at The Rock this season. The Matchup: The New Jersey Devils vs. the New York Islanders (SBN Blog: Lighthouse Hockey) The Time: 7:00 PM ET The Broadcast: TV - MSG + (MSG for the Isles' feed); Digital Audio - The \"Devils Hockey Network .\" A.K.A. Go to Radio.com or NHL.com for an audio feed. The Song for the Night: The Talking Heads were a landmark band. They certainly had a style all of their own. They covered \"Take Me to the River,\" on their 1978 album More Songs About Buildings and Food. The song was originally by <mark>Al Green</mark> and Mabon \"Teenie\" Hodges, but this was a hit for the Talking Heads due to their version of it. The Rules: The rules remain the rules even when you're wondering why I didn't link to the Stop Making Sense version of the song. It is what it is. Please keep your comments clean, legal (read: no streams, no links to streams, no asking for streams, no streams), and all about the games itself. Just as importantly, let's respect each other. There's no need for drama or being unwelcoming of your fellow Devils fan. This is a Gamethread, let's focus on the game. Thank you for reading. Go Devils! Most Read New York Islanders @ New Jersey Devils 7:00 PM - Prudential Center - Newark, NJ Minnesota Wild @ New Jersey Devils 1:00 PM - Prudential Center - Newark, NJ", "articleID": "2019020723_00476391_W", "names": {"Al Green": ["Q14469655", "Q313260", "Q4703915", "Q749039"]}}, {"date": "2019-02-08", "url": "http://pinkvilla.com/entertainment/news/michelle-rodriguez-defends-liam-neeson-says-he-not-racist-439864", "content": "entertainment <mark>Michelle Rodriguez</mark> defends Liam Neeson; says he is not racist <mark>Michelle Rodriguez</mark> has defended actor Liam Neeson, who came under fire earlier this week for admitting that he once wanted to kill a black person for revenge, saying he is not racist. Written By I.A.N.S 2751 reads Mumbai Published: February 8, 2019 05:23 pm <mark>Michelle Rodriguez</mark> defends Liam Neeson; says he is not racist 0 Actress <mark>Michelle Rodriguez</mark> has defended actor Liam Neeson, who came under fire earlier this week for admitting that he once wanted to kill a black person for revenge, saying he is not racist. In an interview to Vanity Fair, Neeson's \"Widows\" co-star <mark>Rodriguez</mark> said Neeson can't be racist because he \"made out with a black person\". \"It's all (expletive). Liam Neeson is not a racist. Dude, have you watched\" Widows'? His tongue was so far down Viola Davis' throat. You can't call him a racist, ever. \"Racists don't make out with the race that they hate, especially in the way he does with his tongue - so deep down her throat. I don't care how good of an actor you are. It's all (expletive). Ignore it. He's a loving man,\" Usatoday.com quoted <mark>Rodriguez</mark> as saying. During the promotions of his upcoming film \"Cold Pursuit\" a few days ago, Neeson made a controversial statement. He said: \"I went up and down areas with a cosh, hoping I'd be approached by somebody - I'm ashamed to say that - and I did it for maybe a week, hoping some (uses air quotes with fingers)\" black bastard' would come out of a pub and have a go at me about something, you know? So that I could kill him. \"Shortly after the statement, he received backlash on social media and people started calling him racist.", "articleID": "2019020812_00351730_W", "names": {"Michelle Rodriguez": ["Q184219", "Q3311458"]}}, {"date": "2019-02-08", "url": "http://mysanantonio.com/news/us/article/Going-green-States-would-get-free-hand-under-pot-13601542.php", "content": "Text \"NEWS' to 77453 for Alerts San Antonio judge lowers bail for King Jay's grandmother NWS gives warning as heavy sleet showers move across S.A. Daughter: S.A. man accused wife of affair before slaying Multi-vehicle crash in S.A. shuts down lanes on I-35 https: //www.mysanantonio.com/news/us/article/Going-green-States-would-get-free-hand-under-pot-13601542.php Going green: States would get free hand under pot bill Michael R. Blood, Associated Press Updated 1:59 pm CST, Friday, February 8, 2019 FILE - In this April 24, 2018, file photo, a hemp plant is pollinated at the Unique Botanicals facility in Springfield, Ore.. Sen. Ron Wyden from Oregon has proposed legislation that would give states a free hand to allow legal marijuana markets without the threat of federal criminal intervention. less FILE - In this April 24, 2018, file photo, a hemp plant is pollinated at the Unique Botanicals facility in Springfield, Ore.. Sen. Ron Wyden from Oregon has proposed legislation that would give states a free...more Photo: Don Ryan, AP Photo: Don Ryan, AP Image 1 of / 3 Caption Close Image 1 of 3 FILE - In this April 24, 2018, file photo, a hemp plant is pollinated at the Unique Botanicals facility in Springfield, Ore.. Sen. Ron Wyden from Oregon has proposed legislation that would give states a free hand to allow legal marijuana markets without the threat of federal criminal intervention. less FILE - In this April 24, 2018, file photo, a hemp plant is pollinated at the Unique Botanicals facility in Springfield, Ore.. Sen. Ron Wyden from Oregon has proposed legislation that would give states a free...more Photo: Don Ryan, AP Going green: States would get free hand under pot bill 1 / 3 Back to Gallery Oregon Sen. Ron Wyden proposed legislation Friday that would give states a free hand to allow legal cannabis markets without the threat of federal criminal intervention, a move that marked the latest push in Congress to bolster the nation's burgeoning pot industry. The proposal, identical to a bill in the House, aims to ease the longstanding conflict between states where cannabis is legal in some form and the U.S. government, which categorizes marijuana as a dangerous illegal drug, similar to LSD or heroin .\" The federal prohibition of marijuana is wrong, plain and simple, \"Wyden, a Democrat, said in a statement .\" Too many lives have been wasted, and too many economic opportunities have been missed. \"Most Americans live in states where pot can be legally purchased for medical or recreational use, and the move to loosen federal restrictions on marijuana came as the issue has played into the emerging 2020 presidential campaign. A similar proposal previously languished in Congress. But Rep. Earl Blumenauer, an Oregon Democrat carrying the current bill in the House, said voters have\" elected the most pro-cannabis Congress in American history. \"The proposal would remove federal criminal penalties for individuals and businesses acting in compliance with state marijuana laws. It would also reduce barriers for legal marijuana businesses to get access to banking. A separate bill would impose a tax on marijuana products similar to federal excise taxes on alcohol, while another would allow state-legal marijuana businesses to claim tax deductions and credits. Justin Strekal, political director of the pro-legalization group NORML, said in a statement that the proposal is another sign of the\" growing public support for ending our failed war on cannabis consumers. \"Sign up for instant alerts from MySA by texting NEWS to 77453. Most Popular 1 Two Texas cities named among 50 worst areas to live in 2 Graphic crime scene photos show aftermath of gun battle outside strip club involving SAPD officer 3 Fried chicken, tacos planned for San Antonio retail development opening this summer 4 Photos: Viral S.A. bar goes up in flames 5 Thieves hit <mark>James Avery</mark> store, nab jewelry in less than 5 minutes 6 Fiesta Oyster Bake announces 2019 Tejano stage lineup 7 Buyer found for San Antonio's troubled Cowboys Dancehall 8 SAPD: Suspect in double homicide home invasion captured 9 Ikea having\" tons of giveaways' at grand opening in Live Oak 10 Big show coming to S.A. 11 Woman assaulted by 3 suspects, including 14-year-old, police say 12 S.A. eatery known for its massive menu closes after 23 years 13 S.A. singer explains \"goodbye' in long, emotional post 14 Friendly Spot named best restaurant for beer in Texas 15 Canada prosecutor: Serial killer staged photos of victims View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019020820_00498107_W", "names": {"James Avery": ["Q3608171", "Q48240545", "Q493077", "Q825454"]}}, {"date": "2019-02-08", "url": "http://www.presstelegram.com/2019/02/08/1-7-tons-of-meth-bound-for-australia-seized-from-ports-of-l-a-and-long-beach-in-record-setting-operation-authorities-say/?fbclid=iwar10zg8pydrl5s8iluig4v1e7vasul8kbtcu8epdlqo3qurxfunp7mlkp-4", "content": "By Megan Barnes | mbarnes @ scng.com | Long Beach Press-Telegram PUBLISHED: February 8, 2019 at 3:21 pm | UPDATED: February 8, 2019 at 4:16 pm This photo provided by U.S. Customs and Border Protection shows an officer extracting methamphetamine from a loudspeaker on Jan. 11, 2019 at the Los Angeles-Long Beach seaport. Australian police arrested six people after what authorities said Friday, Feb. 8, 2019 was the largest single seizure of methamphetamine in the United States and the biggest drug haul bound for Australia. U.S. Customs and Border Protection said 1,728 kilograms (3,800 pounds) of the drug were seized mid-January at the Los Angeles-Long Beach port complex along with smaller amounts of cocaine and heroin. (U.S. Customs and Border Protection via AP) This photo provided by U.S. Customs and Border Protection shows loudspeakers that contained methamphetamine on Jan. 11, 2019 at the Los Angeles-Long Beach seaport. Australian police arrested six people after what authorities said Friday, Feb. 8, 2019 was the largest single seizure of methamphetamine in the United States and the biggest drug haul bound for Australia. U.S. Customs and Border Protection said 1,728 kilograms (3,800 pounds) of the drug were seized mid-January at the Los Angeles-Long Beach port complex along with smaller amounts of cocaine and heroin. (U.S. Customs and Border Protection via AP) This photo provided by U.S. Customs and Border Protection shows an officer extracting methamphetamine from a loudspeaker on Jan. 11, 2019 at the Los Angeles-Long Beach seaport. Australian police arrested six people after what authorities said Friday, Feb. 8, 2019 was the largest single seizure of methamphetamine in the United States and the biggest drug haul bound for Australia. U.S. Customs and Border Protection said 1,728 kilograms (3,800 pounds) of the drug were seized mid-January at the Los Angeles-Long Beach port complex along with smaller amounts of cocaine and heroin. (U.S. Customs and Border Protection via AP) Sound The gallery will resume in seconds A U.S. Homeland Security Investigations agent works to open a metal box containing hidden drugs that was part of a shipment of 1.7 tons of methamphetamine bound for Australia and seized at the twin ports of Los Angeles and Long Beach in January 2019. (Photo courtesy U.S. Immigration and Customs Enforcement) Authorities say 1.7 tons of methamphetamine bound for Australia was concealed in this shipment marked as loudspeakers and intercepted at the twin ports of Los Angeles and Long Beach in January 2019. (Photo courtesy Australian Federal Police) Show Caption of Expand Six people were arrested this week in connection with the planned shipment of nearly two tons of drugs bound for Australia that was intercepted at the twin ports complex of Los Angeles and Long Beach--in the largest-ever domestic seizure of methamphetamine, authorities said. The 3,810 pounds of meth was hidden with 56 pounds of cocaine and nearly 12 pounds of heroin in a shipment of loudspeakers seized in mid-January, according to U.S. Immigration and Customs Enforcement. The joint operation by U.S. and Australian authorities began when Australian agents found out about a massive planned shipment of narcotics and alerted Homeland Security Investigations, officials said. The drugs were concealed in dozens of metal boxes in two containers marked \"Single Loud Speakers\" that were targeted for inspection by U.S. Customs and Border Protection officers. They had yet to be loaded onto a ship. Australian Federal Police estimated the meth had a street value of $1.29 billion, or 17 million \"hits .\" Two Americans--a 52-year-old man and a 46-year-old woman--and four Australians allegedly involved in a drug-smuggling operation behind the shipment were apprehended in Victoria and New South Wales, Australian officials said. Authorities found more meth and \"hundreds of thousands of dollars of proceeds of crime,\" during a raid in Woodstock, a suburb of Melbourne where the Americans were arrested, they said. Three of the suspects were set to appear in court in Melbourne on Friday. If convicted of the drug charges, they each face up to life in prison. All are being prosecuted by the Australian court system. Officials heralded the effort as a major blow to the transnational crime syndicate. \"Along with our law-enforcement partners here and around the world, we continue in a day-to-day battle against the blight of methamphetamine that continues to devastate our communities,\" Joseph Macias, special agent in charge of Homeland Security Investigations in Los Angeles, said in a statement. \"We are keeping this dangerous contraband from reaching our streets and potentially saving lives .\" <mark>Bruce Hill</mark>, assistant commissioner with the Australian Federal Police, said \"by stopping this, we have ensured criminals will not profit from the immense pain these drugs would have caused our community .\" Get the latest news delivered daily! Subscribe Follow Us Facebook Twitter RSS", "articleID": "2019020910_00266474_W", "names": {"Bruce Hill": ["Q14951084", "Q4209690", "Q4977656"]}}, {"date": "2019-02-10", "url": "https://www.pressherald.com/2019/02/10/some-call-greta-van-fleet-the-saviors-of-rock-but-not-them/", "content": "NEW YORK--When the members of the rock band Greta Van Fleet put their last touches on their first full-length album, they didn't celebrate with a round of beers or a fancy dinner. They immediately started working on new songs. \"Once we finished\" Anthem of the Peaceful Army'--the very day that we'd OK'd all the mixing--we started writing the next album, \"said Jake Kiszka, the band's guitarist .\" If we're stagnant, it becomes boring. \"The young Michigan rockers whose sound and classic rock look is reminiscent of Led Zeppelin have done the opposite of stagnate in the last 18 months. It's been more like an explosion, capped by four Grammy Award nominations, including best new artist and best rock album. Since their April 2017 breakthrough with the song\" Highway Tune, \"they've put out two EPs and their\" Anthem of the Peaceful Army \"debuted at No. 1 on Billboard's rock chart and No. 3 on the all-genre albums chart last year. It has also reached the Top 10 in Canada, Italy and Germany. They've played\" Saturday Night Live \"and\" The Tonight Show Starring Jimmy Fallon, \"count <mark>Elton John</mark> as a fan and have been embraced as the four guys who can save rock\" n' roll, a tag they politely decline. \"It's a silly thing to consider anyone a savior of rock\" n' roll. In our opinion, no one king can wear that crown, \"said Jake Kiszka, 22 .\" There's always someone who carries the torch and takes that into the future and interprets that through their influences. \"Jason Flom, who signed Greta Van Fleet to his Lava Records, said there's nothing calculated about the band, saying they make music because it's what they were born to do:\" It's almost like they were sent in a time capsule to save rock \"n' roll,\" he said. \"They wouldn't say that, but I will .\" Keeping the members grounded through all this fuss is blood--three of the members are brothers. Kiszka's twin, Josh, is the howling singer, and his younger brother, 19-year-old Sam, plays bass and keyboards. The quartet is rounded out by drummer and family friend Danny Wagner, 19. The Kiszka brothers are so passionate about what they do that they used to get into fistfights when they were younger over musical choices. Now they rely on each other to get through the noise. \"When someone starts to steer one way or another away from the herd, it seems like there's always someone there to pull you back in,\" said Jake Kiszka, who called the past year \"being in the eye of a storm. There's so much chaos around you but the very center seems so calm .\" At the Grammys, taking place Feb. 10 in Los Angeles, the band is up for best rock song (\"Black Smoke Rising\" ), best rock performance (\"Highway Tune\" ) and best rock album (\"From the Fires\" EP). Competition in those categories include the late Chris Cornell, Arctic Monkeys, twenty one pilots, St. Vincent, Weezer, Fall Out Boy and more. Greta Van Fleet, whose name was inspired by the octogenarian bluegrass musician Gretna VanFleet, also are nominated for best new artist, up against Chloe x Halle, Luke Combs, H.E.R., Dua Lipa, Margo Price, Bebe Rexha and Jorja Smith. Asked which of the four awards the band most coveted, Jake Kiszka was diplomatic. \"I think best album and best performance would be some of the more highlighted categories I'd like us to win. It seems to me the best new artist is sort of a cursed category .\" Does that mean they won't accept it? \"We'll accept it,\" he answered, laughing. \"That would be rude .\" Rudeness is not something baked into the band, which also hasn't relied on social media to fuel its rise. Flom, who has also guided the careers of artists like Lorde and Jessie J, said he's impressed by Greta Van Fleet's work ethic and comradery. \"They get a week off, they go rent a cabin in the hills of Tennessee and write songs,\" he said. \"That is their idea of a good time .\" The band hasn't won over everyone, as proved by the snarky comments online following their \"SNL\" appearance last week. Some criticized them for their ’60s - styled outfits and for mimicking classic rock gestures. One viewer called them \"a glorified college cover band who have just found their dad's Led Zeppelin records .\" Music critics also have been mixed, but the band isn't letting any of that get under their skin. \"Every individual is entitled to an opinion,\" said Jake Kiszka. \"I think we'll always be humbled with the references and honored by the affiliation of those who have influenced us and inspired us to be musicians. But I think there isn't a band in this world that somebody doesn't hate .\" The Zeppelin comparisons once were certainly warranted but increasingly less apt. The band's early bluesy rock has evolved into a more diverse, mature sound, including the laid-back, \"You're the One,\" the last song created for the latest album. Jake Kiszka said Greta Van Fleet has moved on from their stripped-down sonic beginnings. \"It was sort of an objective of ours to achieve somewhat simplicity--to get to the emotion of it and the truth of it and the feel of it,\" he said. \"Once that was achieved, in our minds, it was time to start moving forward in a more technical manner--to grow .\" Share Read or Post Comments Send questions/comments to the editors. Related Stories Latest Articles Business CMP facing a backlog of thousands of faulty bills Green Plate Special Recipe: Mixed Frozen Fruit Curd Cops & Courts 20 years later: A Saco teenager's murder remains unsolved Food More Portland restaurants embrace charging fees for \"no-shows' Politics Federal lawsuit hangs over Eves, LePage as private citizens Want the news vital to Maine? Our daily headlines email is delivered each morning. Email * Newsletter Choices * Daily Headlines and Evening Express Breaking News Business Headlines Maine Cannabis Report High School Sports Real Estate * I understand the Terms of Service. Comments This field is for validation purposes and should be left unchanged. This iframe contains the logic required to handle Ajax powered Gravity Forms.", "articleID": "2019021009_00140279_W", "names": {"Elton John": ["Q16209157", "Q2808"]}}, {"date": "2019-02-10", "url": "https://www.kansas.com/news/business/article226062840.html#storylink=rss", "content": "Some Alaska lawmakers say new ethics rules are too limiting | The Wichita Eagle Some Alaska lawmakers say new ethics rules are too limiting By BECKY BOHRER Associated Press ORDER REPRINT → February 10, 2019 10:02 AM In this Feb. 5, 2019, photo Alaska state Sen. Shelley Hughes poses in her office in Juneau, Alaska. Hughes is among the state legislators who have raised concerns with new ethics rules they see as too restrictive. Becky Bohrer AP Photo In this Feb. 5, 2019, photo Alaska state Sen. Shelley Hughes poses in her office in Juneau, Alaska. Hughes is among the state legislators who have raised concerns with new ethics rules they see as too restrictive. Becky Bohrer AP Photo JUNEAU, Alaska Alaska state Sen. Shelley Hughes withdrew a health care bill she's been working on for more than two years and declined meetings on health care policy to avoid running afoul of new ethics rules she and other lawmakers see as too restrictive. The ethics law passed last year details circumstances under which a lawmaker would have a conflict and limits what action the lawmaker can take if he or she has one. Under the legislative ethics committee's interpretation of the law, legislators can participate in committee and floor debate and vote on bills where they have conflicts, as long as they declare those conflicts. But they can't have similar discussions in private with fellow lawmakers or anyone else. The bill's sponsor said that goes far beyond his original intent, and he and others are looking at possible changes. Sign Up and Save SUBSCRIBE WITH GOOGLE #ReadLocal The law bars legislators from taking or withholding official action or exerting official influence that could substantially hurt or help the financial interests of an immediate family member; the employer of a lawmaker or their immediate family; someone with whom a lawmaker is seeking employment; or someone from whom the lawmaker or an immediate family member has made more than $10,000 over the prior 12 months. The definition used by the Select Committee on Legislative Ethics for \"official action\" is broad, including development, sponsorship, advocacy of or opposition to a law, amendment, resolution or other matter affected by legislative action or inaction. Hughes said the law prevents her from discussing health care policy with her husband, a physician assistant. In a speech to colleagues, Hughes said she withdrew her bill aimed at lowering health care costs because her husband and the clinic where he works could be financially harmed by it, and that was seen as a conflict. Ethics laws should keep lawmakers from manipulating the system for their own gain, Hughes said. \"But when the law prevents us from drawing from our own experience...and from the knowledge that we gain from living with the people we love, it needs to be fixed,\" the Palmer Republican said. \"When the law prevents us from working in the best interests of the people we serve...to address the problems they face, the law needs to be fixed .\" Lawmakers with conflicts can have general discussions in private that avoid specifics of pending legislation or that aren't used to develop legislation related to their conflict, legislative ethics committee administrator <mark>Jerry Anderson</mark> said. But, some lawmakers worry, if the seed for an eventual bill is sown during a general conversation, could that be a violation? That's a realistic concern, <mark>Anderson</mark> said. Senate Majority Leader Mia Costello said legislators are erring on the side of caution and in some cases declining meetings. The state does not have a full-time Legislature. Some lawmakers have other jobs, including attorneys, fishermen and a doctor. Some also have working spouses. Costello is an Anchorage Republican who flies, is married to a commercial pilot and represents a district that holds Alaska's largest commercial airport. In a floor speech, she said she intended to introduce a bill that would have given the Legislature approval of certain aviation-related fees, but didn't because of the new law. \"Everything we do, we're wondering, can I do that? Can I talk to this person?\" Costello said in an interview, adding later: \"We don't want to overreact, either. I don't think we are doing anything but trying to figure out right now what this actually means .\" Former Rep. Jason Grenn, who sponsored the ethics law, said he intended for it to force legislators to be more public about potential conflicts in committees and on the House or Senate floor--and didn't intend to delve into private meetings. \"When it comes to private discussions, you have to have some level of trust with our elected officials,\" Grenn said. The ethics committee's interpretation acts to \"kind of kick common sense out the door,\" the Anchorage independent said. He lost his re-election bid in November but said he's spoken with current legislators about possible revisions. Grenn said the aim was public transparency, not trying to address any potential corruption that other laws or rules already address. Senate Democratic Leader Tom Begich, who serves on the ethics committee, cautioned against \"over-interpreting\" the new law and said legislators with questions can check with <mark>Anderson</mark>'s office. Begich is open to changes that clarify the law but not a wholesale rewrite. The Legislature needs to find the right language \"to ensure that we protect the right of the public to have legislators with integrity on one hand and on the other hand protect the right of the public to have access to the expertise of the people they elect,\" he said. \"That, believe me, is a fine line, and we must find it .\" ", "articleID": "2019021016_00201137_W", "names": {"Jerry Anderson": ["Q14950481", "Q16096792", "Q6183201"]}}, {"date": "2019-02-11", "url": "http://msn.com/en-xl/northamerica/northamerica-life-arts/ser-pounce-game-of-thrones-beloved-fan-favourite-cat-was-killed-off-screen/ar-BBTtyWO?li=BBKxJ6T", "content": "© HBO Spoilers for previous Game of Thrones seasons ahead. Game of Thrones' eighth season hasn't started yet, but showrunners David Benioff and D.B. Weiss recently confirmed in an interview with Entertainment Weekly that at least one fan-favorite character won't make it out of the final season alive: Ser Pounce, Tommen Baratheon's pet cat, who was introduced back in season 4. According to Benioff, \"Cersei hated the name\" Ser Pounce' so much she could not allow him to survive. So she came up with her most diabolical [execution]. Ser Pounce's death was so horrible we couldn't even put it on the air. \"© Shutterstock Kit Harington Ser Pounce's death may not come as much of a surprise, given that the cat only appeared in a single episode, back in season 4's\" Oathkeeper. \"Still, the recent reappearance of long-missing characters like Beric Dondarion and Gendry in season 7 left some fans hoping Ser Pounce might have a return in store, too, despite the death of his owner, Tommen Baratheon. Tommen committed suicide back in season 5, after his wife Margaery was killed in the explosion that destroyed the Great Sept of Baelor. Actor Dean-Charles Chapman, who portrayed Tommen, commented back in 2016 that he hoped Ser Pounce\" didn't get caught up in the blast, \"and that the cat would\" move on with his life and get a girlfriend maybe, \"in the wake of that tragedy. Alas, it seems such a return is not to be .\" That cat was really not fun to work with. \"Plot points aside, it's also possible that the two showrunners may have had other reasons for killing off the cat off-screen--simply, it seems that the cat that played Ser Pounce was kind of a diva .\" That cat was really not fun to work with, \"Benioff notes in the same interview .\" Dogs generally do what you ask them to do if they're smart and well trained, \"Weiss says .\" Cats have their own agenda. \"© Shutterstock <mark>Sophie Turner</mark> Chapman's similarly said working with Ser Pounce was difficult, telling the Huffington Post that when filming the scene,\" That cat that day would have none of it. He was just loving life. He just really wasn't on his game that day. \"Chapman went on to speculate,\" I think that was the reason why they didn't have him back because it's just hard work. Cats can't understand English, so you tell a cat, \"Come on. Jump on the bed,' and he just looks at you like,\" What are you talking about? \"' And Natalie Dormer--who shared the scene with Ser Pounce and Chapman--also confirmed the issue in a 2014 Reddit AMA, commenting that\" Ser Pounce was a bit of a diva that day, he didn't want to stay on the bed, he was very difficult to work with. \"© Shutterstock Kristofer Hivju It seems that inability to play well with others led to Ser Pounce ultimately being killed off-screen. Or possibly the showrunners are just joking around about their ability to be cruel to both the Game of Thrones characters and their audience. At time of publication, The Verge's managing editor, TC Sottek--whose 2016 Game of Game of Thrones team was named\" Ser Pounce's Feral Menagerie \"--was quoted as saying:\" I am very sad. \"Game of Thrones will return on April 14th with its eighth and final season. And if the past books and episodes are anything to go by, Ser Pounce certainly won't be the last character to meet an untimely, messy fate before the end.", "articleID": "2019021208_00407097_W", "names": {"Sophie Turner": ["Q240573", "Q735034"]}}]