[{"date": "2019-02-12", "url": "https://www.journal-topics.com/articles/glenbrook-dist-225-hires-charles-johns-as-new-superintendent/", "content": "Charles Johns, hired by school board members Monday to replace Mike Riggle as Glenbrook High School Dist. 225 superintendent beginning July 1, cuts a cake at the school board meeting welcoming him to the district. (Tom Robb/Journal photo) Glenbrook High School Dist. 225 board members hired Charles Johns to replace Supt. Mike Riggle after Riggle retires. Johns' first day will be July 1 at the start of the district's new fiscal year. Johns is currently superintendent of West Chicago School Dist. 33, but has experience in both elementary and high schools, working his way up from teacher and debate coach at Township High School Dist. 214's Elk Grove High School, to dean, assistant principal, principal, assistant superintendent and superintendent in Dist. 214, Elmhurst Community Unit School Dist. 205 and Dist. 33. Charles Johns (right), hired at Monday's Glenbrook High School Dist. 225 school board meeting to replace retiring Supt. Mike Riggle July 1, chats with Glenview Village President <mark>Jim Patterson</mark> (left) at Monday's school board meeting. (Tom Robb/Journal photo) Asked why he came to Dist. 225, Johns said, \"The Glenbrooks are widely known as one of the finest districts in the entire country. This would be the pinnacle of any educators career .\" Riggle spent more than 20 years working for Dist. 225, starting as Glenbrook North High School principal in 1998 before replacing Supt. Dave Hales in 2008. In September, BWP & Associates was hired to conduct a national search for Riggle's replacement. After pre-screening dozens of candidates, seven potential candidates for the position were identified, including Johns, which were narrowed to three finalists. Those three finalists were interviewed extensively by both school board members and a group of key district stakeholders in December. Charles Johns, hired to replace the retiring Glenbrook High School Dist. 225 Supt. Mike Riggle July 1, chats with an old friend, Dist. 225 Teachers Union President Matt Whipple at Monday's school board meeting. The two taught a summer debate program at the University of Iowa years ago. (Tom Robb/Journal photo) Although school board members voted to approve a contract for Johns at Monday's (Feb. 11) school board meeting, district officials said Johns' salary and contract details would not released until minutes from Monday's meeting are approved by school board members at their next meeting. \"After meeting with many outstanding candidates, Dr. Johns emerged as our finalist because of his systematic approach to providing an equitable education to students,\" said Board President Skip Shein. Johns said his first task will be to learn the organization and build relationships within Dist. 225. He said his process for addressing issues is to, \"be as thoughtful as possible getting a broad view .\" He said understanding any legal issues along with hearing community input is also important to his process. Johns holds a doctorate in educational leadership and policy studies from Loyola University and bachelor's and master's degrees from the University of Iowa in teaching. Glenbrook High School Dist. 225 Supt. Mike Riggle (right) shakes hands with the man who will replace him July 1, Charles Johns (center left) as School Board President Skip Shein looks (center) on at Monday's school board meeting where Johns was hired. (Tom Robb/Journal photo) More From Glenview Go To The Glenview Section Northfield Township Offers Tips On Paying Property Taxes Glenview Opts Back Into County Minimum Wage, Sick Time Ordinances Local Schools React To O’Hare Threat Believed To Be A Hoax", "articleID": "2019021218_00316185_W", "names": {"Jim Patterson": ["Q1185698", "Q20640826", "Q6197397"]}}, {"date": "2019-02-12", "url": "https://www.merrittherald.com/b-c-government-aims-to-stop-concert-ticket-payday-loan-gouging/#respond", "content": "Home> News> B.C. government aims to stop concert ticket, payday loan gouging B.C. government aims to stop concert ticket, payday loan gouging By <mark>Tom Fletcher</mark> on February 12, 2019 Winter weather caused the traditional 15-gun salute and military inspection to be cancelled before B.C. Lt.-Gov. <mark>Janet Austin</mark> read the NDP government's speech from the throne, Feb. 12. (<mark>Tom</mark> Fletcher/Black Press). B.C. Premier <mark>John Horgan</mark> set the agenda for his government's spring session Tuesday with a throne speech packed with promises to hold down ferry and electricity costs, while promising legislation to regulate event ticket sales and payday lenders. Canada's high cellphone bills are another priority for the province, according to the speech read in the B.C. legislature by Lt. Gov. <mark>Janet Austin</mark>. But don't expect relief right away; changes this year include improving \"billing transparency\" and doing another of the NDP government's familiar consultation rounds, while federal law controls much of the wireless industry. \"Your government will give consumers the tools they need to get the least expensive possible service and encourage the federal government to deliver more affordable cellphone options for people,\" the speech says. New rules are on the way for live event ticket sellers, including a ban on mass ticket-buying software. Payday lenders will see a new cap on the fees they can charge. The latest review of money laundering and its effect on real estate is to be completed, with recommendations the speech says \"will provide a basis for immediate action to close loopholes and defend against criminal activity .\" Other goals for 2019 include establishing new Class A provincial parks and creating a Chinese-Canadian museum, along with an upgrade of the Royal B.C. Museum in Victoria. Land purchased on Vancouver Island, the Sunshine Coast, the Okanagan and Kootenays is to be given the province's highest park protection. A freeze on B.C. Ferries fare increases for major routes and discounts on minor and northern routes are to continue for a second year. The speech promises to carry on with rental market changes recommended late last year by an MLA task force. This could include legislation to prevent strata councils from banning rentals. Action is also promised to speed up new rental housing projects and deliver \"more efficient and effective project approvals .\" In industrial development, the speech promises legislative action to advance the LNG Canada project. Before that massive project can begin operation, a dispute with dissident hereditary chiefs of the Wet's uwet' en First Nation in northwest B.C. on the key natural gas pipeline route has to be resolved, and the province must remove the liquefied natural gas income tax put in place by the previous B.C. Liberal government. Mining is also promised help, including \"more support for innovation in mining and mineral exploration, and promoting Indigenous partnerships .\" ", "articleID": "2019021301_00170617_W", "names": {"Janet Austin": ["Q52159219", "Q57078351"], "John Horgan": ["Q16145291", "Q21175985", "Q331298", "Q6239861", "Q6239868", "Q6239870"], "Tom Fletcher": ["Q1051540", "Q16215254", "Q57438696", "Q7815809"]}}, {"date": "2019-02-12", "url": "http://www.nbcconnecticut.com/news/politics/National-Debt-505741901.html", "content": "National Debt Hits New Milestone, Topping $22 Trillion \"Our growing national debt matters because it threatens the economic future of every American\" By Martin Crutsinger Published Feb 12, 2019 at 6:09 PM | Updated at 9:07 PM EST on Feb 12, 2019 NEWSLETTERS Receive the latest politics updates in your inbox Email Privacy policy | More Newsletters <mark>Pablo Martinez</mark> Monsivais/AP This June 8, 2017, file photo shows the U.S. Treasury Department building in Washington. The national debt has passed a new milestone, topping $22 trillion for the first time. The Treasury Department's daily statement shows that total outstanding public debt stands at $22.01 trillion. It stood at $19.95 trillion when President Donald Trump took office on Jan. 20, 2017. The national debt has passed a new milestone, topping $22 trillion for the first time. The Treasury Department's daily statement showed Tuesday that total outstanding public debt stands at $22.01 trillion. It stood at $19.95 trillion when President Donald Trump took office on Jan. 20, 2017. The debt figure has been accelerating since the passage of Trump's $1.5 trillion tax cut in December 2017 and action by Congress last year to increase spending on domestic and military programs. The national debt is the total of the annual budget deficits. The Congressional Budget Office projects that this year's deficit will be $897 billion--a 15.1 percent increase over last year's imbalance of $779 billion. In the coming years, the CBO forecasts that the deficit will keep rising, top $1 trillion annually beginning in 2022 and never drop below $1 trillion through 2029. Much of the increase will come from mounting costs to fund Social Security and Medicare as the vast generation of baby boomers continue to retire. Trump Supporter Storms Media Pen at Texas Rally A Trump supporter stormed the media pen and attacked a BBC cameraman during Trump's first rally for 2019 in El Paso, Texas, shortly after the president criticized the media. (Published Tuesday, Feb. 12, 2019) The Trump administration contends that its tax cuts will eventually pay for themselves by generating faster economic growth. That projection is disputed by many economists. Despite the rising levels of federal debt, many economists say they think the risks remain slight and point to current interest rates, which remain unusually low by historical standards. Still, some budget experts warn that ever-rising federal debt poses substantial risks for the government because it could make it harder to respond to a financial crisis through tax cuts or spending increases. <mark>Michael Peterson</mark>, head of the Peter G. Peterson Foundation, says \"our growing national debt matters because it threatens the economic future of every American .\" Trump Not \"Thrilled' With Border Deal, But Leaning Toward It Copyright Associated Press", "articleID": "2019021311_00116955_W", "names": {"Michael Peterson": ["Q15492344", "Q1927978", "Q6833500", "Q6833502", "Q6833503", "Q6833504"], "Pablo Martinez": ["Q1757794", "Q19896089", "Q7121684"]}}, {"date": "2019-02-13", "url": "https://www.oann.com/u-s-seeks-to-increase-pressure-on-iran-at-warsaw-meeting/", "content": "U.S. Secretary of State Mike Pompeo speaks at a news conference at Lazienki Palace in Warsaw, Poland February 12, 2019. REUTERS/Kacper Pempel February 13, 2019 By Lesley Wroughton and Joanna Plucinska WARSAW (Reuters)--Foreign ministers and senior officials from 60 nations gather in the Polish capital Warsaw on Wednesday where the United States hopes to ratchet up pressure against Iran despite concerns among major European countries about heightened tensions with Tehran. The absence of foreign ministers from major European powers, Germany and France, highlights festering tensions with the European Union over U.S. President Donald Trump's decision last year to withdraw from a 2015 nuclear deal with Iran and reimpose sanctions. EU policy chief, Federica Mogherini, who was a key player in the Iran nuclear deal, will also not attend the two-day conference due to scheduling issues, an EU official said, although U.S. Secretary of State Mike Pompeo will travel to Brussels on Friday to meet with her. Pompeo, who will be joined by U.S. Vice President Mike Pence in Warsaw, played down the absence of leading European ministers at the event during a brief stop in the Slovak capital Bratislava on Tuesday, before he headed to Warsaw. \"Some countries are having their foreign ministers come. Other countries are not. That's their choice,\" he told a news conference. \"We think we will make real progress. We think there'll be dozens of nations there seriously working towards a better, more stable Middle East, and I'm hoping by the time we leave on Thursday we'll have achieved that,\" he added. While countries such as France, Germany and Britain have opened a new channel for non-dollar trade with Iran to avert U.S. sanctions and keep the nuclear deal afloat, they have criticized Tehran's ballistic missile program. \"There will be discussions about Iran's influence in the Middle East, what we can do to help get Iran on a more helpful footing that it has been, to collectively push back on some of its malign behavior in the region,\" a senior U.S. official said of the Warsaw agenda. New U.S. sanctions, mainly targeted at cutting off revenue from Iran's oil sector, have largely succeeded in persuading European companies to abandon business with Iran. Iran has threatened to pull out of the deal unless the European powers enable it to receive economic benefits. The Europeans have promised to help companies do business with Iran as long as it abides by the deal. In other policy differences, Washington's European allies have also voiced concern over Trump's decision to withdraw U.S. troops from Syria. ATTENDANCE QUESTIONS The conference will also hear from White House adviser Jared Kushner, who is Trump's son in law, over plans by the United States for peace between Palestinians and Israelis. While Kushner is not likely to divulge too many details of the plan, it will be one of the first occasions he will publicly discuss the U.S. efforts. Palestinian officials have said they will not attend the Warsaw conference because of Washington's decision to move the U.S. embassy to Jerusalem. Israeli Prime Minister Benjamin Netanyahu will, however, attend, alongside several officials from Gulf states. It was unclear which ministers would be attending since organizers refused to release the list of participants ahead of Wednesday's meeting. Hosting the event is a chance for Poland's conservative government to bolster its ties with Washington at a time when it faces mounting isolation within the EU amid a dispute over its adherence to rule of law standards. \"It's a clear effort to underline their desire to please Washington,\" said Piotr Buras, a director of the Warsaw office of the ECFR think tank. \"The goals of the conference are also defined by the U.S., not by Poland. Poland is just the implementer .\" But Polish Foreign Minister Jacek Czaputowicz said transatlantic cooperation was necessary to resolve problems in the Middle East. \"The European Union alone does not, in my opinion, carry sufficient political weight to try to really influence the situation in the Middle East,\" he told reporters in Warsaw. \"Only working together with the United States, and broadly speaking the community of democratic countries, can we have a positive influence and achieve peace and the stabilization of the situation in the Middle East,\" he added. Michal Baranowski, who heads the Warsaw office of the German Marshall Fund, said the outcome of the conference could either showcase divisions or more agreement over Iran. \"The proof is very much in the pudding whether this conference is something that will show great consensus or whether it will show greater division,\" he said. (Additional reporting by Alan Charlish in Warsaw; editing by Justyna Pawlak and <mark>Tom Brown</mark>)", "articleID": "2019021314_00063165_W", "names": {"Tom Brown": ["Q1305209", "Q15992805", "Q16194983", "Q16195439", "Q28209484", "Q500029", "Q7002060", "Q7815092", "Q7815094", "Q7815097", "Q7815099", "Q7815100"]}}, {"date": "2019-02-11", "url": "http://www.espn.in/golf/story/_/id/25968850/phil-mickelson-brink-victory-pebble-beach-darkness-falls", "content": "Phil Mickelson on the brink of victory at Pebble Beach before darkness falls play Mickelson on the brink of victory at Pebble Beach (1:28) Phil Mickelson plays strong on Sunday, but he and <mark>Paul Casey</mark> were unable to finish their final rounds due to darkness. (1:28) print PEBBLE BEACH, Calif.--Phil Mickelson put himself on the brink of a fifth victory in the AT & T Pebble Beach pro-am by turning a 3-shot deficit into a 3-shot lead when a wild <mark>day</mark> of weather kept him from finishing Sunday. Mickelson was bogey-free with six birdies, and he made his big run starting with a 9-iron to a foot behind the cup on the par-4 ninth. That was start of a five-hole stretch when Mickelson made three birdies and <mark>Paul Casey</mark> had two bogeys. About the only thing that didn't go Mickelson's way was the timing. The final round started an hour late because of rain, and then it was delayed two more hours when sunshine gave way to a hailstorm in a matter of minutes, covering the putting greens in a sheet of white. Mickelson was at 18-under par through 16 holes. <mark>Casey</mark> had a 3-foot par putt on the same hole when Mickelson tried to lobby for them to finish, even in the dark. Phil Mickelson met with reporters in the twilight after play was halted Sunday at Pebble Beach. AP Photo/Eric Risberg \"I can see fine,\" Mickelson told a rules official. \"I don't want to put <mark>Paul</mark> in a bad spot .\" <mark>Casey</mark> was at 15 under, tied with Scott Stallings, who closed with a 66. Along with an outside chance at forcing a playoff, finishing alone in second instead of a tie is a difference of $152,000, along with world ranking points and FedEx Cup points. <mark>Casey</mark> and FedEx executive Don Colleran had a 1-shot lead in the pro-am. \"I don't see how we can finish,\" <mark>Casey</mark> said as they walked up the 16th fairway. \"We can't finish two holes in six minutes. I'd like to .\" Mickelson was standing on the 17th tee when he heard the horn sound to stop play, and he shook his head. The rest of his <mark>day</mark> was far better than the weather. Mickelson is on the verge of winning for the 44th time in his career and matching Mark O'Meara with five victories at a tournament he first played in 1995. It also would be his first victory on American soil since the Phoenix Open six years ago. He won The Open that summer in Scotland, and the Mexico Championship last year. His brilliant play still shared the stage with weather that was bizarre even by Pebble standards. Mickelson and <mark>Casey</mark> were waiting to tee off when clouds moved in quickly moved in, and rain turned into hail that pounded umbrellas, many of them held sideways to account for the wind. Greens quickly were covered by the tiny white pellets, and workers went from using squeegees for excess water to power blowers to remove the hail. <mark>Sam Saunders</mark>, whose grandfather Arnold Palmer was among the Pebble Beach owners, scooped up hail and tossed it like a snowball. <mark>Patrick Reed</mark>'s brother laid on his back and tried to make a snow angel. There was never a reasonable chance to finish in his pro-am format, with mostly foursomes across the golf course. Michael Madrid-USA TODAY Sports <mark>Casey</mark> has never won in three previous times he had a 54-hole lead on the PGA Tour, all of them by 2 shots or more, and he was holding his own against the relentless pursuit of Mickelson, who missed three straight birdie putts from the 12-foot range by the slimmest margins. <mark>Casey</mark> had great par saves, and then Mickelson took off. After his 9-iron into a foot at No. 9 to get within one shot, Mickelson holed a 12-foot birdie on the 10th with a drive that hugged the right side of the fairway and likely would have bounced into the ocean if not for conditions so soft from rain that balls plugged where they landed. <mark>Casey</mark> blinked first with a bogey on the 11th hole, and another on the par-3 12th when his tee shot came up short and into the bunker. Mickelson poured it on, showing his skills have not deteriorated a bit at age 48, controlling spin beautifully to back pin positions. He just didn't want to stay another <mark>day</mark>. \"I get where <mark>Paul</mark> is coming from,\" Mickelson said. \"We're going to have a good chance to come out on fresh greens. I have good vision, I can see fine and I wanted to continue. In all honesty, it's a good thing to play the last two holes in fresh conditions .\" Some players finished in the dark with no chance of winning, but showed the effect of playing without light. Scott Piercy had a 15-foot putt that was slightly uphill, and he still ran it 7 feet by the hole and three-putted for bogey. <mark>Jason Day</mark> closed with a 68 and was tied for fourth at 13-under 175 with Si Woo Kim (68).", "articleID": "2019021411_00074403_W", "names": {"Jason Day": ["Q24005613", "Q246992", "Q6162329", "Q6162331"], "Patrick Reed": ["Q15905139", "Q57514710"], "Paul Casey": ["Q10557500", "Q683113", "Q7149753", "Q7149754"]}}]