[{"date": "2019-02-11", "url": "http://www.espn.in/golf/story/_/id/25968850/phil-mickelson-brink-victory-pebble-beach-darkness-falls", "content": "Phil Mickelson on the brink of victory at Pebble Beach before darkness falls play Mickelson on the brink of victory at Pebble Beach (1:28) Phil Mickelson plays strong on Sunday, but he and <mark>Paul Casey</mark> were unable to finish their final rounds due to darkness. (1:28) print PEBBLE BEACH, Calif.--Phil Mickelson put himself on the brink of a fifth victory in the AT & T Pebble Beach pro-am by turning a 3-shot deficit into a 3-shot lead when a wild <mark>day</mark> of weather kept him from finishing Sunday. Mickelson was bogey-free with six birdies, and he made his big run starting with a 9-iron to a foot behind the cup on the par-4 ninth. That was start of a five-hole stretch when Mickelson made three birdies and <mark>Paul Casey</mark> had two bogeys. About the only thing that didn't go Mickelson's way was the timing. The final round started an hour late because of rain, and then it was delayed two more hours when sunshine gave way to a hailstorm in a matter of minutes, covering the putting greens in a sheet of white. Mickelson was at 18-under par through 16 holes. <mark>Casey</mark> had a 3-foot par putt on the same hole when Mickelson tried to lobby for them to finish, even in the dark. Phil Mickelson met with reporters in the twilight after play was halted Sunday at Pebble Beach. AP Photo/Eric Risberg \"I can see fine,\" Mickelson told a rules official. \"I don't want to put <mark>Paul</mark> in a bad spot .\" <mark>Casey</mark> was at 15 under, tied with Scott Stallings, who closed with a 66. Along with an outside chance at forcing a playoff, finishing alone in second instead of a tie is a difference of $152,000, along with world ranking points and FedEx Cup points. <mark>Casey</mark> and FedEx executive Don Colleran had a 1-shot lead in the pro-am. \"I don't see how we can finish,\" <mark>Casey</mark> said as they walked up the 16th fairway. \"We can't finish two holes in six minutes. I'd like to .\" Mickelson was standing on the 17th tee when he heard the horn sound to stop play, and he shook his head. The rest of his <mark>day</mark> was far better than the weather. Mickelson is on the verge of winning for the 44th time in his career and matching Mark O'Meara with five victories at a tournament he first played in 1995. It also would be his first victory on American soil since the Phoenix Open six years ago. He won The Open that summer in Scotland, and the Mexico Championship last year. His brilliant play still shared the stage with weather that was bizarre even by Pebble standards. Mickelson and <mark>Casey</mark> were waiting to tee off when clouds moved in quickly moved in, and rain turned into hail that pounded umbrellas, many of them held sideways to account for the wind. Greens quickly were covered by the tiny white pellets, and workers went from using squeegees for excess water to power blowers to remove the hail. <mark>Sam Saunders</mark>, whose grandfather Arnold Palmer was among the Pebble Beach owners, scooped up hail and tossed it like a snowball. <mark>Patrick Reed</mark>'s brother laid on his back and tried to make a snow angel. There was never a reasonable chance to finish in his pro-am format, with mostly foursomes across the golf course. Michael Madrid-USA TODAY Sports <mark>Casey</mark> has never won in three previous times he had a 54-hole lead on the PGA Tour, all of them by 2 shots or more, and he was holding his own against the relentless pursuit of Mickelson, who missed three straight birdie putts from the 12-foot range by the slimmest margins. <mark>Casey</mark> had great par saves, and then Mickelson took off. After his 9-iron into a foot at No. 9 to get within one shot, Mickelson holed a 12-foot birdie on the 10th with a drive that hugged the right side of the fairway and likely would have bounced into the ocean if not for conditions so soft from rain that balls plugged where they landed. <mark>Casey</mark> blinked first with a bogey on the 11th hole, and another on the par-3 12th when his tee shot came up short and into the bunker. Mickelson poured it on, showing his skills have not deteriorated a bit at age 48, controlling spin beautifully to back pin positions. He just didn't want to stay another <mark>day</mark>. \"I get where <mark>Paul</mark> is coming from,\" Mickelson said. \"We're going to have a good chance to come out on fresh greens. I have good vision, I can see fine and I wanted to continue. In all honesty, it's a good thing to play the last two holes in fresh conditions .\" Some players finished in the dark with no chance of winning, but showed the effect of playing without light. Scott Piercy had a 15-foot putt that was slightly uphill, and he still ran it 7 feet by the hole and three-putted for bogey. <mark>Jason Day</mark> closed with a 68 and was tied for fourth at 13-under 175 with Si Woo Kim (68).", "articleID": "2019021411_00074403_W", "names": {"Sam Saunders": ["Q7408118", "Q7408119"]}}, {"date": "2019-02-14", "url": "http://kfgo.com/news/articles/2019/feb/14/epa-to-begin-rulemaking-for-drinking-water-limit-for-pfa-chemicals-later-this-year/", "content": "EPA to begin rulemaking for drinking water limit for PFA chemicals later this year Thursday, February 14, 2019 8:25 a.m. CST FILE PHOTO: The U.S. Environmental Protection Agency (EPA) sign is seen on the podium at EPA headquarters in Washington, U.S., July 11, 2018 (Reuters) - The U.S. Environmental Protection Agency on Thursday laid out a plan to control a group of toxic chemicals found in Americans' drinking water but will not set a limit for them until later this year. Acting EPA Administrator <mark>Andrew Wheeler</mark> on Thursday announced the agency's Per - and Polyfluoroalkyl Substances (PFAS) Action Plan, a series of short - and long-term steps to help states exposed to these common chemicals found in Teflon and foams used by firefighters linked to cancer and other health risks. The agency did not announce a maximum contaminant level (MCL) for PFAS, a legal limit for the amount the chemical can be allowed in drinking water under the Safe Drinking Water Act. By the end of this year, EPA said it will undertake a rulemaking process around that by the end of the year. \"We are moving forward with several important actions, including the maximum contaminant level process, that will help affected communities better monitor, detect, and address PFAS,\" <mark>Wheeler</mark> said. (Reporting by Valerie Volcovici; Editing by Chizu Nomiyama) More From National Weak <mark>El Niño</mark> likely to prevail through spring: U.S. forecaster Striking Denver teachers, school district reach deal to end walkout: union Denver teachers, school district reach deal to end strike After year of action, silence to mark Florida school shooting After ex-policeman's murder sentence, divisions in Chicago persist Democrats swear off big money, but will it hurt their 2020 White House chances? Comments", "articleID": "2019021414_00286288_W", "names": {"Andrew Wheeler": ["Q4758886", "Q58994423"], "El Niño": ["Q5698971", "Q8773214"]}}, {"date": "2019-02-13", "url": "https://www.nashville.com/flamekeeper-the-michael-cleveland-story-premieres-at-hof/", "content": "L-R Cortlandt Ingram, John Presley, Michael Cleveland, Sam Bush, Ricky Skaggs, Bela Fleck. Photo by Peyton Hogue Flamekeeper: The Michael Cleveland Story Premieres At HOF Jerry Holthouse 18 hours ago Nashville Music Scene w / Jerry Holthouse Leave a comment 84 Views Last night, the stirring biographical documentary, Flamekeeper: The Michael Cleveland Story, premiered at the Country Music Hall of Fame and Museum. The film tells the story of Michael Cleveland, an iconic and sought-after fiddle player who has overcome great personal hardship to become one of Bluegrass music's most revered instrumentalists. Cleveland is the International Bluegrass Music Association's 11-time, most-awarded, Fiddle Player of the Year, and he has won Instrumental Recorded Performance of the Year six times. Cleveland also fronts the 5-time Instrumental Group of the Year, Michael Cleveland & Flamekeeper, which he founded in 2006. Cleveland was born blind and with a cleft palate, and in early childhood lost 80% of the hearing in his left ear. In spite of physical challenges, he undertook a musical career undeterred and has ascended to the highest possible echelons of his genre. Director John Presley brings his expert eye and heart for storytelling to the project. The film, while visually engaging, was also designed with Cleveland himself in mind. \"I learned that our visually impaired friends see the world in an entirely different way,\" says Presley. \"One of my goals was to create a film that Michael would be able to experience and enjoy through sound alone .\" Years of commercial and short film work, along with his experience as a musician, led the director on a journey to uncover how Cleveland became the artist--and person--he is today. \"I have felt deeply honored to tell his inspirational story and present his talent to new audiences around the world,\" says Presley. \"When I was first approached about the idea of a documentary film about me, I was definitely surprised, and it still seems so surreal,\" adds Cleveland. \"For as long as I've been playing music professionally, I have made it a point to keep the focus on the music and not the fact that I am visually impaired. I decided that if I was going to have a career in music, I wanted to make it on my abilities as a musician and not the fact that I was blind. After I talked to John and took a few days to think it over and run it by my family and the rest of the Flamekeeper team, I realized that this could be an inspiration to some young kid somewhere with a dream that looks as impossible as it seemed to me when I was growing up and dreaming of a career in music .\" Flamekeeper features interviews with 14-time Grammy Award winner Bela Fleck and 21-time Grammy Award winner Vince Gill, who says of Cleveland, \"It's wicked to see how much music he pulls out of a bow--He's untouchable .\" Also appearing in the film are such music notables as Sam Bush, Jens Kruger, <mark>Jeff White</mark>, the Bibelhauser Brothers and Andy Statman. The evening was hosted by the Country Music Hall of Fame and Museum's <mark>Peter Cooper</mark> and was attended by a who's who of bluegrass icons including Fleck, Bush, Gill, Ricky Skaggs, The Whites, <mark>Jeff White</mark>, Becky Buller, and others. Flamekeeper was produced by Validate Films and is Presley's first feature-length documentary film. Presley was joined on the project by co-producer Cortlandt Ingram, a familiar name in the bluegrass world. After winning over one hundred fiddle contests early in his career, Ingram founded a company providing audio and lighting resources for events across the nation. Ingram's knowledge of the bluegrass genre was an invaluable asset to the film's production. Flamekeeper will be released globally to audiences online through Amazon and other streaming platforms on March 1. For more information visit FlamekeeperFilm.com. Share Tweet", "articleID": "2019021417_00600016_W", "names": {"Jeff White": ["Q13461839", "Q56479027", "Q6175258"], "Peter Cooper": ["Q2075218", "Q22003710", "Q39078607", "Q7173381"]}}, {"date": "2019-02-15", "url": "https://www.radioiowa.com/2019/02/15/national-ffa-week-begins-saturday/", "content": "Thousands of Iowa FFA members will be celebrating National FFA Week, starting Saturday and all next week. <mark>Scott Johnson</mark>, executive director of the Iowa FFA Association, says these young people are tomorrow's leaders of America's number-one industry, agriculture. Drive Your Tractor to School Day remains one of the organization's most popular events in Iowa--and one of the most visible. \"I remember from my experiences teaching, it was always weather-pending,\" <mark>Johnson</mark> says. \"If FFA Week happened to be colder, Drive Your Tractor to School Day would almost always occur but sometimes it didn't occur during FFA Week. You had to wait for it to be warmer for those old diesel engines to be able to fire up and survive a day in the open parking lot .\" FFA membership in Iowa hit an all-time high last year with more than 15,400 students wearing the familiar blue jackets. <mark>Johnson</mark> says membership has continued to grow over the past several years. \"We've experienced about a 20% growth in membership,\" <mark>Johnson</mark> says. \"When I started in this position in 2012, we were right around 12,000 to 12,300. Now, we're at 15,000 .\" The number of chapters statewide last year hit 242, which was also a record, one <mark>Johnson</mark> hopes to again surpass this year. The Iowa FFA Association provides leadership, personal growth and career success training through agricultural education, what he says is a growing field. \"We see a few schools that are adding a second ag instructor,\" <mark>Johnson</mark> says. \"We continue to see schools adding new programs. We look forward to the opportunity to bring on-board a number of chapters for the 2019-2020 school year .\" The week gives members an opportunity to educate the public about agriculture through events including: service activities, appreciation breakfasts, dress-up days and Agricultural Olympics.", "articleID": "2019021515_00495730_W", "names": {"Scott Johnson": ["Q1444739", "Q22113504", "Q24804566", "Q3476241", "Q5889250", "Q7436581", "Q7436583", "Q7436584"]}}, {"date": "2019-02-15", "url": "https://www.radiotimes.com/news/tv/2019-02-15/james-jordan-dancing-on-ice-contestant-profile/", "content": "Dancing on Ice contestants: Who is former Strictly pro <mark>James Jordan</mark>? The former Strictly dancer denies he'll have an \"unfair advantage\" on the ice Share on Facebook Share on Twitter Share on Pinterest Share on Google Plus Share on Reddit Email to a friend Friday, 15th February 2019 at 4:17 pm Dancing on Ice 2019 contestants: <mark>James Jordan</mark> Age: 40 Advertisement Known for: Being a former Strictly Come Dancing professional dancer, during which time his partners included Denise Van Outen and Vanessa Feltz. He also came third in the 14th series of Celebrity Big Brother back in 2014. Instagram: @ jamesjordan1978 Twitter: @ the_jamesjordan Professional dance partner: Alexandra Schauman Dancing on Ice 2019 contestants: who has joined the celebrity line-up? Dancing on Ice 2019: pairings revealed Stay up to date with the RadioTimes.com newsletter Why is <mark>James Jordan</mark> famous? <mark>Jordan</mark> spent eight years as a Strictly pro until 2013--he first reached the finals with his partner Dr. Pamela Stephenson back in 2010, and then again with Denise van Outen in 2012. Along the way he also coached Gabby Logan, Vanessa Feltz, <mark>Alex Jones</mark>, Zoe Lucker, Cherie Lunghi and Georgina Bouzova. <mark>Jordan</mark> is married to another fellow Strictly dancer, <mark>Ola Jordan</mark>, with whom he first turned professional. View this post on Instagram Great night last night with @ olajordan at the \"Millies' Recognition to the amazing people in the Armed forces who help make this country a better place for us. A post shared by <mark>James Jordan</mark> (@ jamesjordan1978) on Dec 14, 2018 at 9:21 am PST <mark>Jordan</mark>, a\" bad boy \"of Strictly Come Dancing, nowadays frequently offers critiques on the show--and isn't one to shy away from controversy...He recently criticised Stacey Dooley's Showdance routine to Land of a Thousand Dances from the Strictly finale:\" It was a complete mess and didn't understand the beginning AT ALL. NOT GOOD EVEN FOR A NON DANCER. \"Stacey mmmmm I normally love Kevin's Choreography but I just didn't get this at all. A show dance for me should be full of lifts and an exciting and a mix of dances It was a complete mess and didn't understand the beginning AT ALL NOT GOOD EVEN FOR A NON DANCER #Strictly--<mark>James Jordan</mark> (@ The_JamesJordan) December 15, 2018 His Celebrity Big Brother appearance in 2014 saw him invited back for the All-Star series in 2017, finishing in 13th place. He and <mark>Ola</mark> have also cropped up on Your Face or Mine, Through the Keyhole and a celebrity edition of Total Wipeout. <mark>Jordan</mark> was the third contestant to be announced for Dancing on Ice 2019, and he told Radio 5 Live that his dance background wouldn't give him any\" unfair advantage \".\" People are going to probably say I've got an unfair advantage but when I got on the ice, I actually shocked myself how bad I was, \"he said. View this post on Instagram Having fun today on the ice with one of the coaches Mark.... And I have no idea what my partner @ alex_lukasz was trying to say but it sounded like a mating call from a bird of prey?? I think she was eating AGAIN!!! A post shared by <mark>James Jordan</mark> (@ jamesjordan1978) on Dec 14, 2018 at 9:06 am PST Advertisement\" I can dance but I'm a lot older than I used to be, \"he continued .\" I want to be able to impress Torvill and Dean more than anyone else, but I'm a lot worse than I thought I'd be. \"Sign up for the free RadioTimes.com newsletter Share on Facebook Share on Twitter Share on Pinterest Share on Google Plus Share on Reddit Email to a friend Tags Entertainment <mark>James Jordan</mark> Dancing on Ice", "articleID": "2019021517_00295002_W", "names": {"Alex Jones": ["Q16235485", "Q19559933", "Q20666729", "Q26330355", "Q2641401", "Q319121", "Q47113851", "Q4717247", "Q4717250", "Q4717251", "Q4717252", "Q4717253", "Q4717255", "Q50365540", "Q5665987"], "James Jordan": ["Q10305089", "Q6136966", "Q6136968", "Q6136972"], "Ola Jordan": ["Q5892333", "Q7082861"]}}, {"date": "2019-02-15", "url": "http://www.dailyherald.com/news/20190215/cops-suspect-in-aurora-mass-shooting-dead--", "content": "Cops: Suspect in Aurora mass shooting dead Print hello Multiple police officers and civilians have been wounded in an Aurora shooting at the Henry Pratt Company Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Four police officers and multiple civilians have been wounded in an Aurora shooting Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Police officers on the scene Friday in Aurora following a shooting an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Four police officers and multiple civilians have been wounded in an Aurora shooting Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Four police officers and multiple civilians have been wounded in an Aurora shooting Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Police officers from throughout the suburbs are responding to a mass shooting in Aurora that has left multiple police officers and civilians wounded. The suspect is in custody, but police are urging anyone in the area of Prairie and Highland avenues to shelter in place. Bev Horne | Staff Photographer Police officers on the scene of a shooting Friday afternoon in an industrial area in Aurora. Bev Horne | Staff Photographer Police officers from throughout the suburbs responded to a mass shooting in Aurora. Bev Horne | Staff Photographer Multiple police officers and civilians have been wounded in an Aurora shooting Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Some of the Aurora shooting victims are being treated at Advocate Good Samaritan Hospital in Downers Grove. Marni Pyke | Staff Photographer The suspect in a mass shooting in Aurora that wounded four police officers and as many as a dozen civilians in an industrial area near Prairie and Highland avenues is dead, law enforcement sources said. Sources said they are uncertain if the man, said to be an Aurora resident who lost his job in the past several days, was killed by police or from a self-inflicted gunshot wound. They said a ruling may depend on an autopsy and a review of officers' body cameras. Kane County Coroner Rob Russell confirmed at least one person is dead, but would not say if the person is the suspect. Early reports indicated a civilian also may have been killed. Some victims were airlifted to Advocate Good Samaritan Hospital in Downers Grove. Just before 5 p.m. a spokesman said one patient was at Good Samaritan and another was taken to Advocate Lutheran General Hospital. Condition reports were not immediately available. Patients also are being taken to Amita Health Mercy Medical Center in Aurora. Two people are being treated injuries that are not life-threatening at Rush Copley Medical Center in Aurora. Police are conducting a building-to-building search of the area in case there are more people injured. SWAT teams from throughout the suburbs were called to the scene as was the Bureau of Alcohol, Tobacco, Firearms and Explosives and the FBI. By Friday evening, crime scene tape surrounded Alro Steel at 641 Archer Ave. and numerous police officers still were outside the building. Nearby Holy Angels School and all 18 schools in West Aurora Unit District 129 were placed on lockdown during the search for the shooter. Bob Gonzalez, school board president in West Aurora Unit District 129, also works as a State Farm agent with an office on Prairie Street just east of Highland Avenue. As soon as he heard sirens and realized the emergency in the area was a shooting, he got in touch with Superintendent Jeff Craig to start putting student safety measures into place. At 1:56 p.m., Gonzalez said, Craig put all of the district's 18 schools on soft lockdown. The lockdown lasted until the district began dismissing students about 4 p.m., after police said the situation was \"contained\" by about 3:45. Students were to be dismissed in 40-minute intervals, starting with the elementary schools and Hope D. Wall School, then West Aurora High School, the district's middle schools and the West Aurora Learning Center. While police were searching for the suspect, Gonzalez called multiple clients warning them not to come in to his office at 301 Prairie St. and locked down the facility to preserve the safety of his 4-year-old twin grandchildren. Nancy Caal, an employee of Erwin's Truck Repair, 735 Prairie St., said she and three others were locked down inside the shop during the manhunt for the shooter. \"We have not heard from the police, but we can hear all the sirens so I went and shut the front gate and locked all of the doors,\" Caal said at the time. \"I've got three people here with me and there's four people in the building behind me, too. We're not seeing much because we prefer to be all the way inside the building and not in the windows. We're staying calm .\" \"They just recommended to lock our doors,\" said Polo Lozano, the owner of Capital Printing and Dye Company. His entrance is about 75 yards from the shooting scene. CNN is reporting that President Donald Trump has been briefed on the shooting and is monitoring the situation. • Daily Herald staff writers Harry Hitzeman, Justin Kmitch, Robert Sanchez, Susan Sarkauskas, Katlyn Smith and <mark>Marie Wilson</mark> contributed to this report. Get articles sent to your inbox.", "articleID": "2019021523_00173222_W", "names": {"Marie Wilson": ["Q1305569", "Q27888951"]}}]