[{"articleID": "2019063022_00121166_W", "names": {"Janet Henderson": ["Q43392640", "Q43393947", "Q6153388"], "Greg Taylor": ["Q16940539", "Q17011015", "Q24688832", "Q5606323", "Q5606325", "Q5606326"]}, "date": "2019-06-30", "url": "http://www.wpxi.com/news/national-news/ap-top-news/rescued-hiker-in-california-used-sunwarmed-rocks-for-heat/962799058?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Rescued hiker in California used sun-warmed rocks for heat Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Rescued hiker in California used sun-warmed rocks for heat Updated: Jun 30, 2019 - 5:55 PM Loading...Rescued hiker in California used sun-warmed rocks for heat LOS ANGELES (AP) - A hiker who went missing in the mountains north of Los Angeles survived by wrapping himself with a jacket and towel and staying by sun-warmed rocks for heat, authorities said on Sunday. <mark>Janet Henderson</mark> of the Los Angeles County Sheriff's Department Search and Rescue told KCBS-TV that Eugene Jo, 73, stayed alive for a week by getting close at night to rocks that warmed by the daytime sun and drinking water from a creek. \"He got in close next to the hot rocks because it is very hot up there and those rocks do heat up and that's how he kept himself warm at night,\" <mark>Henderson</mark> said. Jo heard rescuers' voices on Saturday and yelled for help, she said. He was taken to the hospital and later released. Jo went hiking with a group to the 8,000-foot (2,438-meter) summit of Mount Waterman on June 22 when he became separated from them. More than 70 people were searching for him in the mountains Saturday, said Los Angeles County Sheriff's Sgt. <mark>Greg Taylor</mark>. Jo's daughter Grace told KCBS-TV in a statement that her father was home and resting and grew emotional when he learned how many people were out looking for him. \"We're still barely comprehending the extent of this miracle,\" she said. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:"}, {"articleID": "2018121304_00502462_W", "names": {"E. Allen": ["Q27567931", "Q27913609"], "Theresa May": ["Q264766", "Q30161835"]}, "date": "2018-12-13", "url": "https://www.theepochtimes.com/broken-hook-flash-mark-and-bullet-holes-among-new-details-released-by-pge-about-the-camp-fire_2737506.html", "content": "Pacific Gas and Electric (PG & E) crews repair power lines that were destroyed by the Camp Fire in Paradise, Calif. on Nov. 21, 2018. (Justin Sullivan/Getty Images) Broken Hook, Flash Mark, Bullet Holes Among New Details Released by PG & E About the Camp Fire By Zach Li December 12, 2018 Updated: December 12, 2018 Share LINKEDIN PINTEREST REDDIT TUMBLR STUMBLEUPON After lawsuits blaming Pacific Gas and Electric (PG & E) for causing the Camp Fire was filed, the company confirmed on Dec. 11 that several damages including a broken hook, flash mark, as well as bullet holes were found on its equipment in the vicinity of where the fire started, according to a letter PG & E sent to the California Public Utilities Commission. According to the letter, a PG & E employee spotted a fire that was close to a power transmission tower around 6:30 a.m. on Nov. 8. Later that day, an aerial patrol realized that the tower was damaged as a suspension insulator, which was supposed to support a transposition jumper, had separated from an arm on the tower but was still above the ground. PG & E said the damaged tower was inaccessible due to the restriction from Cal Fire until Nov. 14 when the company was asked to assist an investigation carried out by Cal Fire. They found a broken C-hook attached to the separated suspension insulator. The C-hook was used to connect the suspension insulator to a tower arm. Close to where the damage happened and the suspending transposition jumper, a flash mark was observed on the tower by PG & E. In addition, another adjacent power transmission tower was also found damaged, which has an insulator hold down anchor disconnected. PG & E confirmed in the letter there was an outage on the Caribou-Palermo 115 kV Transmission line 20 minutes before the fire started, which they have reported in a notice on Nov. 8. Moreover, the letter mentioned there was another outage on the Big Bend Circuit 15 minutes after the fire started and its equipment was damaged by gunshots. One day after the fire ignited, an employee of PG & E went to where the outage occurred. As a result, the employee found \"the pole and other equipment was on the ground with bullets and bullet holes at the breakpoint of the pole and on the equipment,\" according to the letter. The company also noticed that there were wires down and poles damaged on the road within the burned area. One employee with PG & E also observed \"several snapped trees, with some on top of the downed wires .\" \"These incidents remain under investigation and this information is preliminary,\" said PG & E Regulatory Executive Meredith <mark>E. Allen</mark>. \"The cause of these incidents has not been determined and <mark>may</mark> not be fully understood until additional information becomes available, including information that can only be obtained through examination and testing of the equipment retained by CAL FIRE .\" Last week, a lawsuit against PG & E was filed by a collation of law firms named Northern California Fire Lawyers on behalf of 34 Camp Fire survivors, alleging that the mechanical failure of a component on a power transmission tower resulting from poor maintenance was the cause of the Camp Fire. The lawsuit claims a steel wire hook on a power transmission tower failed to hold up a high voltage line amidst strong winds and led the uninsulated wire to make contact with the steel tower. As a result, \"blazing hot molten materials\" fell on dry vegetation below the tower and ignited the fire. The Camp Fire, which started on Nov. 8, is the deadliest wildfire in the state history, which killed at least 85 people--mostly the elderly and the disabled. The fire charred more than 150,000 acres by the time it was finally extinguished on Dec. 6. The fire consumed nearly 14,000 residences in addition to some 4,800 other buildings and forced tens of thousands of people to evacuate. Watch Next: Why Banks Love War & the War Economy The global banking system has historically played both sides of major conflicts through war financing, and drawing out the battles by providing funds beyond what each country could have otherwise spent. Share this article RECOMMENDED TOP VIDEOS Videos of the Day: Melania Trump Visits Military Families 3hr By Epoch Newsroom Videos of the Day: Trump Confronts Top Democrats Over Border Wall Funding 1d By Epoch Newsroom Videos of the Day: Macron to Speed up Tax Cuts, Raise Wages in Response to \"Yellow Vest' Protests 2d By Epoch Newsroom TOP NEWS Newly Minted Middle Eastern Women's Coalition Throws Support Behind Trump NEW By Holly Kellum More Than Two Decades After the War, Bosnia Faces New Challenges 1hr By Fatjona Mejdini, Special to The Epoch Times Melania Trump Makes First Lady History With Ride in Osprey 3hr By The Associated Press Trump Signs Order to Boost Investment in Opportunity Zones 3hr By Emel Akan Flynn Sentencing Memo Details Unusual FBI Questioning, Asks for Probation 5hr By Petr Svab US Border Crisis: 100,000 Illegal Immigrants in 60 Days 5hr By Charlotte Cuthbertson Former Canadian Diplomat Detained by Beijing State Security Bureau, Canadian Officials Confirm 5hr By Margaret Wollensak, The Epoch Times US Seeks 2-Year Sentence for Ex-Senate Staffer Indicted in Leak Probe 6hr By Ivan Pentchoukov <mark>Theresa May</mark> Clings to UK Premiership Amid Brexit Chaos 6hr By Simon Veazey Boulder Residents Ordered to Bring Guns to Police for Certification 7hr By Colin Fredericson"}, {"articleID": "2020020516_00117788_W", "names": {"Jon Jones": ["Q285450", "Q3183202"], "Valentina Shevchenko": ["Q238184", "Q4522047"]}, "date": "2020-02-05", "url": "https://www.mmafighting.com/2020/2/5/21119484/dominick-reyes-says-hes-ready-for-the-responsibility-of-being-a-role-model-as-ufc-champion", "content": "Filed under: News UFC Latest News Dominick Reyes says he's ready for the responsibility of being a role model as UFC champion New, 1 comment By Damon Martin @ DamonMartin Feb 5, 2020, 11:00 am EST Share this story Share this on Facebook Share this on Twitter Dominick Reyes Thomas Lakes, MMA Fighting Dominick Reyes has dreamed of winning a UFC title since the day he started fighting, but he knows there's a lot more to being champion than just having a belt wrapped around your waist. In the early days of the UFC, the fighters holding titles were almost as anonymous as the fans cheering for them from the crowd. There's a much different atmosphere in 2020 where recent champions have had entire parades thrown in their honor after a big win and others received a hero's welcome just stepping off the plane after capturing UFC gold. In addition to the attention being paid to UFC champions these days, athletes are also being held up as role models, especially to children who have almost always seen prominent sports figures as people they aspire to be like growing up. While reigning UFC light heavyweight champion <mark>Jon Jones</mark> has a complicated history when it comes to his own responsibilities as champion, Reyes believes he's going to set a much different example. He'll never claim he's infallible but the California native knew from his first day in the sport that he had to carry himself in a way that would reflect back positively on the people who raised him as well as admirers who choose to look up to him. \"No matter what, you're a role model,\" Reyes said when speaking to MMA Fighting. \"Kids are going to look up to you, no matter what. Whether you want to or not. I have nieces and nephews. I have a brother who's 10 years old. He looks up to me. These kids look up to me every day so I'm already in that role .\" I'm not perfect. I make mistakes. I drink from time to time. I go out but it's about being responsible and not being an assh * le about it. \"It's not fair to simply paint <mark>Jones</mark> as good or bad when it comes to his time as champion. He's donated winter coats to help needy families in his adopted hometown of Albuquerque, N.M.. He's led charity fundraising to benefit The Pediatric Cancer Foundation. <mark>Jones</mark> has spoken at schools as well as Boys and Girls Clubs while trying to pass on a message of inspiration to the youth looking up to him. On the other side of coin, <mark>Jones</mark> has also seen his name in headlines in the past for a DUI not to mention a hit-and-run accident in 2015 that could have easily landed him with a lengthy jail sentence. It did ultimately cost him the UFC light heavyweight title and almost a year of his career. Reyes isn't casting judgment on <mark>Jones</mark> for his successes or failures but he wants to set a different example as champion if he's victorious in the UFC 247 main event .\" I've been preparing to be at this level my whole life. I've kind of been preparing to be a famous athlete my whole life, \"Reyes said .\" For me, I'm not going to become champion at 23. I'm 30 years old now. I've been trained in the media stuff. I know how to act. I'm very classy with my approach to everything. I'm not going to go out and start doing crazy drugs and drinking everyday. I'm very professional about how I present myself and how I go about my life. \"I have family and really close friends around me. I have a very close circle of people around me. I still live in my hometown. I'm just happy being me. Being champion isn't going to change who I am. When I become champion, that's just added to the resume .\" Some fighters might want to shy away from those extra responsibilities but Reyes has learned to embrace them. He might even be a little excited about it. \"There's more responsibility, more public speaking, more outreach, there's more things that I'm going to be doing but I just see it as more opportunity to help my community,\" Reyes said. \"To help people that need help. To be a positive influence and force of good in this world .\" Get the latest gear Conor McGregor Autographed UFC 189 Mendes KO Photo Conor McGregor Framed Autograph From UFC 205 Rose Namajunas Reebok Namesake T-Shirt Stipe Miocic Heavyweight Champion T-Shirt Khabib Nurmagomedov UFC 229 Photo T-Shirt UFC Reebok USA Country Snapback Adjustable Hat UFC Single Fight Model Glove Display Case Most Read Morning Report: Joe Rogan believes that Dominick Reyes is the most dangerous fighter <mark>Jon Jones</mark> has faced since Daniel Cormier Khabib Nurmagomedov: Conor McGregor rematch depends on \"do I want that?' Khabib Nurmagomedov doesn't sound convinced that a Conor McGregor rematch is worth his time. Jessica Penne has six days to reach $40,000 GoFundMe goal for USADA arbitration Penne's rep says the anti-doping agency will effectively retire her if she doesn't fight her second potential anti-doping case. Leon Edwards thinks he upset Tyron Woodley by insulting his\" sh * t music' Tyron Woodley claims he's taking his bout with Leon Edwards more \"personally\" than most of his fights, and the U.K. frontrunner thinks he knows why. UFC 247 Embedded, Episode 2: \"It gets me up on a different level' It the second episode of UFC 247 Embedded, Dominick Reyes watches the Super Bowl, <mark>Valentina Shevchenko</mark> heads to the beach, Katlyn Chookagian explains her training, <mark>Jon Jones</mark> trains, and more."}, {"articleID": "2011122316_00001677_W", "names": {"Jennifer Carroll": ["Q16206281", "Q3177037", "Q4942091"]}, "date": "2011-12-23", "url": "http://politic365.com/2011/12/23/payroll-taxes-get-cut-what-about-social-security/?utm_source=rss&utm_medium=rss&utm_campaign=payroll-taxes-get-cut-what-about-social-security", "content": "another christmas and yet another bitter, sandbox fight to the last word between democrats and republicans on capitol hill that had working folks and poor folks on unemployment biting their nails. this time, it was over the payroll tax cut. late into the pre-christmas week before the remaining members of congress headed back to their districts for gift-wrapping and fundraisers house and senate leaders managed to cobble together a deal. the deal, however, only kicks the schedule up two months from now at a place where frustrated members - only concerned with political optics - will go at it again. remixing oldwashingtonsauce, congressional leaders simply ripped a page from the debt ceiling debate and crafted a senate-picked conference committee that will negotiate the terms of a year-long tax cut after january 1. many house republicans are infuriated by any deal that makes the white house look good. arriving at the point of a bruising fight over a tax cut is perplexing, as well, considering the bizarre nature of the debate. in a rare move engineered to attract independent-minded fiscal conservatives who would have otherwise thought twice about giving president obama a second term, democrats pushed a tax cut. republicans, regardless of how many ways they sliced it and diced it, did not. it was slick political maneuvering. but, hidden deep in the debate over the payroll tax cut is the fate of social security, a program that impacts the 70 million americans who earned it. some hill insiders, exhausted from the back-and-forth indecision, wondered aloud about what constant temporary payroll tax cut \"fixes\" would do to the longer term entitlement. \"forget about kicking the can,\" complained one senior democratic congressional staffer requesting anonymity. \"we might be kicking social security in the gut if we keep it up at this rate. you keep cutting the payroll tax and you might end up having next to nothing to pay for social security .\" payroll taxes, for true, are the primary funding source for social security. interestingly enough, most reports conveniently omit the fact that it's really a \"social security payroll tax .\" this is the tax that, theoretically, is supposed to end up directly in the pockets of retirees. constant cuts to those, the argument rings, could harm social security down the line, particularly if the cuts get longer and more sustained - something worrying many analysts who are watching the debate closely. workers looking for the short term grace of an extra $40 a paycheck may be stunned when retirement approaches to one day find an insolvent and non-existent entitlement. lack of willpower inwashingtonis driven by the greed of reelection in 2012. neither party wants to be the one that is seen as taking money out people's paychecks, which is as simple as the political narrative gets. hence, politically, the white house outwitted and played house republicans in the final analysis. \"senator reid and i have reached an agreement that will ensure taxes do not increase for working families on january 1 while ensuring that a complex new reporting burden is not unintentionally imposed on small business job creators,\" said house speaker john boehner after the deal was reached on thursday afternoon. translated: i don't want anybody pointing fingers at me come election day. \"because of this agreement, every working american will keep his or her tax cut - about $1,000 for the average family?. vital unemployment insurance will continue for millions of americans who are looking for work. and when congress returns, i urge them to keep working to reach an agreement that will extend this tax cut and unemployment insurance for all of 2012 without drama or delay,\" said the president. translated: remember what i just did for you on election day. essentially, both sides use the tax cut as voting pay-to-play, ethereal funny money used to bribe the voter subconscious into thinking they get something for next to nothing. all they have to do is vote for that person in november. but, in the statements and funky platitudes flowing out ofwashington, there is no mention of what this means for social security, the long heralded titan entitlement once thought of as untouchable. yet, in the constant tennis game over debt and deficit, politicians keep biting at the edges of social security, inching closer and closer to its demise or the point where they can comfortably say it's no longer viable - just enough without offending the massive voting bloc that loves it so much. therein lies the problem: social security is too much of a risky long game these days. tax cuts are an easy short sell, money you make at theatlantic cityslots or that bet on the right horse. \"middle-class working families need tax relief to help them survive in this terrible economy,\" sen. bernie sanders (i-vt) conceded earlier in the week, \"but diverting billions of dollars from social security to provide that tax relief is wrong. this continues a dangerous process that began last year. i strongly believe tax relief should be done in a different way .\" sanders, keeping it straight with no chaser, was one of a daring few on capitol hill that attempted to explain the real risk behind the payroll tax cut. if you keep cutting payroll taxes, where are you going to get your social security from? \"if congress continues to cut the program's funding source, one of two things must happen: 1) social security's insolvency will be accelerated; or 2) social security will have to increasingly rely on general revenues (i.e., income taxes) to pay beneficiaries,\" explains the mercatus center's charles blahous. that tension, however, between short term electoral gratification and long term commonsense is palpable as media heads, pundits and election [game] day strategists play gotcha with candidates. it was played out in a recent interview in which cnn's wolf blitzer backed gop presidential candidate and former senator rick santorum (r-pa) into the corner. \"but am i hearing you correctly, senator?\" asked wolf on prowl for a rating and an emmy. \"you're saying you do want to increase taxes january 1st for 160 million americans?\" santorum, nervous, waffled around at first. \"i want to keep the tax - the taxes leveled on social security right now - the taxes leveled do not pay the benefits,\" he replied. \"there is more money being paid out in social security benefits than there is coming in to social security trust fund dollars .\" but, a second later, the fog cleared up and santorum was sounding as if he'd been coached by liberal nemesis bernie sanders. \"i am for tax cuts. i'd be very happy to come back and talk to the president about how we're going to provide tax relief for millions of americans. but i'm not - i've never been for a social security tax cut, because it undermines our ability to pay social security benefits .\" charles d. ellison, managing editor for politic365.com, washington correspondent for <mark>jennifer carroll</mark> sworn in as florida's first black lt. governor"}, {"articleID": "2013100304_00007748_W", "names": {"Thomas Miller": ["Q1645605", "Q18810669", "Q2426140", "Q24706764", "Q7792461", "Q7792467"]}, "date": "2013-10-03", "url": "http://www.hellenicshippingnews.com//News.aspx?ElementID=f43e57c9-32b4-4a92-b159-43f438577b9a", "content": "Legal and contractual issues, piracy and crime, and international sanctions are the most important areas of concern to merchant shipowners. Close behind are crewing and personnel, insurance regulation, loss prevention, environmental legislation, shipboard risk management, cargo preparation and stowage, and port state control. Consequently, owners want information and advice from their P & I clubs on how to tackle the problems associated with these areas. Their priorities have been revealed by the UK P & I Club's latest member survey. As one of the world's largest marine mutuals, the UK P & I Club's 122 million gross tons of international merchant shipping provides a representative cross section of the industry. Some 259 people from among its member shipowners and their insurance brokers were interviewed, spread globally in relation to all major ship types and vessel ages. Members indicated that financial stability was the most important aspect of their relationship with any P & I club. This was followed by speedy claims resolution, strong working relationships, comprehensive loss prevention and risk management advice, understanding members' business priorities, an extensive office and correspondents' network, high quality executives and avoidance of unbudgeted calls. Nick Whitear, director at UK Club managers <mark>Thomas Miller</mark>, explained: \"The aim of our survey has been to identify and understand the issues that really concern our members and those aspects of service and performance which are most important to them. The Club was very pleased with such a high level of participation across such a wide range of ship types, trade sectors, regional and international trades and corporate organisations .\" We are committed to being the leading shipowner-controlled provider of protection & indemnity insurance and place great value on the opinions of our members about how we can extend and enhance what we do for them. However, a survey can only tell us part of the story, so we are always listening to our members' views in all our dealings with them. \"Overall, the UK Club scored a 96 per cent satisfaction rating from its shipowner members who recognised a consistently high level of performance. Over 80 per cent declared their contact with the Club's underwriting and claims staff was\" just right. \"The Club has worked closely with the International Group of P & I Clubs to create detailed guidance on piracy and international sanctions. An updated edition of Frequently Asked Questions--and matching responses--on piracy was published on the Club website in August. These FAQs reflected the greater incidence of piracy and other violent crimes against ships and seafarers off the Gulf of Guinea coast. FAQs on US sanctions against Iran have also been recently revised. The Club has issued publications on handling dangerous cargoes in containers; environmental compliance in relation to ballast water management; and compliance with the Maritime Labour Convention which took effect on 21st August. The survey was undertaken independently by research firm Firebrand Insight under the codes of conduct of The Market Research Society and ESOMAR, the World Research Federation. The United Kingdom Mutual Steam Ship Assurance Association (Bermuda) Limited is generally known as the UK P & I Club. As a mutual association, the UK Club has no outside shareholders and no financial links with other organisations. Since its establishment in 1869, the Club has existed solely for the benefit of its members. Its structure as a mutual insurance association enables it to respond to the changing needs of its assureds and allows it to provide superior service, attention and coverage. The UK P & I Club is directed by the members. Overall control lies with the directors, elected by the members from amongst themselves. The directors normally meet four times a year to formulate policy on calls, the scope of cover, finance, underwriting and claims matters, reinsurance and issues affecting the P & I world. They resolve specific claims which may not fall clearly within the cover. <mark>Thomas Miller</mark>, the Club's managers, is organised to respond promptly to requests for assistance and to provide informed advice and help with members' claims. Individual support goes far beyond that normally provided by a commercial insurer. The UK Club's size and the scale of the managers' operations has enabled the latter to develop specialist skills and expertise seldom seen in marine P & I. Class 1 and Class 2 Policy Year Balances and Mid-Year Financial Update August 2013 Argentina - New Customs Regulations to Determine the Weight of Exported Solid Bulk Cargoes - Update The Email is not valid. Comment:"}, {"articleID": "2019031216_01294675_W", "names": {"Ryan Hamilton": ["Q16972753", "Q16979943", "Q6378830", "Q7384117"], "Michael Savage": ["Q1292044", "Q3308499", "Q41787918", "Q6834142"]}, "date": "2019-03-12", "url": "http://www.nebraska.tv/news/local/former-nebraska-gop-staffer-under-fire-for-racist-remarks", "content": "Former Nebraska GOP staffer under fire for racist remarks | KHGI Former Nebraska GOP staffer under fire for racist remarks by Associated Press/KHGI Tuesday, March 12th 2019 A A A former campaign staffer of Gov. Pete Ricketts is getting criticized for homophobic, racist and anti-semitic posts online. (KHGI) LINCOLN, Neb.--A former Nebraska Republican Party intern who later worked as a paid campaign staffer for Gov. Pete Ricketts apologized Monday after being exposed as the person behind a series of hateful online posts in which he used anti-Semitic and homophobic slurs and advocated for violence against gay rights parades, black activists and journalists. Bennett Bressman, 22, made the remarks anonymously in an online chat forum for fans of the YouTube show \"America First,\" hosted by Nicholas Fuentes, a right-wing activist who has participated in white nationalist rallies. Bressman was exposed as the author of the posts by activists from \"Anti-Fascist Action Nebraska,\" a local chapter of the group known as \"antifa .\" Ricketts' campaign and the state GOP both confirmed that he worked for them. Bressman spent seven months as a field staffer for the governor's 2018 re-election campaign, during which he distributed yard signs and helped coordinate campaign volunteers. His work on the campaign ended in December. \"I am shocked and horrified to learn that this former staffer made these statements and I had no idea he harbored these feelings,\" Ricketts said in a statement. \"He never expressed these views to me. I condemn these statements and this hateful worldview, which do not reflect my beliefs or the beliefs of Nebraskans .\" <mark>Ryan Hamilton</mark>, the executive director of the Nebraska Republican Party, said Bressman volunteered as an intern for the party during the spring semester of 2018. <mark>Hamilton</mark> said the party will re-examine its pre-employment screening procedures. \"The views expressed by Mr. Bressman online are abhorrent and have no place in the Nebraska Republican Party,\" <mark>Hamilton</mark> said. \"Had the party been aware he harbored those beliefs, he never would have been permitted to volunteer. And had the party become aware of them during his time as an intern, he would have been terminated immediately .\" Bressman confirmed to the Lincoln Journal Star that he posted thousands of comments on the forum, with statements including \"gays are the scum of the earth\" and \"my whole political ideology revolves around harming journalists .\" He apologized and said he posted the comments on his own time, without the knowledge of the GOP or the Ricketts campaign. \"I'm not denying it,\" he told the newspaper. \"I understand how they look really bad and are really bad on their face. I regret what I said .\" In one post, he wrote, \"would you run over a (Black Lives Matter) supporter if they were in the street,\" then added, \"(I) probably would for the (laughs).\" In another, he wrote that he enjoys conservative radio personality <mark>Michael Savage</mark> \"even though he's a Jew .\" In yet another, he admitted that he once threw eggs at a rally for members of the gay, lesbian, bisexual and transgender community and suggests that LGBT parades should get hit by grenades. Bressman did not return a phone message left by The Associated Press on a cellphone listed as his number. Some of his comments appear to make reference to Ari Kohen, a well-known University of Nebraska-Lincoln political science professor who describes himself as \"vividly Jewish .\" Kohen said Monday that he taught Bressman in a class two years ago. He described him as quiet but said he never sensed anything amiss. \"I don't want to be an alarmist, but it's a frightening thing to be 5-10 feet away from someone who seems to viscerally hate you,\" Kohen said. In a statement, University of Nebraska-Lincoln officials said their police department was investigating the \"racist, bigoted and hateful comments\" attributed to a student. \"The safety of our university community is paramount,\" the statement said. \"Any concerns about safety are taken seriously, and we will take all appropriate action based on the identification of a potential threat .\" Nebraska Democratic Party Chair Jane Kleeb released a statement on Monday. \"Hate seems to be a family value for Ricketts. First is was Pete Ricketts' dad who sent emails that included racist comments while he looked the other way on most. Now, a staff member sent racist messages and was told to take one message down but that did not stop Bressman. He kept his job for months and kept spewing hate,\" Kleeb said. \"Obvious questions now linger. Did the campaign take money or coordinate with other white nationalists groups?\" STAY CONNECTED"}, {"articleID": "2020020517_00088004_W", "names": {"James Osborne": ["Q21068913", "Q6140669"], "Bill Foster": ["Q2903389", "Q4909019", "Q4909020", "Q4909021", "Q4909026"]}, "date": "2020-02-05", "url": "http://chron.com/business/energy/article/Democrats-accuse-Energy-Department-of-15032005.php", "content": "https: //www.chron.com/business/energy/article/Democrats-accuse-Energy-Department-of-15032005.php Democrats accuse Energy Department of underspending on clean energy research By <mark>James Osborne</mark> Updated 10:34 am CST, Wednesday, February 5, 2020 The accusations of underspending follows efforts by the Trump administration to cut funding for the EERE office under former Energy Secretary Rick Perry. The accusations of underspending follows efforts by the Trump administration to cut funding for the EERE office under former Energy Secretary Rick Perry. Photo: AFP Contributor/AFP Via Getty Images Photo: AFP Contributor/AFP Via Getty Images Image 1 of / 1 Caption Close Image 1 of 1 The accusations of underspending follows efforts by the Trump administration to cut funding for the EERE office under former Energy Secretary Rick Perry. The accusations of underspending follows efforts by the Trump administration to cut funding for the EERE office under former Energy Secretary Rick Perry. Photo: AFP Contributor/AFP Via Getty Images Democrats accuse Energy Department of underspending on clean energy research 1 / 1 Back to Gallery WASHINGTON--The Department of Energy isn't distributing funding for clean energy research fast enough, House Democrats said Wednesday. At a hearing before the oversight panel of the House Science and Space Committee, Chairman Rep. <mark>Bill Foster</mark>, D-Ill ., said the department's Office of Energy Efficiency and Renewable Energy didn't spend $823 million in funding appropriated by Congress last year, more than a third of its budget. \"We want to make sure EERE manages its R & D investments in an efficient manner and in keeping with congressional intent,\" he said. \"If potential grantees do not think EERE is a reliable partner, they are less likely to engage with DOE in the future. I am concerned about the effect this could have on the United States' position as a global leader in clean energy .\" The criticism follows repeated efforts by the Trump administration to cut funding to the EERE office under former Energy Secretary Rick Perry. But Assistant Secretary for the EERE Daniel Simmons said that it was not the office's intention to withhold spending and that carrying over funding from one year's budget to the next was in line with the final years of the Obama administration. \"What matters at the end of the day is appropriated dollars. The president's proposed budget is the beginning of the process,\" he said. \"It takes a while to get the funding announcements out the door .\" At the same time, <mark>Foster</mark> said, staffing levels at the EERE office have \"severely dropped,\" despite increases in salaries and benefits for DOE staff. But Republicans on the science committee pushed back, arguing that it was the department's job to move cautiously in the distribution of more than $1.3 billion in outside research funding last year. \"After increases by the Obama administration, EERE is by far DOE's largest applied research program,\" Beaumont Republican Rep. Wandy Weber said. \"It is clear DOE has operated appropriately and within its mandate for grant funding review .\" U.S. will soon surpass Saudi Arabia in petroleum exports: Rystad Chazen: Wall Street thinks drillers will \"waste\" cash on...Trump's proposed steel tariffs could hammer Houston...OPEC, Russia seen beating expectations on output cuts Noble Energy selling its Gulf of Mexico business to Fieldwood Fuel Fix on Twitter Tweets by fuelfixblog Fuel Fix on Facebook FuelFix View Comments © 2020 Hearst Communications, Inc. ."}, {"articleID": "2012020818_00083403_W", "names": {"Jeff Howe": ["Q16729938", "Q56065972"]}, "date": "2012-02-08", "url": "http://theatlantic.com/technology/archive/2012/02/lana-del-rey-internet-meme/252721/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+AtlanticScienceAndTechnology+%28The+Atlantic+-+Technology%29", "content": "the ecstasy and the agony of the internet celebrity youtube mega-celebrity, and thus she who often, in press accounts, gets the term \"internet sensation\" appended to her name--has, it turns out, a dad who is a wealthy internet entrepreneur. she has, it turns out, close ties to the music-industrial complex. she has, it turns out, hair that used to be blonde. lana del rey, in other words, is a pop musician who has been manufactured as a pop musician. in that, she is no different from beyonc? or gaga or madonna or any other musical act that has ever existed ever. music is manufacturing. music is performance. music is spectacle. it lives and dies on its ability to combine sincerity and falsity in approximately appropriate ratios. and so, inevitably, it has introduced many an artist to the business end of the hype cycle. lana, however, is different from her counterparts in one particular way: she found her current fame, such as it is, on youtube. she is not a celebrity so much as she is an internet celebrity. and, as an internet celebrity, lana-n? e-lizzie is not just a product; she is a possession. she is, in a very real sense, ours. we, the internet--we buzzing democracy of views and virality--created her. we have made her both what she is and more than what she is, 26 million youtube views. we have, link by link, converted lana del rey, the person, into lana del rey, the meme. which would be terrific for all involved--the singer gets her audience, the audience gets its singer--were it not for the fact that lana del rey is also, inconveniently, a person. she isn't a lolcat; she isn't an image that can be fractured and amended and replicated and transmitted at will. she is an artistic and aesthetic product, sure, but one that comes with an unavoidable narrative arc--an arc whose plot line, archived on the internet, involves past forays into the music business that were much less \"put it, when he\" exposed \"the indie singer for her non-indie past:\" meet lizzy grant. she had blonde hair, didn't look very \"alt sexy .' sorta like a girl from my high school who was a part-time hostess at chili's .\" the community that created lana del rey, in other words, turned on lana del rey. she became the digital version of the electrified dylan, with an invented name and an incorrect instrument. she was vilified for being the oldest and apparently the worst thing you can be in the music industry: inauthentic. even as a folk singer, greil marcus put it, dylan-n? - zimmerman was \"always suspect .\" he \"moved too fast, learned too quickly, made the old new too easily .\" del rey made her old new too easily. and with, it seems, a productive self-consciousness that edges her away from the sincerity of self-directed artistry...and toward something that seems more about commodity. her voice, my colleague spencer kornhaber has written, ranges \"from gloomy sigh to betty boop-ish squeal\" ; her persona, it seems, is equally variable. and so the singer broke the compact that was implied in her viral celebrity, which was that she would respect the platform, the internet, that created her in her current form. she used the internet's world--a world that prides itself on its meritocracy, that enables and ennobles organic self-expression--for the very analog purposes of album sales and album tours and but her fame was also a violation. the internet is not just a platform, but a culture, with norms and normativity. lana del rey, by trying to move beyond that culture, also betrayed it. \"people seem to feel that del rey is trying to trick us,\" sasha frere-jones you'd think, in this era of the facebook timeline--an era that finds us archiving our own evolutions in the vast scrapbook of the internet--we would be more tolerant of evolution in our celebrities. you'd think, actually, that we would celebrate it. and, to some extent, we do. madonna has made her history part of her current story. lady gaga's transformation from egg-dweller is there, on youtube, for all to see. as an internet celebrity, though, lana del rey lacks this privilege. she exists not merely for the internet; she is of it. we, the internet, are responsible for her. we are also culpable for her. and that means that we are invested in her authenticity--or in, more specifically, her ability to produce authenticity--more than we are in celebrities whose origin stories are of the analog world. we are increasingly aware of ourselves as taste-makers. what my colleagues are sharing on twitter, what my friends are listening to on spotify, what my neighbors are rating on yelp--these, increasingly, are determining the products i choose to consume, as well. their choices are influencing mine, explicitly. which means that our choices, collectively, take on the freight of intellectual implication. my friends are not just my friends, but my filters. they play a curatorial role in my online life, just as i play one in theirs. and: we are all increasingly conscious of the curatorial role we are playing in each others' lives. this invests us much more in the things and the people we endorse. and it means that authenticity becomes not just a matter of subjective value, but of collective. we get to decide, we tell ourselves, whether lana del rey is sincere in the art she produces for us. because to be true to herself means also to be true to us, her audience and her enablers. the singer's most recent album, the one enabled by the internet, is titled born to die. it seems appropriate. we already have tough copyright protection after you comment, click post. if you're not already logged in you will be asked to log in or register. yoni appelbaum history, politics raymond bonner international affairs, civil liberties thanassis cambanis international affairs bill davidow technology, economics garrett epps law professor and journalist richard florida cities, creativity joshua foust international affairs howard w. french international affairs <mark>jeff howe</mark> literature, new media lisa margonelli energy, the environment alyssa rosenberg popular culture cristine russell science, health edward tenner culture, technology dominic tierney international affairs"}, {"articleID": "2019021620_00582254_W", "names": {"Anthony Davis": ["Q20961727", "Q317008", "Q344683", "Q4770853", "Q4772366", "Q4772367", "Q4772368", "Q4772369", "Q675140", "Q730880"], "Brad Stevens": ["Q18164413", "Q4954288"]}, "date": "2019-02-16", "url": "https://www.nbcsports.com/boston/celtics/kyrie-irving-some-truth-marcus-morris-criticism-celtics-teammates", "content": "Kyrie Irving: \"Some truth' in Marcus Morris' criticism of Celtics teammates Kyrie Irving:\" Some truth' in Marcus Morris' criticism of Celtics teammates By A. Sherrod Blakely February 16, 2019 2:55 PM CHARLOTTE, N.C.--Kyrie Irving was no different than the rest of the Celtics who reacted to Marcus Morris' harsh criticism of the team following a home loss to the Los Angeles Clippers a week ago. \"There was some truth into [Morris' comments],\" said Irving, who has missed the past two games - both Celtics wins - following Morris' comments and spoke on the matter for the first time Saturday. \"We obviously understand we have a lot of talent in our locker room,\" Irving said. \"So, it's been a lot to manage. We've come out pretty successful. Obviously, not as successful as we would like to be .\" MORE KYRIE - He says knee feels better and he'll play in the All-Star Game What really struck a chord with many was how Morris described the team not having fun, even in stretches in which they were winning games. \"I watch all these other teams in the league, they're jumping on the court, all the stuff that looks like they're enjoying their teammates' success,\" Morris said at the time. \"And they're playing together, and they're playing to win. When I look at us I see a bunch of individuals .\" From Irving's perspective, having a never-satisfied outlook is what the great teams do with little effort or thought put into it. \"That's just overall the attitude you have to have in order to win in this league,\" Irving said. \"You want to be the top team in the East. You want to be one of the top teams in the whole entire league, have playoff position. Enjoy the regular season, have fun. At the end of the day, I've also played in...when I was in Cleveland my beginning years, it wasn't fun every single day. Things happen within the locker room and you just have to move on and the maturity of young players understanding that, it's just part of the business. Irving added,\" it's not college, nobody is babying you. You [media] guys aren't going to baby you, hold back your tongue or your words. It's OK to make mistakes. The judgments outside don't really matter in terms of what you feel about yourself. \"MORE CELTICS - <mark>Davis</mark> says C's are on his list, but so are 28 other teams And it is that mindset that Irving has adopted that allows him to deal with the ebb and flow of the NBA rumor mill in addition to the criticism and credit often bestowed upon NBA players in over-the-top doses .\" No one is going to validate who I am anymore, \"Irving said .\" I'm used to doing it; I struggled with it. Just mentally, really figuring out how powerful words are and what they mean to me. Nobody is going to tell me who I am going to be anyway. Once I started believing that, all this became a lot easier. Irving did not say when that transformation began, but he did shed some light on the primary factor behind it. \"I started listening to myself. It really comes down to. I stopped listening to everyone else telling me who I was supposed to be; a scorer, a passer,\" he's not as good as this'...I'm a great player. I know that. Nobody is ever going to take that away from me. I go as far as I take myself. Once I had that confidence inside of me and believed it every single day...it made this a lot easier to just be who I am and be the person I'm destined to be and that's to service others and change this game. It's not gonna be another player like me and I understand that. We're all one of one and I support that. \"Click here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device. Celtics star Kyrie Irving to play in All-Star Game Celtics star Kyrie Irving to play in All-Star Game By A. Sherrod Blakely February 16, 2019 12:01 PM CHARLOTTE, N.C.--Kyrie Irving said he plans on playing in Sunday's All-Star game after having missed the Celtics' past two regular-season games with a right knee strain. While the optics of the decision don't look great, Irving made it clear that he would not be doing so if there were any questions about his health .\" I've been resting for a minute, the treatment, it's not fun, \"Irving said .\" It's not fun doing that stuff everyday. It's part of the job, trying to stay in shape; not being on the court as much as I would like to be. But it really just puts in perspective just how much I know my body. That's the most important thing. \"Irving's return to the lineup comes at a time when the Celtics put together back-to-back strong performances in his absence, winning on the road against a red-hot Philadelphia team whose trade deadline acquisitions have bolstered their title contention hopes. Boston followed that up 24 hours later with a win over the Detroit Pistons, who are in a tightly contested fight for one of the last playoff spots in the East. CHRIS FORSBERG: Kyrie playing in ASG no big deal...if he doesn't get hurt The progress Irving has made with his rehab was among the chief considerations in his decision to play on Sunday .\" It factored in a lot, \"Irving said .\" For me, I just wanted to go out there and play if I had the opportunity. I do get paid to play basketball. So being off for seven days, six days, doing what I can to prepare my body and being able to go up and down before I play next Thursday [at Milwaukee]. I was like, \"hey, if I have the opportunity, great. If I don't...I wasn't going to be sad or anything like that. I'm grateful for the opportunity to be an all-star. There's not too many chances you get to be around Kawhi Leonard, being around KD [Kevin Durant] and have a starting lineup like we do. That was on my mind, but it didn't factor going in to taking care of my health and making sure I'm good to play .\" Irving, earning his sixth All-Star appearance, has had one of his most complete seasons as an NBA player. He is averaging 23.6 points, 4.9 rebounds and 6.9 assists per game while shooting 49.8 percent from the field and 40.9 percent from 3-point range. Irving is the only player in the NBA averaging at least 23 points and six assists while shooting better than 40 percent from 3-point range. Celtics coach <mark>Brad Stevens</mark> and president of basketball operations Danny Ainge had each said earlier this week that they were OK with Irving playing in the All-Star Game Sunday night in Charlotte if he were medically cleared and Irving thought he could. <mark>Stevens</mark> actually said he'd prefer Irving play as a way of getting prepared for the Celtics' resumption of the regular season Thursday night against the East-leading Bucks in Milwaukee. Irving was voted in as an All-Star starter and was the second pick of his former teammate LeBron James, who'll captain one team of stars against another captained by the Bucks' Giannis Antetokounmpo. The Pelicans' <mark>Anthony Davis</mark> was James' first pick. Click here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device. <mark>Anthony Davis</mark>: Celtics \"on my list' of possible trade destinations <mark>Anthony Davis</mark>: Celtics\" on my list' of possible trade destinations By A. Sherrod Blakely February 16, 2019 11:21 AM CHARLOTTE, N.C.--The only thing one can feel good about when it comes to <mark>Anthony Davis</mark> and that dumpster fire of a situation that now exists with him and the New Orleans Pelicans is that he will be playing somewhere else next season. For the longest time, it was believed that the list of possible teams he's considering did not include the Celtics. But <mark>Davis</mark> put such talk to rest (for now) in addressing the topic on Saturday before the assembled media at NBA All-Star Weekend. \"They are on my list,\" <mark>Davis</mark> said of the Celtics. MORE ALL-STARS - Despite a knee injury, Kyrie Irving says he'll play in the game Sunday While that in itself is a reason for Celtics fans to feel better about their chances of landing <mark>Davis</mark> and keeping him around long-term, he would later appear on NBA TV and say that \"all 29 other teams are on my list .\" So, <mark>Anthony Davis</mark>, are the #Celtics actually on your list?--Adam Kaufman (@ AdamMKaufman) February 16, 2019 So, you're throwing the Celtics in the same boat as say, Phoenix and Sacramento and Chicago? As much as Boston has the kind of assets that should be appealing to the Pelicans front office no matter who is running it, <mark>Davis</mark> acknowledging that Boston is under consideration bodes well for him and the Pelicans. For the Pelicans, it has the potential for them to hold out for a massive deal because if you are to take <mark>Davis</mark> at his word, he's open to playing for ANY team, which is something that one could not say before Saturday when word of a short list leaked and the Celtics were not on it. For <mark>Davis</mark>, it puts forth the image that his actions are more aligned with his words. Specifically, he talks about wanting to be in a winning situation, part of a winning culture. If he's seriously considering a handful of teams, how could the Celtics not be on such a list if it, in fact, he's focused on finding the best possible location where he can win and do so at a high level. But you have to be somewhat pessimistically optimistic when you see that he's talking about being open to everyone and not just the teams that would put him in the best position for success. And with New Orleans firing GM Dell Demps on Friday, <mark>Davis</mark> reiterated how that would have no bearing on where he stands now. \"The Pelicans have to do what's best for them,\" <mark>Davis</mark> said. \"My intentions are the same. No matter who the GM is, my intentions are the same. The Pelicans made a move they felt was best for the organization .\" And <mark>Davis</mark> is looking to do the same with his decision to demand a trade, a trade that <mark>Davis</mark> acknowledges may include the Celtics...or any of the other 28 teams that will surely look into ways in which they can acquire him. Click here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device."}, {"articleID": "2011081021_00062511_W", "names": {"George Lopez": ["Q1703868", "Q73035"]}, "date": "2011-08-10", "url": "http://koamtv.com/story/15244161/us-troubled-by-rising-anti-americanism-in-egypt", "content": "gadhafi son, reported killed, appears on libyan tv syria's crackdown hits ally hezbollah's image us, saudi pressure may keep yemen leader abroad showing hama in ruins, syria says revolt quelled yemeni troops clash with powerful tribe in capital libyan rebels: nato airstrike kills gadhafi's son resident: random killings in besieged syrian city mubarak's regime victim eyes trial with disbelief military killed taliban who downed us helicopter a sad day at dover: president obama honors the us forces killed in deadly afghanistan attack war policy to remain after helicopter crash military launches probe into afghanistan helicopter crash; secrecy shrouds remains' homecoming polygamist leader gets life in prison for assault polygamist leader sentenced to life in prison for assault of young follower he took as bride stocks soar after fed pledges low rates into '13 federal reserve says interest rates will stay low into 2013; stocks stage big rally late ap news minute: stocks slide, copter troops return home for burial, and more striking workers picket verizon locations in east as contract for 45,000 expires downgrade takes toll on stocks, economic confidence stocks plunge after s & p downgrade; dow down 634; europe, economy fears send treasurys, gold up stocks plunge worldwide--dow's 6th-worst loss dow loses 634, its sixth-biggest decline, as worried investors flee stocks around the world obama calls us aaa nation despite aa + rating obama says us remains creditworthy in eyes of global financial markets despite s & p downgrade by matthew lee associated press washington (ap) - the obama administration on wednesday expressed concern about a \"creeping\" trend of anti-american sentiment in egypt, where it says it has noticed mounting attacks and criticism of u.s. aid and motives as the country transitions to democracy. the state department said it has raised the matter with egyptian officials. it complained that the criticism is \"inaccurate\" and \"unfair\" and that personal attacks lodged against anne patterson, the new u.s. ambassador to egypt, are \"unacceptable .\" \"with regard to this kind of anti-americanism that's creeping into the egyptian public discourse, we are concerned,\" department spokeswoman victoria nuland told reporters. \"we've expressed these concerns to the egyptian government. we think this kind of representation of the united states is not only inaccurate; it's unfair. we are very strong supporters of egypt's transition to a democratic future, and we will continue to be there for egypt .\" nuland said patterson \"is one of our finest, most respected, most experienced ambassadors around the world. and she is in egypt to represent u.s. policy and the american people's aspiration to support a strong, democratic, prosperous egypt .\" u.s. officials said secretary of state hillary rodham clinton raised the matter with egypt's new intelligence chief, maj. gen. murad muwafi, in a july 28 meeting in washington. however, the trend has continued with some accusing washington of interference and fanning instability since the ouster earlier this year of authoritarian president hosni mubarak, a longtime u.s. ally. during a july visit to washington, maj. gen. mohammed al-assar, a member of the supreme council of the armed forces, criticized the united states for funding pro-democracy groups away from egyptian government supervision. at a conference hosted by the u.s. institute of peace, al-assar said that some countries including the united states have violated the egyptian laws in their funding egyptian ngos and said that egyptians were opposed to \"foreign interference,\" according to a statement by usip posted on its website. he added, \"it is a matter of sovereignty .\" hours earlier on the same day, he met with a number of scholars at the headquarters of the egyptian consulate. he reiterated same notion and said, \"all foreign funding should be subject to scrutiny in egypt .\" the july 31 issue of a state-run magazine featured a cover depicting patterson as holding a burning wad of dollars to the wick of a bomb wrapped in an american flag. the headline read: \"the ambassador from hell who lit a fire in tahrir,\" a reference to cairo's tahrir square, which was the epicenter of the uprising that toppled mubarak in february. earlier this week, egypt's prestigious state-run daily al-ahram quoted a senior member of the muslim brotherhood, abdel rahman salem, as saying patterson \"has an anti-islamic history and her role is to spread chaos in egypt .\" he referred to patterson's previous post in pakistan and claimed that she \"has relations with cia .\" \"she will work on dismantling the egyptian society just as she did in pakistan,\" he was quoted as saying. he criticized her previous remarks about the us aid to ngos to promote democracy and said, \"it doesn't serve the revolution goals in egypt .\" the administration has been surprised by a rise in anti-american sentiment in the mideast, particularly in egypt where president barack obama delivered a 2009 speech intended to ease tensions between the united states and the arab and muslim world. la stadium study appears to overstate tax benefits ex-executive charged in ny with insider trading la stadium study appears to overstate tax benefits tbs canceling comic <mark>george lopez</mark>'s talk show ap sources: giuliani courts top nh operatives bachmann points to foster parenting _ on her terms jurors: ohio killer's statement looked rehearsed latest picks for debt panel spark some pessimism all content? copyright 2000 - 2011 worldnow and koam. all rights reserved. terms of service. koam - licensed to pittsburg, kansas tips @ koamtv.com send newsroom questions or comments to:"}]