[{"date": "2019-02-16", "url": "https://www.nbcsports.com/boston/celtics/kyrie-irving-some-truth-marcus-morris-criticism-celtics-teammates", "content": "Kyrie Irving: \"Some truth' in Marcus Morris' criticism of Celtics teammates Kyrie Irving:\" Some truth' in Marcus Morris' criticism of Celtics teammates By A. Sherrod Blakely February 16, 2019 2:55 PM CHARLOTTE, N.C.--Kyrie Irving was no different than the rest of the Celtics who reacted to Marcus Morris' harsh criticism of the team following a home loss to the Los Angeles Clippers a week ago. \"There was some truth into [Morris' comments],\" said Irving, who has missed the past two games - both Celtics wins - following Morris' comments and spoke on the matter for the first time Saturday. \"We obviously understand we have a lot of talent in our locker room,\" Irving said. \"So, it's been a lot to manage. We've come out pretty successful. Obviously, not as successful as we would like to be .\" MORE KYRIE - He says knee feels better and he'll play in the All-Star Game What really struck a chord with many was how Morris described the team not having fun, even in stretches in which they were winning games. \"I watch all these other teams in the league, they're jumping on the court, all the stuff that looks like they're enjoying their teammates' success,\" Morris said at the time. \"And they're playing together, and they're playing to win. When I look at us I see a bunch of individuals .\" From Irving's perspective, having a never-satisfied outlook is what the great teams do with little effort or thought put into it. \"That's just overall the attitude you have to have in order to win in this league,\" Irving said. \"You want to be the top team in the East. You want to be one of the top teams in the whole entire league, have playoff position. Enjoy the regular season, have fun. At the end of the day, I've also played in...when I was in Cleveland my beginning years, it wasn't fun every single day. Things happen within the locker room and you just have to move on and the maturity of young players understanding that, it's just part of the business. Irving added,\" it's not college, nobody is babying you. You [media] guys aren't going to baby you, hold back your tongue or your words. It's OK to make mistakes. The judgments outside don't really matter in terms of what you feel about yourself. \"MORE CELTICS - <mark>Davis</mark> says C's are on his list, but so are 28 other teams And it is that mindset that Irving has adopted that allows him to deal with the ebb and flow of the NBA rumor mill in addition to the criticism and credit often bestowed upon NBA players in over-the-top doses .\" No one is going to validate who I am anymore, \"Irving said .\" I'm used to doing it; I struggled with it. Just mentally, really figuring out how powerful words are and what they mean to me. Nobody is going to tell me who I am going to be anyway. Once I started believing that, all this became a lot easier. Irving did not say when that transformation began, but he did shed some light on the primary factor behind it. \"I started listening to myself. It really comes down to. I stopped listening to everyone else telling me who I was supposed to be; a scorer, a passer,\" he's not as good as this'...I'm a great player. I know that. Nobody is ever going to take that away from me. I go as far as I take myself. Once I had that confidence inside of me and believed it every single day...it made this a lot easier to just be who I am and be the person I'm destined to be and that's to service others and change this game. It's not gonna be another player like me and I understand that. We're all one of one and I support that. \"Click here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device. Celtics star Kyrie Irving to play in All-Star Game Celtics star Kyrie Irving to play in All-Star Game By A. Sherrod Blakely February 16, 2019 12:01 PM CHARLOTTE, N.C.--Kyrie Irving said he plans on playing in Sunday's All-Star game after having missed the Celtics' past two regular-season games with a right knee strain. While the optics of the decision don't look great, Irving made it clear that he would not be doing so if there were any questions about his health .\" I've been resting for a minute, the treatment, it's not fun, \"Irving said .\" It's not fun doing that stuff everyday. It's part of the job, trying to stay in shape; not being on the court as much as I would like to be. But it really just puts in perspective just how much I know my body. That's the most important thing. \"Irving's return to the lineup comes at a time when the Celtics put together back-to-back strong performances in his absence, winning on the road against a red-hot Philadelphia team whose trade deadline acquisitions have bolstered their title contention hopes. Boston followed that up 24 hours later with a win over the Detroit Pistons, who are in a tightly contested fight for one of the last playoff spots in the East. CHRIS FORSBERG: Kyrie playing in ASG no big deal...if he doesn't get hurt The progress Irving has made with his rehab was among the chief considerations in his decision to play on Sunday .\" It factored in a lot, \"Irving said .\" For me, I just wanted to go out there and play if I had the opportunity. I do get paid to play basketball. So being off for seven days, six days, doing what I can to prepare my body and being able to go up and down before I play next Thursday [at Milwaukee]. I was like, \"hey, if I have the opportunity, great. If I don't...I wasn't going to be sad or anything like that. I'm grateful for the opportunity to be an all-star. There's not too many chances you get to be around Kawhi Leonard, being around KD [Kevin Durant] and have a starting lineup like we do. That was on my mind, but it didn't factor going in to taking care of my health and making sure I'm good to play .\" Irving, earning his sixth All-Star appearance, has had one of his most complete seasons as an NBA player. He is averaging 23.6 points, 4.9 rebounds and 6.9 assists per game while shooting 49.8 percent from the field and 40.9 percent from 3-point range. Irving is the only player in the NBA averaging at least 23 points and six assists while shooting better than 40 percent from 3-point range. Celtics coach <mark>Brad Stevens</mark> and president of basketball operations Danny Ainge had each said earlier this week that they were OK with Irving playing in the All-Star Game Sunday night in Charlotte if he were medically cleared and Irving thought he could. <mark>Stevens</mark> actually said he'd prefer Irving play as a way of getting prepared for the Celtics' resumption of the regular season Thursday night against the East-leading Bucks in Milwaukee. Irving was voted in as an All-Star starter and was the second pick of his former teammate LeBron James, who'll captain one team of stars against another captained by the Bucks' Giannis Antetokounmpo. The Pelicans' <mark>Anthony Davis</mark> was James' first pick. Click here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device. <mark>Anthony Davis</mark>: Celtics \"on my list' of possible trade destinations <mark>Anthony Davis</mark>: Celtics\" on my list' of possible trade destinations By A. Sherrod Blakely February 16, 2019 11:21 AM CHARLOTTE, N.C.--The only thing one can feel good about when it comes to <mark>Anthony Davis</mark> and that dumpster fire of a situation that now exists with him and the New Orleans Pelicans is that he will be playing somewhere else next season. For the longest time, it was believed that the list of possible teams he's considering did not include the Celtics. But <mark>Davis</mark> put such talk to rest (for now) in addressing the topic on Saturday before the assembled media at NBA All-Star Weekend. \"They are on my list,\" <mark>Davis</mark> said of the Celtics. MORE ALL-STARS - Despite a knee injury, Kyrie Irving says he'll play in the game Sunday While that in itself is a reason for Celtics fans to feel better about their chances of landing <mark>Davis</mark> and keeping him around long-term, he would later appear on NBA TV and say that \"all 29 other teams are on my list .\" So, <mark>Anthony Davis</mark>, are the #Celtics actually on your list?--Adam Kaufman (@ AdamMKaufman) February 16, 2019 So, you're throwing the Celtics in the same boat as say, Phoenix and Sacramento and Chicago? As much as Boston has the kind of assets that should be appealing to the Pelicans front office no matter who is running it, <mark>Davis</mark> acknowledging that Boston is under consideration bodes well for him and the Pelicans. For the Pelicans, it has the potential for them to hold out for a massive deal because if you are to take <mark>Davis</mark> at his word, he's open to playing for ANY team, which is something that one could not say before Saturday when word of a short list leaked and the Celtics were not on it. For <mark>Davis</mark>, it puts forth the image that his actions are more aligned with his words. Specifically, he talks about wanting to be in a winning situation, part of a winning culture. If he's seriously considering a handful of teams, how could the Celtics not be on such a list if it, in fact, he's focused on finding the best possible location where he can win and do so at a high level. But you have to be somewhat pessimistically optimistic when you see that he's talking about being open to everyone and not just the teams that would put him in the best position for success. And with New Orleans firing GM Dell Demps on Friday, <mark>Davis</mark> reiterated how that would have no bearing on where he stands now. \"The Pelicans have to do what's best for them,\" <mark>Davis</mark> said. \"My intentions are the same. No matter who the GM is, my intentions are the same. The Pelicans made a move they felt was best for the organization .\" And <mark>Davis</mark> is looking to do the same with his decision to demand a trade, a trade that <mark>Davis</mark> acknowledges may include the Celtics...or any of the other 28 teams that will surely look into ways in which they can acquire him. Click here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device.", "articleID": "2019021620_00582254_W", "names": {"Anthony Davis": ["Q20961727", "Q317008", "Q344683", "Q4770853", "Q4772366", "Q4772367", "Q4772368", "Q4772369", "Q675140", "Q730880"], "Brad Stevens": ["Q18164413", "Q4954288"]}}, {"date": "2019-02-17", "url": "http://www.gamereactor.eu/games/39904/Red", "content": "RED DEAD REDEMPTION 2 REVIEW. Written by Magnus Groth-Andersen on the 25th of October 2018 at 12 \"A watershed moment, an instant classic, another high point for a studio which has constantly delivered them for decades .\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 13th of February 2019 at 09:00 Tweaks are being made to combat aggressive players spoiling the fun for everyone, alongside other changes like Bounty Hunters. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 11th of February 2019 at 11:50 Rockstar and its western sequel claim the number one position ahead of a week packed with tons of new releases. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 6th of February 2019 at 14:39 A new earnings report from Take-Two shows just how much the game and its online portion have given them a boost in Q3. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 31st of January 2019 at 14:43 Uncharted 4 and Red Dead Redemption 2 come in quite low, with Crash Bandicoot's N. Sane Trilogy being the lowest.", "articleID": "2019021719_00372020_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-02-17", "url": "https://www.mirror.co.uk/3am/celebrity-news/tamzin-outhwaite-daughter-crying-scared-14012965", "content": "Get the biggest soaps stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Tamzin Outhwaite has revealed that she and her young daughter were refused entry to India. The EastEnders star was taking her 10-year-old daughter Florence on a \"healing\" yoga holiday following a \"difficult\" year, but instead, they were left crying and feeling scared in immigration. Tamzin, who plays Mel Owen in the BBC soap, says her plans were ruined by immigration officials over an issue with her visa. And her daughter was terrified that she'd be separated from her mother in the unfamiliar country. The actress said in a series of tweets: \"My 10 yr old and I have just been refused entry into India due to my visa, which was still valid, but apparently a passport stamp in Mumbai to get a connaecting flight to London at new year, counts as entry. We both sat crying in immigration at Goa airport but...Read More Ageless <mark>Amanda Holden</mark> stuns as she celebrates 48th birthday with famous pals Tamzin and Florence were going on a yoga holiday (Image: Instagram) They were refused entry (Image: Instagram)\" ...nobody died and after another 9 hr flight we are back in Blighty! Only having one week for a mother/daughter healing holiday after a difficult year means we are now looking for a new trip. It won't be a family yoga retreat but a bonding trip will suffice. \"I feel very proud of my daughter, who cried, as I did, but was mostly worried that we may be separated like families in the U.S, as her visa was valid but mine not. Fortunately we are home .\" I'm a country I feel lucky and proud to live in please excuse previous spelling and grammar mistakes. Jaded, jet lag and just exhausted! If anyone knows of any last min trips??? All suggestions welcome. (Not India) \"Read More EastEnders' Tamzin Outhwaite teases extended stay for Mel Owen Tamzin as Mel Owen (Image: BBC / Kieron McCarron) Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Tamzin also thanked the kind strangers who comforted them at the airport by handing them tissues to dry their tears. She was later forced to hit back at trolls after they berated her for sharing her story online. She said:\" Nothing spouty about it...feeling lucky and blessed...and extremely proud of my 10 yr old daughter who just went through an ordeal. \"Do you have a story to sell? Get in touch with us at webcelebs @ trinitymirror.com or call us direct 0207 29 33033 Read More Showbiz and TV editor's picks Beckhams on the FROW Megan leaves club with villa-mate Inside Joey Essex's plush pad Coleen forgives Wayne...again", "articleID": "2019021721_00303935_W", "names": {"Amanda Holden": ["Q237204", "Q4739651"]}}, {"date": "2019-02-18", "url": "http://indiatoday.intoday.in/movies/celebrities/story/salman-khan-to-akshay-kumar-bollywood-joins-forces-to-donate-for-pulwama-martyrs-1458758-2019-02-18", "content": "On Thursday, the country saw the deadliest terror attack on security forces in over a decade. The Pulwama attack killed 40 CRPF jawans, leaving the country shaken. As the whole nation, Bollywood celebs too took to social media to condemn the dastardly attack. Many also came together to donate for the families of the martyrs. From <mark>Salman Khan</mark> and Amitabh Bachchan to Akshay Kumar and Badshah, many celebs have donated to the families of the martyrs. Condemning the attack, <mark>Salman</mark> tweeted, \"My heart goes out for the Jawans of our beloved country and their families who lost their lives as martyrs to save our families .\" My heart goes out for the Jawans of our beloved country and their families who lost their lives as martyrs to save our families...#YouStandForIndia <mark>Salman Khan</mark> (@ BeingSalmanKhan) February 14, 2019 Minister of State for Home Affairs Kiren Rijiju took to Twitter to reveal that <mark>Salman</mark> was donating to the families of the martyrs by contributing to the Bharat Ke Veer fund through his charity, Being Human Foundation. Thank you @ BeingSalmanKhan on offering to contribute for Pulwama Martyrs through BEING HUMAN FOUNDATION. I'll work out for handing over of the cheques in the account of #BharatKeVeer @ BharatKeVeer Kiren Rijiju (@ KirenRijiju) February 17, 2019 Amitabh Bachchan will also donate Rs 5 lakh each to the families of CRPF jawans who were martyred in the Pulwama terror attack. The actor will be donating a total amount of Rs 2.5 crore, he revealed in a tweet. Akshay Kumar too will donate Rs 5 crore through Bharat Ke Veer, a fundraising initiative of the Union Ministry of Home Affairs. The actor also urged his Twitter followers to do the same. He tweeted saying, \"#Pulwama is something we cannot & will not forget. We're all angry & it's time to act. So act now, donate to the martyrs of Pulwama on bharatkeveer. gov. in. There's no better way to pay homage to them & show your support. This is the only official site, pls don't fall prey to fakes .\" #Pulwama is something we cannot & will not forget. We're all angry & it's time to act. So act now, donate to the martyrs of Pulwama on https: //t.co/5j0vxsSt7f There's no better way to pay homage to them & show your support. This is the only official site, pls don't fall prey to fakes pic.twitter.com/sYruUtzgKY Akshay Kumar (@ akshaykumar) February 16, 2019 Diljit Dosanjh donated Rs 3 lakh for the families of the CRPF jawans. He tweeted saying, \"Saddened to hear the cowardly Attack on our brave soldiers. Prayers to the families of the brave #CRPF personnel who have sacrificed their lives at #Pulwama today. Salute all our martyred brave hearts .\" Saddened to hear the cowardly Attack on our brave soldiers. Prayers to the families of the brave #CRPF personnel who have sacrificed their lives at #Pulwama today. Salute all our martyred brave hearts. DILJIT DOSANJH (@ diljitdosanjh) February 14, 2019 Musician Badshah, who is also making his Bollywood debut this year, donated Rs 3 lakh to the CRPF Wives Welfare Association fund. He took to Instagram to announce the same. He wrote, \"What happened in Pulwama can neither be forgotten nor forgiven. But it's time to let our soldiers know that we stand with them. Many of the shaheed jawaans have left their families without any earning sources. It is time to contribute and help their families, children and wives and parents. To show them that we all stand with them and assure them of a future full of opportunities. Please donate through various platforms available. Whatever amount you can. Remember, they protect us and keep us safe and they deserve every bit of help and support. Donate karo, contribute karo. JAI HIND .\" View this post on Instagram What happened in Pulwama can neither be forgotten nor forgiven. But its time to let our soldiers know that we stand with them. Many of the shaheed jawaans have left their families without any earning sources. It is time to contribute and help their families, children and wives and parents. To show them that we all stand with them and assure them of a future full of opportunities. Please donate through various platforms available. Whatever amount you can. Remember, they protect us and keep us safe and they deserve every bit of help and support. Donate karo, contribute karo. JAI HIND A post shared by BADSHAH (@ badboyshah) on Feb 16, 2019 at 3:01 am PST The team of Total Dhamaal is also donating Rs 50 lakh for families of the martyrs. Ajay Devgn, who stars in the film, also took to Twitter to announce that the film, which is set to release on February 22, won't be released in Pakistan. ALSO READ | Kangana Ranaut on Pulwama terror attack: Anyone who talks peace now should be slapped on the streets ALSO READ | Janhvi Kapoor slams Pakistan daily for calling Pulwama terror attack a fight for freedom ALSO READ | Amitabh Bachchan to donate Rs 2.5 crore to families of soldiers martyred in Pulwama attack ALSO WATCH | Breaking down deadliest terror attack in Jammu and Kashmir", "articleID": "2019021809_00151549_W", "names": {"Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}}, {"date": "2019-02-20", "url": "http://www.cbssports.com/college-basketball/news/forever-44-how-a-teammates-murder-has-brought-lsu-together-and-fueled-the-tigers-inspired-season/", "content": "The phone buzzed on Will Wade's pillow at 12:57 a.m. Wade, LSU's men's basketball coach, rests his cell phone next to his head on Thursday, Friday and Saturday nights during the school year. Ask many a college coach, and they'll tell you the calls you don't want almost always come after midnight. That night, Wade cracked his eyes and saw that one of his players, freshman Javonte Smart, was ringing him. He picked up expecting to hear Javonte's voice. Instead, it was another one of his freshmen, Emmitt Williams, who was overwrought. He and Smart had been eating at Waffle House when they saw police cars speeding by with their sirens on. Smart and Williams were making their way back toward where they were earlier that night with teammate Wayde Sims. Moments after seeing the police cars, Williams received a call from a friend who told them Sims had been shot. A gut-churning video of the incident was circulating on social media. It was because of this that a friend called Sims' mother, Fay Sims, and woke her up. \"She was frantic and certain it was Wayde,\" Fay said. Williams and Smart got in the car and raced to the scene at 600 Harding Boulevard on the north end of Baton Rouge, Louisiana, near Southern University's Mumford Stadium. Minutes later, Williams had Smart's phone and called their coach. He repeated the same two words. \"He's dead. He's dead. He's dead .\" \"As a coach, you think he's overreacting,\" Wade said. \"He was shot, but I didn't want to obviously believe he was dead .\" Williams and Smart followed the ambulance speeding their teammate to the hospital. Wade made his way posthaste. Fay and Wayne Sims beat their son to Our Lady of the Lake Hospital by about 5 minutes. Initially, they did not know whether Wayde was alive or dead, but approximately 20 minutes after Wayde was brought in, a doctor came out to deliver the news. Less than an hour into Sept. 28, 2018, Wayde Sims, 20, died of a gunshot wound to the head and neck. Fay and Wayne never got to see their only child that night. His body was a crime scene; law enforcement, guarding the door to where doctors were trying to save Wayde, would not his parents through. \"It was hurtful for us because we couldn't go see him, touch him,\" Fay said. They wouldn't see their boy again until more than week later when his body was embalmed in an open casket at his funeral. By the time Wade got to the hospital, Williams, Smart and former LSU teammate Brandon Sampson were waiting in the emergency room alongside Wayde's parents. \"I pretty much knew when I walked in that he was dead,\" Wade said. \"His dad came up and confirmed that to me ....You watch one of your players go to the coroner in a body bag, going into the van, we knew that was him. You almost fall to your knees .\" The killing of Wayde Sims was a senseless act of violence that culminated after an altercation that still has no clear impetus or reason. Sims, Smart and Williams, along with some other friends, attended a concert at Southern University earlier that night, then stopped by a fraternity party before making their way back to LSU, which is approximately a 10-minute drive. Sims stayed back with a friend. What happened after that remains, largely, a frustrating mystery. It's believed Wayde stepped in to stop his friend from being pummeled. From there, a suspect identified as Dyteon Simpson, pulled out a gun, pointed it at Sims and killed him, police said. Simpson, who police say has confessed to the shooting, is facing a second-degree murder charge with the potential for a life sentence. \"Javonte and Emmitt saw him before they left,\" teammate Skylar Mays said. \"Wayde checked to see if they were OK to drive and had everything in order to leave .\" Mays, Sims' oldest friend, awoke the night of Sims' death to an eruption of texts, all of them in some variation of I'm sorry or Stay strong, Sky. \"You don't even know what they're talking about,\" Mays said. \"You don't know what to think, and then to get that call that your best friend was shot ....Can't explain it. You can't explain that type of sorrow .\" Skylar and Wayde were supposed to spend their college careers as best friends on and off the basketball court as they brought LSU back to national prominence. One dumb impulse from a stranger obliterated that. Skylar was called upon to be one of Wayde's pallbearers. He carried his best friend to the grave. Wayde Sims (middle) and Skylar Mays (far ends) grew up together and became best friends before playing at LSU. Skylar Mays Wayde Sims was made for LSU. He grew up 10 minutes from campus and was as perfect a fit for the Tigers as you could find. He attended University High, which is on LSU's grounds. Wayde's father played for legendary Tigers coach <mark>Dale Brown</mark> in the late 1980s and early 1990s. While at U High, Wayde and Skylar won state championships. Wayde totaled 3,045 points and 1,613 rebounds on his way to being named the best high school player in the state of Louisiana. After former LSU coach <mark>Johnny Jones</mark>, Wayne Sims' cousin, was fired following Sims' freshman season, Will Wade got the job. Wade said Sims was one of the first to completely embrace the new staff. \"The two best words you can describe anybody are\" dependable' and \"consistent,'\" Wade said. \"He never missed a practice, never missed a day .\" The bitterness over Wayde's death was all the more infuriating and heartbreaking because those around him said he took a huge step as a person and as a player in the offseason. He was expected to be an important piece for this team in 2018-19. A common refrain in recent months for 21-4 LSU has been: Think how much better we'd be if Wayde was here. \"You look at his locker, and you're in the film room, you almost think he's been gone a few days and he'll be back .\" LSU coach Will Wade \"He had big things coming for him this season before everything happened,\" Wayne Sims said. \"We had high expectations. All that comes to a screeching halt .\" LSU's first official practice was scheduled for the 6 a.m. hour that Friday of his death. Instead, the team wouldn't fully practice until 10 days later--after Wayde was buried. Wade is not a helicopter coach. He doesn't demand curfews. Rather, he tries to curb against players staying out late by holding practice so early. \"We pretty much always do something on a Friday morning. It's just to make sure Thursday night goes smoothly,\" Wade said. \"You look back at everything that's gone on and you look back at anything you could have done, you go through the blame game. <mark>Bob</mark>'s helped me with that. You go back through every scenario .\" Wade is referring to <mark>Bob Delaney</mark>, a former director of NBA officials who was coincidentally hired to be an officiating adviser to the SEC weeks before Wayde Sims was killed. SEC commissioner Greg Sankey brought <mark>Delaney</mark> on for his rules oversight, but <mark>Delaney</mark> is also a former law enforcement agent who successfully infiltrated the mob only to deal with severe anxiety, depression and traumatic stress as a result. He's counseled the U.S. military, 9/11 first responders and dozens of everyday Americans affected by mass-shooting incidents in recent years. <mark>Delaney</mark> and other counselors proved vital in the coping process not just in the days following Sims' death but the months that crept along without him. \"How are we going to be intentional in understanding each person's grieving process as well as their interaction with trauma?\" <mark>Delaney</mark> said. \"When you experience a traumatic event, it peels the wound back on other traumatic events. It's like a scab that went over a wound gets knocked off. Will and his staff and his players, as well as the community and the university, were going to be dealing with a tremendous amount of emotion .\" Players were encouraged to be as open and emotional with <mark>Delaney</mark>, a neutral supporter, as they felt comfortable. But Mays is still caught in a loop where he's trying to stay positive while knowing a part of him is never coming back. \"I don't think it's ever going to feel normal for me as long as I'm playing ball here,\" he said. \"We expected Wayde to have a great year for us and be one of our team leaders because he had that type of summer. We expected him to make a big jump. The biggest asset he was going to bring to our team was his energy, that caring personality and a guy that keeps guys together, keeps guys with the right mindset. He would've done that just being who he was ....There's just some people in this world that everyone gravitates toward you .\" Mays, a junior shooting guard who has started every game this season, is averaging a career-high 13.0 points. Everyone in that program feels the void without Wayde, but Skylar's plight is especially acute. \"Skylar is deeply hurting,\" Fay Sims said. \"He made a comment that it feels like Wayde's on his vacation without his phone .\" Those who knew Wayde best describe him not just as a momma's boy, but as a grandma's boy, too. \"He was really caring for everybody,\" Fay said. \"He didn't see the wrong in people .\" He was also a city-dwelling outdoorsman. Wayde loved fishing, going so far as to get a boating license. He'd go bass fishing at Lake Fields, southwest of New Orleans. Sometimes he'd sneak a quick hour at the pond behind his parents' house, squeezing in the time before midday practice. He'd hop in the trawl-motor two-person boat, even convincing nervous teammate Brandon Sampson to come along. (Because of Wayde, Sampson eventually grew to enjoy fishing, which he now does on occasion .) \"If it takes a life sentence, that's what I want. No plea bargains .\" Wayne Sims Father and son began to take on big adventures, like saltwater angling and going hunting for red fish and trout in the summer of 2017. They'd head out before sunrise and creep down the marshlands well south of New Orleans, combing through brackish water until the sun's blaze baked them nice by noon. On their first trip, Wayde caught a 3-foot red fish. It took him more than 20 minutes to reel it in, tiring him out. Then he caught another one. Wayne still makes time to do the big fishing trips once in a while. As he waits and watches on the boat, his mind will drift. He thinks about his only child. He thinks about the trips that will never be. \"For me, after everything happened, I've questioned God,\" Wayne said. \"Why was he taken away from us? I understand it was a devilish act that happened. What is the purpose? Is there something good that's going to come out of this? Now that we don't have our only son, we miss him dearly and each and every day is a struggle .\" The Sims have gone to every court proceeding and will continue to do so until if/when Simpson is convicted. The case has hit stalls--Wayne personally knew the former judge in the case, causing a conflict of interest and prompting new judge to be assigned--but they are hoping to have a resolution this year. \"It's important that Wayne and I are there,\" Fay Sims said. \"I guess we're Wayde's voice now .\" Wayde Sims' favorite sports: basketball and fishing. Fay Sims Added Wayne: \"Our son was taken away from us, so if it takes for his life, not in the physical sense, but if it takes a life sentence, that's what I want. No plea bargains; we want justice to be served .\" Things have not been easier in the five months that have passed, in part, because the Sims don't have reasons for why their son was pointlessly killed. Closure is that much harder to encircle. They also know the horrific video captured on social media is there for them to watch if they choose, but they refuse. Fay said she knows some who watched it and vomited as a result. \"We don't have a whole lot of facts,\" she said. \"A fight broke out, Wayde stepped in, and the guy had a gun and shot him and killed him .\" Every few weeks brings a new threshold to cross, all of them painstaking. After the initial whirlwind of grief, the funeral, the onslaught of beloved company...then came the optimistic-yet-dreaded opening of LSU's season six weeks later. \"It literally takes my breath when I walk into the PMAC,\" Fay said. \"[Some days are] just way too emotional. When I first walk in, it cuts my breath .\" Thanksgiving for the Sims meant an open seat at the table. On Dec. 13, 2018, what would have been Wayde's 21st birthday, nearly 40 people went to his gravesite in the rain and for a ceremonial balloon release. \"I don't even remember December too much,\" Fay said. Christmas brought no seasonal decorations last year; Fay took a few Christmas items and adorned Wayde's gravesite--still waiting to have its tombstone embedded--with holiday bibelots. Then came the unexpected emotional gush of Dec. 31. \"For me, personally, it was New Year's Eve that was the worst,\" she said. \"That was having to leave 2018, although I kind of felt like I hated of 2018 for taking our son, and didn't want to see 2019 come in because Wayde wasn't a part of it. It's gut-wrenching; it's excruciating pain. I miss him dearly .\" Friends have remained supportive. The Sims' nest has not had the opportunity to become empty. But as the season goes along and LSU keeps playing better, things seem to grow that much more difficult. LSU has gone through an extraordinary--and partly controversial--run this season. Weeks after Wayde's death, Wade and his program came under scrutiny and skepticism after information via wiretap was brought up in federal court (lacking complete context) that illustrated Wade on the phone in 2017 with the now-convicted Christian Dawkins in discussions over a blue-chip recruit. Wade was asked about both that revelation and going through dual-yet-separate personal tribulations. \"It puts everything in proper perspective for you,\" he said. \"It shows you what's really important and rattles you .\" When asked a follow-up question about the wiretap, Wade declined further comment. The death of a player and the exposure of potential/alleged NCAA rule violations are matters detached in importance. But they've also been heavy, obvious, unavoidable storylines--both of which came to light in the preseason--as the Tigers have put together one of the more unexpected success stories on the court in 2019. Watch LSU and you'll see teammates affixed and fond of one another. The body language is affirming and positive. The Tigers are talented, of course, but they're also driven and focused. \"You could see a bonding that takes place where they're taking care of each other in small ways that may not be Earth-shattering, but a guy grabbing another guy by the back of the neck and kind of holding on to him,\" <mark>Delaney</mark> said. \"This is not just emotional and psychological. There's a physiology to this. It's amazing how, when we we go through trauma, people are resilient. We're more resilient than not. When that kind of love comes together, people can do extraordinary things .\" LSU opened its season in nondescript fashion with a 7-3 start. Since then, the Tigers have gone 14-1, climbed to their highest ranking in the AP Top 25 in a decade (No. 13) and improved to 21-4 overall, tied atop the SEC standings with Tennessee. There have been unlikely endings, like the basket interference that wasn't called and thus sealed a win against No. 5 Kentucky on Feb. 12. That gave LSU just its second road win in 37 games all time against a top-five opponent. There was the unreal rally Jan. 26 at Missouri--down 14 with 2:10 left, the Tigers' chances of a win at 0.2 percent--that ended with an 86-80 LSU victory. \"We're going to have six and the other team's going to have five,\" Wade said. \"I think that's the best way to explain what happened at Missouri. It's something that's with our team. Any time you go through something like that as a group, it's tough. You never know how you're going to react .\" LSU has also won in overtime against Arkansas and Mississippi State, the latter featuring an unlikely bounced-in 3-pointer by Javonte Smart to help seal it. A similarly improbable 3-point shot was made by freshman Naz Reid in the Tigers' 83-78 win against Auburn on Feb. 9. \"We like to say that Wayde's made great friends with God,\" Mays said. \"Some of the shots we make, like when Javonte hit the 3 and popped it up and in--similar to how Naz made his 3 at Mississippi State--we like to say Wayde tapped that in a little bit .\" The team has honored Wayde in a number of ways. His No. 44--the same number his dad wore at LSU--is stitched to the uniforms. Some players have taken to writing his name and number on their shoes. All Tigers now finish their weightlifting sessions with 44 reps of bicep and tricep curls. At home games, the team taps his locker before it leaves for the court. \"We're definitely playing for something bigger than ourselves,\" Mays said. \"Amongst all the tragedy and what happened in the past, I feel like we're finding a way to use what happened to give us an extra edge and a drive .\" Wayde Sims' name and number are honored on the shoes of his best friend, Skylar Mays. USATSI Wayde's locker has gone untouched since he died. His playbook is tucked behind his shoes. His practice gear and uniform dangles from the hooks. Wade sits alone in front of the locker once a week, early in the morning, to reflect. \"You look at his locker, and you're in the film room, you almost think he's been gone a few days and he'll be back,\" the coach said. <mark>Delaney</mark> and others helped LSU organize and keep structure as the season started. Everything physical in regard to handling Wayde's loss had to be intentional. His uniform was draped over a seat in the front row of the middle of the team picture. The locker was kept as it was as means of not leaving an empty space for the players to be around the entire season. \"They lose him once, they're losing him again if you do that,\" <mark>Delaney</mark> said. \"The team atmosphere really helps protect them .\" LSU travels with a counselor for its road games and has support staff available for the players and coaches when on campus. Small things can prompt memories of Wayde--good or bad--the emotions of those triggers offering up unpredictable reactions. Routines from previous seasons--Who were the teammates Wayde would sit next to on plane and bus rides? Who would he room with on the road? What songs did he like to play before a game?--are paid more careful attention. \"There's a lot of things that I've learned through all this,\" Wade said. Wade has spoken with veteran college basketball coach Oliver Purnell, who lost a player in his sleep when he was at Dayton, and consulted with former Vanderbilt football coach <mark>Bobby Johnson</mark>, who had a standout player murdered during Christmas break in 2004. \"Sometimes when there's a suddenness to things that triggers you back to being in the hospital,\" Wade said. \"There's a lot of things that can pop up and jolt you and jolt different members of your team at different times .\" For example, it's customary for teams to watch tape of conference opponents and use video from the prior season as means to scout and prep. But for LSU, that film has Wayde on it. Wade will not let his players watch that. He has eliminated it from team prep--though he and his coaches have watched it, and even then, it's as comforting as it can be spooky. He's on the screen but not in the room. \"The jolt is how you forget that you forget the film from last year, it's Wayde making a play,\" Wade said. \"He pops up. We don't want to necessarily trigger that if we don't have to. But as a coaching staff and me, personally, when I watch it, it's very jarring still to this day .\" Wayde Sims with his mother Fay and father Wayne. Fay Sims Cruelly, Wayde's slaying wasn't the first brush with death via gun violence with which the team has dealt. LSU's quietly gone through other trauma with players' family members. Prior to Wayde's death, the team had been involved with the TRUCE program, which targets at-risk areas--like near where he was killed--in Baton Rouge. For LSU, Wayde Sims is now a face of the issue. \"That's what we've tried to transition to, to turn our anger,\" Wade said. LSU's most important moments this season have been equaled or surpassed in private or away from the limelight just as much as the huge victories. Four days after the slaying, Skylar spoke at Wayde's candlelight vigil in front of the Pete Maravich Assembly Center. A few days after that, he got to see his friend one last time. He remembers it with a pause in his voice. \"Walking up to the casket, your knees are weak because you're not ready, but you want to see him,\" Mays said. \"I was honored to be a pallbearer, obviously. I thank Ms. Fay for allowing me to be a pallbearer. That meant the world to me. They had an unbelievable amount of people there and it shows how many people cared about Wayde .\" Skylar and other former teammates of Wayde have taken trips his grave with his mother. She's become a rock for Wayde's friends, to allow them to be vulnerable and cry when needed. She tags messages with plaintive expression: #forever 44?? \"Fay and I are doing the best that we can to live without him, because it's a big hole when you lose a kid like that,\" Wayne Sims said. \"A big void .\" They take two or three trips per week to the cemetery now. It's their only way to feel some modicum of comfort. On the court, Wayde will be honored in a big way come March: At the SEC Tournament, the conference plans to name him this season's SEC Legend for LSU. \"He's always around, he's always in our minds,\" Wade said. But he should be there. This season is not a dream one. It's real, it's painful, it's beyond bittersweet. There is no redemption possible here. The Tigers' success in absence of their murdered brother is a racking reminder, on a daily basis, how unfair life can be. The emotions and subtle aftershocks of his death are still coming out for many who knew him and probably will long after the final game of this season has been played. This team is forever together but forever broken. Wayde Sims' jerseys--he wore the same number as his father--hang in the family home. Fay Sims", "articleID": "2019022015_00445231_W", "names": {"Bob Delaney": ["Q4932243", "Q4932260", "Q4932262"], "Bobby Johnson": ["Q18921994", "Q4935199", "Q4935204"], "Dale Brown": ["Q3012285", "Q323353", "Q5210362"], "Johnny Jones": ["Q15018961", "Q16227667", "Q6267001", "Q6267003", "Q933190"]}}, {"date": "2019-02-20", "url": "http://www.startribune.com/love-healthy-optimistic-as-cavs-fight-to-season-s-finish/506114192/", "content": "<mark>Love</mark> healthy, optimistic as Cavs fight to season's finish By TOM WITHERS Associated Press February 20, 2019--2:40 pm Purchase: Order Reprint INDEPENDENCE, Ohio--<mark>Kevin Love</mark> relaxed on the beach under the warm Caribbean sun during the All-Star break. He hopes it finally shines on him and the Cavaliers in the second half of a depressing, gloomy season. Offering optimism about his future and Cleveland's, <mark>Love</mark> returned to the practice floor with his teammates on Wednesday following the league's annual midseason celebratory interruption. The five-time All-Star recently came back after missing more than 50 games following foot surgery. He was rested for the Cavs' final game against Brooklyn--part of his recovery plan--before the break, but <mark>Love</mark> said he plans to play Thursday against Phoenix and intends to build up his minutes over the next few weeks. Cleveland has 24 games left. \"I think you'll see me more on a steady basis and not miss games after the break, I'm hoping,\" said <mark>Love</mark>, who has played in just two games since November. \"So just continue to improve the minutes and make sure that I'm feeling good and go from there .\" With Cleveland's training staff keeping a diligent eye on him, <mark>Love</mark> took part in the 5-on-5 scrimmage without any problems and said the only issue now is improving his conditioning. Overall, he's pleased with his progress and believes the Cavs are close to turning a corner. The team has been besieged by injuries, but with <mark>Love</mark> back and forward Tristan Thompson close after missing 13 games with foot soreness, the Cavs are as healthy as they've been in months. There won't be any playoffs this season, but <mark>Love</mark> is excited about what the Cavs can accomplish down the stretch. \"Hopefully we'll have everybody back,\" said <mark>Love</mark>, his arms showing some residual redness from his vacation. \"You just have to continue to find motivation and know that there's a bigger picture involved. And you know, for me, it is tough. It's the longest I've missed consecutively in my whole career but I just gotta find opportunity, find ways to get better and in a lot of ways my body feels really fresh. I guess that's the good thing in this and just continue to get better in my game .\" This has been an exceptionally challenging season for the 30-year-old <mark>Love</mark>, who signed a four-year, $120 million contract extension in July. But despite personal setbacks and the Cavs' stunning descent from NBA powerhouse to lottery participant, <mark>Love</mark> has remained engaged and committed. Coach Larry Drew has admired the way he's handled adversity. \"He has done a magnificent job in the way he has conducted himself and he has stayed the course with his rehab through his injury,\" Drew said. \"I know how bad he wants to be out there, but things happen and you have to push through them, which he has done. Now he's able to play. He's gradually getting his legs under him and gradually getting to the point where he can play extended minutes .\" I'm certain that once he is able to get out there and really play extended minutes he's going to make the most of it. \"With less than two months left in the season, the Cavs (12-46) have the league's third-worst record. But there have been some encouraging signs, including the development of rookie guard Collin Sexton. And, although there have been some lopsided losses along the way, the Cavs have played much better over the past few weeks. Although <mark>Love</mark> was sitting, the Cavs took the Nets to three overtimes before losing last week. There's no quit in this group .\" We have guys that fight, \"<mark>Love</mark> said .\" We have guys who play really, really hard, some veterans with five or six years in the league that have put in their time and have been around playoff basketball. Any team when you have bad luck like that you're going to lose a lot of basketball games. The record indicates that obviously we are at the bottom, but we feel like we have a team that can really compete with anybody on any given night. That's the beauty of this game. \"\"We have a good group of guys that want to be better and guys that haven't given in to losing. That can be easy when so many games come at you so fast, but we've had a mentality that any given night we can win a basketball game. We're going to continue to be like that .\" ", "articleID": "2019022020_00708800_W", "names": {"Kevin Love": ["Q297221", "Q6396801"]}}]