[{"date": "2019-02-22", "url": "https://www.dawn.com/news/1465249/2021-tour-de-france-to-start-in-denmark", "content": "2021 Tour de France to start in Denmark AP Updated February 22, 2019 Facebook Count Twitter Share Email Your Name * Recipient Email * 1 The opening stage on July 2 will be a 13-kilometre flat run around the capital. .--AP/File COPENHAGEN: The Tour de France will start in Denmark in 2021, beginning with a ride in Copenhagen followed by two more stages around the country. The opening stage on July 2 will be a 13-kilometre flat run around the capital. \"It is an honour to have the grand depart in Copenhagen,\" race director Christian Prudhomme said Thursday. A 190-kilometre stage between Roskilde and Nyborg, a town on the island of Funen, will follow. That stage will include pedaling on the windy bridges that make up the Storebaelt rail-and-road link. \"The wind is very, very important for the race. It was important to have the finishing line close to the bridge,\" Prudhomme said. \"Stage 2 is for sports enthusiasts .\" The last stage before heading back to France will be in the hilly Jutland peninsula between the towns of Vejle and Soenderborg. The contract for the 90 million kroner ($13.7 million) Danish start was signed on Thursday by Prudhomme and Copenhagen Mayor <mark>Frank Jensen</mark>. Danish Prime Minister Lars Loekke Rasmussen, himself an avid cycling fan, called the Tour de France \"the most iconic cycling race of all time .\" Both Prudhomme and Loekke Rasmussen noted Denmark had been picked because of the country's interest in the race but also because many Danes bicycle to work and school every day. Published in Dawn, February 22nd, 2019 Download the new Dawn mobile app here: Google Play Apple Store Facebook Count Twitter Share Email Your Name * Recipient Email * 1 Advertisement Advertisement Read more Can't block Pakistan from World Cup, says BCCI official South Africa hit back to spoil Sri Lanka's day PSL to launch mid-season trade window Advertisement", "articleID": "2019022206_00249792_W", "names": {"Frank Jensen": ["Q113921", "Q11969906", "Q42827888", "Q46924911", "Q8962688"]}}, {"date": "2019-02-22", "url": "https://www.breitbart.com/news/judge-orders-feds-to-list-private-groups-receiving-watchlist/", "content": "ALEXANDRIA, Va. (AP)--A federal magistrate on Friday ordered the government to disclose to him and to plaintiffs' attorneys a list of private organizations that receive access to the government's list of known or suspected terrorists. Judge <mark>John Anderson</mark> issued the ruling at the conclusion of a hearing in U.S. District Court in Alexandria which he angrily questioned government lawyers about their failure to previously disclose that hundreds of private entities like universities and hospitals receive access to the list. The government admitted earlier this month in a court filing that private groups like universities and hospitals receive access to the list, after denying in previous court hearings and depositions that they do. A government lawyer said the oversight was a mistake and there was no intention to deceive. \"We didn't catch that one,\" government lawyer Antonia Konkoly said of the misstatements about the list, noting that the watchlist administration is \"a very broad operation .\" The Council on American-Islamic Relations is challenging the watchlist's constitutionality. It says innocent Muslims are placed on the list by mistake and suffer numerous consequences as a result. The government also revised its estimate of how many private groups get access to the list, from more than 1,400 to fewer than 700. Konkoly, the government's lawyer, said the initial estimate given earlier this month of 1,441 contained numerous duplicates. She said it's hard to determine an exact number because many of the private entities have similar names, and some of the recordkeeping goes back to \"before the age of modern computing .\" CAIR's lawyers have long suspected that the list is disseminated much more widely than the government has acknowledged. The broad terror watchlist contains hundreds of thousands of names; the much smaller no-fly list is culled from the watchlist. CAIR's lawsuit is filed on behalf of Muslim clients who say they have not only suffered travel consequences as a result of placement on the list but also difficulty in processing financial transactions and interactions with law enforcement. At Friday's hearing, Konkoly said the private groups receiving the list are \"law-enforcement adjacent\" entities like police forces for private universities and railroads. \"There's nothing shocking about any of the entities on the list,\" Konkoly said. \"What may not be shocking to you may be shocking to me or shocking to the plaintiffs,\" <mark>Anderson</mark> responded. As a result, <mark>Anderson</mark> ordered the government to provide him a list of the private agencies. He also ordered, over the government's objection, that the CAIR attorneys be permitted review the list at a secure government location. But the attorneys will not be allowed to keep a copy of the list and are barred from disseminating it publicly. Lena Masri, a CAIR attorney, called <mark>Anderson</mark>'s ruling \"a huge step forward to help us understand the breadth of the dissemination .\" That breadth of dissemination is a key aspect of the CAIR's lawsuit, because the plaintiffs allege that the list is shared so broadly that people suffer consequences in all aspects of life. <mark>Anderson</mark> said he was frustrated that the government did not provide accurate information about the list's private dissemination until roughly two years after the lawsuit was filed, despite specific orders from a judge to come clean on this very topic. He also expressed frustration that the FBI's Terrorist Screening Center, which manages the list, had insufficient answers about how other government agencies share the list. The fewer-than-700 entities referenced in the lawsuit refers only to those private entities that get the data directly from the Terrorist Screening Center. It does not count what other government agencies, like Customs and Border Protection and the Transportation Security Administration, do with the list. The TSA shares its data with airlines, but <mark>Anderson</mark> questioned Konkoly about who else might receive the list. Konkoly provided assurances that private corporations like banks and car dealerships don't get the list, but <mark>Anderson</mark> questioned how she could state that confidently without knowing more about the workings of the other government agencies. \"You don't know what (the department of Homeland Security) does with the information,\" <mark>Anderson</mark> said. CAIR lawyer Gadeir Abbas said it's become clear over the course of the lawsuit that so many government entities are intertwined with the collection and dissemination of the watchlist that nobody truly knows its scope. \"Each agency claims they don't know what the other agency is doing,\" he said.", "articleID": "2019022218_00501355_W", "names": {"John Anderson": ["Q13461960", "Q15994265", "Q16146059", "Q16146064", "Q1699148", "Q18576365", "Q18580618", "Q21460175", "Q22003139", "Q2399086", "Q25352589", "Q28232869", "Q3180912", "Q369857", "Q42431836", "Q43126740", "Q43394002", "Q43911342", "Q56650048", "Q56726476", "Q6218937", "Q6218947", "Q6218954", "Q6218975", "Q6218977", "Q6218982", "Q6218984", "Q6219000", "Q6219005", "Q93374", "Q936548"]}}, {"date": "2019-02-25", "url": "http://verilymag.com/2019/02/northern-spirit-winter-survival", "content": "Enjoy the special wonder that winter can inspire It lifts existence on a plane of snow One level higher than the earth below...~ Robert Frost, \"A Winter Eden\" Many winters ago, when I was perhaps seven or eight, my parents and I traveled to St. Paul, MN in early November to celebrate the traditional German holiday of St. Martinstag, or the Feast of St. Martin. Along with dozens of other families, we made lanterns out of paper and walked with them under the stars up to the steps of a cathedral, where the legend of Saint Martin was reenacted. As the story goes, Martin, a Roman soldier, came across a poor beggar freezing with cold during a snowstorm. Moved to compassion, Martin took his own cloak and sliced it in half with his sword to share with the poor man. ADVERTISEMENT Thanks for watching! Visit Website As we watched the story unfold and held our lanterns, the sky beyond the church began to glow and flicker with faint colors. I had never seen the Aurora Borealis before, and it enchanted me. That moment--the lanterns, the stars, the beautiful story, and the Northern Lights--is perhaps the first time I ever felt the special wonder that winter can inspire. I felt it again when I was an exchange student in Austria many years ago. My host family and I were staying in their grandparents' cabin in the Alpine foothills. As we all got ready for bed after watching a beautiful fantasy movie, I stepped outside for a breath of fresh air and was transfixed by the vista in front of me: silver stars in the blue heavens, sparkling over the snowy mountains around me. The beauty of the view, combined with the magic and adventure of the story we had just seen, created an unforgettable moment. In that moment, I wasn't thinking of the ice I had to skid over on my way to school, or the draft from my window, or any of winter's other inconveniences. That pristine, starry moment has stayed with me for years. ADVERTISEMENT Thanks for watching! Visit Website ADVERTISEMENT Thanks for watching! Visit Website Moments like these helped me to realize the key to making winter more than just a series of bland, house-bound days is connecting the wonderful with the mundane. It is all too easy to get caught up in the wearisome, everyday aspects of winter. Scraping ice off the car in the frigid pre-dawn darkness, tracking dirty snow in the house, and fender-benders at icy intersections (with accompanying dents and scratches) often dominate our impressions of this season. But, as I learned on those nights in St. Paul and the Alps and on many winter days since, the wonder, mythology, and lore of winter is rich, vibrant, and uniquely powerful. If we immerse ourselves and our imaginations in it, then the winter we face outside our doors will assume some of that enchantment. Especially during the post-Christmas winter months when there seems to be no lively holiday or novel excitement to look forward to, we can bring our imaginations to bear on the cold outside our doors to transform our experience. Elevating our imaginations and connecting the wondrous and magical world we can imagine to the world that we see around us can be a powerful way to stave off the winter doldrums. When we're looking for wonder in winter, it makes sense to turn to the original experts at Northern imagination: the Scandinavians. Although known today mostly for their hygge lifestyles, thoughtful aesthetic, and amazing interior design, the Nordic countries have a rich history and mythology going back centuries. That mythology has influenced countless thinkers and writers: J. R. R. Tolkien, <mark>Richard Wagner</mark>, <mark>Stan Lee</mark>, Neil Gaiman, and Edith Pattou have all been inspired to create beautiful and immensely popular work based on these stories. To add some childlike wonder to these cold months, go back to the source and look up some Norse legends about the great gods and heroes of old. My childhood (and perennial) favorite book of these stories is D’Aulaires Book of Norse Myths, a richly illustrated compendium of the classic Norse mythology. Light a candle, snack on some krumkaker, and let the stories of magic, war, tragedy, and romance evoke wonder in your mind. From here, it's natural to branch out to books like Tolkien's Lord of the Rings and Neil Gaiman's American Gods. If you're looking for an intense cure for the winter doldrums, challenge yourself and some friends to make it all the way through <mark>Wagner</mark>'s epic Ring Cycle, a series of four operas chronicling a multi-generational struggle between gods and mortals for ultimate power, inspired by German and Norse sagas. And the Norse gods and warriors aren't the only inspiration for a healthy winter imagination. My favorite fairy tale is \"East of the Sun, West of the Moon\" (retold by Edith Pattou in her novel East), in which a young woman goes on an epic quest to save her love from a dark fate in the Arctic lands. Then there are the beautiful stories of St. Lucia and Good King Wenceslas, remembered in songs, and Jack London's books, such as White Fang or The Call of the Wild, great for evoking the wildness and freedom of the American north. Poetry is especially welcome at this time of year--the quiet joy of Robert Frost's \"A Winter Eden\" or the awakening anticipation of Hilaire Belloc's \"February\" have helped me see the world around me in new ways. Sharing the winter experience with other people can also help cultivate the imagination needed to relish the short days and long nights of winter. One of my most precious memories is spending a week in remote northern Manitoba with my family and some friends in the deep winter in a cabin with no heat, electricity, or plumbing. Although that may sound cold and remote, we were actually in constant contact with fire. Cooking, bathing, heating our rooms, and illuminating our evenings all required building fires and maintaining them constantly. This kept us all busy, and when we weren't building fires, we were gathered around them, reading, drawing, telling stories, or playing fierce games of Canasta. The nights we spent next to the frozen lake were illuminated by the stars and Aurora Borealis, unpolluted by any artificial light, and the sobering thrill of finding actual wolf tracks near our cabin still haunts me. Ever since, when I feel low because of the oppressive darkness of early sunset, I light a fire, even if it's just a candle or a match. That small act reminds me not only of the fun adventures I had with my friends in Canada, but also of all I share with every person who has endured winter before me. Human beings have long gathered around fire to seek light and warmth during the winter. If we strengthen and elevate our imaginations to embrace the winter season, then the legends, songs, and natural wonders around us will help us find bright joy in even the darkest winter nights. Tags terms: Winter Winter Survival Guide books By Margaret Handel", "articleID": "2019022511_00330611_W", "names": {"Richard Wagner": ["Q3431309", "Q42306860", "Q62559"], "Stan Lee": ["Q16194157", "Q181900", "Q7597756"]}}, {"date": "2019-02-27", "url": "http://www.gamereactor.eu/games/69413/FIFA", "content": "FIFA 18 REVIEW. Written by Ricardo C. Esteves on the 30th of May 2018 at 14 \"The free update isn't quite as good as a game created from the ground up especially for the World Cup, but it comes very close .\" 0 REVIEW. Written by Ricardo C. Esteves on the 29th of September 2017 at 12 \"Unlike FIFA 13 on Wii U, this version of FIFA 18 is far from being a disappointment .\" ESPORTS. Written by <mark>Sam Bishop</mark> on the 20th of August 2018 at 10 Actors and esports pros celebrated the charity initiative. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 17th of August 2018 at 11 He spoke with the British Esports Association recently. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 14th of August 2018 at 10 The digital viewership saw a major increase. 0 ESPORTS. Written by <mark>Mike Holmes</mark> on the 6th of August 2018 at 10 The new FIFA 18 world champ crowned at the O2 in London.", "articleID": "2019022708_00751320_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-02-27", "url": "http://wtvbam.com/news/articles/2019/feb/27/us-house-approves-expanded-background-checks-for-gun-sales/", "content": "U.S. House approves expanded background checks for gun sales Wednesday, February 27, 2019 4:20 p.m. EST FILE PHOTO: Rifles are displayed for sale at the Guntoberfest gun show in Oaks, Pennsylvania, U.S., October 6, 2017. REUTERS/Joshua Robert By Amanda Becker WASHINGTON (Reuters) - The U.S. House of Representatives on Wednesday passed a bill that would expand background checks for gun sales to include firearm purchases at gun shows and over the internet, a measure likely to face Senate and White House opposition. The background check bill, which was approved by a 240-190 vote, is the first gun control measure taken up by Democrats since they regained control of the House in the 2018 congressional midterm elections. The bill is likely to face opposition when it goes to the Republican-controlled Senate, however. It would also need President Donald Trump's signature in order to become law. The White House said on Monday that Trump's advisers would recommend the president veto the legislation because it would apply \"burdensome requirements\" that are \"incompatible with the Second Amendment's guarantee of an individual right to keep arms .\" Trump has previously indicated he supported efforts to extend background checks to all gun sales. \"I will be strongly pushing Comprehensive Background Checks with an emphasis on Mental Health. Raise age to 21 and end sale of Bump Stocks! Congress is in a mood to finally do something on this issue - I hope!\" Trump tweeted a year ago, after a shooting at a high school in Parkland, Florida, that left 17 dead. Representative Steny Hoyer, the No. 2 House Democrat, told reporters on Tuesday that Republicans had prevented a vote on a background check bill when they controlled the chamber, and that while there were differences among Democrats about how to curb gun violence, the background check bill had broad support. \"The carnage that we've seen perpetrated by gun violence over the last decade has heightened the American people's concern, and the bill that we're putting on the floor we believe has the support of 90 percent of the American people,\" Hoyer said. From 2009 to 2017, there were at least 173 shootings in the United States in which four or more people were killed, with at least 1,001 total deaths, according to the advocacy group Everytown for Gun Safety. Representative <mark>Doug Collins</mark>, the top Republican on the House Judiciary Committee where the background check bill originated, said on Wednesday that the bill was ineffective because it \"foolishly presumes criminals who flout existing laws will suddenly submit themselves to background checks .\" The House is set to vote on Thursday on a second bill that would extend the time it takes to conduct a background check before a gun sale to 10 days from minutes. (Reporting by Amanda Becker; Editing by Sonya Hepinstall) More From National North Carolina Republican operative charged in election fraud scheme U.S. top court backs killer who forgot crime in death penalty case Johnson and the House vote to block Trump's emergency declaration U.S. bars lithium batteries as cargo on passenger aircraft Northern California community isolated as rain-swollen river rises U.S. top court sympathetic toward Maryland cross in major religion case Comments", "articleID": "2019022721_00241261_W", "names": {"Doug Collins": ["Q18352424", "Q3162841", "Q5300375", "Q919954"]}}, {"date": "2019-02-28", "url": "https://www.tvbeurope.com/technology/grass-valley-img-and-telstra-deploy-ip-link-over-20000km", "content": "Grass Valley has successfully deployed its DirectIP connectivity solution to establish a remote link between cameras based in Telstra's Tokyo office with an XCU base station in IMG Studios' London headquarters, delivering uncompressed, ultra-low latency video over 20,000 km. The longest true remote IP production connection on record, the Tokyo-London link is said by Grass Valley to d emonstrate a robust IP workflow between camera, IP switches and XCU that supports HD, 3G, UHD and SlowMotion feeds over large distances. Using a centralised control room to ensure high performance levels and easy set-up/maintenance, DirectIP ensures that signal availability is unaffected, allowing the remote site to integrate seamlessly with the production, regardless of distance. Trevor Boal, head of Telstra broadcast services, said: \"This trial confirms that resolution and speed are not a barrier to remote production. Getting signals from one side of the world to the other with low latency and assured quality over the Telstra network is now a reality. The transmission of remote signals via the Telstra network over such long distances between Grass Valley's cameras and the production centre is a real gamechanger that will enable productions and workflows that were not previously possible .\" Grass Valley live production VP <mark>Mark Hilton</mark> added: \"IP-based remote production is a great way to address the cost pressures of live productions as they strive to meet the growing demand for first-class content and immersive viewing experiences .\" This unique real-life field test strongly underscores the unmatched capability of Grass Valley's DirectIP workflow. As the only camera manufacturer that delivers all-IP communication between a camera head and its base station, our customers can achieve enormous savings on time, budget and resources by only sending camera heads to on-site production venues. This model maximises equipment usage at their production facilities for a higher return on investment while still supporting high-end productions--it really is a major win for them and with that, a win for the whole industry. \"", "articleID": "2019022810_00141052_W", "names": {"Mark Hilton": ["Q6768049", "Q6768050", "Q6768051", "Q6768052"]}}, {"date": "2019-03-01", "url": "https://www.euronews.com/2019/03/01/us-house-panel-demands-kushner-clearance-details-from-white-house", "content": "U.S. House panel demands Kushner clearance details from White House U.S. House panel demands Kushner clearance details from White House By Reuters Text size Aa Aa By <mark>David Morgan</mark> WASHINGTON (Reuters) - A Democratic-led congressional panel on Friday demanded that the White House comply with requests for documents and witnesses for a probe into alleged security clearance abuses involving President Donald Trump's son-in-law Jared Kushner and others. After weeks of White House stonewalling, House Oversight Committee Chairman Elijah Cummings, in a letter to the White House, said \"I am now writing a final time to request your voluntary cooperation .\" Cummings panel has subpoena power. Cummings highlighted in his letter a New York Times story that said Trump ordered his former chief of staff <mark>John Kelly</mark> to provide Kushner with clearance over objections from <mark>Kelly</mark> and Donald McGahn, then White House counsel. [nL1N20N2CM] The Times said <mark>Kelly</mark> and McGahn both wrote memos about the incident and that McGahn outlined concerns raised about Kushner by career security officials, including CIA officers. \"If true, these new reports raise grave questions about what derogatory information career officials obtained about Mr. Kushner to recommend denying him access to our nation's most sensitive secrets,\" Cummings wrote to White House Counsel Pat Cipollone in the March 1 letter, which appeared to set the stage for his committee to subpoena the material. The White House did not immediately respond to a request for comment. The Oversight Committee launched its investigation on Jan 23. Cummings said he and his staff have since written and spoken to White House officials multiple times about obtaining documents and witnesses, but to no avail. Kushner's temporary clearance was suspended by <mark>Kelly</mark> in February 2018, along with other officials operating under temporary clearances, as part of measures to tighten procedures after White House staff secretary Rob Porter was fired when his two ex-wives raised charges of domestic abuse. Cummings said he has provided the White House with detailed descriptions of security clearance abuses by at least nine high-level White House officials including Kushner and current and former national security advisers. The House Democrat's letter included a transcript from a Jan. 31 Times interview with Trump, in which the president denied ordering <mark>Kelly</mark> to overrule security officials and provide clearances for Kushner. Trump said he did not think he had the authority to overrule security officials on clearance matters, according to the letter. But White House adviser Kellyanne Conway told an NBC interviewer on Friday that Trump has said he has \"absolute authority\" to order security clearances. Cummings gave the White House until Monday to respond to his latest demands. His panel's probe is part of a wide-ranging effort by House of Representatives Democrats, launched since they took majority control of the chamber in January, to investigate Trump, his presidency and his business interests. (Reporting by <mark>David Morgan</mark> and Susan Heavey in Washington; Editing by Kevin Drawbaugh and James Dalgleish) euronews provides breaking news articles from reuters as a service to its readers, but does not edit the articles it publishes. Articles appear on euronews.com for a limited time. Share this article", "articleID": "2019030205_00301750_W", "names": {"David Morgan": ["Q12899555", "Q15486799", "Q18685631", "Q21063610", "Q21452763", "Q26250588", "Q30122174", "Q30122521", "Q3703268", "Q5237706", "Q5237709", "Q5237710", "Q5237711", "Q5237716", "Q56596970"], "John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}}]