[{"date": "2019-03-03", "url": "http://news8000.com/news/national-news/dea-ny-fentanyl-bust-finds-enough-to-kill-nearly-2-million-people/1047351570", "content": "DEA: NY Fentanyl bust finds enough to kill nearly 2 million people Five people arrested during the raid Posted: Mar 02, 2019 05:48 PM CST Updated: Mar 02, 2019 06:36 PM CST Fentanyl test strips prove controversial A home in a quiet Westchester County, New York, neighborhood was hiding enough fentanyl to kill 2 million people, the US Drug Enforcement Administration said. Federal agents found five kilograms (just over 11 pounds) of fentanyl and six kilograms (13.2 pounds) of heroin Friday when they raided a fentanyl mill operating out of a home in Ardsley, the DEA said. Five people who were arrested during the raid are facing several drug charges. Braulio Mata, 31; <mark>Jose Garcia</mark>, 44; and 20-year-old Yarly Mendoza-Delorbe were charged with conspiracy and drug possession. Another suspect, Ramon Aracena Alfe, 47, is facing a possession charge. The fifth person, 32-year-old Dionell Duarte Hernandez, has been charged with possession and resisting arrest, officials said. The group began renting the home a few months ago and neighbors had noticed several vehicles coming and going, CNN affiliate News 12 Westchester reported. \"The fentanyl alone has the potency to kill nearly over two million people,\" said DEA Special Agent in Charge Ray Donovan. \"I commend the men and women in the Task Force and Tactical Diversion Squad for their quick and efficient investigation into this organization and their diligence to the safety of the residents living nearby .\" Ardsley is a wealthy community about 20 miles north of New York City. Copyright 2019 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2019030300_00746251_W", "names": {"Jose Garcia": ["Q18808599", "Q3810443", "Q58413561", "Q6292313", "Q6292317", "Q778451"]}}, {"date": "2019-03-03", "url": "http://indiatoday.intoday.in/world/story/donald-trump-criticises-india-over-high-tariffs-threatens-to-impose-reciprocal-tax-1469242-2019-03-03", "content": "US President <mark>Donald Trump</mark> on Saturday accused India of being a \"high tariff\" nation and threatened to charge a reciprocal tax to match heavy duties imposed on goods imported from the United States. <mark>Trump</mark>'s statement came while he was addressing the last day of the four-day Conservative Political Action Conference (CPAC) in Maryland. \"India is a very high tariff nation. When we send a motorcycle to India, they charge 100 per cent tariff. When India sends a motorcycle to us, we charge nothing. I want a reciprocal tax, at least I want to charge a tax,\" said <mark>Trump</mark>. A reciprocal tax can be defined as a form of a tariff to imports from other countries that charge a similar duty on imports from the US. This is not the first time <mark>Donald Trump</mark> has called out to India over high import duties. \"But let me tell you something. The world respects our country. They respect us,\" he added. India and US were engaged in a minor trade tussle in 2018 when the US took action against certain trade policies, which allegedly favoured Indian traders, thus disrupting the balance of trade. On February 6, another disciplinary action was taken by the US against India's trade and investment policies as it withdrew the policy of zero tariffs on Indian exports to the US. Under the Generalised System of Preferences (GSP), India used to enjoy tariff concession to the tune of USD5 .6 billion worth of exports. However, the move to withdraw GSP is expected to reduce US trade deficit with other economies in the world. Read | US welcomes Pakistan's decision to release captured Indian pilot Also Read | <mark>Trump</mark>'s former lawyer <mark>Michael Cohen</mark> has testified. Calls him racist and conman Watch | Reasonably decent news on India-Pakistan conflict: <mark>Donald Trump</mark>", "articleID": "2019030303_00303701_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Michael Cohen": ["Q16728129", "Q18038631", "Q1930523", "Q22277395", "Q28868110", "Q6829330", "Q6829331", "Q6829332", "Q6829335", "Q6829336"]}}, {"date": "2019-03-04", "url": "https://www.mirror.co.uk/news/politics/chris-grayling-accused-running-scared-14086903", "content": "Get the biggest politics stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Chris Grayling was accused by Labour of running scared after the government sent the Health Secretary Matt Hancock to answer an urgent question on the pay out to Eurotunnel. Labour's <mark>Andy McDonald</mark> described the Transport Secretary as an \"international embarrassment\" who should be sacked without delay. The Government settled with Eurotunnel at a cost of £ 33 million over the award of Brexit contracts to ferry firms Eurotunnel, which operates the Channel Tunnel, has now dropped its challenge to the Department for Transport's decision to award deals worth £ 108 million to Seaborne Freight, DFDS and Brittany Ferries to lay on additional crossings to ports other than Dover in the case of a no-deal Brexit. Today Downing Street was yet again forced to confirm that the Prime Minister continues to have full confidence in Mr Grayling. Mr Grayling's catalogue of controversies gained international recognition in a New York Times article questioning how he survives. <mark>Andy McDonald</mark> called Mr Grayling an \"international embarrassment' (Image: Katie Lunn/Teesside Live) Read More Government pays £ 33m to Eurotunnel over no-deal Brexit ferry contracts The piece said:\" He has bumbled his way from one government post to another, accused of making a hash of each, and becoming a byword for haplessness in a golden age of political blundering in Britain. \"Mr <mark>McDonald</mark> told the Commons:\" Once again the Transport Secretary is not in his place to answer a question directed at him. His disregard for taxpayers in this House is clear. \"He added:\" Even in this golden age of ministerial incompetence, the Transport Secretary stands out from the crowd. He leaves a trail of destruction in his wake, causing chaos and wasting billions of pounds yet he shows no contrition, no acknowledgement of his mistakes nor any resolve to learn and improve. \"He's now ridiculed in the New York Times, the mayor of Calais has banned him from his town - the Transport Secretary has become an international embarrassment .\" Mr <mark>McDonald</mark> went on: \"The Prime Minister is the only person in the country who retains confidence in this failing Transport Secretary and only does so because of her own political weakness .\" The public deserve to know how many more calamities is the Prime Minister prepared to tolerate and how many more billions of pounds will she allow him to waste before saying enough is enough. Matt Hancock was forced to answer on behalf of the government (Image: PA) Read More More than 60 <mark>Donald Trump</mark> associates asked to hand over documents in fresh corruption probe \"This country cannot afford this Transport Secretary. He should be sacked without delay .\" In his response, Mr Hancock did not defend Mr Grayling but he did defend the legal settlement with Eurotunnel, adding: \"The purpose of the decision was to ensure the unhindered flow of medicines .\" The purpose of this is to make sure that whatever happens in Brexit people can be safe. \"Mr Hancock earlier urged MPs to back the Government's Brexit agreement with the EU to avoid a no-deal Brexit. It came after the Commons had heard an urgent question on probation changes overseen by Chris Grayling as Justice Secretary which saw a 22% rise in re-offences / The Government's part-privatisation of probation was criticised as a\" dangerous experiment that left the public less safe and out of pocket \"by Labour i Labour MP Diana Johnson said:\" I think this must be making parliamentary history - two urgent questions about the same incompetent minister and chaos and mayhem in two different departments and he doesn't even have the face to come here and front it out and what we're left with is Hancock's half hour. \"Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Labour claimed Mr Hancock was\" acting as a human shield \"for Mr Grayling, who has faced repeated calls to resign over the fiasco. Asked why the Transport Secretary was not answering a question from his Labour shadow about ferry contracts, Downing Street said today:\" The settlement with Eurotunnel was a cross-Government decision, as the provision of freight capacity was largely designed to secure the ongoing supply of crucial medicines, medical supplies and veterinary medicines. \"So it's entirely appropriate for the Health Secretary to answer the question .\" The Labour Whips Office described the decision to put Mr Hancock forward to answer Mr <mark>McDonald</mark>'s question on the floor of the Commons as \"extraordinary\". \"The Government have confirmed that Matt Hancock, the Health Secretary, will be acting as a human shield for Chris Grayling,\" the Labour whips tweeted. \"When you are unwilling, or the Government are not prepared to field you, to face the scrutiny of your peers and explain why the department you lead has had to pay £ 33 million of taxpayers money, you know the game is up .\" Read More Latest Brexit news Official Brexit delay plan - explained Northern Ireland backstop explained Key dates as the clock ticks down 21 ways No Deal will hit you What EU citizens must do to stay Northern Labour voters back referendum PM's \"shameless bung' for Labour towns UK\" abandons' key backstop demand", "articleID": "2019030420_00016431_W", "names": {"Andy Mcdonald": ["Q23011622", "Q4761018", "Q526689"], "Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-03-05", "url": "https://www.goldcoastbulletin.com.au/sport/espn-star-hired-by-major-league-team/news-story/b22e5a262463c9537f2818e5d0906058", "content": "social-email_circle American TV star <mark>Jessica Mendoza</mark> has been hired as an executive scout for the New York Mets in Major League Baseball. A day after the team announced it hired Al Leiter and John Franco as baseball operations advisers, the Mets added ESPN analyst <mark>Mendoza</mark> for the same role. The former softball player, who will keep her role with \"Sunday Night Baseball,\" will assist the Mets in \"areas of player evaluation, roster construction, technological advancement and health and performance,\" the Mets said in a statement Tuesday. Van Wagenen, a player agent until joining the Mets, pointed to his own hire by the team as an inspiration to take a chance on <mark>Mendoza</mark>. \"First, I was an outside-the-box hire and I have been a believer in getting new voices and fresh perspectives in the room, especially when you are making decisions,\" Van Wagenen said at First Data Field. \"And <mark>Jessica</mark> has a very high baseball IQ. She has aptitude to learn anything. And she knows the game. Like Al Leiter, like <mark>David Wright</mark>, like John Franco, she's a winner. She played the game at an extremely high level, an Olympic champion .\" But Van Wagenen said she also brought other attributes to the job, calling her \"a pioneer .\" \"She has clearly elevated herself to show she knows baseball inside and out,\" Van Wagenen said. media_cameraThe former softball star knows her stuff. Both <mark>Mendoza</mark> and Van Wagenen attended Stanford, although Van Wagenen went there before <mark>Mendoza</mark>. Van Wagenen said he got to know the 38-year-old <mark>Mendoza</mark> when she went to ESPN and hired CAA--the agency where Van Wagenen worked until leaving to join the Mets. Van Wagenen added he reached out to <mark>Mendoza</mark> for advice when he was weighing whether to interview for the GM spot. \"When I interviewed for this job, I had a list of people on my wish list that if we can bring in fresh perspectives and people that had talent and talent that can grow and evolve in the game, we should do that,\" Van Wagenen said. \"<mark>Jessica</mark> was in my first presentation to Mets ownership. I'm excited to be able to make it a reality .\" <mark>Mendoza</mark> is expected to be in Mets camp Friday. \"I am excited to work with Brodie and his team and am thrilled to be associated with the Mets and their storied history,\" <mark>Mendoza</mark> said in a statement released by the team. \"I've known Brodie and Jeff Wilpon for years now and I'm honoured to be a small part of the organisation. I would also like to thank ESPN and Disney for their understanding and confidence as I balance both tasks moving forward. Baseball is a passion of mine and I look forward to expanding on my love for the game .\" Van Wagenen said her job with TV allows <mark>Mendoza</mark> enough time early in the week to focus on the Mets. \"There will be physical time in which we are together and a lot of phone time,\" the GM said. As for potential conflicts of interest, <mark>Alex Rodriguez</mark>, who works alongside <mark>Mendoza</mark> on \"Sunday Night Baseball,\" also serves in a similar role with the Yankees. \"She has to remain professional in both jobs,\" Van Wagenen said. \"Clearly, there is a confidentiality agreement and understanding that anything she gleans from our operation she is not going to be sharing on her broadcast, and anything she gleans in her course of working other clubhouses she can't bring to us. She's a professional and knows the lines she has to keep .\" ", "articleID": "2019030520_00575233_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"], "David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"], "Jessica Mendoza": ["Q19843119", "Q3130679"]}}, {"date": "2019-03-05", "url": "http://hypervocal.com/items/2511306", "content": "Scott Gottlieb, the leader of the Food & Drug Administration (FDA), is resigning his position effective next month, the <mark>Trump</mark> administration announced Tuesday. In a note to FDA staff, Gottlieb said he was leaving to spend more time with his family. \"There's nothing that could pull me away from this role other than the challenge of being apart from my family for these past two years and missing my wife and two young children,\" he wrote. His replacement has not been announced. ADVERTISEMENT Gottlieb, a physician and cancer survivor, has been one of President <mark>Trump</mark> <mark>Donald</mark> John <mark>Trump</mark> Tlaib to join protest calling for <mark>Trump</mark> impeachment Ex-Trump campaign aide says he might not cooperate in House Dem probe <mark>Trump</mark> to meet with former Yemen hostage: White House MORE's most popular appointments and appeared to be widely liked within Congress by both Democrats and Republicans. He led the agency's response to the opioid epidemic, and recently has been cracking down on youth vaping. Gottlieb has also made it an agency priority to speed up approvals for generic drugs. During his confirmation process, congressional Democrats and outside groups sounded the alarm about Gottlieb's industry connections, warning they pose major conflicts of interest. He had investments in 20 different health-care companies that made products regulated by the agency. Gottlieb is the only FDA commissioner who worked in the pharmaceutical industry prior to being nominated; the others have mainly come from public health or academia. But he won over skeptics with his focus on bringing down high drug prices and reducing youth smoking rates. His resignation was unexpected, as he recently hired senior staff. \"I want to be very clear--I'm not leaving,\" he tweeted two months ago. \"We've got a lot important policy we'll advance this year .\" In a statement Tuesday, Health and Human Services Secretary Alex Azar praised Gottlieb's contributions to the agency. \"He has been an exemplary public health leader, aggressive advocate for American patients, and passionate promoter of innovation,\" Azar said. \"Scott's leadership inspired historic results from the FDA team...The public health of our country is better off for the work Scott and the entire FDA team have done over the last two years .\" I will personally miss working with Scott on the important goals we share, and I know that is true for so many other members of the HHS family, \"Azar added. In his resignation letter, Gottlieb listed a host of agency accomplishments under his tenure, including a record number of generic drug approvals. He lavished praise on agency staff for being able to avert drug and device shortages in the aftermath of Hurricane Maria in Puerto Rico. This was Gottlieb's second stint at FDA. He served as a deputy FDA commissioner under former President George W. Bush before leaving the agency in 2007. After he left the agency, Gottlieb served on the boards of pharmaceutical companies, worked as a venture capitalist and was a resident fellow at the American Enterprise Institute, a conservative think tank. Gottlieb's resignation occurs as his signature plan to crack down on the\" epidemic \"of youth vaping is poised to be released. The FDA rule that would sharply limit the sales of flavored e-cigarettes, which he says are attractive to kids, is under review at the White House. Gottlieb has tried to balance restricting the sales of e-cigarettes to youth, while also making sure they are available as a tool to help adults quit smoking traditional cigarettes. He has frequently threatened companies that he would pull their products off the market if they didn't stop marketing to teenagers. The rule has not been made public yet, but Gottlieb has previously proposed limiting the sales of most flavored e-cigarettes to age-restricted, in-person locations, effectively ending sales at gas stations and convenience stores. He also recently requested meetings with the leaders of e-cigarette manufacturers and large retailers about what they're doing to keep the devices away from kids. The initiative drew praise from some anti-tobacco activists, but was criticized by conservatives and some Republican members of Congress who said he was going too far .\" The FDA is a stand out agency, across the administration, that's moving in the completely wrong direction, \"said <mark>Paul Blair</mark> of Americans for Tax Reform, which led a coalition of conservative groups seeking to block the changes. <mark>Blair</mark>, in an interview before Gottlieb's resignation, said the commissioner's approach to regulation is inconsistent with the president's agenda .\" Without your intervention, Commissioner Gottlieb may not only destroy tens of thousands of jobs at small stores and manufacturers, but he will prevent some of the more than 35 million American adults who still smoke tobacco cigarettes from ever successfully quitting, \"ATR and 18 other groups wrote in a letter to <mark>Trump</mark> last month. Tobacco stocks briefly spiked on the news Gottlieb was planning to resign; shares of Altria, which recently invested $13 billion in e-cigarette maker Juul, jumped almost $2 a share before leveling off. President <mark>Trump</mark> on Tuesday tweeted that Gottlieb\" has done an absolutely terrific job as Commissioner of the FDA. \"\"Scott has helped us to lower drug prices, get a record number of generic drugs approved and onto the market, and so many other things. He and his talents will be greatly missed!\" <mark>Trump</mark> said. Gottlieb waded into the drug pricing fray shortly after he took charge of the agency. He wrote in a public blog posting that high drug prices are \"a public health concern that FDA should address .\" In a speech, he said he wanted to \"end the shenanigans\" that interfere with competition. ADVERTISEMENT The FDA has historically stayed out of the drug pricing debate, but Gottlieb insisted the pricing issue fits with the agency's mission. In an interview with The Hill last year, he said unleashing free market forces is the key to lowering drug prices. Members of Congress who worked with Gottlieb called him an effective leader and public servant. \"In all my years of public service, I've never worked with a more talented, forthright, and effective agency leader than Dr. Scott Gottlieb,\" said Rep. Greg Walden Gregory (Greg) Paul Walden FDA chief Scott Gottlieb resigns State rules complicate push for federal data privacy law A conservative climate plan will build on personal responsibility while reducing emissions MORE (R-Ore .), the top Republican on the House Energy & Commerce Committee. \"He worked effectively with Congress to find solutions and to improve the quality of life for all of us .\" Updated at 5:26 p.m. Tags <mark>Donald Trump</mark> Greg Walden e-cigarettes Health FDA resignation <mark>Trump</mark> Cabinet", "articleID": "2019030619_00497682_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Paul Blair": ["Q1524916", "Q7149400"]}}]