[{"date": "2019-03-07", "url": "http://kutv.com/news/nation-world/guidelines-ask-agents-to-target-spanish-speakers-at-border", "content": "Guidelines ask agents to target Spanish speakers at border | KUTV Guidelines ask agents to target Spanish speakers at border by ELLIOT SPAGAT, Associated Press Thursday, March 7th 2019 VIEW ALL PHOTOS FILE - In this Jan. 25, 2019, file photo, a migrant who did not give his name looks on with his children as they wait to hear if their number is called to apply for asylum in the United States, at the border in Tijuana, Mexico. (AP Photo/Gregory Bull, File) SAN DIEGO (AP)--Border agents have been told to explicitly target Spanish speakers and migrants from Latin America in carrying out a <mark>Trump</mark> administration program requiring asylum seekers wait in Mexico, according to memos obtained by The Associated Press that reveal some inner workings of a top government priority to address the burgeoning number of Central Americans arriving in the country. The <mark>Trump</mark> administration launched the program in late January in what marks a potentially seismic shift on how the U.S. handles the cases of immigrants seeking asylum and fleeing persecution in their homeland. The program initially applied only to those who turned themselves in at official border crossings, but a memo from a division chief of the Border Patrol's San Diego sector says it expanded Friday to include people who cross the border illegally. The guidance includes instruction about various groups of immigrants who are not to be sent back to Mexico and instead go through the traditional asylum process in the U.S. immigration court system. They include pregnant women, LGBT migrants and people suffering medical issues. Authorities said previously that Mexican asylum seekers are excluded, as are children traveling alone. FILE - In this Feb. 19, 2019, file photo, migrants who are awaiting their chance to request asylum in the U.S. pass the time inside a shelter in Bachilleres gymnasium in Ciudad Juarez, Mexico. (AP Photo/Christian Torres, File) U.S. officials must check if the asylum seeker has any felony convictions and notify Mexico at least 12 hours before they are returned. Those who cross illegally must have come as single adults, though the administration is in talks with the Mexican government to include families. The program is being implemented as border arrests soared in February to a 12-year-high and more than half of those stopped arrived as families, many of them asylum seekers who generally turn themselves in instead of trying to elude capture. Guatemala and Honduras have replaced Mexico as the top countries, a remarkable shift from only a few years ago. The instructions say Mexican officials insist that no more than 20 asylum seekers are returned each day from San Diego to Tijuana, Mexico, on Monday through Saturday, underscoring challenges that the U.S. faces in trying to quickly ramp up one of its top border enforcement priorities and most significant changes to the U.S. immigration system of <mark>Donald Trump</mark>'s presidency. Authorities said Tuesday that more than 76,000 were stopped or apprehended at the Mexican border in February, more than double the same period last year. A memo on Tuesday to top Border Patrol officials in San Diego said the agency is under \"pressures to utilize this program as much as we can .\" Asylum-seeking families are typically released from U.S. custody immediately and allowed to settle with family or friends while their cases wind through immigration courts, which often takes years. Critics say that amounts to \"catch-and-release,\" which administration officials want to limit with the new Mexico program. In a statement, the Department of Homeland Security described the program as \"another tool available in the law\" to respond to the record numbers of Central American migrants arriving at the border in recent months. The agency said the program is being carried out in a \"thoughtful and deliberate manner\" that protects vulnerable migrants and is done in collaboration with the Mexican government. Two U.S. officials who were not authorized to discuss the internal guidance and spoke on condition of anonymity confirmed contents of the memos obtained by the AP. FILE - In this Dec. 3, 2018, file photo, migrants are escorted by a U.S. Border Patrol agent as they are detained after climbing over the border wall from Playas de Tijuana, Mexico, to San Ysidro, Calif. (AP Photo/Rebecca Blackwell, File) Explicitly targeting Spanish speakers and Latin Americans had not been previously disclosed, though some critics said it was no surprise considering that recent arrest numbers are largely Central Americans. Judy Rabinovitz, an attorney for the American Civil Liberties Union, said the criteria \"does smack of the same concerns we had in the Muslim ban,\" referring to <mark>Trump</mark>'s ban on travelers from several predominantly Muslim countries, which was eventually upheld by the Supreme Court. \"We know they are trying to get at Central American asylum seekers but to see it written there so blatantly is so disturbing,\" said Rabinovitz, whose organization was among those that sued the administration last month to block the policy. Secretary Kirstjen Nielsen has made the administration's \"Migrant Protection Protocols\" a top priority, working for months with Mexican counterparts to seal the broad outlines of an agreement in November. Testifying Wednesday in Congress, Nielsen said the U.S., working with Mexico, was exercising its authority to make people wait outside the country. \"All asylum seekers have the opportunity to present their case,\" she said. \"We're not turning anybody around .\" The effort has gotten off to a modest start amid mixed signals from Mexican officials and been limited to San Diego. Tonatiuh Guillen, who heads Mexico's immigration agency, told the AP that Mexico accepted 112 Central Americans during the first five weeks, including 25 children. Homeland Security has declined to release numbers. A Homeland Security official, speaking to reporters Friday on a conference call on condition of anonymity, said the administration planned to grow the effort exponentially across the border, including to people who cross illegally between border crossings. The official declined to say when or where but said it was likely to be expanded in the next few weeks. One memo obtained by the AP shows that it had been expanded on the same day. ___", "articleID": "2019030712_00029963_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-03-07", "url": "http://www.wiltsglosstandard.co.uk/news/national/17484632.silence-in-the-commons-as-mp-reads-out-names-of-women-killed-by-men/", "content": "Silence in the Commons as MP reads out names of women killed by men By Press Association 2019 The Houses of Parliament, as <mark>Jess Phillips</mark> was speaking during the parliamentary debate marking International Women's Day 0 comment The House of Commons listened in silence as an MP read out the names of some 130 women killed by men in the last year. Labour's <mark>Jess Phillips</mark> said she wanted to use the parliamentary debate marking International Women's Day to honour her promise to share the names of those women who had died since the previous debate. The MP for Birmingham Yardley added she could \"feel the nervousness in the room\" that she would not finish reading the list within the seven-minute time limit imposed on speeches, telling the Commons: \"That is how we should feel every single minute of every single day--nervous that one of our constituents will wake up dead .\" Labour MP <mark>Jess Phillips</mark> reads out the names of women killed by men in the last 12 months (PA) It took Ms <mark>Phillips</mark> more than four minutes to read out the names and she thanked Karen Ingala Smith, of the Counting Dead Women project, for \"tirelessly\" recording the lives of the women affected. Ms <mark>Phillips</mark> explained: \"In the first International Women's Day debate I ever attended I promised to read out the names of women killed by men since the last International Women's Day--today I will honour that promise .\" Over the years I have had the pleasure of meeting the families of these women, grateful that their loved ones were being remembered. \"I read these names not only to continue to highlight how male violence can terrorise ordinary women's lives but to pay tribute to them and those who didn't survive, and give them the opportunity to be heard because the reason these women are no longer with us is because they are hard to see, they are hard to hear and they are hard to believe .\" So shocking to listen to @ jessphillips reading out a list of women killed by male violence since last International Womens Day. The list seems never ending. Each of these a victim. Terrible .--Anna Turley MP (@ annaturley) March 7, 2019 After reading out the names, Ms <mark>Phillips</mark> added: \"I could feel the nervousness in the room that I wouldn't finish reading the list within seven minutes and that is how we should feel every single minute of every single day--nervous that one of our constituents will wake up dead .\" The fear and tension that we felt in our bodies that I wouldn't get through the list and I'd be made to sit down is what victims of domestic violence feel every minute that they walk around their houses, the second they wake up in the morning they feel frightened and that they're going to have to walk on awkward eggshells all day long. \"These women need us in this place to hear their names and hear their stories so that we can change and make it so next year's list might at least be a little bit shorter\". Conservative Helen Whately (Faversham and Mid Kent) later highlighted how \"unconscious bias and discrimination\" are still holding women back. She added: \"Just last week a man told me that women don't want to stand for election because they'd rather stay at home in the evening because men are the breadwinners and they're the ones who like to work hard .\" I've lost count of the number of times people have asked me how I manage to be an MP and look after my children, as if this is some sort of incredible feat as opposed to what women do day in day out--juggling being a Member of Parliament or any demanding career. \"0 comment", "articleID": "2019030715_00332406_W", "names": {"Jess Phillips": ["Q19979409", "Q6185996"]}}, {"date": "2019-03-07", "url": "https://inews.co.uk/news/uk/amber-rudd-diane-abbott-coloured-woman-bbc-radio-interview/", "content": "In brief The comments provoked an immediate response Diane Abbott called the comments \"offensive, outdated and revealing' Work and Pensions Secretary Amber Rudd has been criticised after she described Labour frontbencher Diane Abbott as a\" coloured woman' during a BBC interview on Thursday. The Government minister was discussing the women in politics on Jeremy Vine's BBC Radio 2 show, when she used the offensive term. The comments provoked an immediate response from Ms Abbott who branded it \"offensive, outdated and revealing\" in a tweet. Ms Rudd apologised shortly after making the comments saying: \"Mortified at my clumsy language and sorry to Diane Abbott My point stands: that no one should suffer abuse because of their race or gender .\" \"Coloured woman' Work and Pensions Secretary Amber Rudd talks to the media in Westminster (Photo: Jack Taylor/Getty Images) Ms Rudd was talking about internet trolling of Ms Abbott when she said:\" It's definitely is worse if you're a woman, and it's worst of all if you're a coloured woman. \"\"I know that Diane Abbott gets a huge amount of abuse, and I think that's something we need to continue to call out .\" She said research has shown that \"it definitely was the case that the women get it more, black and black minority ethnic women get it additionally\". She added: \"It is just a particularly nasty form of attack that focuses on gender and colour and I think that we have to address it by calling it out and we have to continue to look at ways of trying to stop it happening .\" \"The term\" coloured \", is an outdated, offensive and revealing choice of words\" --Diane Abbott (@ HackneyAbbott) March 7, 2019 The Labour MP for Midlothian, Danielle Rowley, tweeted: \"Amber Rudd undermining an important point about online abuse by referring to Diane Abbott as a\" coloured woman \"on BBC Radio 2. She clearly gets her language from the same bygone era as her abhorrent welfare policies .\" Ms Rudd returned to Government in November after resigning as Home Secretary in April 2018 because of the department's handling of the Windrush scandal. Ms Abbott, who is Labour shadow Home Secretary, has called for action to tackle online abuse after research showed she received nearly half of all abusive tweets sent to female MPs in the run-up to the 2017 general election. More on Amber Rudd Amber Rudd to end repeat PIP assessments for disabled pensioners <mark>Theresa May</mark> to pause Brexit as up to 15 ministers threaten to walk out More people are using food banks in Amber Rudd's constituency since UC Amber Rudd admits Universal Credit has pushed people to food banks Brexit: Justice Secretary David Gauke urges Parliament to give MPs free votes \"to resolve things' Cabinet split as <mark>Theresa May</mark> refuses to rule out No Deal Brexit News Politics UK Video Amber Rudd BBC Radio 2 Diane Abbott", "articleID": "2019030715_00365618_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2019-03-07", "url": "http://www.breakingnews.ie/showbiz/the-crown-drew-7m-viewers-says-bbc-boss-as-netflix-keeps-figure-under-wraps-909451.html", "content": "The BBC has said Netflix big hitter The Crown was watched by around seven million viewers after the streaming service kept its viewing figures under wraps. The streaming giant--also known for shows like Sex Education, Stranger Things and House Of Cards--does not reveal how many people watch its shows. But BBC director-general <mark>Tony Hall</mark> said the period drama attracted fewer viewers in the UK than Bodyguard, the BBC drama starring Richard Madden and Keeley Hawes, with a vastly smaller budget. In a speech at a media and telecoms conference, Lord <mark>Hall</mark> said the BBC's Bodyguard finale reached 17 million viewers in a month while \"our data suggests The Crown, an absolutely brilliant series, reached seven million users in the UK in 17 months\". Olivia Colman will star as the monarch in The Crown (Ian West/PA) A Netflix source said the streaming company did not recognise the figure and added it was not official. \"It is a UK-made show, which has taken a very British subject to 190 countries,\" the source added. The streaming company does not reveal viewing figures, saying fans watch its shows at different times. Oscar-winner Olivia Colman takes over the role of the monarch from Claire Foy in the next instalment of the drama. Tobias Menzies will appear as the Duke Of Edinburgh, previously played by <mark>Matt Smith</mark>, while Helena Bonham Carter will be Princess Margaret. Netflix has 10 million subscribers in the UK. - Press Association", "articleID": "2019030716_00923490_W", "names": {"Matt Smith": ["Q1882744", "Q20713866", "Q24809160", "Q27074050", "Q30123100", "Q312385", "Q3299556", "Q3852033", "Q40281443", "Q43091034", "Q54152850", "Q6789356", "Q6789357", "Q6789358", "Q6789359", "Q6789360", "Q6789363", "Q6789364", "Q6789365", "Q6789366", "Q6789367", "Q6789368", "Q6791245"], "Tony Hall": ["Q21597856", "Q33675022", "Q7822516", "Q7822518", "Q7822519", "Q80390"]}}, {"date": "2019-03-01", "url": "http://www.canindia.com/womens-empowerment-shouldnt-come-at-cost-to-men-australian-pm/", "content": "Author: CanIndia New Wire Service Views: 1 Canberra, March 8 (IANS) Australian Prime Minister <mark>Scott Morrison</mark> sparked outrage on the International Women's Day on Friday by saying that men should not have to make way for women's empowerment. \"We're not about setting Australians against each other, trying to push some down to lift others up. We want to see women rise. But we don't want to see women rise only on the basis of others doing worse,\" <mark>Morrison</mark> said at a function organized by Australia's Mining Industry, according to CNN. The Prime Minister, who has been criticized for the lack of female representation among his party's leadership, was slammed on social media for his comments. \"Men who are threatened or worried of women achieving equality is the bloody problem,\" tweeted Australian Senator Sarah Hanson-Young. ALSO READ: Iraq arbitrarily arresting, torturing child IS suspects: Report Independent MP Kerryn Phelps, who last year won a by-election seat given up by <mark>Morrison</mark>'s predecessor Malcolm Turnbull, gave the Prime Minister \"the emoji treatment\" , posting a single wide-eyed, shocked face in response to his comments. After the event, <mark>Morrison</mark> tweeted: \"Today is about appreciating all the women in our lives and our nation--celebrating their value and achievements .\" During his speech, <mark>Morrison</mark> told the Chamber of Minerals and Energy that a stronger Australian economy would improve job prospects for women. However, several resignations from female members of <mark>Morrison</mark>'s government led many to question his commitment to jobs for women within his ruling Liberal Party. Independent parliamentarian Julia Banks told a crowd at an event that <mark>Morrison</mark>'s leadership style was akin to \"Mad Men crossed with House of Cards\". She quit <mark>Morrison</mark>'s Liberal Party last November, citing a \"culture of gender bias, bullying and intimidation\". ALSO READ: 7 killed in Paris building fire Former Foreign Minister Julie Bishop will leave Parliament altogether at the next election, which is due before the end of May. The Prime Minister also addressed on Friday his party's efforts to remedy its \"bad-for-women\" reputation, saying: \"I have been doing a bit of advancement of women lately myself. There are now seven women in my Cabinet, which is the highest number of women ever in a Cabinet in Australia's history .\" <mark>Morrison</mark>'s online detractors pointed out that just 22 per cent of sitting Liberal Party members across Australia's two houses of Parliament were women .--IANS", "articleID": "2019030813_00027537_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"]}}, {"date": "2019-03-11", "url": "http://www.wftv.com/news/trending-now/genealogy-dna-solve-case-of-newborn-left-to-freeze-to-death-in-ditch-38-years-ago/929482557?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Genealogy, DNA solve case of newborn left to freeze to death in ditch 38 years ago Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Genealogy, DNA solve case of newborn left to freeze to death in ditch 38 years ago By: Crystal Bonvillian, Cox Media Group National Content Desk Updated: Mar 11, 2019 - 6:54 PM Loading...of Genealogy, DNA solve case of newborn left to freeze to death in ditch 38 years ago SIOUX FALLS, S.D. - His community named him <mark>Andrew John</mark> Doe. The residents of Sioux Falls, South Dakota, took the newborn into their hearts, with about 50 strangers attending a burial that included a tiny white casket, flowers, stuffed animals and a pin on his pajamas that stated, \"You are loved .\" Now, just over 38 years after the baby boy was found dead in a ditch, his umbilical cord and placenta still attached and tears frozen on his cheeks, police officials say they have identified his mother and charged her in his death. Sioux Falls Police Chief Matt Burns on Friday announced the arrest of Theresa Josten Bentaas, 57, of Sioux Falls. Bentaas, who was identified as <mark>Andrew</mark>'s mother through genetic genealogy, is charged with first-degree murder, along with the lesser included offenses of second-degree murder and manslaughter. Bentaas remained in the Minnehaha County Jail Monday in lieu of $250,000 bond. Burns began a news conference Friday with a synopsis of <mark>Andrew</mark>'s short life, which an autopsy showed lasted about two hours on Feb. 27, 1981, as he \"slowly succumbed to exposure .\" \"He had been loosely wrapped in a blood-stained blanket and left all alone in the cold,\" Burns said .--Vanessa Gomez (@ VanessagKSFY) March 8, 2019 Detective Michael Webb, who has worked on the cold case since 2009, said a passerby test-driving a vehicle with friends the next day made the gruesome discovery of the body, which was wrapped in the blanket, a sheet and a shirt and left in a ditch alongside a cornfield. A pair of women's underwear was also found next to the body, according to an arrest affidavit in the case. Lee Litz, the man who spotted the red wine-colored blanket and found the baby's body, told the Argus Leader in Sioux Falls in 2016 that the memory remains fresh in his mind. A soon-to-be father in 1981, he said he often wonders what would have become of the child if he'd found him sooner. \"I sure would have adopted him rather than see him die like that,\" Litz told the newspaper. According to the Argus Leader's archives, the forensic pathologist who examined the baby's body believed he had been in the ditch for about 24 hours before he was found. Blood loss from the still-attached umbilical cord likely contributed to his death. See 1981 coverage of <mark>Andrew John</mark> Doe's wake and burial below, courtesy of KELO. Litz attended <mark>Andrew</mark>'s funeral and still visits his grave. He is sometimes accompanied by his daughter, who thinks of <mark>Andrew</mark> as an older brother. \"To see a child thrown away like that. How could someone do that?\" Litz said in 2016. \"Someone got away with murder .\" Upon learning of Bentaas' arrest, Litz said he was \"elated\" to hear the news. \"I'm feeling very happy that she was found, (but) very sad that he's laying in the ground yet,\" Litz told KSFY in Sioux Falls. \"He needed somebody, and she just left him like a piece of garbage .\" \"We don't forget about these cases' The crime shocked the Sioux Falls community, where the baby's death became, over the years, one of just a handful of unsolved cases. It wasn't for a lack of effort, said Webb, who pointed out that aside from the items found in the ditch with the baby, all investigators had to go on was a blood type .\" The investigators worked very diligently during that time, however, they did not have anything that we have today as far as DNA technology and the advances that we have today, \"Webb said. The detective said investigators received tips in the case early on, but whenever they would go to a home hoping to find the dead infant's mother, they would either find a woman still pregnant or one holding her own newborn in her arms. Leads in the case quickly dried up and years passed by. <mark>Andrew John</mark> Doe's story remained a popular one in Sioux Falls, with plenty of media attention over the years, but the leads just weren't there .\" The case never gets closed, \"Webb said .\" These don't go closed, however, it does go cold. \"Sioux Falls PD Webb said cold cases are never far from homicide detectives' minds .\" We don't forget about these cases. We never do, \"Webb said .\" And about 10 years ago, we started taking a different look on this to see what we could do, given the advancements in technology and DNA, to solve this case. \"The major turning point in the case came in the spring of 2009, when Webb decided to have the baby's body exhumed. According to the arrest affidavit, the remains were sent to the University of North Texas' Health Science Center, where lab workers were able to extract a DNA profile from the bones. <mark>Andrew</mark>, who was exhumed that September, was returned to his grave in Sioux Falls' St. Michael's Cemetery the following June. Investigators plugged the baby's DNA profile into South Dakota's criminal databases at least once a year over the subsequent decade, but never found a match, Webb said. When public genealogy databases became a popular new law enforcement tool last year, detectives had renewed hope. Webb said at Friday's news conference that investigators spent the past several months working with Parabon Nanolabs Inc., a private company renowned for its work helping to solve cold cases. Parabon used DNA left over from <mark>Andrew</mark>'s exhumation and found two potential family trees among the genetic profiles in its database .\" Of interest was that a lot of these family trees came back to Sioux Falls and the surrounding areas, \"Webb said .\" This was the first tip in 38 years that got us anywhere close to the baby's identity. \"Watch Friday's news conference in its entirety below, courtesy of the Argus Leader. From there, investigators used a combination of the internet and old birth and marriage announcements to narrow down their suspect pool. Webb said detectives had always believed the person who abandoned the child was a young person. The woman who connected the family trees had children who were teenagers in 1981. Bentaas, whose maiden name was Josten, was 19 when <mark>Andrew</mark> was born. Detectives got DNA samples from beer cans, water bottles and cigarette butts in the trash outside the home of Bentaas and her husband, Dirk Bentaas, and on Feb. 15, the South Dakota state crime lab matched the couple's DNA to that of <mark>Andrew John</mark> Doe. They were the mother and father of the child, Webb said. The DNA of the baby's brother, one of the Bentaases' two living adult children, was also found on a beer bottle, the affidavit said. A search warrant was obtained for DNA from both parents to confirm the match .\" A bump and then no bump' The couple, who married in August 1987, were interviewed by investigators Feb. 27--38 years to the day that the baby was placed in the ditch. Webb said the interviews were set for that date on purpose. Detectives waited to file charges against Theresa Bentaas after confirmation of the DNA match came from the state crime lab last week, Webb said. No charges were filed against Dirk Bentaas because he never knew about his son's birth or death, Webb said .>> Read more trending news According to the arrest affidavit, Theresa Bentaas admitted to hiding her pregnancy in late 1980 and early 1981 and giving birth alone at her apartment. She told detectives she was \"young and stupid .\" She then drove to the ditch, which was in proximity to her home, and left the baby there, the document said. A witness in 1981 reported seeing a light-colored Datsun type vehicle parked in that area, with a \"woman's legs hanging out and some blankets on the ground at the time,\" the affidavit said. \"When asked what she was thinking when she drove away from that ditch, (Bentaas) stated she was sad, scared and she ran from it and it was not smart,\" the affidavit said. \"She was asked if she saw this on the news after the baby was discovered and she said she did and that she was in denial that she was the one responsible for that .\" Records from the infant's burial showed that she was not among the mourners who attended, Webb said. When asked if she ever thought about what she had done when driving in the now-residential area where she'd left her son, Bentaas responded, \"Of course,\" the affidavit said. Read the entire arrest affidavit below. Theresa Bentaas Arrest Affidavit by c_bonvillian on Scribd Dirk Bentaas, who was also a teenager when <mark>Andrew</mark> was born, told investigators his then-girlfriend \"had a bump and then no bump\" around the time the abandoned newborn was discovered, the Argus Leader reported. \"(Dirk) Bentaas admitted to hearing about (<mark>Andrew John</mark> Doe) being found but did not believe the defendant was capable of doing such an act,\" according to the newspaper. Webb told reporters it felt good to solve the notorious crime after nearly four decades. He said what kept him and other investigators going over the past decade was the knowledge that new technology is always around the next corner. \"I know it sounds cliché, but we don't quit on these,\" Webb said. \"And I'll be the first to admit, you work pretty hard when it's a child case .\" You go through a lot of frustrations and you get knocked down a lot, but you keep getting back up and you don't quit. And that's what we did. \"© 2019 Cox Media Group.", "articleID": "2019031123_00406416_W", "names": {"Andrew John": ["Q12301620", "Q4757506"]}}, {"date": "2019-03-12", "url": "https://www.fitsnews.com/2019/03/12/sc-governors-school-upheaval-update/", "content": "SC SC Governor's School: Upheaval Update At least one key administrator \"no longer employed\" by SCGSAH...Share Tweet Published 5 mins ago on March 12, 2019 By FITSNews Students at the South Carolina Governor's School for the Arts and Humanities (SCGSAH) will reportedly receive an update on the administrative chaos currently enveloping this taxpayer-subsidized campus in downtown Greenville, S.C.. According to sources familiar with the situation, a school-wide meeting has been scheduled for 1:00 p.m. EDT to address reports of administrative upheaval at the government-funded institution. What exactly is going on? It is not immediately clear, however our news outlet has confirmed that the school's vice president of finance and administration--<mark>John Warner</mark>--is no longer employed by SCGSAH. In fact, <mark>Warner</mark>'s biographical page on the school website is currently displaying a 404 error. This news outlet has been told that \"multiple administrative positions at the school have been terminated,\" but as of this writing we cannot confirm any additional names. <mark>Warner</mark> (below), an ex-entrepreneur, was an integral part of the school's latest expansion project--a $4.3 million rehearsal center funded by South Carolina taxpayers. (Click to view) (Via: SCGSAH) \"When the school was built, they kind of ran out of money and skimped a little on the music space,\" <mark>Warner</mark> told The Greenville News last February. \"Right now, we have kids practicing in elevators and stairwells. This fills the need that we have for music teaching and teaching space and ensemble space .\" In addition to this grant, state taxpayers shelled out $12 million on the construction of this school back in 1999 and have been giving it $1.5 million annually--including a $1.5 million appropriation in the current version of the fiscal year 2019-2020 state budget. Located in Falls Park on the Reedy River, SCGSAH was founded in 1980 as a summer program but opened its doors as a full-time campus in 1999. The school accepts students from all over the state who have perfect (or near-perfect) grade point averages and who successfully complete auditions for one of its six art disciplines--dance, drama, creative writing, music, voice and visual arts. (SPONSORED CONTENT--STORY CONTINUES BELOW) (DOMINION ENERGY) Several parents of students at the school reached out to us on Monday in the aftermath of class delays and cancellations reportedly related to the administrative chaos. \"Something's not right,\" one concerned parent told us. Developing...*** WANNASOUND OFF? Got something you'd like to say in response to one of our stories? Please feel free to submit your own guest column or letter to the editor via-email HERE. Got a tip for us? CLICK HERE. Got a technical question or a glitch to report? CLICK HERE. Want to support what we're doing? SUBSCRIBE HERE. Banner: McMillan Pazdan Smith Related Topics: Falls Park greenville south carolina Reedy River SCGSAH South Carolina Governor's School for Arts and Humanities Don't Miss Sources: Upheaval At Greenville SC Governor's School Advertisement You may like Sources: Upheaval At Greenville SC Governor's School Greenville SC Arrests: Double Standard Alleged Follow-Up Files: Upstate Catholic School Scandal Upstate \"Drag Queen Story Hour\" Comes Off Without Incident Greenville Mental Health Advocate Arrested Again Greenville SC Police Chief Eyes City Manager Post Comments", "articleID": "2019031216_00605459_W", "names": {"John Warner": ["Q15491306", "Q16194388", "Q19878573", "Q29643753", "Q464810", "Q54321981", "Q6263063", "Q6263071", "Q6263076"]}}, {"date": "2019-03-12", "url": "http://www.nebraska.tv/news/local/former-nebraska-gop-staffer-under-fire-for-racist-remarks", "content": "Former Nebraska GOP staffer under fire for racist remarks | KHGI Former Nebraska GOP staffer under fire for racist remarks by Associated Press/KHGI Tuesday, March 12th 2019 A A A former campaign staffer of Gov. Pete Ricketts is getting criticized for homophobic, racist and anti-semitic posts online. (KHGI) LINCOLN, Neb.--A former Nebraska Republican Party intern who later worked as a paid campaign staffer for Gov. Pete Ricketts apologized Monday after being exposed as the person behind a series of hateful online posts in which he used anti-Semitic and homophobic slurs and advocated for violence against gay rights parades, black activists and journalists. Bennett Bressman, 22, made the remarks anonymously in an online chat forum for fans of the YouTube show \"America First,\" hosted by Nicholas Fuentes, a right-wing activist who has participated in white nationalist rallies. Bressman was exposed as the author of the posts by activists from \"Anti-Fascist Action Nebraska,\" a local chapter of the group known as \"antifa .\" Ricketts' campaign and the state GOP both confirmed that he worked for them. Bressman spent seven months as a field staffer for the governor's 2018 re-election campaign, during which he distributed yard signs and helped coordinate campaign volunteers. His work on the campaign ended in December. \"I am shocked and horrified to learn that this former staffer made these statements and I had no idea he harbored these feelings,\" Ricketts said in a statement. \"He never expressed these views to me. I condemn these statements and this hateful worldview, which do not reflect my beliefs or the beliefs of Nebraskans .\" <mark>Ryan Hamilton</mark>, the executive director of the Nebraska Republican Party, said Bressman volunteered as an intern for the party during the spring semester of 2018. <mark>Hamilton</mark> said the party will re-examine its pre-employment screening procedures. \"The views expressed by Mr. Bressman online are abhorrent and have no place in the Nebraska Republican Party,\" <mark>Hamilton</mark> said. \"Had the party been aware he harbored those beliefs, he never would have been permitted to volunteer. And had the party become aware of them during his time as an intern, he would have been terminated immediately .\" Bressman confirmed to the Lincoln Journal Star that he posted thousands of comments on the forum, with statements including \"gays are the scum of the earth\" and \"my whole political ideology revolves around harming journalists .\" He apologized and said he posted the comments on his own time, without the knowledge of the GOP or the Ricketts campaign. \"I'm not denying it,\" he told the newspaper. \"I understand how they look really bad and are really bad on their face. I regret what I said .\" In one post, he wrote, \"would you run over a (Black Lives Matter) supporter if they were in the street,\" then added, \"(I) probably would for the (laughs).\" In another, he wrote that he enjoys conservative radio personality <mark>Michael Savage</mark> \"even though he's a Jew .\" In yet another, he admitted that he once threw eggs at a rally for members of the gay, lesbian, bisexual and transgender community and suggests that LGBT parades should get hit by grenades. Bressman did not return a phone message left by The Associated Press on a cellphone listed as his number. Some of his comments appear to make reference to Ari Kohen, a well-known University of Nebraska-Lincoln political science professor who describes himself as \"vividly Jewish .\" Kohen said Monday that he taught Bressman in a class two years ago. He described him as quiet but said he never sensed anything amiss. \"I don't want to be an alarmist, but it's a frightening thing to be 5-10 feet away from someone who seems to viscerally hate you,\" Kohen said. In a statement, University of Nebraska-Lincoln officials said their police department was investigating the \"racist, bigoted and hateful comments\" attributed to a student. \"The safety of our university community is paramount,\" the statement said. \"Any concerns about safety are taken seriously, and we will take all appropriate action based on the identification of a potential threat .\" Nebraska Democratic Party Chair Jane Kleeb released a statement on Monday. \"Hate seems to be a family value for Ricketts. First is was Pete Ricketts' dad who sent emails that included racist comments while he looked the other way on most. Now, a staff member sent racist messages and was told to take one message down but that did not stop Bressman. He kept his job for months and kept spewing hate,\" Kleeb said. \"Obvious questions now linger. Did the campaign take money or coordinate with other white nationalists groups?\" STAY CONNECTED", "articleID": "2019031216_01294675_W", "names": {"Michael Savage": ["Q1292044", "Q3308499", "Q41787918", "Q6834142"], "Ryan Hamilton": ["Q16972753", "Q16979943", "Q6378830", "Q7384117"]}}]