[{"date": "2019-03-13", "url": "http://www.gamereactor.eu/games/11063/CounterStrike", "content": "COUNTER-STRIKE: GLOBAL OFFENSIVE REVIEW. Written by Rasmus Lund-Hansen on the 27th of August 2012 at 18 \"Like Americans going to Japan only to eat at McDonald's when they could have been eating the same burgers at home .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 11th of March 2019 at 07 We also know the week one bracket for the competition as it kicks off this week, featuring big names in the world of CS: GO. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 8th of March 2019 at 09 Bodyy has been moved to the bench to make way for this new addition, and G2 hopes to improve results with the signing. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 6th of March 2019 at 09 The North American squad has just parted ways with Zellsis, and now a new report indicates the Mousesports player might be coming on board. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 5th of March 2019 at 10 In partnership with OMEN by HP and Elgiganten, the biggest and best teams in the Nordics will battle it out.", "articleID": "2019031319_00154629_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-03-13", "url": "https://www.reviewjournal.com/life/travel/mccarran-airport-to-see-minimal-effects-of-boeing-737-max-jet-grounding-1617243/", "content": "Travel McCarran to see minimal effects of Boeing 737 MAX jet grounding The Federal Aviation Administration's ordered grounding of all Boeing 737 MAX aircrafts in the U.S won't have much impact on Las Vegas. By Mick Akers / Las Vegas Review-Journal March 13, 2019 - 3:23 pm A Southwest Airlines plane takes off from McCarran International Airport in Las Vegas Thursday, Oct. 25, 2018. K.M. Cannon Las Vegas Review-Journal @ KMCannonPhoto The Federal Aviation Administration's ordered grounding of all Boeing 737 MAX aircrafts in the U.S won't have much impact on Las Vegas. The decision to halt the MAX flights comes after the collection of new data and evidence at the Ethiopian crash site of Flight 302, which killed all 157 people on board, was analyzed, coupled with newly refined satellite data available to the FAA, according to a statement released by the administration. The impact at McCarran International Airport is expected to be light, as only 2 percent of the roughly 15,500 flights scheduled for March feature the MAX 8 jets, according to airport spokesman <mark>Chris Jones</mark>. \"It's not a massive piece of the day-to-day, in-and-out at McCarran, but obviously we want everybody to be safe and we want the situation to be resolved,\" he said Tuesday. Three North American carriers serving McCarran operate MAX planes: Southwest Airlines, United Airlines and WestJet, according to Christine Crews, McCarran spokeswoman. Three McCarran flights involved the MAX 8 jets Wednesday, all departing flights, with the last one taking off for Chicago at 11:23 a.m., according to flight tracking website Flight Aware. No MAX 9 flights operated in or out of McCarran Wednesday, according to Flight Aware. None of the MAX jets were at McCarran following the FAA grounding orders, Crews said. Any changes to the flight schedules associated with those planes is at the discretion of the individual airlines. \"They may choose to cancel flights, they might be able to switch out equipment and continue as scheduled,\" Crews said. Southwest plans to operate its flight schedule with every available aircraft in its fleet. Southwest is offering flexible rebooking policies, allowing for customers to rebook on alternate flights without any additional fees or fare differences within 14 days of their original date of travel between the original city pairs. United said in a statement about 40 flights feature the MAX 9 plane a day, and through a combination of spare aircraft and rebooking customers, they do not anticipate a significant operational impact. WestJet was rebooking customers slated for MAX 8 jets onto other flights, according to its website. The grounding will remain in effect pending further investigation of the crash in Ethiopia, which will include examining the flight data recorders and cockpit voice recorders, The FAA said. A separate crash involving a MAX 8 jet occurred in Indonesia in October, killing all 189 people on board. Canada also ordered the grounding of the MAX planes Wednesday. Contact Mick Akers at makers @ reviewjournal.com or 702-387-2920. Follow @ mickakers on Twitter. Business Videos El Cortez owner Kenny Epstein on running the iconic property Kenny Epstein, owner of the El Cortez Hotel in downtown Las Vegas, talks about Jackie Gaughan mentorship and answers rumors about bodies in the basement at the mob-era casino. (K.M. Cannon/Las Vegas Review-Journal) @ KMCannonPhoto LVCVA recommends construction of underground people mover The Las Vegas Convention and Visitors Authority announced the recommendation for an underground people mover for the convention center. The system would have the potential to expand and connect Downtown and the resort corridor all the way to McCarran. (Michael Quine / Las Vegas Review-Journal) LVCVA/Boring Company Press Conference The Las Vegas Convention and Visitors Authority announced a collaboration with Elon Musk's The Boring Company to develop and operate an autonomous people mover system for the Las Vegas Convention Center District. International Pizza Expo includes green and gluten free The International Pizza Expo at Las Vegas Convention Center included companies focused on vegan and gluten free, and plant-based pizza boxes. (K.M. Cannon/Las Vegas Review-Journal) @ KMCannonPhoto International Pizza Expo kicks off in Las Vegas The first day of the International Pizza Expo at Las Vegas Convention Center is everything Pizza. (K.M. Cannon/Las Vegas Review-Journal) @ KMCannonPhoto T-Mobile program aids guests with sensory needs A program at T-Mobile Arena is designed to provide a more sensory friendly experience for guests. Photo Booth Expo Danielle May talks about how Simple Booth transformed her Volkswagen bus into a business. Nevada Gaming Commission's highest fines The highest fines assessed by the Nevada Gaming Commission, according to commission Chairman Tony Alamo: 1) Wynn Resorts Ltd., $20 million, 2019 2) CG Technology (then known as Cantor G & W Holdings), $5.5 million, 2014 3) The Mirage, $5 million ($3 million fine, $2 million compensatory payment), 2003 4) Stardust, $3 million, 1985 5) Santa Fe Station, $2.2 million ($1.5 million fine, $700,000 compensatory payment), 2005 6) Las Vegas Sands, $2 million, 2016 7) CG Technology, $1.75 million, 2018 8) CG Technology, $1.5 million (also $25,000 in escrow for underpaid patrons), 2016 9) Caesars Entertainment, $1.5 million, 2015 10) Imperial Palace, $1.5 million, 1989 11) Peppermill Casinos, $1 million, 2014 Tiny Pipe Home vs Shipping Crate A Tiny pipe home was displayed at the International Builders Show this week in Las Vegas. Auto repair shortage affects Las Vegas The auto repair industry is facing a national shortage of workers. Franchising industry booming Experts say Las Vegas is a hotbed for the franchise industry. Africa Love owner talks about his store in Las Vegas Mara Diakhate, owner of Africa Love, gift and decor store, talks about his store in Las Vegas. (Bizuayehu Tesfaye / Las Vegas Review-Journal) @ bizutesfaye Developer gets approval to build homes at Bonnie Springs The Clark County Planning Commission has approved a plan to build 20 homes on the site of Bonnie Springs Ranch. (Michael Quine/Las Vegas Review-Journal) Dig This opens new location In Las Vegas Remember when you were a kid and played with construction toys in the sand box? Dig This Las Vegas has the same idea, except instead of toy bulldozers, you get to play with the real thing. (Mat Luschek/Review-Journal) Town Square developer Jim Stuart building again in Las Vegas Las Vegas' real estate bubble took developers on a wild ride, something Jim Stuart knows all too well. (Las Vegas Review-Journal) Salon opens at Veterans Village T.H.E. Salon, owned by Nicole Christie, celebrated their opening at the Veterans Village with a ribbon cutting ceremony. Southwest Airlines considering Las Vegas-Hawaii flights Southwest Airlines CEO <mark>Gary Kelly</mark> says the airline is \"very focused\" on Hawaii. Hawaiians have a strong presence in Las Vegas. The city's unofficial status is \"Hawaii's ninth island .\" In 2018, at least 2,958 people from Hawaii moved to Nevada. Of those, 88.7 percent moved into Clark County, according to driver license surrender data. According to the Las Vegas Convention and Visitors Authority, 310,249 people came to Las Vegas from Hawaii in 2018. Fewer Nevadans are celebrating Valentine's Day Fewer Nevadans are celebrating Valentine's Day. About 1.2 million Nevadans are expected to celebrate this year, a 5 percent drop from 2018. A growing number of people consider Valentine's Day over-commercialized. Others weren't interested in the holiday or had nobody to celebrate with. But spending is expected to rise. Those who do celebrate are buying for more people. The average American is expected to spend about $162 this year for Valentine's Day, a 57 percent jump from a decade prior. Katherine Cullen, director of industry and consumer insights at NRF Foreclosures of mansions in Las Vegas Las Vegas was ground zero for America's foreclosure crisis after the housing bubble burst. (Eli Segall/Las Vegas Review-Journal) Rick Helfenbein talks about the impact of tariffs on the clothing industry MAGIC fashion convention showcases men's clothing trends The MAGIC fashion convention has come to Las Vegas at the Mandalay Bay Convention Center to showcase some of the hottest clothing trends for men. (Nathan Asselin/Las Vegas Review-Journal) Allegiant Air flight attendants learn how to handle a water landing Field instructor Ashleigh Markel talks about training prospective flight attendants for Allegiant Air getting live training with a raft for a water landing at the Heritage Park Aquatic Complex in Henderson on Monday. (John Hornberg/Las Vegas Review-Journal) Smith & Wollensky CEO Michael Feighery speaks Smith & Wollensky CEO Michael Feighery speaks about the new Smith & Wollensky restaurant coming to the Grand Canal Shoppes at The Venetian in Las Vegas. Smith & Wollensky CEO Michael Feighery speaks Smith & Wollensky CEO Michael Feighery speaks about the new Smith & Wollensky restaurant coming to the Grand Canal Shoppes at The Venetian in Las Vegas. Smith & Wollensky CEO Michael Feighery talks about Las Vegas return Michael Feighery, CEO of Smith & Wollensky Restaurant Group, discusses the restaurant's upcoming return to the Las Vegas Strip. Apartments to Come to Hughes Center Developer Eric Cohen discusses his current building project at the Hughes Center office park in Las Vegas, Thursday, Jan. 31, 2019. Caroline Brehman/Las Vegas Review-Journal Stratosphere to rebrand to The STRAT The Stratosphere, a 1,150-foot-tall property in Las Vegas will be renamed The STRAT Hotel, Casino and Skypod. Local designers' picks for the Las Vegas Market The trends that local interior designers are noticing at the Las Vegas Market this year. (Rachel Aston/Las Vegas Review-Journal) Trends in bath products at Las Vegas Market Camille Herd, the showroom manager for European Bath Kitchen Tile & Stone, talks about the popularity of free-standing bath tubs. (Rachel Aston/Las Vegas Review-Journal) @ rookie__rae Kitchen trends at Las Vegas Winter Market Las Vegas Winter Market displayed kitchen trends that mirror common dining accessories at Strip eateries. (Rachel Aston/Las Vegas Review-Journal) @ rookie__rae Life Videos MAGIC fashion convention showcases men's clothing trends The MAGIC fashion convention has come to Las Vegas at the Mandalay Bay Convention Center to showcase some of the hottest clothing trends for men. (Nathan Asselin/Las Vegas Review-Journal) Former Army medic's Afghanistan story told in new book The graphic novel \"Machete Squad\" is based on journals written by Las Vegan Brent Dulak. Las Vegas man talks about losing his wife Dwayne Murray, 37, lost his wife, LaQuinta while she was at Centennial Hills Hospital. A jury awarded him $43 million last week after it said the hospital failed to perform the standard of care in administering a drug for her sickle cell disease. Barber sets up shop in grandfather's old shop Andres Dominguez's new barber shop is filled with memories of his grandfather, who ran the El Cortez landmark for more than 30 years. (John Przybys/Las Vegas Review-Journal) Life and times of a 90-year-old horse player Leo Polito of Las Vegas describes meeting legendary jockey and trainer Johnny Longden on the beach at Del Mar.. Mike Brunker/Las Vegas Review-Journal. Learning the history of singing bowls Presentation at Summerlin Library teaches residents about the history of singing bowls (Mia Sims/Las Vegas Review-Journal) Learning live-saving techniques in Stop the Bleed class Leslie Shaffer, an AMR paramedic, shows how to control bleeding during a Stop the Bleed course at the Summerlin Library. The class is designed to teach anyone how to control and stop life-threatening bleeding. (Mia Sims/Las Vegas Review-Journal) Vicki Richardson speaks about on the power of art Artist and arts advocate Vicki Richardson talks about the power of art to inspire and challenge. (John Przybys/Las Vegas Review-Journal) DressCoders pairs tech with haute couture DressCoders is a startup focused on haute couture garments. The company uses illuminated thread that is washable and can be sewn right into the fabric. (Mat Luschek/Las Vegas Review-Journal) CES 2019: Brava infrared oven In cooking with the Brava infrared oven, there's no preheating. the bulbs can reach 500 degrees in less than a second. (Heidi Knapp Rinella/Las Vegas Review-Journal) Sinks Merge Style And Utility Study could determine cause of Alzheimer's, Parkinson's diseases Dr. Aaron Ritter, director of clinical trials at the Cleveland Clinic Lou Ruvo Center for Brain Health, discusses his research on how inflammation in the brain impacts Alzheimer's and Parkinson's diseases. (Jessie Bekker/Las Vegas Review-Journal) Holocaust survivors talk about tragedy and friendship Janos Strauss and Alexander Kuechel share their perspectives on life. (John Przybys/Las Vegas Review-Journal) \"Siegel Cares' Santa delivers toys to kids at Siegel Suites in Las Vegas Siegel Cares, the charitable wing of The Siegel Group, delivered toys to families at their apartment complexes in Las Vegas. (K.M. Cannon/Las Vegas Review-Journal) Revisiting\" Christ the King \"sculpture A longtime admirer of the sculpture at Christ the King Catholic Community in Las Vegas shares her perspective. (Bizuayehu Tesfaye/Las Vegas Review-Journal @ bizutesfaye) Henderson couple adds another school to their generosity Bob and Sandy Ellis of Henderson, who donate to several Clark County School District schools, have added <mark>Matt Kelly</mark> Elementary in Las Vegas to their list of schools where every student gets new shoes, socks and a toy. (K.M. Cannon/Las Vegas Review-Journal) Terry Fator Christmas House Arguably better than a hotel holiday display, is Terry and Angie Fator's home located in southwest Las Vegas. UNLV Winter Graduation Packs Thomas & Mack UNLV's 55th winter commencement ceremony included approximately 2,146 undergraduate and graduate students who recently completed their studies. (Benjamin Hager/Las Vegas Review-Journal) Build-A-Bear comes to Reed Elementary School Students participated in a Build-A-Bear-Workshop at Doris Reed Elementary School in Las Vegas, Thursday, Dec. 13, 2018. Rev. Father Seraphim Ramos talks about Greek Orthodox icons during an interview with the LVRJ Rev. Father Seraphim Ramos talks about Greek Orthodox icons during an interview with the Las Vegas Review-Journal at St. John the Baptist Greek Orthodox Church. Bizuayehu Tesfaye/Las Vegas Review-Journal @ bizutesfaye Masjid Ibrahim Islamic Center art depicts names of God Masjid Ibrahim Islamic Center founder Sharaf Haseebullah talks about new diamond-shaped art panels featuring some of the 99 names of Allah at the main entrance the Las Vegas mosque. (K.M. Cannon/Las Vegas Review-Journal) Holiday poultry with Tim and Chemaine Jensen of Village Meat & Wine Tim and Chemaine Jensen of Village Meat & Wine explain the different types of poultry available for the holidays. (Heidi Knapp Rinella/Las Vegas Review-Journal) Catholic Charities hosts early Christmas meal Students from the Bishop Gorman High School football and cheerleader team helped to serve food at the Christmas meal sponsored by the Frank and Victoria Fertitta Foundation at Catholic Charities of Southern Nevada on Sunday. (Rachel Aston/Las Vegas Review-Journal) Incarcerated Christmas This is the fourth year HOPE for Prisoners has worked with the Nevada Department of Corrections to create a Christmas for prisoners to visit their families. (Rachel Aston/Las Vegas Review-Journal) 2018 Homeless Vigil Straight From The Streets holds its 23rd annual vigil to remember the 179 homeless individuals who died in Clark County this year. Getting through the Holiday blues Psychologist Whitney Owens offers advice on keeping your mental health in check during the Holiday season in Henderson, Thursday, Dec. 13, 2018. (Caroline Brehman/Las Vegas Review-Journal) ad-high_impact_4", "articleID": "2019031322_00812107_W", "names": {"Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"], "Gary Kelly": ["Q27830945", "Q455972", "Q5524807", "Q5525352"], "Matt Kelly": ["Q1909208", "Q41886658"]}}, {"date": "2019-03-13", "url": "https://www.fifetoday.co.uk/news/driver-jailed-for-mowing-down-rival-outside-fife-pub-1-4888525", "content": "Driver jailed for mowing down rival outside Fife pub Ian Walle drove at speed into <mark>Mark Watson</mark> outside the pub. Picture: Google Published: 11:51 Wednesday 13 March 2019 Share this article Sign Up To Our Daily Newsletter Sign up A driver, who accelerated his car at high speed hitting a man on the road outside a Fife pub, has been jailed. Ian Walle (36) took revenge after becoming involved in a dispute in the bar earlier that night. The victim was sent flying over the bonnet, hitting the windscreen and falling on to the road. Walle, of Groban, Leven, appeared for sentencing at Dunfermline Sheriff Court. He previously admitted that on May 13 last year at Methil Brae, Methil, he assaulted <mark>Mark Watson</mark> by driving a car at him whereby he was struck, went on to the bonnet and fell to the ground, all to his injury and to the danger of his life. The incident occurred outside the Kirkland Bar where both men had been earlier. The court heard there was a dispute between Walle and Mr <mark>Watson</mark>'s son over a debt. Depute fiscal Sarah Lumsden previously told the court that Mr <mark>Watson</mark> had been in the pub with friends on the night of the incident. Another customer was outside having a cigarette and saw Walle, who had been in the bar earlier, in a grey BMW parked across the road. Walle then asked this man to go into the bar and pass on a message to Mr <mark>Watson</mark> for him to go outside. \"The accused then accelerated away with his tyres screeching,\" said the depute. He drove along the road then stopped and turned so that he was facing towards the bar. He then \"drove at high speed with no effort to slow down\" towards Mr <mark>Watson</mark> who was standing on the road outside the bar by this time. \"Mr <mark>Watson</mark> was thrown on to the bonnet and rolled off on to the road. The car had a cracked windscreen and the accused drove off,\" added Ms Lumsden. Video: Kirkcaldy residents told of £ 500,000 windfall on film The police were called and Mr <mark>Watson</mark> was on his feet outside the bar when the officers arrived. Officers later saw the BMW on fire in another part of Methil. The fire service had been called to the scene. The victim sustained a grazed shoulder and a bump to the head. He was treated by paramedics but did not have to attend hospital. The court was previously told by defence solicitor Gordon Martin that his client's position was that he had been assaulted in the pub toilet by Mr <mark>Watson</mark>. His solicitor at sentencing Emma Farmer said Walle had run up drugs debts because of a cocaine habit. Sheriff Charles MacNair told Walle: \"The use of a motor car as a weapon is extremely serious. It is only by the greatest of good fortune that the injuries were relatively minor and you also have a record of violence .\" The sheriff jailed Walle for nine months. He also banned him from driving for 28-and-a-half months. Get in touch and tell us your story Two in hospital after police car in three-car crash Gallery: Do you remember Fife in the 90s? In Pictures: Your World Book Day kids Care home worker struck off for \"rough treatment' of elderly resident £ 100,000 of drugs seized in Kirkcaldy raid The Essentials", "articleID": "2019031323_00265893_W", "names": {"Mark Watson": ["Q16244723", "Q612493", "Q6770249", "Q6770250", "Q6770253", "Q6770254", "Q6770257"]}}, {"date": "2019-03-13", "url": "https://www.brisbanetimes.com.au/national/cbd-melbourne-the-pell-tolling-at-the-melbourne-club-20190313-p513ve.html?ref=rss&utm_medium=rss&utm_source=rss_feed", "content": "CBD Melbourne: The Pell tolling at the Melbourne Club CBD Melbourne: The Pell tolling at the Melbourne Club CBD Melbourne: The Pell tolling at the Melbourne Club By Samantha Hutchinson and Kylar Loussikian March 13, 2019--10.59 pmVery large text size \"What to do about George Pell?\" It's the question that has been asked up and down the local and international Catholic hierarchy, and in Melbourne's legal precinct, the state's corrections system and countless homes across the country. And now it's a topic of conversation inside the exclusive, gentlemen-only Melbourne Club, which has counted Australia's highest-ranked Catholic as a member since 1992. To be sure, it has been a week of headaches for Melbourne's coterie of blokes-only clubs, after Julian Burnside's on-air Damascus moment, deciding membership of an all-men club didn't fit with the brand of a Green-voting human rights defender. But the question of whether to let women on the members' roll is elementary compared to the weightier issue of what to do with a convicted sex offender who has already been given the privilege of joining. Advertisement The Melbourne Club's general committee did not respond to requests for comment on the status of Pell's membership. A club secretary also refused to confirm receipt of the questions. Pell is understood to have received his guernsey during his tenure as auxiliary bishop of Melbourne in 1992. Presumably his role afforded him honorary membership, a category sometimes provided gratis to senior members of the Defence Force, clergy, government and other fields of service. Other less decorated hopefuls--who pass the first requirement of possessing a Y chromosome--must be proposed and seconded, then supported by written references from seven additional referees, all of which have known the candidate for a minimum of 10 years. Credit: Matt Golding And that's all before the five-figure joining fee. Members say it's about weeding out the slouches. But those lucky enough to be admitted are expected to remain on their best behaviour for the entirety of their membership. Which means filing for bankruptcy can prompt a member to be turfed, as can adverse findings made by the courts. Members can't say if Pell will be sadder to give up the camaraderie, the annual turkey carve or access to what could be the city's prettiest courtyard and lawn, shaded by a fairy-lit, historically significant plane tree. But they are certain he'll miss the hospitality. He was often a guest in the club's hotel rooms on the second and third floors. Russelling up at AustralianSuper Don Russell always kept a curiously low profile, despite once being <mark>Paul Keating</mark>'s right-hand man. Now he's under consideration for a more public position--chairman of AustralianSuper, the country's largest superannuation fund, which manages more than $160 billion in savings. AustralianSuper's current chairwoman, former Reserve Bank board member Heather Ridout, was appointed to the position five years ago and her term will soon be up (although we have no doubt any future Labor governments will find her work). Old mates: <mark>Paul Keating</mark> and his former adviser Don Russell, who is in contention for the chair at AustralianSuper. Credit: AAP In addition to his time with <mark>Keating</mark>, Russell has had a gig at West AM and chaired State Super. Meanwhile, industry-backed funds have been increasingly contested territory as Treasurer Josh Frydenberg moves to seek new powers to stop apparent union activism. Ridout earlier this month declared AustralianSuper--which manages funds for members of the Australian Workers' Union and others--would not be \"dragged into industrial relations\" , but also accused the government of making retirement savings political. It's unclear whether Russell's appointment has been given the green light already, but his name has certainly been floated as the odds-on successor to Ridout. An announcement could come soon. Shaking the can and sharing the spoils The rattling noise filtering through the state is audible to anyone, as all the Liberal and Labor heavyweights in town attempt to fill the coffers ahead of their election efforts. Former Australia Post boss turned Latitude Financial chief executive Ahmed Fahour was the star at Bill Shorten's fundraising lunch at the Swisse HQ in Collingwood on Wednesday, where his anti-bank commentary was poorly received by the Westpac lobbyists in attendance. Know your audience: Former Australia Post chief turned low-tier lender Ahmed Fahour Credit: Markus Weber Woodside was also present, as was Allianz corporate affairs chief Nicholas Scofield, who we have learnt is a master of the shakuhachi (a type of flute) in the Chikuho tradition. Meanwhile, Prime Minister <mark>Scott Morrison</mark> headlined a fundraising bash hosted by Martyn Myer at the Collins Street HQ of the retailing dynasty's family office, before finishing the day at a comparatively lower-key \"Politics in the Pub\" affair at the Malvern Hotel, alongside Higgins hopeful Katie Allen. But it's not just about raising the cash. It's also about shoring up votes. Liberal MP <mark>Tim Wilson</mark> is expected to announce a handout of up to $9 million on Thursday to help the genteel Melbourne bayside suburb of Sandringham get the indoor netball courts it so desperately needs. And nothing screams \"save the furniture\" like the Liberals ploughing millions of dollars into one of their safest seats in the state.", "articleID": "2019031401_00082610_W", "names": {"Paul Keating": ["Q15452628", "Q242654"], "Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"], "Tim Wilson": ["Q16205919", "Q17319084", "Q20055589", "Q50093894", "Q7804502", "Q7804503", "Q7804505"]}}, {"date": "2019-03-14", "url": "http://www.messengernewspapers.co.uk/news/national/17501643.spurs-mad-boy-receives-harry-kane-message-after-hospital-song-goes-viral/", "content": "Spurs-mad boy receives <mark>Harry Kane</mark> message after hospital song goes viral By Press Association 2019 <mark>Harry</mark> Pankurst along with Tottenham stars <mark>Harry Kane</mark> and Hugo Lloris 0 comment A Tottenham-mad child who has been ill in hospital for weeks has received a special message from <mark>Harry Kane</mark> and Hugo Lloris after a video of him singing went viral. Stuart Pankhurst posted a video of his eight-year-old son <mark>Harry</mark>, who had been in hospital for three weeks, singing Glory, Glory Tottenham Hotspur in his bed at Sheffield Children's Hospital over the weekend. My sons been in hospital and very poorly for over 3 weeks, having numerous operations to make him better, over this time he's been very subdued and not wanting to do much but sleep, today I played his favourite song and this happened @ SpursOfficial?? pic.twitter.com/uOty2EMgO3--stuart p (@ panky80) March 9, 2019 Mr Pankurst wrote: \"My sons been in hospital and very poorly for over 3 weeks, having numerous operations to make him better, over this time he's been very subdued and not wanting to do much but sleep, today I played his favourite song and this happened @ SpursOfficial .\" The video struck a chord with Twitter users, and it racked up over 700,000 views. Lincolnshire-based <mark>Harry</mark> and Stuart received hundreds of messages from well-wishers, and even caught the attention of Tottenham themselves, with the help of some high-profile supporters including TV presenter <mark>Adam Richman</mark>. And that inspired two Spurs stars--<mark>Harry</mark>'s favourite player <mark>Kane</mark> and goalkeeper Lloris--to send the youngster a get-well-soon message. Thank you all again for your kind messages, this is what your amazing support achieved?? pic.twitter.com/mrgjTzNP8j--stuart p (@ panky80) March 12, 2019 \"Hi <mark>Harry</mark>, me and Hugo here,\" the England captain said in a video sent to his dad via the official Tottenham Twitter account. \"We've seen your video, huge inspiration. We just want to wish you all the best. Keep going and hope to see you soon .\" The clip \"absolutely made his day\" according to Stuart. He wrote on Twitter: \"Thank you all again for your amazing support and kind messages, he's slowly getting better day by day, your support means so much to me and my family\" Just want to say a massive thank you to @ SpursOfficial @ HKane and Hugo lloris for sending <mark>Harry</mark> a msg wishing him well, it has put the biggest smile on his face and even made his twin brother cry as he's a massive spurs fan and was so happy for his brother ❤ ️--stuart p (@ panky80) March 11, 2019 Stuart said on March 2 that his son had been rushed into surgery after his shunt had become infected. A shunt is often used to treat children with hydrocephalus, to help drain away excess fluid from the brain. <mark>Harry</mark> and his twin brother Oscar were born prematurely at 26 weeks, according to Stuart who has shared a number of details of their medical complications via social media. 0 comment", "articleID": "2019031415_00865411_W", "names": {"Adam Richman": ["Q350691", "Q4679665"], "Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}}]