[{"date": "2019-03-14", "url": "https://kpel965.com/sen-kennedy-looks-for-answers-about-last-minute-fiscal-year-spending/", "content": "Louisiana Network <mark>John Kennedy</mark>, Getty Images Share on Twitter Share on Facebook Senator <mark>John Kennedy</mark>, who sits on the Senate Budget Committee, questioned the acting director of the Office of Management and Budget Russell Vought over transactions that took place in the final month of the fiscal year. A recent report showed several federal agencies spending habits that <mark>Kennedy</mark> wanted answers for. \"Were you aware that at the end of last fiscal year, the Department of Defense at the last minute spent $4.6 million on lobster tail and crab?\" asked <mark>Kennedy</mark> \"I'm aware of that report and we are looking into it,\" responded Vought. <mark>Kennedy</mark>'s questions didn't just stop with the military's fondness of seafood. The federal government spent $97 billion on contracts in the last month of fiscal year 2018. The total for contract spending for the entire fiscal year was $544.1 billion \"Another agency spent $53,004 on China tableware...$673,471 on golf carts. That's a disgrace,\" said <mark>Kennedy</mark>. <mark>Kennedy</mark> also expressed his displeasure with a recent report showcasing cases of fraud with government assistance programs in Louisiana as additional examples of government waste in taxpayer dollars. \"Do you know how much Americans spend of their hard earned money every year, tax dollars, to help people less fortunate than they are? Try a trillion dollars,\" said <mark>Kennedy</mark>. Categories: National News Comments Leave A Comment Back To Top", "articleID": "2019031419_01074218_W", "names": {"John Kennedy": ["Q16090838", "Q16105132", "Q16195622", "Q1700694", "Q20737930", "Q25190305", "Q28530228", "Q43021748", "Q48775493", "Q548829", "Q593437", "Q59417950", "Q6242832", "Q6242834", "Q6242838", "Q6242847", "Q6242859", "Q6242864", "Q6242872", "Q6250211"]}}, {"date": "2019-03-14", "url": "http://www.msn.com/en-us/money/taxes/taxpayers-are-leaving-dollar14-billion-in-tax-refunds-on-the-table/ar-BBULmKz?srcref=rss", "content": "© Provided by CNBC LLC The IRS is sitting on $1.4 billion in unclaimed tax refunds, and taxpayers are running out of time to grab their cash. These tax refunds are from 2015, and they belong to about 1.2 million taxpayers who didn't file a return that year, according to the IRS. In order to claim the money, taxpayers must submit their 2015 tax returns by April 15. If these people fail to turn in their Form 1040, the cash goes to the U.S. Treasury. Top 5 Myths About Tax Audits Get the facts Ad Turbotax Generally, you have three years from the due date of your tax return to claim your refund. The IRS may continue to hold your 2015 refund if you haven't submitted returns for 2016 and 2017. More from Personal Finance Wealthy parents in college admissions scam may face IRS wrath Here's the tax bill if you hit the $448 million Powerball Trump budget could open up this tax-free savings account \"Most likely if you have an unclaimed refund, you just never filed your return,\" said <mark>Susan Allen</mark>, CPA and senior manager of tax practice and ethics for the American Institute of CPAs. \"The common thing is that maybe you thought you didn't have a filing requirement or your income is too low, but you could still be entitled to a refund,\" she said. There is no penalty for submitting a late return if you're due a refund. The IRS isn't as kind to late filers with balances due; those taxpayers are on the hook for penalties. Who needs to file © Provided by CNBC LLC The Internal Revenue Services offices in Washington, D.C. Generally, once your income reaches a certain level, you need to file. For the 2018 tax year, single filers under 65 are required to submit a return if their gross income was at least $12,000. For married couples under 65, the threshold is $24,000. If you're 65 and over, you'll need to file if your gross income is at least $13,600. That number goes up to $25,300 for married couples if one spouse is over 65, and $26,600 if both are at least that age. Your dependents aren't necessarily off the hook for filing, either. Whether your kids must file a return will depend on whether they had earned or unearned income. For 2018, single dependents under age 65 must file a return if they had unearned income--that is, income from taxable interest, dividends and capital gains--over $1,050, according to the IRS. They must also file a return if their earned income--money from salaries, wages, and tips--exceeds $12,000. When filing pays © Provided by CNBC LLC Just because you don't have to file, doesn't mean you should skip it. For instance, low-income filers might be eligible for the earned income tax credit. This tax break is more generous for families: Filers with no kids can get a maximum credit of $519 for the 2018 tax year, but the break goes up to $6,431 for taxpayers with 3 or more kids. The catch is that you need to file your return in order to claim the credit. Subscribe to CNBC on YouTube. Read More", "articleID": "2019031509_01741512_W", "names": {"Susan Allen": ["Q18802458", "Q21458971", "Q2654842"]}}, {"date": "2019-03-18", "url": "https://www.worldboxingnews.net/2019/03/18/kieran-smith-pushing-top-15-world-ranking/", "content": "Kieran Smith pushing for Top 15 World Ranking RINGSIDE 18/03/2019 Kieran Smith has set his sights on breaking into the top 15 world rankings once he's made his return to the ring at the Emirates Arena on Friday. Unbeaten Smith (13-0) is back in action on a packed card in Glasgow as #MTKFightNight return to Scotland live on iFL TV. He already holds the WBC International Silver title, and he would love to add the full version of the belt to his collection to earn himself a top 15 ranking with the WBC. Smith said: \"I want to keep pushing up the WBC rankings and hopefully fight for the WBC International belt next. That will put me in the top 15 of the rankings .\" It's good to be getting back in the ring. Since I signed up with MTK Global and teamed up with Danny Vaughan last year, I was promised to be kept busy and they came through with that. I had three fights in three months which was great. \"I picked up the WBC International Silver belt as well which was the icing on the cake for the end of the year, and it's now setting me up for a good 2019 .\" It's a packed card live on iFL TV in Glasgow on Friday, also featuring Iain Butcher challenging Scott Allan for the Celtic bantamweight title. The undercard is full of talented stars too, including <mark>David Brophy</mark>, Michael McGurk, Lewis Benson, Reece McFadden, <mark>Jack Turner</mark> and many more.", "articleID": "2019031818_00825216_W", "names": {"David Brophy": ["Q29376699", "Q5231793"], "Jack Turner": ["Q20131307", "Q3805671", "Q3805672", "Q42887655", "Q6115549", "Q6115550", "Q6115552"]}}, {"date": "2019-03-18", "url": "https://www.gizmodo.com.au/2019/03/new-zealand-isps-say-theyre-blocking-sites-that-fail-to-remove-christchurch-shooting-video/", "content": "David Nield Mar 19, 2019, 10:00 am Life is complicated enough without apps that are weighed down with features you don't need. Make your smartphone an oasis of calmness, tranquility, and elegant design choices with our picks for the best minimalist apps of the moment--they stick primarily to the job they were made for, and are easy on the eyes. Bryan Menegus Mar 19, 2019, 9:30 am Last week, a heavily-armed 28-year-old entered two mosques in Christchurch, New Zealand, and opened fire, killing at least 50 in the country's worst modern shooting. Prior to attacking dozens of Muslim worshipers, the killer posted a manifesto, outlining why he planned to commit mass murder, and he livestreamed a portion of the gruesome act on Facebook. The video was then reportedly re-posted hundreds of thousands of times. As a result, three of the biggest mobile internet service providers in New Zealand have opted to temporarily block some of the websites where the video remains available. Andrew Liszewski Mar 19, 2019, 9:00 am A company called Tombot thinks it's come up with a way to improve the quality of life for seniors facing challenges when it comes to being social: A robotic companion dog that behaves and responds like a real pup, but without all the responsibilities of maintaining a living, breathing animal. The company even enlisted the talented folks at the Jim Henson's Creature Shop to help make the robo-dog look as lifelike as possible. It's a noble effort, but it also raises lots of questions. Matt Novak Mar 19, 2019, 8:30 am <mark>Richard Erdman</mark>, a character actor whose amazing career dates back to the 1940s and includes over 170 acting credits, has died at an assisted living home in Los Angeles, California. He was 93. James Whitbrook Mar 19, 2019, 8:00 am Production on Matt Reeves' Affleck-less The B atman could begin this year. Supergirl's surprise new addition last night will be sticking around for a while. There are yet even more murmurings about a potential Diablo TV show. Plus, get a look at Mento on Doom Patrol, and production on the spinoff begins. Spoilers get! Riverdale Despite having an event booked in for next week, Apple dropped some hardware news last night. Say hello to the new iPad Mini and iPad Air. Holly Brockwell Mar 19, 2019, 7:00 am Despite saying the Mate 20 X would be its first 5G phone, Huawei has just had its Mate X (that's the foldy one--Huawei, please sort your naming conventions out) EU-certified as 5G compliant. That doesn't mean the Mate 20 X won't be 5G, just that the bendable Mate X has beaten it to certification. Possibly because Huawei would rather have headlines for its fancy new folding phone than its older, supermassive gaming phone. Charles Pulliam-Moore Mar 18, 2019, 11:00 pm The latest episode of Starz's shines a fair amount of light on Shadow Moon's past which, up until this point, was basically as enshrouded in mystery on the show as it was in the original novel. American Gods Learning more about Shadow and where he comes from, <mark>Ricky Whittle</mark> recently explained to io9, was important for this part of the series because the understanding is that we as an audience are finally ready for the information. Julie Muncy Mar 18, 2019, 10:00 pm All of the Star Wars Galaxy of Adventures shorts are brilliant. But there's one moment in this one, starring Yoda and Luke, that I absolutely adore. Julie Muncy Mar 18, 2019, 8:45 pm Mark Ruffalo's propensity for spoilers is, at this point, beyond a running gag, even though, so far as we know, he's been on his best behaviour regarding. And while that joke may be losing its lustre, this one still got a few laughs out of me. Avengers: Endgame Holly Brockwell Mar 18, 2019, 8:30 pm They were hailed as the solution to the notch problem, but it seems punch-hole cameras have already outstayed their welcome. VP of Samsung's R & D group, Yang Byung-Duk, has said that the company is already moving on from punch-hole screens to phones with all-screen bodies. That doesn't mean no more selfie cameras - it means that like the ultrasonic fingerprint scanner on the Galaxy S10, the camera would be underneath the screen. Germain Lussier Mar 18, 2019, 8:15 pm For sports fans, the best part of March is filling out brackets. But what to do if you love filling out brackets but don't care about college basketball? You come right here because io9 has got you covered. Catie Keck Mar 18, 2019, 8:00 pm This week, in a letter addressing individual workers of the food delivery service DoorDash, the company's co-founder and CEO Tony Xu appeared to finally face brewing tension over the startup's tipping model. In the letter, Xu said the company would be organising surveys and roundtables with its delivery workers, independent contractors called dashers, about what they think DoorDash should be doing better. Xu wrote that DoorDash had \"heard from some who expressed confusion about how pay is calculated and what happens with tips .\" Stephanie Panecasio Mar 18, 2019, 7:45 pm You know that feeling you get when you're watching a movie, and you can't for the life of you figure out where you've seen the actor before? Maybe it's a question of special effects makeup or costuming, but it just won't click. Julie Muncy Mar 18, 2019, 7:30 pm With news that <mark>James Gunn</mark> would return to helm Guardians of the Galaxy vol. 3 after all, DC fans were left wondering: what about The Suicide Squad, <mark>Gunn</mark>'s upcoming DC film? Yessenia Funes Mar 18, 2019, 7:00 pm The clean energy revolution has arrived, and...it's complicated. New Mexico is now the third state to adopt a 100 per cent clean energy mandate, with the legislature passing a bill Tuesday mandating the state reach that goal by 2045. Governor Michelle Lujan Grisham is expected to sign the bill any day now.", "articleID": "2019031823_00294362_W", "names": {"James Gunn": ["Q1152925", "Q715505", "Q717015"], "Richard Erdman": ["Q2149430", "Q7325528"], "Ricky Whittle": ["Q6108784", "Q7332228"]}}, {"date": "2019-03-20", "url": "https://kztv10.com/news/ap-world-news/2019/03/20/the-latest-erdogan-says-mosque-gunman-no-different-from-is/", "content": "The Latest: Erdogan says mosque gunman no different from IS Associated Press CHRISTCHURCH, New Zealand (AP)--The Latest on the mosque attacks in New Zealand (all times local): 7:30 p.m. Turkish President Recep Tayyip Erdogan says the gunman who killed 50 people at two New Zealand mosques is no different from the militants of the Islamic State group. In an opinion piece published in The Washington Post on Wednesday, Erdogan also called on Western leaders to learn from \"the courage, leadership and sincerity\" of New Zealand's Prime Minister Jacinda Ardern and \"embrace Muslims living in their respective countries .\" The opinion piece's headline read: \"The New Zealand killer and the Islamic State are cut from the same cloth .\" Erdogan said the West \"must reject the normalization of racism, xenophobia and Islamophobia .\" Separately, the Turkish president has been criticized for showing excerpts from video of the mosque attacks and for comments about the Gallipoli campaign in World War I. ___ 6 p.m.. A father and son who fled the civil war in Syria for \"the safest country in the world\" have been buried before hundreds of mourners, the first funerals for victims of shootings at two mosques in New Zealand that horrified a nation known for being welcoming and diverse. The funerals Wednesday of 44-year-old Khalid Mustafa and 15-year-old Hamza Mustafa came five days after a white supremacist methodically gunned down 50 worshippers at two mosques in Christchurch--a massacre that he broadcast live on Facebook. Hamza's high school principal described the student as compassionate and hardworking, and said he was an excellent horse rider who aspired to be a veterinarian. ___ 5:25 p.m. New Zealand Police Commissioner Mike Bush says he believes police officers stopped the gunman who killed 50 people at two mosques on his way to another attack. Bush says they believe they know where the gunman was going but won't say more because it's an active investigation. In a 74-page manifesto he released before the attack, accused Australian gunman Brenton Tarrant said he was going to attack mosques in Christchurch and Linwood, and then one in the town of Ashburton if he made it that far. Bush also revised his timeline, saying officers rammed the suspect off the road and arrested him 21 minutes after the first emergency call rather than 36 minutes. Bush says FBI agents have traveled to New Zealand to help with the investigation. ___ 4 p.m. Australia's prime minister says he has asked the Turkish president to withdraw his accusation of an anti-Islam motive behind Australia and New Zealand sending troops to Turkey in the World War I Gallipoli campaign. Turkish President Recep Tayyip Erdogan was denouncing Islamophobia after an Australian was arrested in the killings of 50 worshippers in two mosques in New Zealand. Australian Prime Minister <mark>Scott Morrison</mark> said \"all options are on the table\" if Erdogan does not withdraw his comments. Turkish ambassador Korhan Karakoc said he had a \"frank\" conversation with <mark>Morrison</mark> when the envoy was summoned to Parliament House on Wednesday. Thousands of Australian and New Zealand citizens gather at the Gallipoli peninsula on April 25 each year to commemorate the start of the failed British-led campaign in 1915 to open a new front in the war against Germany. ___ 3:10 p.m.. A man accused of sharing video of a massacre in New Zealand has been jailed by a judge until his next court appearance in mid-April. Philip Arps, 44, appeared in a Christchurch court Wednesday on two charges of distributing the killer's livestream video of last week's attack on Al Noor mosque, a violation of the country's objectionable publications law. Each charge carries a maximum sentence of 14 years in prison. Arps, heavily tattooed and dressed in a T-shirt and sweatpants, hasn't entered a plea. He remained expressionless during the hearing, his hands clasped behind his back. Judge Stephen O’Driscoll denied him bail. Charging documents accuse Arps of distributing the video on Saturday, one day after the massacre. ___ 1:15 p.m.. The first two people to be buried after last week's mosque attacks that killed 50 people are a father and his son. Khalid Mustafa was 44 and Hamza Mustafa was 15. The teen was a student at Cashmere High School and was compassionate and hard-working, according to the principal <mark>Mark Wilson</mark>. Hamza was an excellent horse rider who aspired to be a veterinarian, <mark>Wilson</mark> says. Hamza's younger brother Zaed, 13, suffered gunshot wounds to the leg in the attack. Mourners on Wednesday carried the bodies to a freshly dug gravesite, where hundreds gathered around to watch. Some were invited to scoop handfuls of dirt on top of the bodies. Authorities spent four days constructing a special grave at a city cemetery that is designated for Muslim burials. ___ 12:35 p.m.. The first funeral for two of 50 victims of last week's shootings at two mosques in New Zealand has begun. Hundreds of people are at the services in Christchurch. The identity of the victims was not immediately known. Authorities spent four days constructing a special grave at a city cemetery that is designated for the Muslim burials. An Australian white supremacist killed 50 worshippers in two mosques last Friday. ___ 11:50 a.m. Australia's Prime Minister <mark>Scott Morrison</mark> says he will protest to the Turkish ambassador on Wednesday against the Turkish president's accusation of an anti-Islam motive behind Australia and New Zealand sending troops to Turkey in the World War I Gallipoli campaign. Turkish President Recep Tayyip Erdogan was denouncing Islamophobia after an Australian white supremacist killed 50 worshippers in two mosques in the New Zealand city of Christchurch. <mark>Morrison</mark> said the comments were not helpful. Thousands of Australian and New Zealand citizens gather at the Gallipoli peninsula on April 25 each year to commemorate the start of the failed British-led campaign in 1915 to open a new front in the war against Germany. ___ 11:30 a.m. New Zealand Prime Minister Jacinda Ardern has visited a school where two boys killed in last week's mosque attacks were students. In a speech at Cashmere High School, Ardern renewed her call for people to focus on the victims rather than the perpetrator. She says there will be interest in the terrorist but asked the students not to say his name or dwell on him. The Cashmere High students killed were 14-year-old Sayyad Milne and 15-year-old Hamza Mustafa. A third Cashmere student, Mustafa's 13-year-old brother Zaed, is recovering from gunshot wounds to his leg. ___ 10:45 a.m. Wednesday New Zealand Police Commissioner Mike Bush says police have now formally identified and released the bodies of 21 people out of the 50 who were killed in last week's mosque attacks. Bush said that releasing the bodies was a priority for family reasons, compassionate reasons and cultural reasons. Islamic law says that people should be buried as soon as possible after death, preferably within 24 hours. Bush's comments came after it was announced that the first two burials of the victims are scheduled to take place Wednesday morning. He says they hope to finish formally identifying most victims by the end of the day although some will take longer. Associated Press", "articleID": "2019032007_00414382_W", "names": {"Mark Wilson": ["Q1388440", "Q15990366", "Q16196771", "Q1922662", "Q19661240", "Q1993337", "Q20022466", "Q28059691", "Q3849582", "Q42717787", "Q44270625", "Q47542215", "Q50294072", "Q55704489", "Q6770379", "Q6770380", "Q6770381", "Q6770382", "Q6770383", "Q6770384", "Q6770385"], "Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"]}}, {"date": "2019-03-21", "url": "http://wboc.com/story/40170539/report-myanmar-china-failing-to-stop-bride-trafficking", "content": "Report: Myanmar, China failing to stop \"bride' trafficking - WBOC-TV 16, Delmarvas News Leader, FOX 21 - Report: Myanmar, China failing to stop\" bride' trafficking - WBOC-TV 16, Delmarvas News Leader, FOX 21 - Member Center: Report: Myanmar, China failing to stop \"bride' trafficking Posted: Thursday, March 21 2019 12:21 AM EDT 2019-03-21 04:21:31 GMT Updated: Thursday, March 21 2019 4:21 AM EDT 2019-03-21 08:21:41 GMT (AP Photo/Ted S. Warren, File). In this Monday, March 11, 2019 file photo, a Boeing 737 MAX 8 airplane being built for TUI Group sits parked in the background at right at Boeing Co.'s Renton Assembly Plant in Renton, Wash.. The Transportation Department...(AP Photo/Ted S. Warren, File). In this Monday, March 11, 2019 file photo, a Boeing 737 MAX 8 airplane being built for TUI Group sits parked in the background at right at Boeing Co.'s Renton Assembly Plant in Renton, Wash.. The Transportation Department...The decision by Europe and Canada to break with U.S. air-safety regulators over the safety of the Boeing 737 Max is likely to delay the resumption of flights after two deadly crashes. More The decision by Europe and Canada to break with U.S. air-safety regulators over the safety of the Boeing 737 Max is likely to delay the resumption of flights after two deadly crashes. More Thursday, March 21 2019 1:41 AM EDT 2019-03-21 05:41:40 GMT Updated: Thursday, March 21 2019 4:21 AM EDT 2019-03-21 08:21:31 GMT (Roberto E. Rosales/The Albuquerque Journal via AP, Pool, File). FILE - This Aug. 13, 2018 pool file photo shows defendants, from left, Jany Leveille, Lucas Morton, Siraj Ibn Wahhaj and Subbannah Wahhaj entering district court in Taos, N.M., for a dete...(Roberto E. Rosales/The Albuquerque Journal via AP, Pool, File). FILE - This Aug. 13, 2018 pool file photo shows defendants, from left, Jany Leveille, Lucas Morton, Siraj Ibn Wahhaj and Subbannah Wahhaj entering district court in Taos, N.M., for a dete...Five former residents of a New Mexico compound are scheduled to appear in federal court on terrorism-related charges that include conspiring to attack U.S. law enforcement and military members. More Five former residents of a New Mexico compound are scheduled to appear in federal court on terrorism-related charges that include conspiring to attack U.S. law enforcement and military members. More Thursday, March 21 2019 1:21 AM EDT 2019-03-21 05:21:33 GMT Updated: Thursday, March 21 2019 4:21 AM EDT 2019-03-21 08:21:19 GMT (AP Photo). This combination photo shows actress Lori Loughlin at the Women's Cancer Research Fund's An Unforgettable Evening event in <mark>Beverly Hills</mark>, Calif., on Feb. 27, 2018, left, and actress Felicity Huffman at the 70th Primetime Emmy Awards in Los...(AP Photo). This combination photo shows actress Lori Loughlin at the Women's Cancer Research Fund's An Unforgettable Evening event in <mark>Beverly Hills</mark>, Calif., on Feb. 27, 2018, left, and actress Felicity Huffman at the 70th Primetime Emmy Awards in Los...Will\" Aunt Becky' and other parents charged with college scam see prison time? Experts differ on the probability. More Will \"Aunt Becky' and other parents charged with college scam see prison time? Experts differ on the probability. More Thursday, March 21 2019 1:11 AM EDT 2019-03-21 05:11:32 GMT Updated: Thursday, March 21 2019 4:21 AM EDT 2019-03-21 08:21:18 GMT (AP Photo/Rogelio V. Solis). This March 11, 2019 photo shows a makeshift levee built by a resident in Rolling Fork, Miss., to protect his home from flood waters. In March 2019, scientists are warning that historic flooding could soon deluge parts of se...(AP Photo/Rogelio V. Solis). This March 11, 2019 photo shows a makeshift levee built by a resident in Rolling Fork, Miss., to protect his home from flood waters. In March 2019, scientists are warning that historic flooding could soon deluge parts of se...Scientists are warning that historic flooding could soon deluge parts of several southern states along the lower Mississippi River, where flood waters could persist for several weeks. More Scientists are warning that historic flooding could soon deluge parts of several southern states along the lower Mississippi River, where flood waters could persist for several weeks. More By ELAINE KURTENBACHAssociated Press BANGKOK (AP) - Authorities in China and Myanmar are failing to stop the brutal trafficking of young women, often teenagers, from the conflict-ridden Kachin region for sexual slavery, according to a report by Human Rights Watch. The report released Thursday says women are often tricked into traveling to China in search of work or kidnapped and held against their will to be sold as\" brides \"for Chinese men. Most of those taken hostage by Chinese families are locked up and raped, it says. Those who do escape are often obliged to leave children fathered by Chinese men behind. The report urges authorities to do more to raise awareness about the risks of trafficking, provide more support for victims who return home, and to prosecute those guilty of crimes against them. The 226 known cases of such trafficking in 2017 were only a fraction of the total number, since many victims are afraid or ashamed to come forward, especially given the lack of support from law enforcement or welfare services, the report says .\" Human Rights Watch's research suggests the number of women and girls being trafficked is substantial and possibly growing, \"it said. The group interviewed 37 survivors of such crimes for the report. It said the women were sold to Chinese families for the equivalent of $3,000 - $13,000 each. Twelve of those interviewed were under 18 when they were trafficked. The youngest was 14. It said 22 of them were held for a year or longer. Often, the women are drugged and taken captive, left at the mercy of families with whom they can barely communicate .\" Most were locked in a room and raped repeatedly as the families that bought them wanted them to become pregnant, \"said Heather Barr, author of the report and a co-director for women's rights at Human Rights Watch. The traffickers are able to lure women with false promises of jobs because of the lack of good options for making a living in camps for displaced people in northern Myanmar's Kachin state. As of September, there were about 100,000 people displaced inside Kachin, where the Kachin Independence Army, like other ethnic minority armed groups, has been fighting for greater autonomy for decades. Thousands of women and children have also fled their homes in neighboring Shan state, some across the border into China. The porous border between southern China's Yunnan province and northern Kachin facilitates such trafficking, and the relative shortage of marriageable women, thanks to Chinese traditions favoring male heirs over girls has left many families in China desperate for brides. Although Chinese authorities have been battling trafficking inside China as well, the families who buy the women are almost never prosecuted, the report says. Some foreign brides from neighboring countries go voluntarily. But for many, the experience is harrowing. One interviewee, Ja Htoi Tsawm, was kidnapped while doing farm work in China to support her family and held captive for two years. While she was away her in-laws sold her house and put one of her children in an orphanage. Another of her four children died. The report said that Myanmar police and other authorities refused interviews by Human Rights Watch although the Ministry of Social Welfare did provide some data. Myanmar anti-trafficking police said they handled 130 cases of trafficking, 96 of which involved women, in January-July 2018, the report said. Of 820 successful prosecutions for trafficking in 2008-2013, 534 cases involved forced marriages and an even larger share were with China. The trafficking networks span China Chinese authorities did not respond to requests for comment, it said. The persisting conflict in areas of Myanmar has left millions of women and children vulnerable to great risk. U.N. investigators reported last fall on a fact-finding mission that found violence by the Myanmar military in Kachin, Shan and the western state of Rakhine. It cited allegations of crimes by the military and other security forces including murder, torture, pillaging, execution without due process, rape, sexual slavery and hostage taking. Members of the Kachin Women's Association, a group affiliated with the Kachin Independence Organization that helps victims, were quoted as saying that at times they lack the money to help provide and top up SIM cards needed to keep in contact with the women still stuck in China. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2019032108_00364697_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}]