[{"date": "2019-03-21", "url": "http://www.tribuneindia.com/news/punjab/us-sikhs-collect-1-lakh-for-documentary-on-guru-nanak/746291.html", "content": "Posted at: Mar 21, 2019, 5:55 AM; last updated: Mar 21, 2019, 5:55 AM (IST) US Sikhs collect $1 lakh for documentary on Guru Nanak Also in this section Members of the Sikh community during a fund-raising event in New York. Tribune photo Tribune News Service Bathinda, March 20 Sikhs from various parts of New York City area have raised $1,00,000 for the first-ever documentary on Guru Nanak Dev. The documentary will be shown on 200 TV stations all over America during 2019, when the Sikhs will be celebrating the 550th birth anniversary of the founder of Sikhism. As per a release, members of Gurdwara Baba Makhan Shah Lobana in New York showed their enthusiasm for this cause and they backed the plan presented by the National Sikh Campaign (NSC). The NSC is spearheading this national project of the Sikhs in America and will be organising premier shows of this film in the US and other parts of the world. It has hired Auteur Productions to make this documentary to be shown on TV stations. The fund raising event started with a gatka show by children. Second generation US-born Sikh youth expressed their enthusiasm and support for this project. <mark>Tarlok Singh</mark> Chugh, an internet sensation on Punjabi jokes, came from Calgary, Canada, and made every one laugh. Over 20 youth members displayed their gatka skills. Dr Rajwant <mark>Singh</mark>, senior adviser, NSC, who gave a detailed presentation on the documentary's plan, said, \"The goal is to reach out to Americans. We are trying to make sure that we go beyond the traditional way of celebrating this important occasion .\" ", "articleID": "2019032109_00196391_W", "names": {"Tarlok Singh": ["Q16885697", "Q9355688"]}}, {"date": "2019-03-21", "url": "http://www.businesswire.com/news/home/20190321005085/en/Stratasys-Takes-Top-Spot-ABI-Research’s-Additive", "content": "OYSTER BAY, N.Y.--(BUSINESS WIRE)--Ranked as the top Additive Manufacturing (AM) platform vendor, Stratasys scored highest in the overall category of implementation and topped four of the twelve ranking criteria announced ABI Research, a market-foresight advisory firm providing strategic guidance on the most compelling transformative technologies. Stratasys was closely followed by 3D Systems, Desktop Metal, and GE Additive in overall rankings. Newcomer Desktop Metal took the overall top spot in innovation. The Additive Manufacturing Platform Ranking competitive assessment ranked 10 major vendors of the technology--3D Systems, Carbon, Desktop Metal, Digital Alloys, EOS, ExOne, GE Additive, HP, Renishaw, and Stratasys--using ABI Research's proven, unbiased innovation/implementation criteria framework. Each vendor was analyzed based on a combination of AM technology process, material science, software, process and application adaptability, GTM, revenue and bookings, availability, customer references, partnerships, cost, and channel strategy. To qualify as an additive manufacturing platform vendor, the company had to have a production additive manufacturing solution on the market, be targeting production AM as its main opportunity, or be working with promising metal alloy AM technologies and techniques that could, in ABI Research's view, prove a strong fit for the production AM market. These platforms will produce more than US $360 billion worth of parts and end products each year and nearly US $2 trillion in sum by the end of the next decade. Stratasys scored highest in implementation, followed by 3D Systems, EOS, Desktop Metal, and GE Additive. \"Stratasys, 3D Systems, and EOS are the market incumbents--all have been involved in AM since their inception. 3D Systems went neck-and-neck with Stratasys in all categories, expect partnerships, where it was edged out by Stratasys due to Stratasys' investment in Desktop Metal, collaboration with companies like Siemens, and work with its own global manufacturing network, which companies like UPS use to automatically invoke AM rather than traditional manufacturing processes based on order volume requests,\" explained <mark>Ryan Martin</mark>, Principal Analyst at ABI Research. Desktop Metal was the surprise frontrunner among companies to more recently enter the AM arena, edging out incumbents like GE Additive and EOS on the powder-bed side and dusting ExOne and HP in terms of performance on binder jetting. \"Desktop Metal was the technology category leader but could be challenged in the long run if GE Additive and others can cultivate a credible metal binder jetting solution. Others to watch are Carbon, which recently launched its L1 production system, and Digital Alloys, which has a savvy GTM strategy that aligns well with the strength of its Joule Printing technology,\" <mark>Martin</mark> said. \"Desktop Metal took the top spot for innovation due to the applicability of its core technology and the capabilities of its production system relative to others in its category; Desktop Metal is the binder jetting technology category leader, and binder jetting as a technology blows PBF out of the water when it comes to the scale of true production applications. Carbon and GE Additive tied for second and were only 2.5% behind Desktop Metal. Digital Alloys was the surprise fast follower to the runner up position. Digital Alloys has a technology that could displace if not converge with the DED category (where companies like Sciaky play) due to the speed, quality, and affordability of Joule printing,\" concluded <mark>Martin</mark>. These findings are from ABI Research's Additive Manufacturing Platforms competitive assessment report. This report is part of the company's Industrial Solution, which will help manufacturers digitize operations to create better quality products at lower costs. Competitive Assessment reports offer comprehensive analysis of implementation strategies and innovation, coupled with market share analysis, to offer unparalleled insight into a company's performance and standing in comparison to its competitors. About ABI Research ABI Research provides strategic guidance for visionaries needing market foresight on the most compelling transformative technologies, which reshape workforces, identify holes in a market, create new business models and drive new revenue streams. ABI's own research visionaries take stances early on those technologies, publishing groundbreaking studies often years ahead of other technology advisory firms. ABI analysts deliver their conclusions and recommendations in easily and quickly absorbed formats to ensure proper context. Our analysts strategically guide visionaries to take action now and inspire their business to realize a bigger picture. For more information about subscribing to ABI's Research Services as well as Industrial and Custom Solutions, visionaries can contact us at +1.516.624.2500 in the Americas, +44.203.326.0140 in Europe, +65.6592.0290 in Asia-Pacific or visit www.abiresearch.com.", "articleID": "2019032112_00462231_W", "names": {"Ryan Martin": ["Q19968809", "Q21064078", "Q25190545", "Q55281093", "Q57609494"]}}, {"date": "2019-03-21", "url": "http://ktvl.com/news/local/portlands-dovelewis-animal-hospital-to-be-featured-on-new-tv-show-animal-er-live", "content": "Portland's DoveLewis animal hospital to be featured on new TV show \"Animal ER Live' by KATU Staff File photo by Gia Goodrich A A PORTLAND, Ore.--A local animal hospital will soon be starring in a new show on National Geographic Wild that follows veterinarians as they rush to save injured pets. The network is launching a new TV series called\" Animal ER Live, \"and one of the emergency rooms featured will be DoveLewis in Northwest Portland. The hospital is a nonprofit and treats animals around the clock .\" It's gonna be groundbreaking television that's gonna allow us to pull back the curtain a little bit and show people what happens live in an animal ER on a busy Saturday and Sunday night, \"said <mark>Ron Morgan</mark>, President and CEO of DoveLewis The show runs for two hours and is completely live. It will take camera feeds from 7 different animal hospitals across the U.S. as emergencies begin to unfold. The show premiers on Saturday, March 30 at 6 p.m. on Nat Geo Wild. Unmute", "articleID": "2019032214_00347250_W", "names": {"Ron Morgan": ["Q16745423", "Q20273714"]}}, {"date": "2019-03-23", "url": "http://www.actionnewsjax.com/sports/tipping-off-wofford-murray-state-aim-for-big-march-moment/933342281?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "TIPPING OFF: Wofford, Murray State aim for big March moment By: AARON BEARD, AP Basketball Writer Updated: Mar 23, 2019 - 2:48 AM Loading...TIPPING OFF: Wofford, Murray State aim for big March moment RALEIGH, N.C. (AP) - The first teams will earn their spot in the NCAA Tournament's Sweet 16 on Saturday - and the upstarts are right there near the front of the line. There are eight double-digit seeds left in the field of 32 entering the second round, three of those coming from outside the power conferences: No. 12 seeds Murray State and Liberty, and No. 13 UC Irvine. And then there's Wofford, the headliner in a batch of schools aiming to make their own enduring March Madness moment with a marquee matchup against Kentucky. That game comes Saturday in the Midwest Region, along with Murray State's date with Florida State in the West bracket in an eight-game schedule. And make no mistake: there's plenty of belief for a pair of teams that haven't lost a game in months. \"You don't want to get out of character and try to do things that you can't do or do things that you're uncomfortable doing just to try to show that you can do something,\" Wofford guard Fletcher Magee said. \"We want to stay within ourselves, play our game, and we feel that if we do that, we can be right there and we can compete with them .\" Murray State (28-4) rolled in its first-round game behind Ja Morant, who had a hello-national-audience performance with 17 points, 16 assists and 11 rebounds in a rout of fifth-seeded Marquette. That was the Racers' 12th straight win. They haven't lost since falling to Jacksonville State on Jan. 31. Morant (24.4 points, 5.7 rebounds) leads the country with 10.2 assists per game, and the Racers have three other double-figure scorers. The biggest challenge will be handling Florida State's size and length. \"We know Ja will get all of the attention,\" said Shaq Buchanan, averages 13.1 points. \"Like, it's amazing, but at the same time, we know how to handle that. And we know everybody's going to be keyed in on him (Saturday), so we just going to make plays for him like we did against Marquette .\" As for Wofford, the seventh-seeded Terriers (30-4) have been a popular pick. All four losses came against power-conference teams that made the NCAA Tournament and they have won 21 straight games since falling to Mississippi State on Dec. 19. The Southern Conference champions, who rolled past Seton Hall in the first round, entered the tournament ranked No. 13 in the NCAA's new NET rankings - ahead of names like LSU, Auburn and Kansas - after claiming their first AP Top 25 ranking in program history. Behind Magee's incredible shot-making ability, the Terriers rank ninth in KenPom's adjusted offensive efficiency (118.8 points per 100 possessions). They're facing a second-seeded Kentucky team missing leading scorer and rebounder PJ Washington due to a foot sprain. \"I can't imagine a team more confident, and that's earned,\" Wofford coach <mark>Mike Young</mark> said, adding: \"They may whip our tail, but it will not be because my kids are scared. They'll come out ready to fight .\" Here are some of the other storylines for Saturday's schedule: TILLIE'S HEALTH Gonzaga has been waiting for Killian Tillie to look healthy. The 6-foot-10 junior had a season-high 17 points on 7-for-8 shooting in the first-round rout of Fairleigh Dickinson for the top-seeded Zags, who face No. 9 seed Baylor in the West Region. Tillie had been sidelined into January with a foot injury, then reinjured his foot and didn't return until the West Coast Conference Tournament. Now he's another weapon for a team that leads KenPom's adjusted offensive efficiency rankings (125.4 points per 100 possessions). \"It makes us much more versatile,\" Zags coach Mark Few said, adding: \"He's got an incredible feel for the game and basketball intuition .\" CHAMPS IN ACTION It's been a while since reigning national champion Villanova was a lower seed playing to pull an upset. The sixth-seeded Wildcats face No. 3 seed Purdue in the South Region's only game Saturday and they are 3 1/2 - point underdogs. It will be the first time the Wildcats have played a higher seed before the Final Four since beating top-seeded Kansas in a 2016 regional final on the way to coach <mark>Jay Wright</mark>'s first national championship. Villanova had been a No. 1 or No. 2 seed for five straight tournaments. BIG TEN BATTLE It's not ideal, but the Big Ten has a second-round East Region matchup with No. 2 seed Michigan State and 10th-seeded Minnesota. The Spartans won the only meeting in February, and the rematch will cost the Big Ten one of its seven teams still alive in the tournament. \"However the NCAA Tournament does the seeds and the matchup is how they do it,\" Minnesota's Amir Coffey said. \"We have no control over that. We just have to be ready for whoever we are matched up against .\" THE REST OF THE SCHEDULE The schedule includes another 2-vs-10 matchup in the West with Michigan against Florida, respectively. In the East, third-seeded LSU meets sixth-seeded Maryland. And in the Midwest, there's an intriguing matchup between fourth-seeded Kansas and fifth-seeded Auburn - two teams that have experienced wild swings in their seasons. Kansas was preseason No. 1 in the AP Top 25 yet dealt with a series of injuries and off-court issues that have left coach Bill Self with a very different roster. Meanwhile, Auburn peaked at No. 7 in December, fell out of the rankings, then made a late-season surge to win the Southeastern Conference Tournament. ___ Follow Aaron Beard on Twitter at http: //www.twitter.com/aaronbeardap ___ More AP college basketball: https: //apnews.com/MarchMadness and http: //www.twitter.com/AP_Top25 Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2019032307_00006457_W", "names": {"Jay Wright": ["Q3807514", "Q6167365"], "Mike Young": ["Q17144212", "Q19664774", "Q3308595", "Q6849349", "Q6849350", "Q6849351", "Q6849355"]}}, {"date": "2019-03-24", "url": "https://www.mirror.co.uk/sport/rugby-union/billy-vunipola-swaps-scotland-horror-14178848", "content": "Get the biggest daily news stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Billy Vunipola put his Twickenham hell behind him to help Saracens beat Harlequins with a revival Scotland would have been proud of. A week ago he and Jamie George were part of an England team which blew a 31-point lead to draw with Gregor Townsend's tartan marauders. This time it was them with a mountain to climb after London rivals Quins went into half-time leading 17-6 at the Olympic Stadium. While the wheels of England's chariot completely came off in their Calcutta Cup horror show, Saracens responded like the champions they are. The north Londoners scored three second half tries and had a further two controversially disallowed as they powered back to win 27-20. Read More England's <mark>Eddie Jones</mark> compared to Jose Mourinho by worried World Cup winner <mark>Marcus Smith</mark> scores first try of afternoon for Harlequins (Image: Getty Images) Saracens boss Mark McCall said: \"The players were superb, really calm, really clear about what we needed to do better. The reaction of the group in the second half was fantastic .\" We could have felt sorry for ourselves with those disallowed tries but we didn't. We were the kind of team we wanted to be. \"Vunipola had come to Stratford\" hurting \"from England's implosion which he said would leave opponents thinking they possessed a soft underbelly. Read More Alex Goode says big game flop was making of Saracens and can be of England David Strettle touches down for Saracens, only for it to be one of two tries the champions controversially had chalked off (Image: Getty Images) With a massive Champions Cup quarter-final at home to Glasgow next Saturday, Saracens could ill-afford to show similar weakness. They hinted at it when <mark>Marcus Smith</mark> and <mark>Danny Care</mark> grabbed first half tries in front of a 42,717 crowd, but their response more than made up for that .\" The second half is going to provide us with a bit of feel-good to take into the Glasgow game, \"said McCall .\" The first half some soul searching as to what we need to do better. \"Will Skelton scores one of his two tries (Image: Getty Images) Read More <mark>Danny Care</mark> has\" unfinished business' with World Cup and won't give up on dream Don't kick the ball dead when there is still one second left on the game clock, as Alex Lozowski did, for one thing. He thought he was ending the half only for ref JP Doyle to permit Quins the lineout, from which <mark>Care</mark> scuttled over. Sarries were furious with themselves and their frustration grew in the third quarter as Doyle disallowed a try by Vunipola after adjudging that he himself had blocked Chris Robshaw, so preventing him from making the try-saving tackle. Read More Owen Farrell's future as England captain questioned after wild Scotland draw Strettle (blue) clashes with Harlequins pair Joe Marler (left) and Chris Robshaw (Image: Action Images) It did not look that way and the TMO said as much, but Doyle held firm - then came up with another controversial call to deny a second Saracens try. This time he found fault with a scrap between <mark>Liam Williams</mark> and <mark>Care</mark>, both of whom he sin-binned, and although it had no impact on Dave Strettle's try, he chalked it off anyway. Saracens might have lost their heads had <mark>Schalk Burger</mark> not scored from close range between the two disallowed efforts. Quins' Gabriel Ibitoye is tackled by Saracens' Ali Crossdale (Image: Getty) That try, combined with the collapse of both Quins' lineout and discipline, meant it was only a matter of time before the champions took charge. Their inspiration was Aussie lock Will Skelton who plundered two tries in nine minutes to seal a man of the match performance and send Vunipola and George home happy. SARACENS - Tries: <mark>Burger</mark>, Skelton 2. Cons: Lozowski 3. Pens: Lozowski 2. HARLEQUINS - Tries: <mark>Smith</mark>, <mark>Care</mark>. Cons: <mark>Smith</mark> 2. Pens: <mark>Smith</mark> 2. Read More Sport top stories Real reason Wilder rejected Joshua fight Schumacher Jr honoured by dad comparison Bryony Frost will miss Grand National McIlroy wins \"unofficial fifth Major '", "articleID": "2019032408_00536744_W", "names": {"Danny Care": ["Q433555", "Q5220208"], "Eddie Jones": ["Q1773628", "Q3047282", "Q5336166", "Q5336167", "Q5336170", "Q735730"], "Liam Williams": ["Q19578254", "Q23306997", "Q56421819", "Q6539846"], "Marcus Smith": ["Q16235030", "Q30122761", "Q59162330", "Q6758457", "Q6758458"], "Schalk Burger": ["Q284846", "Q3475286"]}}]