[{"date": "2019-03-25", "url": "https://ktvq.com/cnn-asia-pacific/2019/03/25/kashmir-fast-facts/", "content": "Kashmir Fast Facts Here's a look at Kashmir, a region in the Himalayan and Karakoram mountain ranges. India, Pakistan and China all claim partial or complete ownership of Kashmir. Facts: Kashmir is an 86,000-square mile region in the northern part of the Indian subcontinent. The separatist violence has killed more than 47,000 people, which does not include people who have disappeared due to the conflict. Some human rights groups and nongovernmental organizations put the death toll at twice that amount. India and Pakistan have been fighting over Kashmir since both countries gained their independence in 1947. The Line of Control separating Indian - and Pakistani-controlled parts of Kashmir is 435 miles (700 km) long. India-controlled: One state, called Jammu and Kashmir, makes up the southern and eastern portions of the region, totaling about 45% of Kashmir. Pakistan-controlled: Three areas called Azad Kashmir, Gilgit and Baltistan make up the northern and western portions of the region, totaling about 35% of Kashmir. China-controlled: One area called Aksai Chin in the northeastern part of the region, equaling 20% of Kashmir. India also alleges Pakistan has ceded 3,220 square miles in Kashmir to China. Srinagar is the summer capital city in Jammu and Kashmir state. Jammu is the winter capital. The capital of Azad Kashmir is Muzaffarabad. Kashmir: India and Pakistan's bitter dispute Timeline: August 15, 1947--India and Pakistan gain independence from Great Britain. Kashmir initially decides to remain independent, choosing not to become a part of either Pakistan or India. October 1947--After armed tribesmen from Pakistan's North-West Frontier Province invade Kashmir, Maharaja Hari Singh, the ruler of Kashmir, signs a letter acceding to India. In exchange for handing key powers to the central government in New Delhi, Kashmir gains India's military protection. Pakistan does not recognize this letter as a legal document. This begins India and Pakistan's first war over Kashmir. January 1, 1949--India and Pakistan agree to withdraw all troops behind a mutually agreed ceasefire line, later known as the Line of Control. August 5, 1965--India and Pakistan go to war again over Kashmir. Pakistan invades Indian-held Kashmir, but the fighting produces little territorial gain for Pakistan. 1971--Fighting erupts again as part of the Indo-Pak war. July 1972--The Simla Agreement ends the fighting and establishes the Line of Control between Indian-controlled Kashmir and Pakistan-controlled Kashmir. The two sides continue to argue over the border. 1989--Islamic militants begin an uprising in Indian-controlled Kashmir. Tens of thousands of people have been killed. 1999--India and Pakistan fight a limited border conflict in Kashmir, after armed invaders cross the Line of Control in the town of Kargil. July 25, 2000--Hizbul Mujahedeen, a pro-Pakistan Kashmiri militant group, declares a unilateral cease fire for three months in Jammu and Kashmir. August 3, 2000--India begins peace talks with Hizbul Mujahedeen, in Srinagar. August 8, 2000--Hizbul Mujahedeen calls off its two-week-old ceasefire and orders its forces to resume fighting against Indian troops. May 23, 2001--India ends a six-month military ceasefire against Islamic guerillas in Kashmir while also inviting Pakistani military ruler, General Pervez Musharraf, to peace talks aimed at ending five decades of hostilities between the two countries. July 14-16, 2001--Pakistani President Pervez Musharraf and Prime Minister Atal Behari Vajpayee meet in Agra, India, for a three-day summit. The talks fail to produce a joint statement on Kashmir. December 20, 2001--The Indian army deploys troops on its border with Pakistan in the northern states of Kashmir and Punjab after an attack by militants (India says they were from across the border) on the Indian Parliament building. Pakistani troops also buildup across the frontier. January 2002--General Musharraf of Pakistan outlaws the three main Pakistani-based Islamic militant groups. October 2002--Four rounds of polls to choose a new state administration conclude in Indian-controlled Kashmir. About 300-500 people are killed during the election campaign. November 2003--India agrees to a Pakistani offer of a ceasefire along their borders in the disputed region of Kashmir. The ceasefire goes into effect November 26 and is the first ceasefire in 14 years. January 4, 2004--India's Prime Minister Atal Bihari Vajpayee meets with Pakistan's President Musharraf in Islamabad for a one-hour meeting. It is their first direct contact in two years. June 2004--India and Pakistan's foreign secretaries meet for talks, the first detailed discussions between the two countries in six years. November 14, 2006--Indian Foreign Secretary Shiv Shanker Menon and his Pakistani counterpart, Riaz Mohammed Khan meet in New Delhi, India for peace talks. The main topic of discussion is finding ways to implement a proposed anti-terror mechanism that both countries have agreed to set up. March 13, 2007--Top Pakistani and Indian diplomats meet in Islamabad. Topics include improving conditions for hundreds of prisoners in each others' jails and relaxing visa restrictions. March 28, 2008--Human rights workers find nearly 1,000 unmarked graves near the Line of Control, the border that divides Pakistani - and Indian-controlled portions of Kashmir. Hundreds of protestors in Indian Kashmir clash with police on April 25, demanding an investigation into the graves. October 21, 2008--India and Pakistan open a trade route for the first time in six decades on the Line of Control in Kashmir. Fruit, clothing and spices are among the items being transported. Summer 2010--Violence erupts in Kashmir and kills more than 100 people, the worst bloodshed in a decade. January 14, 2011--India's home secretary announces that India will cut a fourth of its security forces in Kashmir over the next 12 months. February 10, 2011--Pakistan and India agree to resume peace talks that halted after the Mumbai terror attacks of 2008. July 27, 2011--Pakistani Foreign Minister Hina Rabbani Khar meets with Indian Foreign Minister S.M. Krishna in New Delhi to discuss ways to improve travel and trade across Kashmir. April 8, 2012--Pakistani President Asif Ali Zardari meets with Indian Prime Minister <mark>Manmohan Singh</mark> during a private trip. It is the first trip to India by a Pakistani leader in seven years. November-December 2014--After five rounds of elections, though the regional People's Democratic Party (PDP) wins the most seats, it does not pick up the 44 seats necessary to form a government in Indian-controlled Kashmir. February 2015--The Hindu nationalist Bharatiya Janata Party (BJP) and the People's Democratic Party (PDP), a regional party backed by the Muslim majority, announce the formation of a coalition government in Indian-controlled Kashmir. This follows five rounds of elections in 2014 without a clear winner and is the first time that the Hindu nationalist BJP will be part of the governing coalition in the state assembly. The coalition government is sworn in on March 1, 2015. January 2016--The death of the chief minister of the Indian state of Jammu and Kashmir, Mufti Mohammad Sayeed, creates tumult within the coalition government. The presumptive successor is Mehbooba Mufti, Sayeed's daughter. She declines to take the oath of office, however, as relations fray between the PDP and the BJP. With the power-sharing alliance in crisis, Governor's rule is imposed in accordance with the Constitution of Jammu and Kashmir. April 4, 2016--Mehbooba Mufti is sworn in as the first female chief minister of Indian-administered Jammu and Kashmir. September 18, 2016--In the early morning hours, armed militants enter an Indian army base in the garrison town of Uri--about 63 miles (102 kilometers) from Srinagar, the capital of Indian-administered Jammu and Kashmir--and kill 19 soldiers. Several hours later, four militants are killed in a shootout with the Indian army. It's unclear which militant group is responsible. The attack, which takes place near the de facto border between India and Pakistan in Kashmir, is one of the deadliest on an army base in Kashmir since militant attacks began in 1989. September 29, 2016--Two Pakistani soldiers are killed after clashes with Indian troops on the de facto border in Kashmir. October 2016--India relocates more than 10,000 people from around the disputed border area of Kashmir as tensions continue to escalate with Pakistan. November 14, 2016--Seven Pakistani soldiers are killed in an exchange of fire between Pakistani and Indian forces at the Line of Control. November 15, 2016--Raja Farooq Haider, the prime minister of Azad Jammu and Kashmir, the Pakistani-controlled part of the disputed region, says the government has so far moved 8,000 people to \"safer places\" in the wake of ongoing \"Indian shelling,\" and plans are being made to move even more people. In response, Indian defense spokesman Lt. Col. Manish Mehta tells CNN from the Indian city of Jammu, \"We always respond appropriately and effectively whenever there is a ceasefire violation from the Pakistan side .\" August 1, 2017--Violent protests erupt over the killing of a militant leader. According to Indian officials, Pakistani commander of banned terror group Lashkar-e-Taiba (LeT) Abu Dujana, along with his aide Arif Nabi Dar, were killed after engaging in a lengthy gun battle with government troops in Kashmir's Pulwama district, 35 kilometers south of the capital Srinagar. February 14, 2019--At least 40 are killed when a bomb explodes near a convoy of Indian paramilitary personnel in Indian-administered Kashmir, one of the deadliest attacks in the disputed region in recent years. February 26, 2019--Pakistan has promised retaliation \"at the time and place of its choosing\" after India conducts airstrikes on an alleged terrorist training camp inside Pakistan territory, in a significant escalation of hostilities between the nuclear armed powers, in the first such incursion by Indian air force planes since the India-Pakistan war of 1971.", "articleID": "2019032516_00456918_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}}, {"date": "2019-03-29", "url": "https://www.rt.com/news/455075-george-clooney-hotel-boycott-brunei/?utm_source=rss&utm_medium=rss&utm_campaign=RSS", "content": "Also on rt.com Brunei's law mandating STONING TO DEATH of gays & adulterers to come into force next week \"Every single time we stay at, or take meetings at or dine at any of these nine hotels we are putting money directly into the pockets of men who choose to stone and whip to death their own citizens for being gay or accused of adultery,\" Clooney argued. \"Are we really going to help pay for these human rights violations?\" Brunei is a tiny kingdom with a population of just 450,000 located on the island of Borneo, neighboring the Islamic nations of Indonesia and Malaysia. It does, however, have significant oil reserves and was ranked by Forbes as the world's fifth-richest nation. The nine hotels (including the Dorchester and 45 Park Lane in London, and the <mark>Beverly Hills</mark> Hotel and Hotel Bel-Air in Los Angeles) are operated by the Dorchester Collection luxury chain, which itself is owned by the Brunei Investment Agency. Clooney did, however, concede that similar efforts in the past eventually were only \"effective to a point\" as the outrage that fueled the initial boycott eventually subsided \"and certainly any boycott would have little effect on changing these laws .\" The Kingdom of Brunei first announced its intention to introduce Sharia law back in 2013 but only recently confirmed the death penalty for homosexuality and adultery, which will take effect from April 3. Clooney received many plaudits for his activism online. I am following my friend George Clooney in boycotting all of the hotels owned by the Sultan of Brunei following the April 3rd law in Brunei to stone and whip to death all gays. The <mark>Beverly Hills</mark> Hotel, Hotel Bel-Air, The Dorchester, Hotel Plaza Athenee, Hotel Eden and more. pic.twitter.com/Tp6iBYbRU8", "articleID": "2019032918_00161014_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}, {"date": "2019-03-29", "url": "http://www.gamereactor.eu/?system=xboxone&sid=e1eb5c51cc62c2b7e9631348063fff40", "content": "Written by Ben Lyons on the 29th of March 2019 at 16:08 We spoke to Fatshark's <mark>Mats Andersson</mark> about the upcoming Warhammer Vermintide 2 expansion called Winds of Magic. 0 Here is 20 minutes of Dauntless gameplay from PAX East Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 15:09 We got to try the action-RPG in Boston and headed out into the cold to take on some challenges with our fellow warriors. 0 Check out our Void Bastards gameplay Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 14:45 We tried the Bioshock-inspired game for ourselves at GDC in California, and saw the art style and mechanics in action. 0 A Hyper Light Drifter TV series is being worked on Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 14:33 Developer <mark>Alex Preston</mark> has been in talks with Castlevania's Adi Shankar about how to translate the game into a series. 0 Ash in Dead by Daylight was \"the worst kept secret\" Written by Bengt Lemne on the 29th of March 2019 at 14:21 We talk to Behaviour Interactive's Mathieu Coté and Dave Richard about the decision to bring in the iconic Evil Dead hero. 0 Watch us play The Forgotten City Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 13:42 We got a taste of the game at GDC last week, where we experienced the opening of the adventure that bends time in strange ways. 0 Divinity: Fallen Heroes mixes Original Sin and Dragon Commander Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 12:31 We spoke to Larian's founder Swen Vencke at PAX East about the newly-revealed game, and where the idea came from in the first place. 0 Control more \"open-ended and\" sandboxy \"than Quantum Break Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 12:05 Remedy's Thomas Puha told us that the goal is to\" give you reasons to play once the story is over \"with their upcoming game. 0 CD Projekt\" probably \"providing 250 new jobs with expansion Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 11:38 Chief Financial Officer Piotr Nielubowicz revealed the news when discussing the financial report for 2018, which includes dips in profit and revenues. 0 Mortal Kombat 11's beta is on today's stream Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 11:14 We head into the heat of battle to check Netherrealm's fighting game out ahead of launch, and see if we can become the best. 0 Here are our impressions of the Borderlands 3 reveal Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 09:33 The sequel was finally confirmed at PAX East, and we were there to witness it for ourselves and get a sense of what's coming. 0 We Happy Few's They Came From Below DLC landing next week Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 09:00 James and Roger must locate the source of the robot invasion and find Dr. Faraday in an adventure that's included in the Season Pass. 0 Scuf Gaming reveals official NBA 2K League controller Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 08 The Scuf Vantage NBA 2KL is available now for players in the US and Canada, being the official controller of the esports league. 0 Written by <mark>Mike Holmes</mark> on the 28th of March 2019 at 20:10 Trailer and screens land for the recently announced current-gen update of Gearbox's shooter. 0 Borderlands 3 finally confirmed Written by <mark>Sam Bishop</mark> on the 28th of March 2019 at 19:52 This wasn't the only Borderlands news Gearbox had for us at PAX East, as the GOTY edition of the first game was revealed alongside Ultra HD Texture Packs.", "articleID": "2019032918_00245728_W", "names": {"Alex Preston": ["Q16213147", "Q4717649"], "Mats Andersson": ["Q27523043", "Q30106599", "Q43108969", "Q5555453", "Q5555464", "Q5555469", "Q5555471"], "Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-03-29", "url": "http://wap.business-standard.com/article/markets/sebi-wants-safety-first-contingency-plans-in-place-for-mf-investors-119032901014_1.html", "content": "Sebi wants safety-first, contingency plans in place for MF investors Regulator wants trustees to prepare report on complex exposures to promoter entities Last Updated at March 29, 2019 20:03 IST email this article Type address separated by commas Your Email: Enter the characters shown in the image. Send me a copy: Zee group's <mark>Subhash Chandra</mark> gives personal guarantee to mutual funds The Securities and Exchange Board of India (Sebi) has shot a six-point letter to mutual funds (MFs) to ensure that unitholders' interests are not getting compromised due to rise \"complex' debt investments of MFs to promoter entities. The regulator has directed the MF trustees,\" To review the risk management policy of the MF including the aspects like cap on such exposure (exposure to promoter entities), adequate cover, legal risk, market risk, liquidity risk, etc. to ascertain that the interest of unitholders are protected at all points of time. \"According to industry sources, Sebi also wants to assess if MFs have taken high-levels of exposures to promoters, which have already pledged a large part of their shares .\" Promoters with excess pledging would have limited ability to pledge additional shares to restore equity cover in case of sharp price fall, \"said a fund manager, requesting anonymity. The market regulator has asked MF trustees to have a report ready by end of this month, which reviews total exposure through such structures\" during the last two years i.e. from January, 2017 onwards including outstanding exposure as on date. \"According to sources, the regulator wants to know whether MFs have proper contingency plans in place as despite being debt instruments, volatility in equity markets has a bearing on the credit quality of these exposures. According to a recent note by CRISIL,\" around 90 per cent of the rated pledge debt of Rs 38,000 crore had cover of less than two-times--even as low as 1.2 or 1.3 times. \"This is lower than what the Reserve Bank of India (RBI) stipulates for non-banking financial companies (NBFCs) that lend against shares. The RBI stipulates that all NBFCs with more than Rs 100 crore asset size need to maintain a loan-to-value (LTV) of 50 per cent where listed shares are placed as collateral. An LTV of 50 per cent means that for a Rs 50,000 loan, the market value of the collateral shares needs to be Rs 1 lakh. This translates into two times share cover. The CRISIL note points out that low equity cover heightens the risks for MFs and other investors as unlike NBFCs and banks, they don't have enough capital buffers .\" Considering high equity volatility, low covers of 1.2 or 1.3-times may not be able to provide adequate cushion and avert a default on the debt. While NBFCs and banks have capital cushion to absorb risks as per regulatory capital adequacy norms, others do not have any such leeway, \"the note read. The industry officials say the inherent risk in such structures stems from the fact that there is no underlying cash flow .\" Promoter-funding structures such as LAS have no real cash flows. A typical promoter company only gets dividend income. These structures are largely built around refinance, \"said Amandeep Chopra, group president and head of fixed income at UTI MF. The risks have got exacerbated as such structures are finding limited sources of funding in the current environment of tight liquidity .\" With NBFCs becoming wary of doing roll-overs for such structures, these could see a continued build-up of stress, \"Chopra added. The strain in loan-against-shares structures had prompted MFs to enter into standstill agreement with the promoters as selling the pledged shares could trigger downgrade and negatively impact the exposed funds' net asset value. Sebi had earlier sought details of MFs' debt exposure to Essel group companies after both sides entered into an agreement to hold back selling of the promoter entities' pledged shares. According to reports, the RBI is also looking at the recent cases of\" standstill' agreements between the borrowers and the lenders. First Published: Fri, March 29 2019. 20:03 IST Copyrights © 2019 Business Standard Private Ltd.. All rights reserved. From BS Website Welcome User Business Standard is happy to inform you of the launch of \"Business Standard Premium Services\" As a premium subscriber you get an across device unfettered access to a range of services which include: Access Exclusive content - articles, features & opinion pieces Weekly Industry/Genre specific newsletters - Choose multiple industries/genres Access to 17 plus years of content archives Set Stock price alerts for your portfolio and watch list and get them delivered to your e-mail box End of day news alerts on 5 companies (via email) NEW: Get seamless access to WSJ.com at a great price. No additional sign-up required.", "articleID": "2019032921_00118500_W", "names": {"Subhash Chandra": ["Q21508195", "Q3630136", "Q37838865", "Q57334579"]}}, {"date": "2019-03-29", "url": "https://denver.cbslocal.com/2019/03/29/colorado-avalanche-gabriel-landeskog-2/", "content": "Filed Under: Colorado Avalanche, Gabriel Landeskog By Brian Madden DENVER (CBS4)--The Captain returns tonight. Avalanche Head Coach Jared Bednar made it official Friday morning by declaring Gabriel Landeskog fit for action. \"Yeah, he's playing tonight,\" said Bednar. NEWARK, NEW JERSEY--OCTOBER 18: Gabriel Landeskog #92 of the Colorado Avalanche celebrates his hat trick goal at 16:38 of the third period against the New Jersey Devils at the Prudential Center on October 18, 2018 in Newark, New Jersey. The Avalanche defeated the Devils 5-3. (Photo by Bruce Bennett/Getty Images) Landeskog will lineup with Carl Soderberg and <mark>Colin Wilson</mark> against the Arizona Coyotes. His return will be a positive influence as the Avs battle for the final playoff position with the Coyotes. \"It's great to have him,\" said Avs center Nathan MacKinnon. \"He's our leader, just his presence in the room is going to be great for us tonight .\" The puck drops at Pepsi Center at 7 p.m. Friday as the Avs take on the Arizona Coyotes.", "articleID": "2019032921_00859881_W", "names": {"Colin Wilson": ["Q1108757", "Q1708464", "Q20018732", "Q21465762", "Q358746", "Q368831", "Q505667", "Q5145685", "Q5145686", "Q5145687"]}}, {"date": "2019-03-28", "url": "http://crainscleveland.com/legal/licata-law-group-bridges-ne-ohio-china", "content": "March 30, 2019 04:00 AM Licata Law Group bridges NE Ohio, China Print As Chinese investors seek out deals in the U.S., Cleveland lawyer Louis Licata may be a catalyst who funnels their capital to Northeast Ohio. Licata's business contacts in China are looking to the former Council of Smaller Enterprises (COSE) chair to source deals across the U.S., since there's a sense their money could see better returns here because of the fragility of the Chinese economy right now. \"Part of the reason their economy has struggled over the last two years is because ours is doing so well,\" Licata said. \"In the last 20 years, I've seen this sort of back-and-forth. When China's economy is really good, ours isn't. A lot of the U.S. tries to invest in China. Then it shifts, and China comes back and tries to invest in the U.S.\" But Licata--who founded his Independence law firm, Licata Law Group, in 1990 and has spent decades navigating global business deals for smaller and midsize companies--has developed some special connections in Asian markets, to which roughly 35% of his firm's revenue is tied. That positions him and his practice as a portal connecting businesspeople in China and Cleveland. To that end, Licata recently signed an agreement with the Liaoning Zhuozheng Law Firm in Shenyang City in China's Liaoning province. It's believed to be the first formal relationship between law firms in the U.S. and China's populous northeast region. The idea is to establish, in writing, a dynamic whereby the two entities will work deals on behalf of their respective businesses, clients and potential investors. Founded in 2010, the Liaoning Zhuozheng firm has more than 100 lawyers. A goal of the firm is to increase its relationships in China's northern provinces versus the southern region where it's already well meshed into the business fabric. That ultimately means helping investors there make money. \"We are pleased to initiate this new agreement to establish the communication and collaboration between Chinese and American lawyers in the future, in the mutual understanding to create economic development projects for both of our law firms and business communities,\" said Liu Zhengwei, founder and director of Zhuozheng, in a prepared comment. That's something that particularly excites local stakeholders. \"There's no shortage of initiatives and ideas for how to move U.S. products to China, and those are certainly important,\" said Joe Roman, CEO of the Greater Cleveland Partnership, in a statement. \"What's exciting about this initiative is that it focuses the discussion on Northeast Ohio and highlights what our region has to offer to Chinese investors that might otherwise be unaware of the strength our own region has to offer. There's nothing but upside for the local business community in an agreement like this .\" Chinese investors sourcing deals here--and vice-versa--is certainly not novel. But the coordinated effort to focus on the Northeast Ohio region at this time, to some degree, is. And there are a number of reasons why it's playing out now. \"The Chinese money coming to U.S. has been a long history, but most money goes to the West and East coasts,\" said Su He, an attorney with He & Associates in Beachwood and executive director of the 2-year-old Greater Cleveland Chinese Chamber of Commerce. \"But it's hard to get into those markets because there are lots of people there already. The relationships are not as easy as we can get here .\" That's one element of the opportunity investors have here: the ability to foster new relationships in regions with which overseas businesspeople naturally aren't as familiar, such as the Buckeye State. After all, said He, to foreign businesspeople, there are no discernible differences between Cincinnati, Columbus and Cleveland--let alone Ohio compared to the rest of the Midwest. She noted the Chinese chamber devotes a bulk of its resources to building up Cleveland's public image and courting large Chinese companies to visit the market \"because we truly believe Cleveland has such huge potential .\" A more global Cleveland Licata's connections to Asia began with his undergrad degree, which bent toward China and Asia studies. He worked on business deals for smaller and midsize companies through the 1990s, sometimes his contribution as simple as writing out terms and conditions. But as his practice developed, and he sought more global opportunities for his growing clientele, his familiarity with the country naturally steered his attention there. Some of his work evolved into helping various U.S. companies and suppliers introduce facilities and products to the Chinese market. While reluctant to name-drop clients with deals in the works, one of the local manufacturers with whom Licata has been working is Cleveland Whiskey. There, he has assisted CEO Tom Lix to sell product in a country packed with stiff liquor competition (<mark>Jack Daniels</mark>, for instance, has its own facility for distribution capabilities there). Lix recently pulled back on expanding to overseas markets for now, including China and Europe--largely because of retaliatory tariffs that have hurt margins and good will--but is working with Licata on possible re-entry opportunities in China. As far as the kinds of items Chinese investors want, whether from the U.S. or elsewhere, in Licata's world, it's often a short, specific list of consumer-related products. Items in high demand right now include honey, olive oil, American red wine and juice products. Licata is currently working on deals involving all of those with suppliers in Greece for olive oil and the Middle East for honey. Going the other way, Licata noted that Chinese investors are relatively agnostic about what they'd invest in here. On the table is everything from what's tied to the obvious, big corporate players in the market, such as Cleveland Clinic, to real estate projects. \"The way this is working is, if I see something in our region that might be a good opportunity for Chinese investment, they just want me to bring it to them to start,\" Licata explained. \"It could really be anything .\" Some may want to invest in smaller funds: One effort in which Licata is engaged involves selling investors on Flashstarts' $6 million, pre-seed Blockchain + Fund, which carries just a $10,000 minimum buy-in. Others may want to outright acquire factories, product suppliers or warehouses, whether to collect on returns or otherwise establish a foothold in the American market (which would help them skirt taxes and exchange rates when money moves overseas). The perception in China right now, said He, is that any opportunity in the U.S. could be potentially viable--hence the reliance on a network here through Licata or someone like him. Various factors, not just Licata's experience, are leading to a lot of that potential being framed through the Northeast Ohio market. \"The general feeling is Chinese investors are exploring the Midwest area,\" He said. \"They are still motivated to source deals in the U.S., but because of harsh economic/trade policies, they are getting slower or waiting-and-see .\" One special thing in Cleveland is we are an important city in the health care industry, \"she added .\" China is very focused on developing health care-related businesses, such as diagnosis service, hospital management, medical devices and innovative technologies. So for this part, I see lots of Chinese investors still motivated and expanded opportunities in the Greater Cleveland area. \"He said the Chinese chamber is aware of a number of potential deals in the works, but can't disclose them publicly because of ongoing negotiations. A couple of related companies also declined interviews about those deals. Licata said the agreement with Liaoning Zhuozheng doesn't include any formal goals to ink a specific number of deals or help deploy a particular amount of capital in any specific amount of time. But with several deals already in the works, it's very possible Chinese money could weave its way into the local business fabric more than ever. That, in turn, could further grow and globalize the city and the region .\" I think this community has tremendous, unrealized potential to be a global city, \"Licata said .\" I think Cleveland has all the right pieces, but we're not realizing the potential of the collective use of those pieces. We are very fragmented in terms of being a global city. But we have good people in place and a lot of good opportunities. \"Letter", "articleID": "2019033008_00398687_W", "names": {"Jack Daniels": ["Q6111998", "Q981415"]}}, {"date": "2019-04-01", "url": "http://www.nbcconnecticut.com/entertainment/entertainment-news/Game-of-Thrones-Takes-Over-Bellagio-Fountains-in-Las-Vegas-507943121.html", "content": "\"Game of Thrones' Takes Over Bellagio Fountains in Las Vegas The 3 1/2 - minute spectacle that left a crowd of onlookers cheering debuted two weeks ahead of the scheduled premiere of the HBO fantasy series' final season Published 2 minutes ago NEWSLETTERS Receive the latest entertainment-news updates in your inbox Email Privacy policy | More Newsletters AP A woman watches during a\" Game of Thrones \"- themed show at the fountains at the Bellagio casino-resort, Sunday, March 31, 2019, in Las Vegas. Winter came to Las Vegas. Fire-breathing dragons held court over the world-famous fountains at the Bellagio casino-resort Sunday, as familiar elements from the TV phenomenon\" Game of Thrones \"were projected on the rising water. The jets danced to a score incorporating the recognizable theme song before one of the colossal beasts lit up the lake along the Las Vegas Strip in a blaze of pyrotechnics. The 3 1/2 - minute spectacle that left a crowd of onlookers cheering debuted two weeks ahead of the scheduled premiere of the HBO fantasy series' final season. The streaming water formed the show's iconic throne and crown. A towering 800-foot-long (244-meter) wall of water emerged from the lake. In Memoriam:\" Victory Lap' Rapper Nipsey Hussle Matt Winkelmeyer/Getty Images for Warner Music The display, however, intentionally did not reveal any elements of the new season. \"We didn't just want to portray literally scenes from\" Game of Thrones' here, not like a teaser or a preview of season eight, \"said <mark>Mark Fuller</mark>, CEO of WET Design, the company that created the fountains and show .\" We want to bring you the emotion. \"At the heart of the fountain show is the giant wall of water. It represents the ice wall that defines the TV show, but also serves as a surface onto which the creators project falling snow, the series' logo and the silhouettes of the dragons breathing orange and blue flames. Fox's Pirro Back on-Air After Remarks on Muslim Politician The company worked with the series' composer Ramin Djawadi to create a special score that along with the dancing water aimed to capture the excitement of the TV hit. The fountain show begins by dropping musical hints of the TV series, using Djawadi's\" Winter is Here \"from the seventh season. It comes to full force as the show's recognizable\" Main Titles \"theme song comes on .\" We have to make sure that the fountain gives the same kind of energy, the same kind of drama, that people are associating this music with, \"said Peter Kopik, director of design and choreography for WET Design .\" (That) was the hard part of the choreography because it's continuously energetic and continuously up and loud and strong, and choreography had to reflect the same thing and not being tiring at the same time. \"WATCH: Jussie Smollett Speaks After Charges Dropped Jussie Smollett makes a statement after appearing in court where prosecutors dropped all charges against him. (Published Tuesday, March 26, 2019) The spectacle ends as the shadow of the Night King appears one last time, and flames cover part of the roughly 9-acre (3.6-hectare) lake. Oklahoma resident Josh Elliott stopped by the lake with his wife Sunday as part of their anniversary trip. They were amazed by what they saw .\" We have probably seen a hundred fountain shows, and this is by far the best, \"he said while waiting for the show to start for a second time .\" Oh yeah, we are not moving. \"Live-Action\" Dumbo' Struggles to Soar at Box Office Las Vegas resident Gaile Tiquia is re-watching all seasons ahead of the upcoming premiere. She said she came to the casino-resort after seeing a mention on social media about the special show and wondering if it would include any spoilers. \"I had chills for the entire show,\" she said. \"It's amazing! It's too much .\" The \"Game of Thrones\" fountain show marks the first time the lake has been set ablaze, but artists and others have previously used the fountains for a variety of stunts. Billionaire Richard Branson rode a jet ski on the lake in 2010, and Drake performed one of his hits there during the 2017 Billboard Music Awards. Top Celeb Photos: Vice and Netflix Premiere \"The Beach Bum' Richard Shotwell/Invision/AP The landmark at the luxury property owned by MGM Resorts International attracts millions of visitors every year. It has nightly shows with recorded music ranging from Andrea Bocelli and Sarah Brightman's duet\" Time to Say Goodbye \"to Sin City's unofficial hymn\" Viva Las Vegas \"sung by Elvis Presley .\" The Bellagio fountain is iconic. It's known around the world, and so is \"Game of Thrones,'\" Djawadi said. \"So, I think putting them together and seeing the music choreographed to a fountain like that is quite the spectacle. I think it will get everybody really pumped for this final season coming up .\" The special fountain show will run nightly until April 13, the day before the eighth season's premiere. Elon Musk Releases Rap Single About Harambe the Gorilla Copyright Associated Press", "articleID": "2019040114_00450996_W", "names": {"Mark Fuller": ["Q50326821", "Q6767691", "Q6767692"]}}]