[{"date": "2019-04-02", "url": "http://feeds.manchestereveningnews.co.uk/~r/menews/~3/9uhjErjTDq8/british-businesses-slowing-down-amid-16062802", "content": "Get the biggest daily stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email A new study shows that growth in the UK economy has practically \"ground to a halt\" due to the lack of clarity surrounding Brexit. The British Chambers of Commerce (BCC), who produced the report, concluded that exports, orders, investments, and cashflow have all been affected by the uncertainty over the UK's relationship with the EU. Surveying 7,000 businesses with one million workers collectively, the results highlighted how services and manufacturing firms were being negatively impacted. Looking at the first three months of the year, the BCC said that the study indicated that businesses were \"hitting the brakes .\" The BCC has called for an end to the lack of clarity and the \"relentless uncertainty\" over Brexit, which it says has hurt investment plans and business confidence. Head of economics for the BCC, Suren Thiru, said: \"\"Our latest survey suggests that UK growth nearly ground to a halt in the first quarter of 2019, with increasing anxiety over Brexit and weakening global economic conditions driving a significant deterioration in almost all the key indicators in the quarter .\" The services sector suffered the more substantial loss of momentum in the first quarter, with both domestic and international activity slowing sharply in the quarter. \"The manufacturing sector continues to struggle amid tougher global and domestic trading conditions and rising cost pressures .\" The forward-looking indicators are disappointingly downbeat with weakening orders, confidence and investment intentions pointing to precious little growth over the coming quarters, unless substantial action is taken. \"Dr <mark>Adam Marshall</mark>, director general for the BCC, added:\" Our findings should serve as a clear warning that the ongoing impasse at Westminster is contributing to a sharp slowdown in the real economy across the UK. Business is hitting the brakes - hard.", "articleID": "2019040210_00281310_W", "names": {"Adam Marshall": ["Q16732034", "Q22237120"]}}, {"date": "2019-04-03", "url": "https://thecourier.com/national-news-latest/2019/04/03/killing-police-k-9s-in-florida-could-earn-longer-prison-term/", "content": "Advertisement TALLAHASSEE, Fla. (AP)--People who kill or seriously injure police dogs in Florida soon could face tougher penalties after the Senate unanimously passed a bill inspired by the shooting death of a canine named Fang. \"This bill has been a roller coaster of emotions,\" said Sen. Aaron Bean. \"Fang was executed .\" Fang was a 3-year-old German shepherd at the Jacksonville Sheriff's Office. He was fatally shot as officers chased a 17-year-old carjacking suspect. Bean said he decided to sponsor the bill after learning the penalty for killing the dog was a maximum of five years in prison. The bill would make the crime a second-degree felony punishable by up to 15 years in prison. \"The double hurt came not only in losing the animal, but we discovered the penalty for harming an animal...was only a third degree felony,\" Bean said. \"It was just sad .\" Bean noted that just last weekend a police K-9 was shot in Pinellas County after a traffic stop, though the dog is expected to survive. In making his case for the bill, he turned to Republican Sen. <mark>Tom Wright</mark>, a former Rochester, Minnesota, police officer who was assigned a K-9. He told stories about two incidents when his K-9, Officer Denver, stopped an armed suspect he was pursuing. \"Just two examples of I probably wouldn't be here today if it wasn't for this dog,\" <mark>Wright</mark> said. \"These are officers, they just happen to have four legs .\" The increased penalties would also apply to anyone who seriously injures or kills a police horse or canines used by fire departments and search and rescue teams. A companion House bill is ready to be considered by the full chamber after unanimous approval in each of its committee stops. Comments RELATED ARTICLES MORE FROM AUTHOR National News Latest 6 more excused from jury in trial of cop who shot 911 caller National News Latest Trump signs memorandum to stem counterfeit goods trafficking National News Latest The Latest: Huffman, Loughlin shows at court in college scam SPONSORED LINKS Daily Polls TRENDING WITH VIDEO: Guitar lessons help vets work through their frets April 3, 2019 WITH VIDEO: Findlay High students host event to teach sexual assault...April 3, 2019 Findlay street resurfacing plans advancing April 3, 2019 CIRCULARS Brinkman's April 3, 2019 Kroger Weekly Ad April 3, 2019 Lowe's Home Improvement April 3, 2019 Letters to the Editor The Docket Obituaries Classifieds", "articleID": "2019040319_00396488_W", "names": {"Tom Wright": ["Q1335131", "Q14949657", "Q1647937", "Q23418836", "Q5192198", "Q7818105", "Q7818107", "Q7818108", "Q7818109"]}}, {"date": "2019-04-03", "url": "http://www.90min.com/posts/6336279-neil-warnock-says-cardiff-s-one-day-of-training-played-a-role-in-defeat-to-manchester-city", "content": "Neil Warnock Says Cardiff's \"One Day of Training' Played a Role in Defeat to Manchester City Cardiff City manager Neil Warnock has hailed his side's showing at Manchester City despite the champions recording a straightforward 2-0 victory. The Bluebirds were vastly outplayed on Wednesday night, being afforded just 21% of possession and having only one shot on target during the contest. First-half goals from <mark>Kevin De Bruyne</mark> and Leroy Sane sealed the points for the hosts as they returned to the top of the Premier League with the win. Conversely, Cardiff are five points adrift of Burnley who occupy 17th position in the table. Many would have predicted a rout following <mark>De Bruyne</mark>'s sixth minute opener for the Champions League quarter-finalists, but the visitors showed resilience to maintain a respectable scoreline. Goalkeeper Neil Etheridge was outstanding, preventing further damage with a string of excellent saves. Though they rarely threatened themselves, Warnock was impressed by the attitude and application of his players during the loss. Speaking after the encounter at the Etihad, he said (as quoted by Wales Online):\" I was just really proud of them. To concede a goal as early as that, you do fear the worst. \"[Manchester City] started like the Real Madrid of ten years ago. They're so quick, everybody's comfortable on the ball. We only had one day [of training] after the disappointment of the Chelsea game. FULL-TIME Man City 2-0 Cardiff City go back to the top of the #PL after a comfortable win, sealed thanks to goals from <mark>De Bruyne</mark> and Sane #MCICAR pic.twitter.com/Qi90e3b08J--Premier League (@ premierleague) April 3, 2019\" The circumstances could have knocked a lot of teams, really, \"the 70-year-old continued .\" But they came to see me on Monday morning when I'd mentioned playing the Under-23s tonight and everybody told me, \"Gaffer, we want to play in this game!' - so that was nice .\" Despite the lack of attacking opportunities, the Welsh outfit fared much better in the north-west than some of their fellow strugglers have this season. In this campaign alone City have hit both Southampton and Huddersfield for six, whilst also racking up five goals in their thrashing of Burnley back in October. Related Topics: Cardiff City Top Stories", "articleID": "2019040408_00427341_W", "names": {"Kevin De Bruyne": ["Q357984", "Q52835665"]}}, {"date": "2019-04-04", "url": "http://www.bendigoadvertiser.com.au/story/5999664/project-horse-breaks-through-for-marshall/?cs=81", "content": "Junortoun trainer Dylan Marshall gets maiden win with \"project' pacer Barbie Mattgregor Tayla Fellows with Barbie Mattgregor on the morning after her maiden win at Maryborough on Thursday. BARBIE Mattgregor has always been a work in progress for Junortoun trainer Dylan Marshall. But the 31-year-old hopes he has gone some way to unlocking the secret to the four-year-old mare, after her win at Maryborough on Thursday. Barbie Mattgregor, who is raced by Steve Clements, from the Brisbane Pastoral Company, has done the bulk of her racing - 35 starts in total - in Queensland and New South Wales - under three individual trainers. Her last six runs have been in Victoria under the stewardship of Marshall, who is the only trainer to get a win with the mare. The hobby trainer, who works full-time as a diesel mechanic, took some encouragement from Barbie Mattgregor's maiden win .\" She has been a bit of a project horse...she had 30-odd starts before yesterday (Thursday) and has been one of those horses who has taken a lot of working out, \"he said .\" They didn't go any spectacular time, but she got the job done. \"With a bit of luck and a sharp breeze, hopefully we have worked her out a bit .\" Being a day meeting, Marshall unfortunately missed the win, with his partner Tayla Fellows taking on the handling duties. The couple operate only a small team of horses from their base, opposite Lord's Raceway, but clearly relish the involvement after more than 10 years in the industry. \"There has been bits and pieces (of success) along the way; we have only ever had a small team, no more than five or six,\" Marshall said. He said Barbie Mattgregor, who was driven for the first time by Michael Bellman on Thursday, would next run at Ballarat on April 16. \"We are trying to keep her to a mile, she doesn't really get the longer trip,\" Marshall said. \"We will certainly have a bit more confidence in her than we did beforehand .\" Also among the winners on Thursday was Longlea trainer <mark>John McDermott</mark>, who scored with Whata Challenge. The five-year-old gelding now has wins in two of his past four starts for McGregor, who has raced the horse since January last year, after formerly being trained by Matt Craven. Have you signed up to the Bendigo Advertiser's daily newsletter and breaking news emails? You can register below and make sure you are up to date with everything that's happening in central Victoria.", "articleID": "2019040423_00097816_W", "names": {"John Mcdermott": ["Q1101311", "Q18433720", "Q4275622", "Q5371876", "Q6247615", "Q6247619"]}}, {"date": "2019-04-05", "url": "https://thecourier.com/national-sports-latest/2019/04/05/la-longballs-muncy-bellinger-martin-hr-dodgers-beat-rox/", "content": "Advertisement DENVER (AP)--Cody Bellinger couldn't offer up a deep explanation on why the Los Angeles Dodgers are going deep so often. \"Everyone's feeling good,\" he said. That's deep enough. Bellinger, Max Muncy and <mark>Russell Martin</mark> homered as the Dodgers kept up their longball barrage, beating Colorado 10-6 on Friday in the Rockies' home opener. After hitting a franchise-record 235 home runs last year, the NL champion Dodgers have connected a whopping 21 times in only eight games this season. They've homered in every game so far. What's more, the 21 homers through their opening eight games are the second-most in major league history behind the St. Louis Cardinals, who had 23 in 2000. \"We have a talented lineup,\" Muncy said. \"We're very deep. On top of that, we're all up there and having fun .\" Bellinger hit his sixth of the year, breaking the game open with a three-run drive in the fifth. To think, he didn't hit his sixth homer last season until game No. 41. \"I'm just feeling good and trying to keep it going,\" Bellinger said. Muncy finished a double shy of a cycle, walking in the ninth. He can't remember the last time he ever accomplished the feat. \"That would've been pretty cool,\" Muncy said. Trevor Story homered twice for the Rockies. Kenta Maeda (2-0) threw five efficient innings and cruised through a scuffling Colorado lineup. He allowed four hits and his only run on Nolan Arenado's sacrifice fly. Maeda's biggest pitch was a slider in the fifth that Trevor Story took for a called third strike with two outs and the bases loaded. The Rockies were 0 for 6 with runners in scoring position against Maeda. His secret was simple: \"Have a strong heart,\" Maeda said through a translator. A slow-working Tyler Anderson (0-2) couldn't find his groove in allowing six runs over four innings. Both homers he surrendered were on fastballs. The left-hander is coming off a season in which he gave up 30 homers, tied for the most in the NL. \"They have some guys that are really hot and they stayed hot,\" Anderson said. \"I think really the one that turns it from a day that you're grinding through into a bad day is that Bellinger homer. That was a pretty good pitch that usually in the past he hasn't gotten to that pitch. But he's pretty locked in right now .\" Bellinger's drive off Anderson gave him 16 RBIs. In contrast, the Rockies have 22 RBIs as a team. This was the first of 19 games between two teams that needed a tiebreaker last season to decide the NL West crown before the Dodgers prevailed. It's a burgeoning rivalry in the eyes of the Rockies, but not so much to Los Angeles. \"They're a good club that I have a lot of respect for,\" Dodgers manager <mark>Dave Roberts</mark> said. \"But geography plays into a rivalry .\" TRAINER'S ROOM Dodgers: LHP <mark>Rich Hill</mark> (strained left knee) will throw a 20-pitch bullpen session Saturday ....<mark>Roberts</mark> said he was leaning toward LHP Clayton Kershaw (shoulder inflammation) making another rehab start at Triple-A Oklahoma City. Kershaw gave up two runs and struck out six over 4 1/3 innings in a rehab stint Thursday. <mark>KELLY</mark> UPDATE In the ninth, righty <mark>Joe Kelly</mark> came out of the game after being hit by a comebacker that deflected off his glove and caught him in the right wrist. The X-rays on the wrist were negative. \"He'll pick up a baseball tomorrow and see how it feels,\" <mark>Roberts</mark> said. HOME OPENER The Rockies have now dropped three of their last four home openers. The announced attendance was 48,404. \"(The fans) brought it today and we really didn't,\" Story said. JANSEN CLEARED <mark>Roberts</mark> won't hesitate to use closer Kenley Jansen while in Denver's higher altitude. Jansen had surgery in the offseason to address an irregular heartbeat that surfaced again while in Colorado for a series in August. He didn't travel with the team back to Colorado in September as a precaution. \"We feel the heart thing, we have it at bay with the surgery,\" <mark>Roberts</mark> explained. SIGNING The Rockies announced late in the game they agreed on a minor league contract with LHP Jorge De La Rosa, who turned 38 on Friday. UP NEXT Dodgers: RHP Walker Buehler (0-0, 15.00 ERA) looks to bounce back Saturday against Colorado after a rough opening outing. Rockies: RHP Jon Gray (0-1, 4.05) is 3-4 with a 4.70 ERA in 11 starts against the Dodgers. ___ More AP MLB: https: //apnews.com/MLB and https: //twitter.com/AP_Sports Comments RELATED ARTICLES MORE FROM AUTHOR National Sports Latest Magic use huge 1st half to rout Hawks 149-113 in home finale National Sports Latest Spurs get double-figure scoring from 8, beat Wizards 129-112 National Sports Latest Lamb hits 3-point winner, Hornets beat Raptors 113-111 SPONSORED LINKS Daily Polls TRENDING \"Everyday heroes' help combat child abuse, neglect April 5, 2019 Twice blessed April 5, 2019 I-75 project: Next phase of bridge work ready to start April 5, 2019 CIRCULARS Meijer April 5, 2019 Lowe's Home Improvement April 5, 2019 Brinkman's April 3, 2019 Letters to the Editor The Docket Obituaries Classifieds", "articleID": "2019040603_00130402_W", "names": {"Dave Roberts": ["Q5229686", "Q5229688", "Q5229690", "Q5229691", "Q5229692", "Q5229694", "Q5229696", "Q5229697", "Q5229698", "Q5229699", "Q5229701", "Q5229702"], "Joe Kelly": ["Q14950949", "Q18098357", "Q19519193", "Q22005763", "Q2351168", "Q6210642", "Q6210645", "Q730076"], "Rich Hill": ["Q3430418", "Q7323297"], "Russell Martin": ["Q1027572", "Q555382"]}}, {"date": "2019-04-06", "url": "http://express.co.uk/news/uk/1110620/Brexit-news-UK-BBC-Theresa-May-European-Union-Conservative-Party-Labour", "content": "The Conservative Party has been engaged in Brexit talks with the Labour Party after the Prime Minister reached out to Jeremy Corbyn last week to help try to deliver Britain's exit from the EU. Speaking on BBC Radio 4's Today programme, Education minister, Nadhim Zahawi, warned a further Brexit delay which sees the UK fighting the EU elections in May would be a \"suicide note\" for the Tory Party. Mr Zahawi added the talks with the Labour Party are \"ongoing and we hope that they deliver an outcome that allows Labour to support the withdrawal agreement\". BREXIT BOMBSHELL! Leave would win again in 2nd referendum says Abbott New UK passports printed without European Union phrase--how to apply But the Tory frontbencher added that if Labour could not sign up to a joint approach with the Government, MPs should be forced to find a compromise through a preferential voting system in order to resolve the deadlock. He said: \"If we can't get Labour to agree I think it's important that Parliament acts quickly now to decide what it is in favour of - whether it is through some voting mechanism where we have a single transferable vote and we vote on all the different deals .\" We need to do that quickly because I think going into the EU elections for the Conservative Party, or indeed for the Labour Party, and telling our constituents why we haven't been able to deliver Brexit I think would be an existential threat. \"I would go further and say it would be the suicide note of the Conservative Party .\" Brexit news: Nadhim Zahawi warned entering EU elections would be a \"suicide note' for the Tories (Image: GETTY • ITV) I would go further and say it would be the suicide note of the Conservative Party Education minister, Nadhim Zahawi The Conservative minister also said the UK faced a\" seismic \"political shift with the rise of the hard-left and hard-right if Brexit was not delivered. He said:\" I could easily see a scenario in our politics where populist parties on the hard-left and the hard-right would say \"your mainstream politicians have lied to you, not delivered on their promise' .\" \"They promised you they would deliver the instruction you gave them at the referendum, 17.4 million people voted for', it was a close run thing, which is why I think Mrs May's deal such a good compromise, but since we don't deliver that, I think there could easily be a seismic change in our politics .\" He added: \"We need to find out what Parliament will accept and then make a judgment as to whether that delivers Brexit. MPs' FURY at BBC Question Time BIAS after moving show from Bolton t.. . Brexit betrayal EXPOSED: PM favours soft exit says ex-No10 aide\" If we do not deliver Brexit we would be unleashing forces that I think could get this country, and indeed the rest of Europe, into a very bad place. \"Mr Zahawi claimed Parliament's opposition to a no-deal Brexit meant\" we are at the mercy of the 27 other countries \"in the EU. He said:\" If we do pass the withdrawal agreement and ratify it then we can leave. All other options will be ceding control to the EU27. \"It comes as Chancellor <mark>Philip Hammond</mark> said there were\" no red lines \"from the Government side in the ongoing talks with Labour. At a meeting of EU finance ministers in Bucharest he said:\" We should be open to listen to suggestions that others have made. Some people in the Labour Party are making other suggestions to us, of course, we have to be prepared to discuss them. \"Our approach to these discussions with Labour is that we have no red lines, we will go into these talks with an open mind and discuss everything with them in a constructive fashion .\" Mrs May has asked for a Brexit delay until June 30 but wants to terminate any extension before the European polls if she is able to get a deal through Parliament. European Council president Donald Tusk is recommending a longer postponement of one year, with a break clause in the case of earlier ratification, in a so-called \"flextension\" deal.", "articleID": "2019040610_00380830_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"]}}, {"date": "2019-04-09", "url": "https://www.irishtimes.com/news/crime-and-law/steve-collins-returns-to-limerick-10-years-after-son-s-murder-1.3854274?localLinksEnabled=false", "content": "<mark>Steve Collins</mark> returns to Limerick 10 years after son's murder Roy Collins was killed by members of the Dundon McCarthy gang in 2009 55 minutes ago Updated: 49 minutes ago <mark>Brian Hutton</mark> A file image of <mark>Steve Collins</mark>, father of Roy Collins who was shot dead in Limerick ten years ago, pictured with a photograph of him with his son. Photograph: Press 22 <mark>Steve Collins</mark>, father of murdered Limerick businessman Roy Collins, has moved back to the city to rebuild his family's life, he has said. The family fled Ireland in recent years to try and overcome the devastation wreaked on the them by gangland violence and intimidation. Mr Collins led a campaign, including street marches through Limerick, against the rampant criminality in the city and emigrated after testifying against members of the Dundon McCarthy gang who murdered his son in 2009. In October 2017, Wayne Dundon and Nathan Killeen, who are serving life sentences for the murder, had their convictions upheld by the Court of Appeal. Exactly ten years to the day of the killing of 35-year-old father-of-two Roy at the Coin Castle amusements arcade they ran at Roxboro Road in Limerick, his father said it was time to build a new life for his other son Steven in their home city. \"There is inward investment all the time now (in Limerick), we have the hanging gardens and the likes of that here now,\" he said. \"We have invested heavily in a bar here, my son Steven runs it. Father of murdered Roy Collins hopes others will give evidence\" We are trying to rebuild our lives, trying to rebuild Steven's life, to give him something to hold on to. We were comfortable in this city before all this came on our door, then we were destroyed and devastated in every way - this is a rebuilding thing now. \"Mr Collins said he remains\" haunted \"by his ordeal .\" It never leaves you...you never expect it to come into your life, the horrific way it happened, \"he said .\" It's a loss you never get over, nobody ever gets over losing a child - it doesn't matter what age they are. We are just happy to be moving on now. \"Mr Collins praised the support of the people of Limerick who came out onto the streets in solidarity with his family when they began their campaign against gang violence .\" It gave us the impetus to move on and talk to politicians and campaign to get the law changed. I think we've achieved that with the 2009 Justice Act, \"he said .\" I think Limerick is a different place. When we came back we noticed it how things have changed. The investment is coming into the city now. That wouldn't happened back in the day, in 2009. \"For such a small city, it was crazy. To get change, it is heartening .\" Mr Collins told RTÉ Radio's Morning Ireland the change came at a huge cost to his family and the stress has \"put an awful burden\" on their health. \"We relocated to try rebuild our lives again, but it was tough, we always wanted to come back in Limerick. We sacrificed an awful lot for this city .\" It took the people of Limerick to stand up and say \"we are sick of this\" , he said, to bring about the changes. \"I'm just so happy it happened...this didn't just help Limerick - it helped the whole country .\" ", "articleID": "2019040908_00454711_W", "names": {"Brian Hutton": ["Q55090000", "Q912381"]}}]