[{"date": "2019-04-09", "url": "https://www.irishtimes.com/news/crime-and-law/steve-collins-returns-to-limerick-10-years-after-son-s-murder-1.3854274?localLinksEnabled=false", "content": "<mark>Steve Collins</mark> returns to Limerick 10 years after son's murder Roy Collins was killed by members of the Dundon McCarthy gang in 2009 55 minutes ago Updated: 49 minutes ago <mark>Brian Hutton</mark> A file image of <mark>Steve Collins</mark>, father of Roy Collins who was shot dead in Limerick ten years ago, pictured with a photograph of him with his son. Photograph: Press 22 <mark>Steve Collins</mark>, father of murdered Limerick businessman Roy Collins, has moved back to the city to rebuild his family's life, he has said. The family fled Ireland in recent years to try and overcome the devastation wreaked on the them by gangland violence and intimidation. Mr Collins led a campaign, including street marches through Limerick, against the rampant criminality in the city and emigrated after testifying against members of the Dundon McCarthy gang who murdered his son in 2009. In October 2017, Wayne Dundon and Nathan Killeen, who are serving life sentences for the murder, had their convictions upheld by the Court of Appeal. Exactly ten years to the day of the killing of 35-year-old father-of-two Roy at the Coin Castle amusements arcade they ran at Roxboro Road in Limerick, his father said it was time to build a new life for his other son Steven in their home city. \"There is inward investment all the time now (in Limerick), we have the hanging gardens and the likes of that here now,\" he said. \"We have invested heavily in a bar here, my son Steven runs it. Father of murdered Roy Collins hopes others will give evidence\" We are trying to rebuild our lives, trying to rebuild Steven's life, to give him something to hold on to. We were comfortable in this city before all this came on our door, then we were destroyed and devastated in every way - this is a rebuilding thing now. \"Mr Collins said he remains\" haunted \"by his ordeal .\" It never leaves you...you never expect it to come into your life, the horrific way it happened, \"he said .\" It's a loss you never get over, nobody ever gets over losing a child - it doesn't matter what age they are. We are just happy to be moving on now. \"Mr Collins praised the support of the people of Limerick who came out onto the streets in solidarity with his family when they began their campaign against gang violence .\" It gave us the impetus to move on and talk to politicians and campaign to get the law changed. I think we've achieved that with the 2009 Justice Act, \"he said .\" I think Limerick is a different place. When we came back we noticed it how things have changed. The investment is coming into the city now. That wouldn't happened back in the day, in 2009. \"For such a small city, it was crazy. To get change, it is heartening .\" Mr Collins told RTÉ Radio's Morning Ireland the change came at a huge cost to his family and the stress has \"put an awful burden\" on their health. \"We relocated to try rebuild our lives again, but it was tough, we always wanted to come back in Limerick. We sacrificed an awful lot for this city .\" It took the people of Limerick to stand up and say \"we are sick of this\" , he said, to bring about the changes. \"I'm just so happy it happened...this didn't just help Limerick - it helped the whole country .\" ", "articleID": "2019040908_00454711_W", "names": {"Steve Collins": ["Q1337988", "Q16194486", "Q2346903", "Q48817948", "Q7612235", "Q7612236"]}}, {"date": "2019-04-09", "url": "http://www.inverelltimes.com.au/story/6011642/labor-pushes-investigation-into-phone-tower-on-rineharts-kingstown-property/?src=rss", "content": "Local News news, local-news, An investigation request into a phone tower on Gina Rinehart's New England property has been filed with the Auditor-General. A letter from Labor's regional communications spokesman <mark>Stephen Jones</mark> has asked that the decision to place the tower on the Kingstown property be scrutinised. \"I believe the decision-making around the location of this particular base station should be investigated to ascertain if proper departmental procedures were adhered to and if decision-making was influenced by factors outside of the program objectives,\" Mr <mark>Jones</mark> wrote. \"I understand that you are already considering an audit of Round 3 of this program .\" In that round, the Coalition Government selected the locations for co-funding, leading to criticisms from state governments alleging the program was not delivering good outcomes for the community. \"Kingstown residents have complained that the tower has been plagued by reception problems since it was switched on two weeks ago. Member for New England Barnaby Joyce campaigned for the tower and announced it as part of the federal government's Mobile Black Spot program in June 2015. He said he had no say in the exact location of the phone tower in Kingstown. Mr Joyce told The Inverell Times on Tuesday afternoon that the referral of the issue to the auditor-general was a political stunt .\" The Labor Party of course will play games, this is a political tactic, \"he said .\" I could refer anything; I could refer Mr <mark>Jones</mark> if I wanted too. \"Mr Joyce said he worked to get the funding for the tower in the village, but where it is placed is up to Telstra. He rejected any assertion he had any dealings with Gina Rinehart on the issue, and said the government and Telstra negotiated with the previous owners of the property, prior to her purchase\" I have never have had any conversation with Ms Rinehart with any purchase of hers in the New England, \"Mr Joyce said .\" Any negotiations about the phone tower do not include me; I provide the money for a phone tower in Kingstown, it's up to Telstra where it puts it. \"If it was up to me, I would have put it on top of the hill so that it gives coverage to the whole town .\" The tower is located on Sundown Valley, a property purchased by Gina Rinehart's pastoral arm, Hancock Agriculture, in August last year. But the contract with Telstra to host the tower was signed by the previous owners, Hancock Agriculture chief executive David Larkin told the Times, and said the annual rent paid on the tower was not a motivation. The Australian National Audit Office (ANAO) will now consider the request, a spokesman for the Auditor-General said. \"As outlined in the ANAO corporate plan, the Auditor-General aims to respond to the vast majority, 90 per cent, of requests for audit within 28 days,\" he said. It's not the first time the federal government's Mobile Black Spot program has been referred to the national audit body. READ MORE: Third drought assistance package announced A 2016 ANAO investigation found the $110 million program did not target the funding to areas where coverage had not previously existed. At least 89 of the 499 base stations provided minimal new coverage at a cost of $28 million; that means the public funded a program that did not extend coverage into new areas. The investigation also found that there was not a structured method for assessing the technical and financial aspects of proposals. It found that the department's ability to measure the effectiveness of the program was difficult, given there was no way to evaluate it. https: //nnimgt-a.akamaihd.net/transform/v1/crop/frm/hAWJC77isbRCSsmqzS5A6F/777f8a0f-e2fb-46d6-bfb0-652852e883cf.png/r2_0_1152_650_w1200_h678_fmax.jpg", "articleID": "2019040923_00109917_W", "names": {"Stephen Jones": ["Q11836360", "Q1380938", "Q17476791", "Q2374211", "Q25345871", "Q2670107", "Q4160428", "Q43565191", "Q47119713", "Q56598186", "Q7609616", "Q7609617", "Q7609618", "Q7609619", "Q7609620", "Q7609622", "Q7609623", "Q7612967"]}}, {"date": "2019-04-10", "url": "http://www.newindianexpress.com/world/2019/apr/10/woman-lived-to-99-with-most-organs-on-wrong-side-of-body-1962606.html", "content": "Home World Woman lived to 99 with most organs on wrong side of body The discovery of the rare condition, which was presented this week to a conference of anatomists, was astounding especially because Bentley had lived so long. Share Via Email Published: 10th April 2019 11:45 AM | Last Updated: 10th April 2019 11:45 AM | A + A A - Rose Marie Bentley. By PTI SALEM: Rose Marie Bentley was an avid swimmer, raised five kids, helped her husband run a feed store, and lived to the ripe age of 99. It was only after she died that medical students discovered that all her internal organs \"except for her heart' were in the wrong place. The discovery of the rare condition, which was presented this week to a conference of anatomists, was astounding especially because Bentley had lived so long. People with the condition known as situs inversus with levocardia often have life-threatening cardiac ailments and other abnormalities, according to Oregon Health & Science University. <mark>Cameron Walker</mark>'s class at the university in Portland was examining the heart of a cadaver last year when they noticed the blood vessels were different. When they opened the abdominal cavity, they saw that all the other organs were on the wrong side. The unusual blood vessels helped the heart compensate. In a telephone interview Tuesday, <mark>Walker</mark> described his reaction to the find as\" definitely a mix of curiosity, fascination and a sense of wanting to explore a little bit of a medical mystery' a medical marvel really' that was in front of us. \"\"And I would say the students felt something very similar,\" <mark>Walker</mark>, an assistant professor of anatomy, told The Associated Press. Bentley's family had not known about the condition, which OHSU says occurs only once in every 22,000 births. Apparently, Bentley didn't either. Bentley, who lived in Molalla, 40 kilometers south of Portland, had led a normal life. Her only recurrent physical complaint was arthritis, her daughter Louise Allee remembered. But there were signs. When Bentley was in her 50s, she underwent a hysterectomy, and the doctor also wanted to remove the appendix. But he couldn't find it, Allee said in a phone interview. When Bentley had her gallbladder removed at least a decade later, it was on the opposite side of where it should have been, she said. \"No one said a thing,\" Allee said. Bentley had agreed to donate her body to OHSU, Oregon's only academic health center. \"This is an important case that really gave us an opportunity to talk about the importance of future clinicians paying attention to subtle anatomic variations, not just large anatomic variations, in terms of addressing their future patients as individuals,\" <mark>Walker</mark> said. \"Don't judge a book by its cover, and always check and see what you've got before you talk about care .\" He has researched how long people with the condition have lived, and he found no documented cases in which a person lived beyond age 73. Bentley surpassed that by 26 years. Her husband, James, died about 15 years ago. Stay up to date on all the latest World news with The New Indian Express App. Download now (Get the news that matters from New Indian Express on WhatsApp. Click this link and hit \"Click to Subscribe'. Follow the instructions after that .) TAGS Rose Marie Bentley situs inversus Oregon", "articleID": "2019041006_00155738_W", "names": {"Cameron Walker": ["Q25189341", "Q30122762"]}}, {"date": "2019-04-11", "url": "http://smdailyjournal.com/news/world/rugby-australia-to-terminate-folau-deal-after-anti-gay-post/article_f36ad061-474a-56af-8789-f45bcd7c12c8.html", "content": "Facebook Twitter SMS Email Facebook Twitter SMS Email Print Save SYDNEY (AP)--Rugby Australia says it plans to terminate Israel Folau's contract after the star fullback made anti-gay comments on social media for the second year in a row. RA chief executive Raelene Castle said she and NSW Rugby Union chief <mark>Andrew Hore</mark> made \"repeated attempts\" to contact Folau directly and via his representatives on Thursday but that he failed to communicate with them. \"As a code we have made it clear to Israel formally and repeatedly that any social media posts or commentary that is in any way disrespectful to people because of their sexuality will result in disciplinary action,\" Castle said. \"In the absence of compelling mitigating factors, it is our intention to terminate his contract .\" Folau, one of the sport's top players, published a message on his Instagram account late Wednesday that hell awaits \"drunks, homosexuals, adulterers, liars, fornicators, thieves, atheists, idolators .\" The decision comes just five months before the start of the Rugby World Cup in Japan .------More AP sports: https: //apnews.com/apf-sports and https: //twitter.com/AP—Sports Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Facebook Twitter SMS Email Print Save Locations Australia Oceania New South Wales", "articleID": "2019041110_00062194_W", "names": {"Andrew Hore": ["Q25189782", "Q4757335", "Q505193"]}}, {"date": "2019-04-11", "url": "https://www.actionforex.com/live-comments/189463-us-mnuchin-on-china-trade-talks-both-sides-agreed-to-set-up-enforcement-offices/", "content": "Live Comments US Mnuchin on China trade talks: Both sides agreed to set up...Facebook Twitter Google + Pinterest WhatsApp Linkedin Email Print In a CNBC interview yesterday, US Treasury Secretary Steve Mnuchin talked about some concrete progress in US-China trade negotiations, including the core issue of enforcement. Mnuchin said: \"We've pretty much agreed on an enforcement mechanism. We've agreed that both sides will establish enforcement offices that will deal with the ongoing matters. This is something both sides are taking very seriously...We are really focused on the execution of the documents .\" Nevertheless he refused to put a timeline of the talks. \"We are hopeful we can do this quickly, but we are not going to set an arbitrary deadline,\" Mnuchin said. \"If we can complete this agreement, this will be the most significant changes to the economic relationship between the U.S. and China in really the last 40 years. The opening of the Chinese economy will be a tremendous opportunity with structural changes that will benefit U.S. workers and U.S. companies .\" - advertisement - <a href = \"https: //ads.actionforex.com/www/delivery/ck.php? n=a7dc4c0c' target =' _ blank'> <img src =\" https: //ads.actionforex.com/www/delivery/avw.php? zoneid=74 & n=a7dc4c0c' border =' 0' alt = \"/> </ a> Chinese commerce ministry confirmed today that senior trade negotiators from both countries held phone calls earlier this week. <mark>Gao Feng</mark>, the ministry's spokesman said\" in the next step, both trade teams will keep in close communication, and work at full speed via all sorts of effective channels to proceed with negotiations. \"Stay udpated with our FREE Forex Newsletters Download our Free Forex Ebook Collection RELATED ARTICLES MORE FROM AUTHOR Fundamental Analysis First Signs Of Stimulus Emerge In China Fundamental Analysis Investors Assess Important Macroeconomic Events Fundamental Analysis French And German CPI Data | Brexit Horror Continues | Fed Minutes Keeps Gold Above 1300 Fundamental Analysis Draghi Briefly Sinks Euro, Brexit Delayed Fundamental Analysis UK Gets Another Six Months To Agree On The Brexit Deal Central Bank Views FOMC Minutes--Pouring Cold Water on Doves who Expect Rate Cut This Year Market Overview Sterling Mildly Higher after Brexit Extension, Dollar Mixed after FOMC Minutes Live Comments FOMC minutes: Several members noted interest rate could shift in either direction Fundamental Analysis Fed Minutes Show Increasing Comfort with Patience LEAVE A REPLY Cancel reply Please enter your comment! Please enter your name here You have entered an incorrect email address! Please enter your email address here Save my name, email, and website in this browser for the next time I comment. I accept the Privacy Policy * This site uses Akismet to reduce spam. Learn how your comment data is processed. - advertisement - <a href =\" https: //ads.actionforex.com/www/delivery/ck.php? n=a7dc4c0c' target =' _ blank'> <img src = \"https: //ads.actionforex.com/www/delivery/avw.php? zoneid=74 & n=a7dc4c0c' border =' 0' alt =\" /> </ a> - advertisement - <a href = \"https: //ads.actionforex.com/www/delivery/ck.php? n=af1a6833' target =' _ blank'> <img src =\" https: //ads.actionforex.com/www/delivery/avw.php? zoneid=75 & n=af1a6833' border =' 0' alt = \"/> </ a>", "articleID": "2019041111_00375640_W", "names": {"Gao Feng": ["Q16231274", "Q16908273", "Q24834646", "Q3095227", "Q45437663", "Q45512683", "Q45537138", "Q45537211", "Q45587330", "Q45682018", "Q45683278", "Q45702447", "Q711470", "Q8964143", "Q9447417"]}}, {"date": "2019-04-11", "url": "http://www.gamereactor.eu/games/11347/Rainbow", "content": "RAINBOW SIX: SIEGE REVIEW. Written by Anders Mai on the 30th of November 2015 at 11 \"It's in competitive multiplayer where the game shines. The matches are short, intense and always surprising .\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 9th of April 2019 at 12:19 The April Fools' event has clearly gone down well with fans, who now have more time to enjoy the colourful playlist. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 3rd of April 2019 at 09:51 The bright and sparkly event has landed to celebrate April Fool's, and we tried the special variant of Hostage with toy soldiers. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 2nd of April 2019 at 09:01 Rainbow is Magic introduces a new hostage situation in Plane to rescue a teddy bear, alongside some eccentric customisation items. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 27th of March 2019 at 09 Kaid, Maverick, Nomad, and Clash are getting skins, charms, headgear, and uniforms to celebrate the Pro League competition.", "articleID": "2019041122_00161251_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-04-12", "url": "http://www.gazette-news.co.uk/sport/national/17570975.ramos-sidelined-by-calf-injury/", "content": "<mark>Ramos</mark> sidelined by calf injury By Press Association 2019 <mark>Sergio Ramos</mark> has a calf injury 0 comment Real Madrid captain <mark>Sergio Ramos</mark> could face a spell on the sidelines after the club announced he has sustained a calf injury. The capital club revealed on Friday that <mark>Ramos</mark> has been diagnosed with a left soleus injury. <mark>Sergio Ramos</mark> medical report. #RealMadrid https: //t.co/17mX7inDb7--Real Madrid C.F.???????? (@ realmadriden) April 12, 2019 A statement on the club's official website read: \"After the tests carried out on our player <mark>Sergio Ramos</mark> by the Real Madrid medical services, he has been diagnosed with a grade I injury in the left soleus .\" The player's situation will continue to be monitored. \"0 comment", "articleID": "2019041216_00272058_W", "names": {"Sergio Ramos": ["Q483309", "Q514286"]}}, {"date": "2019-04-13", "url": "http://economictimes.indiatimes.com/news/elections/lok-sabha/india/lok-sabha-polls-is-a-fight-between-anil-ambani-ordinary-people-thieves-honest-people-rahul-gandhi/articleshow/68864936.cms", "content": "Lok Sabha polls is a fight between Anil Ambani & ordinary people, thieves & honest people: Rahul Gandhi Rahul said the election was also a fight between ideologies, where there is hatred, anger and divisive politics on the one hand and love, affection and brotherhood on the other. PTI | Apr 13, 2019, 05.43 PM IST 0 Comments Reuters Mocking the \"Chowkidar' (watchman) term coined by the Prime Minister for himself, Gandhi sought to know whom did the watchman guard. Congress president Rahul Gandhi Saturday said the 2019 Lok Sabha election is a fight between Anil Ambani and ordinary people, thieves and honest people and false promises and the truth .\" This election is between Anil Ambani and the common citizens, five years of \"Anyay' (injustice) and NYAY (justice/minimum income scheme), thieves and honest people and false promises and truth,\" said Gandhi at a public rally here. The Congress president said the 2019 election was also a fight between ideologies, where there is hatred, anger and divisive politics on the one hand and love, affection and brotherhood on the other. He added that the fight is also about the \"lie\" of Prime Minister Narendra Modi of depositing Rs 15 lakh into everyone's account and Rs 3.6 lakh into the accounts of women living below the poverty line as promised by the Congress. Mocking the \"Chowkidar' (watchman) term coined by the Prime Minister for himself, Gandhi sought to know whom did the watchman guard .\" Have you ever seen a Chowkidar outside the house of a farmer, labourer and unemployed? Chowkidar is found outside the house of Anil Ambani. This Chowkidar guarded 15 to 20 rich people, \"he said .\" The prime minister had promised to give Rs 15 lakh into everyone's account but the murder accused <mark>Amit Shah</mark> called it a Jumla, which he said was spelt just like that, \"said Gandhi. The Congress president said he would not like to be the Chowkidar, but the voice of the people. He accused the prime minister of jailing the farmers and not Anil Ambani for allegedly defaulting on loans. Gandhi said once his government comes to power in 2019, the NYAY scheme (minimum income guarantee scheme) would be implemented and added that women of economically weaker sections would get Rs 72,000 deposited in their accounts, benefiting five crore families. 0 Comments", "articleID": "2019041313_00056385_W", "names": {"Amit Shah": ["Q19946588", "Q4746875", "Q4746876"]}}, {"date": "2019-04-14", "url": "https://www.pressherald.com/2019/04/14/sundays-nhl-roundup-islanders-move-closer-to-sweep-against-penguins/", "content": "PITTSBURGH--The New York Islanders don't play a particularly sexy brandy of hockey. They forecheck. They backcheck. They block shots and take few risks, more focused on fundamentals than flash. It's a style designed to frustrate opponents regardless of pedigree, one that has them on the cusp of just their second playoff series win in more than a quarter century. Jordan Eberle and Brock Nelson scored 62 seconds apart in the first period to quickly erase an early deficit, Robin Lehner stopped 25 shots, and the Islanders moved within one victory of finishing off Sidney Crosby and the rest of the frustrated Pittsburgh Penguins with a 4-1 win Sunday to take a 3-0 lead in their best-of-seven Eastern Conference quarterfinal series. It's heady territory for a franchise that's advanced past the first round just once since 1993. Yet the Islanders certainly look like they belong on the big stage. They've outscored Pittsburgh 11-5 through three games and have trailed for less than four minutes against a team that began the playoffs looking to capture its third Stanley Cup in four years, a dream that's all but vanished. \"We kind of did our best to play simple hockey and really just grind it out a little bit,\" said Islanders forward Anders Lee, whose empty-net goal with 1:28 to go pushed his team to the cusp of an unlikely sweep. While they lack Pittsburgh's offensive firepower, the Islanders have made up for it with depth and resiliency. Rather than get rattled after Garrett Wilson gave the Penguins just their second lead of the series when he redirected a point shot past Lehner midway through the first period, the Islanders responded immediately. Eberle beat <mark>Matt Murray</mark> short side from just above the goal line 28 seconds after Wilson's goal, and Nelson finished off a 2-on-1 just over a minute later to put New York in front to stay. Lehner withstood a series of pushes by the Penguins, and the Islanders counterpunched brilliantly in the third period, getting goals from Leo Komarov and Lee to pull away. \"Playoffs are all about momentum,\" said Eberle, who has three goals in the series. \"When you can take some team's momentum away and just continue to build yours, it's key .\" <mark>Matt Murray</mark> finished with 32 saves for the Penguins, but Pittsburgh again struggled to generate sustained offensive pressure. New York, which allowed an NHL-low 196 goals on its way to a second-place finish in the Metropolitan Division, has clamped down on Crosby and linemate Jake Guentzel. The two combined for 75 goals and 101 assists during the regular season but have yet to record a point in this series. Pittsburgh needs a win in Game 4 on Tuesday to avoid being swept for the first time since the 2013 Eastern Conference finals against Boston. \"You've got to find ways to score goals this time of year,\" Crosby said. \"It's not easy, but you've got to find a way to do it, and obviously we haven't done a good job of it through the first three games .\" NOTES AVALANCHE: Cale Makar is about to jump from one grueling playoff run straight into another. The 20-year-old defenseman signed a three-year, entry-level deal with Colorado, a day after his UMass squad lost in the Frozen Four championship game. Makar, who's from Calgary, could make his NHL debut Monday in Game 3 of a first-round playoff series against the Calgary Flames. The series is tied at a game apiece. \"I want to make sure he's in, rested, prepared and focused on what we're doing here now. Then we'll make a decision on when we get him in the lineup,\" Avalanche Coach Jared Bednar said. \"It's definitely a big step up from the college game, especially when you're jumping in mid-series, in a heated playoff round, against such a good opponent like Calgary. It's my job to make sure I'm putting him in a position to succeed .\" The 6-foot, 192-pound Makar was the fourth overall pick by Colorado in the 2017 draft. He recently won the Hobey Baker Memorial Award as college hockey's top player after a season in which he had 16 goals and 33 assists in 41 games. Share Read or Post Comments Send questions/comments to the editors. <Previous Linden seeks Boston Marathon repeat Next> Related Stories Latest Articles Business American cancels Max flights through mid-August Sports Sunday's NHL roundup: Islanders move closer to sweep against Penguins Boston Bruins Bruins get physical, thanks to boost from <mark>David Backes</mark> Nation & World Japanese leader visits Fukushima nuclear plant Nation & World Pompeo says China prolonging Venezuela crisis Want the news vital to Maine? Our daily headlines email is delivered each morning. Email * Newsletter Choices * Daily Headlines and Evening Express Breaking News Business Headlines Maine Cannabis Report High School Sports Real Estate * I understand the Terms of Service. Name This field is for validation purposes and should be left unchanged. This iframe contains the logic required to handle Ajax powered Gravity Forms.", "articleID": "2019041423_00082371_W", "names": {"David Backes": ["Q1173622", "Q5231027"], "Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"]}}]