[{"articleID": "2018022219_01027069_W", "names": {"Julio Sosa": ["Q5955805", "Q6309065"], "Brian Gill": ["Q16230677", "Q22106454", "Q47068063"]}, "date": "2018-02-22", "url": "http://www.thedp.com/article/2018/02/amy-wax-op-ed-penn-law-upenn-philadelphia-professor-bourgeois-culture", "content": "Amy Wax's newest opinion piece has reignited a familiar debate at Penn Law By Lucy Curtis <1 minute ago Credit: <mark>Julio Sosa</mark> Months after she sent campus into an uproar with a fiery opinion piece praising \"bourgeois culture,\" Penn Law School professor Amy Wax has divided students and colleagues alike with a familiar weapon: another op-ed piece. Her new article, titled \"What Can't Be Debated on Campus,\" was published in The Wall Street Journal on Feb. 15 and explores the \"unreasoned speech\" she encountered in response to her original Philadelphia Inquirer op-ed. Wax's piece has raised questions about how Penn Law handled the ensuing furor over her controversial opinions and invited rancorous debate from professors and students over her teaching a mandatory, first-year course. In the op-ed, which Wax adapted from a speech she delivered in December, she accused Dean of Penn Law Theodore Ruger of asking her to \"take a leave of absence next year\" and stop teaching her civil procedure class, which is required for first-year students. \"When I suggested that it was his job as a leader to resist such illiberal demands, he explained that he is a\" pluralistic dean' who must listen to and accommodate \"all sides,'\" Wax wrote. Penn Law spokesperson Steven Barnes sharply disputed Wax's claim in a statement sent to The Daily Pennsylvanian. \"Professor Wax is a valued member of our faculty and nothing has changed in her status,\" Barnes said. He described the conversation with Wax as a \"discussion with the dean about the timing of a regularly-accrued sabbatical, a discussion the dean has with many faculty members each year, as every tenured faculty member enjoys a sabbatical benefit, with full pay .\" Wax also took aim at her colleagues, including the group of 33 professors who criticized her in an open letter published in August in the DP. Their piece contained \"no argument, no substance, no reasoning, no explanation whatsoever as to how our op-ed was in error,\" she wrote. One of the co-writers of the open letter, Penn Law professor Jonah Gelbach, said Wax's piece in the Journal initially omitted the fact that he and two other legal scholars wrote extensive rebuttals to Wax in the fall. Gelbach's essay, titled \"Facts v. Wax,\" was published in September and is over 14,000 words long. \"The version of the op-ed that now appears online contains a sentence acknowledging those posts, but only because I shamed a WSJ editor into adding it,\" he wrote in an email. At the bottom of Wax's article, an addendum now reads, \"The essay has been updated to note that two signers of the open letter condemning Ms. Wax's op-ed later wrote substantive responses to her arguments .\" The piece has been amended to note the two responses to Amy Wax posted at Heterodox Academy and linking to them. https: //t.co/9tSIoTjxEU--Gary Rosen (@ garyrosenWSJ) February 18, 2018 Gelbach also said he sent an early draft of the Heterodox Academy essay to Wax, but she responded by saying that she did not have time to read it. (Wax did not respond to repeated requests for comment .) In addition to openly questioning Ruger's conduct, Wax has also reopened a debate about her fitness to teach a mandatory course for 1Ls, some of whom advocated for her removal. \"A couple weeks before we even got here, she publishes an op-ed openly denigrating cultural backgrounds of students who are then required to take her class,\" said Vivek Kembaiyan, a 1L student who sits on the Council of Student Representatives for Penn Law. \"Students who've had her [are] apprehensive about going to her office hours, or asking for a recommendation, because they come from one of the specific backgrounds that she calls out in her op-ed .\" In the fall, the Penn Black Law Students Association and the Penn chapter of the National Lawyers Guild called on Wax to be barred from teaching the course. B.J. Courville, a 1L student, said she has separately petitioned faculty members to remove Wax from the first-year curriculum as well. \"At the end of the day I deserve the same education and the same safe learning environment as the person next to me, from a strictly economic standpoint,\" Courville said. But months after that debate receded from the minds of many higher education observers, Penn Law students remain divided over Wax's standing. \"There are a lot of times when I find myself at odds with the opinions of my professors,\" 3L student Mia Rendar said. \"I don't think it's right to punish someone for giving an independent opinion .\" Conservative sites like Breitbart and the National Review have rallied behind her and Wax has said she received many supportive emails in response to her original Inquirer piece. Other critics who disagree with her argument about bourgeois cultural values have decried the style of ad hominem attacks that refer to her a \"Nazi\" and a \"racist .\" \"Every open letter you sign to condemn a colleague for his or her words brings us closer to a world in which academic disagreements are resolved by social force and political power, not by argumentation and persuasion,\" wrote scholar Jon Haidt in an essay defending Wax. Sign up for our newsletter Get our newsletter, Dear Penn, delivered to your inbox every weekday morning. Sign Up Gelbach and Wax's many intellectual adversaries are not as persuaded. \"Professor Wax isn't entitled a safe-space bubble in which she can express her opinions however she likes without fear of criticism from those whom she angers,\" Gelbach wrote. \"Debate comes with a price .\" All comments eligible for publication in Daily Pennsylvanian, Inc. publications. More Articles Dozens of Penn students, faculty gather in the rain to protest gun violence on Thursday Republican candidate for governor pledged to prioritize \"people over politics' at Penn talk Students critique sexual assault policy after admin. say they haven't heard significant feedback Penn men's soccer announces <mark>Brian Gill</mark> as next head coach Inside Penn grad students' decision to stall their efforts to unionize Valentine's Day Gift Guide for the Last Minute Shopper Sponsored"}, {"articleID": "2017092900_00275106_W", "names": {"Wayne Jones": ["Q2338144", "Q4160432", "Q7976374", "Q7976375"], "Sam Thompson": ["Q19520038", "Q21067120", "Q55117887", "Q7408246", "Q7408247"], "John Fox": ["Q12892062", "Q13459838", "Q19662010", "Q19750869", "Q24285717", "Q3809274", "Q44786513", "Q6233800", "Q6233806", "Q6233808", "Q6233810", "Q719030"], "Michael Decker": ["Q21064686", "Q47878431"], "Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"]}, "date": "2017-09-28", "url": "http://communitynewspapergroup.com/sports/national/dad-battled-tiger-on-the-golf-course-son-is-now/article_3e448ef9-1aee-58f9-950a-83c37ab71875.html", "content": "Twitter surely must be God's gift to the transfer student. Weeks before arriving in Owasso, Ernest William Kuehne IV--also known as Will--had already befriended Rams receiver Dylan Chinn, using the social media site. When Kuehne (pronounced \"key-knee\" ) was finally on the ground in Ram Town, their friendship deepened. Soon, senior running back Bryce Cabrera joined the club. Today, the three are inseparable. They're also key components, along with Josh Proctor, <mark>Wayne Jones</mark>, Tyrese Sisson, Devin Tyler, <mark>Sam Thompson</mark>, Courtre Alexander, Tyler Moody and Duece Mayberry, in what has to be the reclamation project of the year in Oklahoma high school football. Coming off two sub-par seasons, in their first year under local coaching legend Bill Blankenship, the Rams are 4-0, ranked No. 2 and headed into a 7:05 p.m. Friday showdown at No. 1 Union, 6A Division I defending champion. Cox3 will televise a potential preview of the state final. Kuehne, a junior, needed less than two full weeks of spring practice to begin separating himself as the Rams' starting quarterback. In his first four starts, he's completed 71 percent of his passes for 989 yards and 14 touchdowns, with only one interception, leading an offense that averages 54 points and 495.1 yards per game. \"He's still a work in progress, but he has played well,\" Blankenship said. \"There's a whole lot he can improve on fundamentally, but it's encouraging to have a quarterback who's been able to do what he's done so far. He's always taking notes. He's a student of the game. He makes a point of trying to learn everything he's been exposed to .\" Owasso's fast start has ignited a mountainous surge in fan interest. An estimated 11,600 spectators saw the home opener against Broken Arrow three weeks ago. Rams athletic director Zach Duffield called it likely \"an all-time record for Owasso Stadium .\" Another 8,000 to 9,000 watched the district opener against Mustang last week. Union officials are expecting 13,000 on Friday. \"It's really exciting when the stands are full and the whole town comes out to watch us play,\" Kuehne said. \"That gets the whole team fired up. But we can't be focused on that. We have to focus on what we need to do to keep getting better .\" Kuehne couldn't be happier with his new hometown. \"I love it. It's a great place,\" he said. \"The people are awesome and I've really connected with the team. There's not much I don't like about it. I think it's the perfect place for me and for my family .\" Who is Kuehne and where did he come from? How did he arrive at the perfect moment, and with just the right skills necessary to run Blankenship's spread-the-ball, take-what-the-defense-gives-you system with near perfection? Some suspect he was recruited for the purpose. But as Kuehne tells the story, he recruited himself. Or his father did. Golf fans shouldn't have any trouble recognizing the name \"Trip\" Kuehne. The former Oklahoma State three-time All-American golfer--and Will's father--was part of a Cowboys' 1995 national championship team and received the Ben Hogan Award that same year as the nation's top collegiate golfer. In 1994, he was also part of the dramatic U.S. Amateur championship, finishing runner-up to his good friend and soon-to-be-legend, Tiger Woods. In the 36-hole, match-play final, Kuehne led by five holes with 12 to play at TPC Sawgrass in Ponte Vedra Beach, Florida. But Woods rallied in stunning fashion, foreshadowing his spectacular professional career. \"It was tough, but to that point, it was some of the best golf I've ever played in my life,\" Trip Kuehne said. \"Sometimes, you can play as good as you possibly can and come up on the short end of the stick. That's a little of what happened .\" The Dallas native saw the painful loss as an omen. Instead of turning pro, he returned to OSU to complete his master's degree and prepare for a business career. Today he runs a successful investment management company, Double Eagle Capital. Trip has never watched tape of the match, but he refers to it as \"a blessing in disguise .\" Once back in Stillwater, he met his future bride. The former Dusti Stuart was a Cowgirls basketball player from Shattuck. Had they not gotten together, there would be no Will Kuehne. This time last season, Will was a sophomore football player at Liberty Christian School in Argyle, Texas. The family was satisfied with Liberty, but for several reasons, Tripp had been looking to move his family north for several years. For starters, the Kuehnes are OSU season-ticket holders with multiple ties to the Stillwater campus. Dusti's father, the late Jiggs Stuart, was a letterman football and baseball player at Oklahoma A & M in the early \"40s .\" So there really is some orange that runs through our bodies, \"Trip said. Trip wanted to move his wife closer to her mother and Will wanted to move closer to his private quarterback trainers, Joe Dickinson and Joe McCulley. Dickinson is a former offensive coordinator at the University of Oklahoma, University of Tulsa and Central Oklahoma, with 35 years of college and high school coaching experience. McCulley is a former TU quarterback and offensive innovator who coached high school football at Grove, Tahlequah, Broken Bow, Coalgate, Kiowa and Hennessey. He was also superintendent at Hennessey (in western Oklahoma) before announcing his retirement in October 2015. He moved to Collinsville last year. Both were working with quarterbacks for DeBartolo Sports University, an organization dedicated to training young athletes, when Will and his father attended a DeBartolo event five years ago in Oklahoma City. At the time, Will was a sixth-grader at tiny Westlake (Texas) Academy. He had just been introduced to the idea of playing quarterback and wanted private instruction. More from this section +5 <mark>John Fox</mark>, Chicago Bears at a crossroads in Year Three of rebuild Tampa Bay Bucs' Gerald McCoy wants to talk to fans face-to-face to discuss frustrations Husker notes: Omaha North grad <mark>Michael Decker</mark> centers in on larger role; <mark>Chris Jones</mark> works out and more\" I figured if (Westlake's coaches) wanted me to do it, I wanted to be the best I could be, \"he said. Last year at Liberty, he played safety and a smattering of quarterback. He's also played receiver and linebacker. McCulley said Will's experience with other positions has given him a unique perspective for playing quarterback .\" He understands the physical part of the game, \"McCulley said .\" Nothing is more potentially demoralizing for a quarterback than getting hit, but I was noticing in the Jenks game that he was able to stand in there, take the hit and put the ball out there. He understands getting hit and getting up. It gives him a chance to be special. \"McCulley also likes Kuehne's\" innate ability \"to control his emotions .\" He has that temperament. It comes from being part of a family of athletes. He's been around athletes his whole life, \"McCulley said. Will's aunt and uncle were also standout golfers. Kelli Kuehne won four straight Texas high school state titles for Highland Park (1992-95), won the U.S. Women's Amateur in 1995 and had won an LPGA Tour tournamnet before injuries cut short her career. Hank Kuenhe played college golf at OSU and SMU and had four wins on the PGA Tour. Many consider the Kuehne siblings the most successful in U.S. amateur golf history. At least two or three years ago, Trip was considering private schools in the Tulsa area. McCulley had worked with Lincoln Christian's 2015 standout, Micah Wilson, and recommended Lincoln and a few others. Had the family moved then, Will might be playing for Cascia Hall, Lincoln or Holland Hall right now. But then, he couldn't have become Blankenship's bandleader. Blankenship won three state titles and 154 games over 14 Union seasons (1992-05). In 2012, he won a Conference USA title and Liberty Bowl in his best of four seasons at the TU helm. Trip said he knew Blankenship\" only by reputation. I knew he had coached at TU and was a great high school coach. We decided to move for our own reasons, but when Bill got the Owasso job (in January), it became kind of a no-brainer. Where else could you play high school football where the coach has won a (college) conference title and a bowl game? \"Will arrived in March, just in time for the final nine weeks of Owasso's school year. The family's Westlake home sold in 18 days, but their initial contract on an Owasso residence fell through before another property in Stone Canyon became available. Trip operates his business from a separate building that was used by the previous owner for his model-train hobby. The family belongs to The Patriot Golf Club, but Trip, a two-time Texas high school state champion at Highland Park and three-time Walker Cup qualifier, plays less golf than he once did. He's having more fun these days following his son's football career, and Will just isn't that interested in chasing the little white ball .\" His dream has always been to play quarterback and we're going to let him chase that dream and see how good he can be, \"Trip said. Then, he added with a chuckle,\" We keep his golf score by how many balls he loses. \""}, {"articleID": "2011091710_00022079_W", "names": {"Tim Burgess": ["Q2433840", "Q7803247"]}, "date": "2011-09-16", "url": "http://overheadbin.msnbc.msn.com/_news/2011/09/16/7781454-seattle-hotels-step-up-to-fund-tourism-promotion", "content": "recommended: seattle hotels step up to fund tourism promotion recommended: at long last, a historic carousel rides again time pubdate datetime = \"2011-09-16t08:35:31 -04:00\" > ago seattle hotels step up to fund tourism promotion three months after washington's tourism office was shuttered, a group of major downtown seattle hotels is backing a tourism improvement area to fund such promotion through a $2-a-night surcharge on hotel rooms. by elaine porterfield, msnbc.com contributor it's no secret that tourists and business travelers bring much-needed dollars to municipalities, but in the face of the unrelenting recession, many state and city budgets for tourism promotion around the nation have been slashed, if not eliminated. a group of major seattle hotels, faced with similar problems such as the closure of the washington state tourism office in june, has thrown their support behind a tourism improvement area to fund such promotion through a $2-a-night surcharge on hotel rooms. san diego is another city that uses such taxes for promoting tourism. the money is desperately needed to keep their industry moving forward, said howard cohen, president of the seattle hotel association and manager of three downtown hotels for clise properties, inc. when the state of colorado eliminated its tourism office several years ago, it ended up losing a third of its tourism business, cohen said. \"we're trying to take the bull by the horns ourselves,\" he said. seattle city councilman <mark>tim burgess</mark>, who first proposed the idea, said that it's anticipated that $6 million would be raised the first full year of the tax in 2012. \"if invested in the (tourism) promotion of seattle, according to most estimates of economists, it would mean about $30 to $33 million in economic gain,\" <mark>burgess</mark> said. the proposed room tax, which will be considered tuesday by the seattle city council regional development and sustainability committee, has the support of mayor mike mcginn, said brian surratt, the city's business development director. if it passes through that committee, it will go before the full city council on sept. 26. cohen says they hope to have the tax in place by the beginning of november. surratt, who called the closure of the state tourism office devastating for destination travel to washington, said the city was excited to see the private hotel industry step up and embrace the surcharge. \"tourism dollars are great for economic development,\" surratt said. \"it's outside money coming here that stays here...it's a win-win for all. we've got roughly 20,000 people employed in tourism here. that's a huge chunk of our jobs (in seattle).\" overall in washington, tourism is a $15.2 billion industry that supports nearly 144,000 jobs, contributes nearly $1 billion in local and state tax revenues and ranks fourth in gross domestic product produced in washington, according to the seattle's convention and visitors bureau. the nightly tax would be applied to hotels around downtown seattle, including the core shopping area, trendy belltown, the international district and bustling south lake union, the new neighborhood of online retail giant amazon. (will be verified, but never shown): you're in easy mode. if you prefer, you can you're in xhtml mode. if you prefer, you can"}, {"articleID": "2015041317_00015921_W", "names": {"Tim Burton": ["Q56008", "Q7803257"], "Gina Rodriguez": ["Q16729296", "Q732111"]}, "date": "2015-04-13", "url": "http://seventeen.com/celebrity/movies-tv/news/a30020/cara-delevingne-casting-alice-in-wonderland", "content": "We've only gotten a taste of Cara Delevingne's mad acting skills in the Paper Towns, but it's already impossible to imagine a time when the supermodel wasn't an A-list actress. It might be hard to believe, but before her acting career took off, she was actually passed over for a major role in one of your fave Disney movies. Cara recorded an audition tape for the lead role of Alice in Disney's Alice in Wonderland and sent it to the producers, and for a second, it looked like she might be destined to get the part. New Zealand Herald of her crazy first-audition experiences, \"Then I was at a wedding and this woman came over to me. She said,\" You don't know me, but I know exactly who you are'. \"It turned out to be a producer behind the Alice In Wonderland movie .\" She told me that they all loved my tape! And I went to <mark>Tim Burton</mark>'s house and met with him. \"Obvs in the end, she didn't get the part, but she's not bitter .\" I didn't get the part, but that experience lit a fire in me, \"Cara said of how the experience helped spark her acting career. Even though we're supes bummed we never got to see an Dylan O'Brien & <mark>Gina Rodriguez</mark> Are In Talks To Star In A Major Movie Together! Fifth Harmony's Camila Cabello Shuts Down Becky G Feud Rumors In The Best Way Possible Rebel Wilson Doesn't Think It's Best for Girls to Model Themselves After Victoria's Secret Models"}, {"articleID": "2016120206_00384296_W", "names": {"Jack Dempsey": ["Q21621158", "Q6112074"], "Kate Jones": ["Q20235524", "Q41718769", "Q56867959", "Q6375568"]}, "date": "2016-12-02", "url": "http://www.goldcoastbulletin.com.au/news/national/hmas-tobruk-to-be-scuttled-in-wide-bay-region-after-queensland-towns-win-dive-site-bid/news-story/d7e713f955597fa0448d53103530b5e4", "content": "HMAS Tobruk to be scuttled in Wide Bay region after Queensland towns win dive site bid Tom Snowdon, The Courier-Mail December 2, 2016 4:52 pm A PRIZED former warship will be scuttled off the south Queensland coastline after councils pitched a hard-fought battle to secure the navy vessel as a tourist dive site. Federal Defence Personnel Minister Dan Tehan announced today the HMAS Tobruk would be sunk in the Wide Bay area between Bundaberg and Hervey Bay. \"She will be fondly remembered by all those who served in Tobruk and those who have been supported by the many operational and humanitarian deployments she undertook,\" Mr Tehan said. \"The scuttling of Tobruk in the Wide Bay Burnett area will be a permanent monument to Tobruk's proud history and a reminder she served as her motto intended\" Faithful and Strong'. \"The Bundaberg and Fraser Coast councils mounted a hard-fought campaign after they pledged $1 million each to secure the former landing ship after it was decommissioned in 2015 after 34 years of service. The councils were fighting against most other coastal Queensland local government areas, including Redlands, which had been petitioning for the ship to be sunk off its shores in a bid to transition towards a tourism economy as sand mining operations draw to a close. Tasmania had also thrown a bid in the ring to have it sunk in the icy waters of Binalong Bay. Bundaberg Mayor <mark>Jack Dempsey</mark> said the pre-scuttling work, including cleaning, would be done at the local port .\" This work is valued at millions of dollars and it certainly would provide a financial fillip for local businesses that might be engaged to undertake the work, \"Cr <mark>Dempsey</mark> said .\" I cannot applaud loudly enough the wonderful bipartisan spirit of co-operation between Bundaberg and Fraser Coast Councils in combining their energies and resources to win this project for the benefit of the communities of our regions. \"Queensland Government Tourism Minister <mark>Kate Jones</mark> said all the proposals presented\" excellent arguments to host the ex-HMAS Tobruk \".\" The Fraser Coast, in partnership with Bundaberg, was able to present the most compelling case that a dive site in its area would deliver the most benefit, \"Ms <mark>Jones</mark> said. The ship is expected to set off from Sydney this month but Ms <mark>Jones</mark> said it would probably be 2018 before preparations could be completed so it could be sunk Federal Member for Hinkler Keith Pitt, who claimed it could become one of the country's\" premier \"dive sites, said it had been a difficult three-year campaign .\" This dive wreck will not only bring domestic and international visitors to the region, it will bring much needed long term, sustainable jobs and a future for the next generation, \"Mr Pitt said .\" That has always been the driver behind this campaign: more jobs for this region, with an economic boost of $4 million per year."}, {"articleID": "2017042415_00377549_W", "names": {"Ryan Murphy": ["Q1185730", "Q19979249", "Q21934130", "Q316844", "Q3453832", "Q6379482", "Q6380012", "Q7384364"]}, "date": "2017-04-24", "url": "http://erietvnews.com/story/35227000/feud-season-2-will-be-a-very-different-kind-of-feud-says-ryan-murphy", "content": "\"Feud' Season 2 will be' a very different kind of feud,' says Ry - Erie News Now: News, Weather & Sports | WICU 12 & WSEE\" Feud' Season 2 will be' a very different kind of feud,' says Ry - Erie News Now: News, Weather & Sports | WICU 12 & WSEE Member Center: \"Feud' Season 2 will be' a very different kind of feud,' says <mark>Ryan Murphy</mark> Posted: Updated: By Sandra Gonzalez CNN (CNN)--The story about a clash between two Hollywood heavyweights came to a close with Sunday's conclusion of\" Feud \"Season 1. And creator <mark>Ryan Murphy</mark> already has his sights set on next season, which will center on the ill-fatted marriage between Prince Charles and Princess Diana .\" It's going to be super juicy, \"<mark>Murphy</mark> told Entertainment Weekly .\" It's a very different kind of feud than the feud we told with Bette and Joan. It's a love affair feud. \"FX picked up the second installment of the anthology series even before Season 1 debuted. The roles of Charles and Diana have yet to be cast. But <mark>Murphy</mark> says filling the iconic roles is proving to be difficult feat .\" It's become sort of a Scarlett O'Hara part, \"<mark>Murphy</mark> said of finding an actress to fill Diana's shoes .\" A lot of people want to be Diana, and we're doing a very sympathetic portrayal of her. \"<mark>Murphy</mark> added that he's\" open \"to both newcomers and established stars for the role .\" I don't know where we're going to land, \"he said. <mark>Murphy</mark> said at an Emmy event over the weekend that the second installment begins with the couple filing divorce papers and will tell the story of\" the dissolving of a fairy tale. \"Season 2 will be written by <mark>Murphy</mark>, Jon Robin Baitz and Ned Martel .\" FEUD: Charles and Diana \"will consist of 10 episode and is scheduled to debut in 2018. TM & © 2017 Cable News Network, Inc., a Time Warner Company. All rights reserved. 3514 State St. Erie, PA 16508 Newsroom: (814) 454-8812"}, {"articleID": "2014091017_00090453_W", "names": {"Markus Schäfer": ["Q1529352", "Q19668288", "Q27531610", "Q40433377"]}, "date": "2014-09-10", "url": "http://www.automotiveworld.com/news-releases/mercedes-benz-invests-three-billion-euros-germany-mercedes-benz-realigns-production-organization-passenger-cars/", "content": "Mercedes-Benz invests more than three billion euros in Germany: Mercedes-Benz Realigns its Production Organization for Passenger Cars New organization model focuses on vehicle and powertrain product architectures Mercedes-Benz invests more than three billion euros in capacity increase and modernization of its German passenger cars and powertrain plants in 2014 \"We want to continue to grow and will significantly increase our production capacities in the coming years,\" said <mark>Markus Schäfer</mark>, Member of the Divisional Board of Mercedes-Benz Cars, Production and Supply Chain Management. <mark>Markus Schäfer</mark>, Member of the Divisional Board of Mercedes-Benz Cars, Production and Supply Chain Management. Mercedes-Benz is realigning its global passenger cars manufacturing activities and is strengthening its German passenger cars locations with investments worth billions of euros. \"We want to continue to grow and will significantly increase our production capacities in the coming years. At the same time we want to permanently and sustainably strengthen our competitiveness with a high-performance organization,\" said <mark>Markus Schäfer</mark>, Member of the Divisional Board of Mercedes-Benz Cars, Production and Supply Chain Management, during a media event at the Mercedes-Benz Sindelfingen plant. This year alone, Mercedes-Benz is managing 18 vehicle ramp-ups at eight locations worldwide, among them the start of production of the new C-Class sedan on four continents. Until 2020, Mercedes-Benz will additionally introduce 12 models which do not have a predecessor. As well as stepping up its international activities, Mercedes-Benz is strengthening it German plants with investments of more than three billion euros this year. At the Sindelfingen plant, more than one billion euros are invested primarily for future products. Another billion euros go to the Untertürkheim core plant, amongst others for the expansion of engine production. The Bremen plant's capacities will be increased with around 750 million euros. Further investment also goes to the Rastatt compact car plant, where the fully-electric B-Class electric drive has been seamlessly integrated into series production. The new manufacturing organization Mercedes-Benz Operations (MO) is based on global production networks and centralized responsibility for logistics and quality. \"Under our previous production structure, the individual plants operated largely autonomously. Now, manufacturing will be organized according to product architectures, independent of individual locations,\" explained <mark>Schäfer</mark>. These product architectures comprise the rear-wheel drive architecture (MRA), the front-wheel-drive architecture (MFA), the architectures for SUVs (MHA) and sports cars (MSA) as well as the powertrain architecture (MPA) The MRA production network (S -, E -, C-Class) is led by Andreas Kellermann, who was previously head of the Bremen plant. Michael Göbel is now in charge of global compact car production (A -, B-Class, CLA, GLA and in the future CLA Shooting brake), having previously overseen roadster production in Bremen. Production of SUVs (M -, R -, GL -, and G-Class) and sports cars (SL, SLK) is the responsibility of Jason Hoff, who also retains his existing role as President and CEO of Mercedes-Benz U.S. plant in Tuscaloosa/Alabama (MBUSI). Peter Schabert, who has been responsible for global powertrain production since 2010, will continue in this position unchanged. Each vehicle and powertrain architecture will draw on a system of modules and components. The new C-Class is the first model series to be built entirely in accordance with this principle. The C-Class is Mercedes-Benz's highest-volume model series and went into production on four continents within just six months earlier this year: Bremen came first in February, followed by the East London plant (South Africa) in May, the Tuscaloosa plant (USA) in June, and the BBAC plant in Beijing (China) in July. Within the global production network, Bremen is the lead plant and manages all aspects of C-Class production, from the tooling strategy and quality assurance to the training of colleagues from other sites worldwide. The company is thereby ensuring that the highest standards are met at all production sites right from the outset. Around 500 employees from plants outside Germany have received intensive training so that, as multipliers, they can pass on their knowledge within their home plants. \"Our German passenger car and powertrain plants form the backbone of our global production network. The achievements of the teams in all four plants are second to none: they have done an outstanding job in launching the C-Class at four sites in such a short space of time,\" stated <mark>Schäfer</mark>. Making sure that every production facility delivers the high quality that is synonymous with the Mercedes-Benz brand is just one aspect of the redefined quality management function. \"Our quality remit covers every area of Mercedes-Benz Cars, from product development to customers,\" said <mark>Schäfer</mark>. He believes that providing innovative manufacturing processes is also a part of quality management: \"It means our designers and developers are able to launch exceptional vehicles that are equipped with leading technologies .\" Another key factor in the new organization is centralized supply chain management, in which all stages of the supply chain must be seamlessly integrated, from the supplier right through to the end customer. \"We still face great challenges in this field, at the same time there is also huge potential for reducing costs and increasing efficiency,\" explained <mark>Schäfer</mark>. Global production networks bring Mercedes-Benz closer to the different markets and customers and enable it to respond more quickly to changes in demand, because production can be adjusted in individual plants. At the same time, manufacturing in other currency areas enable exchange rate volatility to be evened out. \"Given the expanding range of models, steadily increasing unit figures, and greater complexity than ever before, we have to become significantly more flexible,\" said <mark>Schäfer</mark>. This includes having different variants on the same assembly line, factory equipment being used for several vehicle generations, and working hours that can be varied depending on demand. By standardizing and modularizing its plants, Mercedes-Benz intends to contain the level of capital expenditure needed and reduce fixed costs. \"It is essential that we achieve continuous improvement in all disciplines and raise our productivity,\" added <mark>Schäfer</mark>. The expansion of alliances, establishment of joint ventures, and use of capacity at contract manufacturers play an important role in Mercedes-Benz's growth strategy. At the end of June, Daimler announced that it was setting up a production joint venture with the Renault-Nissan alliance, stepping up their existing cooperation. The partners intend to build a new generation of compact cars at a new factory in Aguascalientes, Mexico, which will have a total annual production capacity of 300,000 units. <mark>Schäfer</mark> focuses on transparency and a collaborative working relationship across all hierarchy levels, both in the company as a whole and in his own organization: \"A high-performance organization depends on the motivation of all employees. The human factor makes the difference .\" Goodyear's Georges Feider notes the benefits and challenges of truck tire development live at 4 hours ago 120,000 Porsche cars delivered to customers worldwide 4 hours ago All-new Opel 2.0 CDTI: New generation large diesel debuts in Paris Automotive World is a leading provider of automotive industry information. Our news, analysis, research and forecasts have been informing the decisions of automotive stakeholders, including all of the world's major vehicle manufacturers, since 1992. Automotive Megatrends is the events division of Automotive World, the leading provider of premium automotive industry information. Our aim is to connect and inform the stakeholders who are shaping the global automotive industry of tomorrow. 1 - 3 The Washington Building Stanwell Road Penarth CF64 2AD"}, {"articleID": "2017092404_00244124_W", "names": {"David Johnston": ["Q16730377", "Q21066672", "Q28102004", "Q3018164", "Q41564", "Q43132128", "Q43394930", "Q5235710", "Q5235711", "Q5235712", "Q5235713", "Q5235714", "Q58338670"]}, "date": "2017-09-24", "url": "http://www.financialexpress.com/world-news/canadian-pm-justin-trudeau-melania-trump-prince-harry-inaugurate-invictus-games/868214/", "content": "The eight-day event, established in 2014 by Prince Harry, includes over 550 injured soldiers and veterans from 17 countries competing in 12 adaptive sports, reports Efe news. (Reuters) Top News Big relief for consumers: Prices of FMCG products falling after GST rollout Bihar Police Constable Admit Card 2017: CSBC releases admit cards; how to download it from official website csbc. bih. nic. in Subramanian Swamy says economy is heading for depression, claims warning govt last May Canadian Prime Minister Justin Trudeau along with US First Lady Melania Trump and UK's Prince Harry inaugurated the Invictus Games for military veterans with disabilities or injuries here. The eight-day event, established in 2014 by Prince Harry, includes over 550 injured soldiers and veterans from 17 countries competing in 12 adaptive sports, reports Efe news. This event marked the first solo foreign trip for Melania Trump. Prior to the official opening of the third edition of the Invictus Games on Saturday evening, Melania Trump met Prince Harry for the first time. She invited Prince Harry to visit the White House at \"any time\". Melania Trump also met with Trudeau, his wife, Sophie-Gregoire, and their three children prior to the event. Afterwards, Melania Trump held a reception with the approximately 100 US competitors participating where she said: \"On behalf of my husband and our entire country, I want to thank you and your families for all you have sacrificed to keep us safe .\" The opening ceremony of the Toronto Invictus Games also saw Prince Harry meet with his girlfriend, American actress Meghan Markle. Markle, who resides in Toronto, attended the opening ceremony but did not sit with Harry. The American actress witnessed the opening ceremony sitting several rows behind, whilst Ukrainian President Petro Poroshenko and his wife Maryna; the Trudeau couple, Melania Trump, Prince Harry and Governor General of Canada <mark>David Johnston</mark>, and his wife Sharon sat together in the VIP area. The Canadian Prime Minister said: \"The Invictus Games are a unique and powerful way to honour those who have sacrificed so much on behalf of their country .\" They represent the best and deserve our gratitude forever. Over the next eight days, the Invictus Games will put the spotlight on the strength and resilience that characterized their service. Sophie and I wish every competitor the best of luck. \"The 2017 Invictus Games will conclude on September 30."}, {"articleID": "2013040902_00034175_W", "names": {"Lance Armstrong": ["Q2172", "Q6483312"]}, "date": "2013-04-09", "url": "http://theglobeandmail.com/sports/hockey/canada-dominates-russia-to-advance-to-final-at-world-hockey-championship/article10924011/?cmpid=rss1", "content": "canada's meghan agosta-marciano celebrates a goal from haley irwin as russian goalie anna prugova flops helplessly. (adrian wyld/the canadian press) / header> canada's meghan agosta-marciano celebrates a goal from haley irwin as russian goalie anna prugova flops helplessly. canada dominates russia to advance to final at world hockey championship roy macgregor ottawa - the globe and mail in news equal to the recent scientific revelation that ice is actually frozen water, canada and the united states will meet tuesday in the gold-medal game of the women's world hockey championship. it was, of course, never in doubt. canada defeated russia 8-1 monday night in front of 7,255 fans at scotiabank place in a game noteworthy for the fact that the winning goaltender outscored most of her opponents. u.s. advances to women's world hockey final with win over finland hockey russia revelling as team on the rise rachel brady team canada's szabados stands tall against women and men hayley wickenheiser, women's national ice hockey team captain and four-time olympic medallist walks the runway in the heart truth fashion show, part of toronto fashion week in toronto, on thursday, march 21, 2013. hayley wickenheiser walks the runway canadian goaltender shannon szabados picked up an assist on the opening goal when, 19:14 into the opening period, she sent a puck up ice to meaghan mikkelson, who gave it to haley irwin for a shot that bounced before skipping over the outstretched stick of russian goaltender anna prugova. prugova had been brilliant up to that point, stopping 19 of the 20 shots she faced as play was almost totally in the russian end. the canadians, while controlling play, seemed unable to convince the puck to cross the russian goal line. the dam broke early in the second period, however. moments after russia's captain, and best player, yekaterina smolenstseva put a hard shot off szabados's right post, the canadians scored again when natalie spooner was able to squeeze a shot in the short side. canada went up 3-0 when marie-philip poulin backhanded a rebound past prugova and 4-0 on a long blast from just inside the russian blueline by jennifer wakefield, the star of canada's 3-2 shootout victory over the americans in team canada's opening match of the tournament. the russians finally scored just past the game's halfway point when defender svetlana tkachyova took a shot through a screen that eluded szabados. soon, however, goals by jayna hefford and poulin, with her seventh of the tournament, had canada far out in front. third-period goals by meghan agosta-marciano and rebecca johnston - on replacement goaltender yulia leskina - were unnecessary. canada outshot russia 49-18. earlier monday, the united states defeated finland 3-0 to advance to the gold-medal match. the highlight of the game was not the shutout but the play of finnish goaltender jessie vetter, who kept the score respectable compared to the 8-0 drubbing canada had delivered the finns in the opening round. finland and russia will play for the bronze medal earlier in the day. as has been the case in every olympic and world competition, the disparity in competition had become a major issue by the time the medal round began. team sweden, which had showed promise at the turin games in 2006, when it beat the americans in the swedish miracle on ice to meet canada in the gold, showed very poorly in this tournament. the host team had skated with its own controversy since it opened the tournament wearing the black-and-yellow colours of a worthy charity founded by an unworthy, <mark>lance armstrong</mark>, whose name will forever be a euphemism for cheating in sports. after the canadians defeated the swiss 13-0 in a humiliating sacking, they erroneously tried to defend the overkill by claiming switzerland had not started its best goaltender - forgetting, it seemed, that the canadians had blasted an astonishing 79 shots at the two unfortunates who played that night. there are many unwritten rules to the game at all levels, and they range from you never, ever give a butt end to you should never, ever run up the score. there is also much good to be said about the 2013 women's world championship. first and foremost would be the impressive number of young players in the stands - young women who might one day wear the red and white (not the black and yellow of livestrong) of the national team or, for that matter, the colours of other hockey nations. second would be the strides taken by russia, an embarrassing also-ran in previous world championships. the russians did not fare well against the canadians, but they did win other games and impressed with how much they had developed in a year. the competition issue was highlighted in vancouver in 2010, when ioc president jacques rogge said women's hockey would need to become more competitive if it hoped to maintain its position in the winter games. \"it was a little shot from jacques to us,\" international ice hockey federation president rene fasel said monday. the iihf's reaction was to put two million swiss francs (about $2.2-million canadian) into women's hockey development. a mentor program, mostly featuring canadian coaches and players, has been in place for a year. asked if there was a genuine concern that women's hockey could be killed, fasel shrugged and said, \"you never know - they kicked wrestling out .\" but, he added, in his opinion, \"there is no danger .\" fasel pointed out that in the 1928 winter games that the canadian men whipped switzerland by that same 13-0 score that the canadian women beat switzerland this week. it took 78 years, but in turin in 2006, the swiss men beat the canadian 2-0. the question, of course, is will the women be shown such patience? women's world championship young guns step up for canada at world championhsips globe unlimited unparalleled journalism. unflinching insight. unlimited access to canada's #1 newspaper site. disclaimer? copyright 2013 the globe and mail inc. all rights reserved. we've run into a glitch. please try again later."}, {"articleID": "2011051523_00006071_W", "names": {"Ana Rocha": ["Q16490009", "Q46542407", "Q4750486", "Q47786590"]}, "date": "2011-05-15", "url": "http://fox4now.com/story/14649071/host-a-french-student-this-summer", "content": "serving drinks on fort myers beach: can it soon be a reality for all bars? another allegation of police brutality in cape coral connie mack hosts annual military college event lehigh acres students banned from field day confederate license plates could be headed to florida memorial for bicyclist killed on sanibel causeway smoking policy discrimination at bingo hall? fuel prices rise for businesses; cost gets passed along to you confederate license plates could be headed to florida memorial for bicyclist killed on sanibel causeway lehigh acres students banned from field day fort myers man says collier deputies need to be held accountable smoking policy discrimination at bingo hall? how would you like to host a french foreign-exchange student at your house for a few weeks this summer? host families are needed to give room and board to students between the ages of fifteen and seventeen years old. students need a place to stay for three weeks in july, though field trips are scheduled for the students through the exchange program called world exchange. you don't have to have teens at home to apply. organizers say this is a great opportunity for the students to learn the american way of life. \"for most of them it is a dream come true to live in the united states and live with a family and they still want to come to the us in the future and build their lives here,\" world exchange state program director <mark>ana rocha</mark> said. \"i think it's a good experience not only for the kids but for the families too, to get somebody from another country to show them our way of living,\" howard edwards said, with the world exchange. some of the kids have had such a great experience staying with the host families last year they are coming back again this summer. if you'd like more information, contact <mark>ana rocha</mark> 239-689-1876 or 313-3117. her email address is"}]