[{"date": "2019-04-16", "url": "http://www.westerntelegraph.co.uk/news/national/17576445.francois-henri-pinault-the-fashion-mogul-married-to-the-hollywood-star/", "content": "Francois-Henri Pinault--the fashion mogul married to the Hollywood star By Press Association 2019 Salma Hayek and Francois-Henri Pinault 0 comment Married to Hollywood star Salma Hayek and the son of a French business mogul, Francois-Henri Pinault has become one of the most important figures in the luxury goods industry and a regular on the front row of catwalk shows. He began his career at his father Francois Pinault's company Pinault Distribution, which later became PPR and then Kering, in 1987 and is now its chairman and chief executive. Under his leadership the group sold off its retail assets including La Redoute and Printemps and merged with the Gucci Group, which oversees luxury brands including Gucci, Yves Saint Laurent and <mark>Alexander McQueen</mark>, to become one of the biggest players in high-end fashion. Francois-Henri Pinault and Salma Hayek attending the British Fashion Awards in 2015 (Ian West/PA) He changed the name of the group from PPR to Kering in 2013 in reference to his Breton roots. Mr Pinault, 56, has been president of his family's investment firm, Groupe Artemis, since 2003, and it is this group that will donate funds to help restore Notre Dame Cathedral after it was devastated by fire. In a statement obtained by French newspaper Le Figaro, he said: \"My father (Francois Pinault) and myself have decided to release a sum of 100 million euro from our Artemis funds (the family holding company) to participate in the effort that will be necessary for the complete reconstruction of Notre Dame .\" Mr Pinault married Hayek in Paris in 2009 and the couple have an 11-year-old daughter named Valentina. He was previously married to Dorothee Lepere and dated supermodel Linda Evangelista. 0 comment", "articleID": "2019041608_00541235_W", "names": {"Alexander Mcqueen": ["Q207939", "Q21014274"]}}, {"date": "2019-04-16", "url": "http://www.startribune.com/fox-draws-nearly-2-6-million-viewers-for-sanders-town-hall/508654242/", "content": "Fox draws nearly 2.6 million viewers for Sanders town hall By DAVID BAUDER Associated Press April 16, 2019--2:50 pm Purchase: Order Reprint NEW YORK--Sen. Bernie Sanders took heat from some Democrats for holding a town hall on Fox News Channel but there's one result hard to argue with: it was the most-watched candidate event in the election campaign so far. An estimated 2.55 million people saw Sanders' town hall Monday in Bethlehem, Pennsylvania, the Nielsen company said. Not only did that beat the 1.35 million people who saw Sanders on CNN on Feb. 25, the Fox telecast aired before prime time when traditionally the largest audience gathers. Sen. Kamala Harris' CNN town hall in January was seen by 1.95 million viewers, the previous high for a 2020 presidential contender. The Vermont senator also apparently had one prominent viewer in Washington. President Donald Trump tweeted on Tuesday that it was \"so weird to watch Crazy Bernie\" on Fox News. He said Bret Baier, who co-anchored the event with Martha MacCallum, and the audience was \"so smiley and nice .\" Baier later tweeted his thanks to Trump for watching, and said he'd like to have the president on a town hall or for an interview on his nightly news show. \"We cover all sides,\" Baier said. While Trump is a frequent interview subject on Fox, he tends to avoid newsier personalities like Baier and <mark>Chris Wallace</mark>. During the town hall, Sanders noted the blowback he'd gotten from some Democrats for appearing on Fox and took a few shots at the network, at one point drawing a rebuke from Baier. \"We are very grateful that you're here,\" Baier said. \"We are giving you an hour of substance and talk on our airwaves so we can get over the Fox thing, if you're alright with that,\" he said. Fox says it is in talks with other Democrats to have town halls on the network, but hasn't said who. Democratic National Committee head Tom Perez said earlier Monday that the organization was not reconsidering its decision in February not to hold any of its upcoming debates on the network. He was responding to a question from Fox's Bill Hemmer about upcoming debates, which the DNC has scheduled on NBC News and another on CNN. Fox chose not to preempt its opinionated prime-time lineup of Tucker Carlson, Sean Hannity and Laura Ingraham to show Sanders on Monday. The prime-time hosts spent relatively little time on the Sanders appearance that had preceded their shows. \"You saw crazy Bernie on the air tonight,\" Hannity said during his monologue. \"That was hard to watch...Let's hear every communist idea we possibly can .\" Ingraham had Trump aide Larry Kudlow on her show, and asked him to respond to a passage in the town hall where Sanders said that the economy was improving well before Trump took office. More from Star Tribune", "articleID": "2019041620_00430229_W", "names": {"Chris Wallace": ["Q21256789", "Q2964884", "Q2964885", "Q37624906", "Q5108402", "Q5108404"]}}, {"date": "2019-04-17", "url": "https://www.kmuw.org/post/tiger-woods-biographer-says-golfers-masters-comeback-transcends-sports", "content": "Tiger Woods Biographer Says Golfer's Masters Comeback \"Transcends Sports' By <mark>Dave Davies</mark> • 4 hours ago Share Tweet Email Listen Listening.../ <mark>DAVE DAVIES</mark>, HOST: This is FRESH AIR. On the last hole of the Masters Golf Tournament Sunday, Tiger Woods made sports history when he stood over a two-foot putt on the 18th green. (SOUNDBITE OF ARCHIVED RECORDING) JIM NANTZ: Many doubted we'd ever see it, but here it is. (CHEERING) NANTZ: The return to glory. (CHEERING) <mark>DAVIES</mark>: Woods' fifth Masters title at age 43 followed a 10-year drought of major tournament victories and completed a remarkable comeback from a personal scandal that all but ruined his reputation and back surgery that left him unable to swing the club at all. For some perspective on Woods' career and his achievement, we turn to Jeff Benedict. He's the author, with Armen Keteyian, of a widely read biography published last year called\" Tiger Woods. \"It's now out in paperback. Well, Jeff Benedict, welcome to FRESH AIR. Tiger Woods dominated golf like nobody ever - like few people dominate anything, really. Give us a sense of how he was trained for this life and skill. How - you know, how young was he when he started learning golf? JEFF BENEDICT: I think it's fair to say Tiger was 2 years old when he really started to learn golf. He was 1 when he started watching his father play golf or practice golf in the garage. And that was a daily regimen, where he would sit there and watch his father putt. By the time he was 2, Tiger was putting and starting to practice and learn things with his dad. He was in golf all the time. By the time Tiger's 12 or 13, there's some really intense training going on that goes beyond what most parents would deem appropriate. Earl would do things like - they were demeaning. I mean, he would call Tiger very demeaning names, names that I can't use on the air. It was an attempt to put him down or break him down in a mental way and an emotional way while Tiger was practicing. It was intended to toughen him and really prepare him for what was ahead. They had a code word between the two of them. The word was enough. And Tiger was to use that word if his father ever pushed him too far. He never used that word. <mark>DAVIES</mark>: His dad, Earl, was African-American. His mom, Kultida, was Thai. And Earl would sometimes yell racial epithets at Tiger. Was that to prepare him for a racist world that he would encounter? BENEDICT: I think part of the reason he used those epithets was because Earl had a really good understanding of where his son was going. He knew that where Tiger was going was the country club set. When he was a young boy and a teenager - Tiger, that is - Earl was constantly looking for ways to help his son beat the country club kids who had all the advantages of wealth and socioeconomic status. And so part of that, those racial epithets - yeah, he - that's part of what's factored into it. Tiger would be competing on golf courses as a teenager where there were no kids of color. There were no parents of color. There was just nobody of color at these clubs. And then this boy would walk out onto the course, and all eyes would be on him because he was - not only did he look differently than everybody else, but he was so much better than everybody else. And there's a tremendous amount of pressure - emotional pressure that comes with that. And Earl was trying to put a shield or forcefield around his son that would enable him to cope with that when he reached the PGA tour. <mark>DAVIES</mark>: When he joined the PGA Tour - there are a lot of ways to measure this - how good was he? BENEDICT: He arrives like a comet. I mean, if you think about it, in 1997, he hasn't been on the tour for a year yet, and he goes to the Masters and wins by a record margin. I mean, you're talking about a boy basically, right? He's just come out of college as a sophomore. And he doesn't just win the Masters. He trashes the Masters. He completely annihilates the field. His driving distance off the tee is so much farther than everybody else. It's a bit like watching a bionic man hit a golf ball. And everybody's watching this going, this is the future. I mean, this kid's just got here. You're - everybody's playing for second place. I mean, he - that's how he arrived. <mark>DAVIES</mark>: You know, I read in your book about that Masters in which he made history by setting course records and tournament records that - you know, a major golf tournament is 72 holes. The first nine holes, he played horribly. He would have been sent home except he turned it around after nine and refocused. This is remarkable. BENEDICT: It is, and I think that that's one of the reasons that to this day, Tiger Woods gives tremendous credit to his father. There is a bond between them. There's a reason for that iconic moment at the end of that Masters where Earl and Tiger are embracing and crying into each other's shoulders and expressing, I love you to each other. It's - that was sort of the culmination of the 18 years of grinding, driving training between Earl and Tiger. And it paid off with that Masters. It's - that's the role really of Earl that you saw come out in Tiger. He was there for that Masters. And frankly, he shouldn't have been because Earl was ill, and he was - his doctor advised him not to go. But he went, and he had a role in helping Tiger turn it around mentally. <mark>DAVIES</mark>: Tiger Woods had a remarkable career as a professional. I want to talk about, though, what his body went through. It's interesting, you know? You see some golfers - and I play the game a little. And you see some golfers who have a nice, relaxed swing, and the ball just takes off like a rocket. But Tiger didn't. I mean, every time he swung a club, even one of the shorter clubs, it was just an explosion of impact. Tell us a bit about what his body went through and the toll that it took on him - all the practice and play. BENEDICT: I think that the best way to describe or differentiate Tiger's - not only his swing but his approach to golf is this - that when he first joined the PGA Tour in' 96, the adjective that was used to describe his swing was violent. Violent is not a word you typically associate with golf. I mean, that's a word for football or boxing. But Earl was all about weaponizing his son. When Tiger struck the ball, it was like an explosion. His high school girlfriend told us that the first time she witnessed Tiger drive a ball at a driving range, it felt and sounded like a rocket taking off. Now, over time, his swing coach Butch Harmon was concerned that that violent torque of a swing on his back was going to have some negative consequences. They were actually trying early on to tone it down. Even his youth instructor was trying to get him to not swing so hard and so violently. But on the other hand, that was part of who he was and part of what made him great. But it did take a toll. <mark>DAVIES</mark>: And he finally got - what? - spinal fusion surgery. What does that mean? What did it mean for him? BENEDICT: The fourth and final back surgery that Tiger Woods had was a spinal fusion surgery. And, you know, there was a lot of question as to whether that would work, whether he'd be able to return. Most experts and prognosticators predicted that he would never play again. The thing is, as you - everybody underestimates who this man is and how this man was made. And I'm talking more now about - not about how he was built physically, but I'm talking about how he was built mentally. And there's things like determination and grit that Tiger possesses and to a degree that I think really separates him from everybody else. And I don't just mean the other golfers on the PGA tour. I'm talking about athletes in general. He's a rare world-class athlete that has grit and determination and a pain threshold that just - it's unlike any athlete that I've seen or written about. <mark>DAVIES</mark>: Jeff Benedict is the author with Armen Keteyian of the book\" Tiger Woods. \"It's now out in paperback. We'll continue our conversation after a short break. This is FRESH AIR. (SOUNDBITE OF MUSIC) <mark>DAVIES</mark>: This is FRESH AIR, and we're speaking with Jeff Benedict. He is the author with Armen Keteyian of the biography\" Tiger Woods, \"which is now out in paperback. His marriage exploded in a scandal in 2009 - turned out he'd had multiple extramarital affairs. And in general, it's fair to say looking at this biography that he's - was in many ways not the most admirable person. I will say I'd give some slack to people who get fame and wealth at a very young age. I mean, a lot of us do stupid things when we're young, and we just don't have the means and the attention for them to be so noticed. How much has he changed? What's your sense of that? Is he different towards other players, fans, other relationships? BENEDICT: I think he's evolved. He's evolved a lot over time. He's in his 40s now. He's been through more than - it's hard to actually find someone on the planet that's been through things comparable to Tiger because of the fame he had. So when he made the mistakes that he made, we all watched them in real time. And it was a colossal fall from grace. He was mimicked. He was mocked. He was criticized. He was made fun of. He was the butt of jokes on late night television. Where I think this changed was the way he dealt with that. I've never seen a public figure respond to controversy the way he did. He faced the cameras. He answered the tough questions. He didn't run and hide. He took it, and he took it in a way that I think impressed people. People might not have been impressed with what he did, but the way he responded to it, I think, was the beginning of a change. And then you had that 10-year period from 2009 when he had the car accident until 10 years later where he was - went through all the injuries. And now what you're seeing is he's a father with children. He's a super dedicated dad. He's got his career back. He thought he'd never play again. Now he's playing again. He's got his health back and his mobility. And I think he looks at everything differently. He looks at the game differently. He looks at life differently. You can see it. There's a genuineness to the way he is engaged with people now. This is not an act. It's not the nasty thing you saw 15 years ago when he was at the pinnacle of his game. What you're seeing now is a guy, I think, who loves what he's doing. To me, that potentially makes him more dangerous. As long as he stays healthy, he could be really hard to beat over the next few years. <mark>DAVIES</mark>: So what he did last weekend, winning the Masters at age 43 after debilitating surgery and his - you know, the blow-up of his career - how big is this in the annals of sports? BENEDICT: It could very well go down as the greatest comeback in the history of sports. What he came back from is unprecedented because of just how far he'd fallen. This wasn't just, you know, a decent golfer who had some public humiliation. This was the greatest golfer of all time. This was one of the greatest athletes in history who had an incredibly precipitous fall that took him right out of the game. It turned his life upside down. And we all watched it. And then it culminated with a series of injuries that took him out of the sport entirely. People didn't expect him to ever play again, let alone come back and do something like win the Masters. The reason it's doubly great is because this is a comeback story that transcends sports. We all know what's happened to him in his private life because it played out so publicly. And so the message of Tiger's life, I think, has become, you know, just because you're down doesn't necessarily mean you're out. And that's a message that resonates with a lot of people who may not even care about golf or sports in general. I think that there's a lot of people that have watched this. And the reason they've been inspired by it is because they got introduced to him after the scandal. And that's when they realized, oh, this was the great golfer; look what's happened to him. And now they see that he's turned all that around, and he's gotten it back. <mark>DAVIES</mark>: Jeff Benedict, thanks so much for speaking with us. BENEDICT: Thank you. <mark>DAVIES</mark>: Jeff Benedict is the author with Armen Keteyian of the 2018 book\" Tiger Woods. \"It's now out in paperback. It's baseball season, and on tomorrow's show, we learn about fastballs, curveballs, screwballs and spitballs from New York Times national baseball writer Tyler Kepner. He talked to hundreds of pitchers about what they throw and how they try to get a mental edge over the hitters they face. His new book is\" K: A History Of Baseball In Ten Pitches. \"Join us. (SOUNDBITE OF ANTONIO ADOLFO'S\" MILESTONES \") <mark>DAVIES</mark>: FRESH AIR's executive producer is <mark>Danny Miller</mark>. Our technical director and engineer is Audrey Bentham. Our associate producer for digital media is Molly Seavy-Nesper. Thea Chaloner directed today's show. For Terry Gross, I'm <mark>Dave Davies</mark>. (SOUNDBITE OF ANTONIO ADOLFO'S\" MILESTONES \") Transcript provided by NPR, Copyright NPR. Share Tweet Email", "articleID": "2019041800_01020940_W", "names": {"Danny Miller": ["Q1164698", "Q3015284", "Q3015285", "Q42823193", "Q5220627"], "Dave Davies": ["Q364890", "Q5228642"]}}, {"date": "2019-04-18", "url": "https://www.euronews.com/2019/04/18/ivanka-trump-passed-on-world-bank-job", "content": "Ivanka Trump passed on World Bank job By Euronews with Associated Press • last updated: 18/04/2019 - 08:13 Ivanka Trump on April 17, 2019. - Copyright Text size Aa Aa Ivanka Trump has confirmed that she passed on the job of World Bank chief after her father asked her if she was interested. The US President's daughter is currently a White House senior adviser. She told the Associated Press on Wednesday that her father raised the job \"as a question\" and that she told him that she was \"happy with the work\" she's doing. <mark>Donald Trump</mark> told The Atlantic last week that he considered his daughter, Ivanka, for the top position at the World Bank. \"She would have been great because she's very good with numbers,\" he explained. Instead, she worked on the selection process for the new head of the World Bank, David Malpass, whom she said would do an \"incredible job. The US and Europe have a long-standing agreement that the US has the right to select the head of the World Bank while the head of the International Monetary Fund is usually European. Share this article", "articleID": "2019041809_01377712_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-04-23", "url": "https://www.oann.com/blackrock-will-not-back-bayer-management-in-agm-vote-sources/", "content": "FILE PHOTO: The company logo and trading information for BlackRock is displayed on a screen on the floor of the New York Stock Exchange (NYSE) in New York, U.S., March 30, 2017. REUTERS/Brendan McDermid April 23, 2019 By Simon Jessop and Ludwig Burger LONDON/FRANKFURT (Reuters)--Bayer's largest shareholder, fund manager BlackRock, will not support the German company's management in a key vote at its annual general meeting (AGM) on Friday, two people familiar with the situation told Reuters. About 30 billion euros ($34 billion) has been wiped off the pesticides and drugs firm's market value since August, when a U.S. jury found Bayer liable because Monsanto, which it bought for $63 billion last year, had not warned of alleged cancer risks linked to its weedkiller Roundup. Bayer suffered a similar courtroom defeat last month and more than 11,000 plaintiffs are claiming damages. BlackRock, which latest filings show owns 7.2 percent of Bayer's voting rights, plans to either abstain from or vote against ratifying the management board's actions during the year under review, the sources said. The largely symbolic vote of confidence \"will send a message to the board\" that BlackRock is not happy with the way Bayer's management handled the Monsanto deal, one of the sources said. Recent defeats in U.S. courts, which Bayer is appealing, have shed a new light on Bayer's assessment of the legal risks it took with the Monsanto deal, the source added. A vote to ratify the board's actions features prominently at every German AGM. It has no bearing on management's liability, but is seen as a key gauge of shareholder sentiment. Bayer's management, led by CEO <mark>Werner Baumann</mark>, could see an embarrassing plunge in approval ratings, down from 97 percent at last year's AGM https: //www.investor.bayer.de/en/events/stockholders-meeting/asm-2018, which was held shortly before the Monsanto takeover was closed in June. Asset management firm Deka, among Bayer's largest German investors, said over the weekend it would vote against ratifying management's action, having voiced sharp criticism earlier this month. Also this month, shareholder advisory firms Institutional Shareholder Services (ISS) and Glass Lewis recommended investors not to give the executive board their seal of approval. Singapore state investor Temasek and Norway's oil fund, Bayer's next two biggest shareholders after BlackRock, both declined to comment on their voting intentions. Major Frankfurt-based asset managers DWS and Union Investment also would not disclose their plans. Approval ratings of more than 95 percent have long been the norm at German AGMs but international investors have become more critical over recent years. In a recent low for a company leadership team, former Deutsche Bank co-CEOs <mark>Anshu Jain</mark> and Juergen Fitschen scored approval ratings of 61 percent during the bank's 2015 AGM. Both announced their resignation within weeks. Company filings showed this month that Bayer's supervisory board sought law firm Linklaters' expert opinion for reassurance that management had complied with its duties when acquiring Monsanto. Non-executive Chairman Werner Wenning has come out in strong support of the top executive team and its decision to pursue the Monsanto deal. Sources have said the Wenning himself was a driving force behind the transaction. The U.S. Environmental Protection Agency, the European Chemicals Agency and other regulators across the globe have found that glyphosate, the active ingredient in Roundup, is not likely carcinogenic to humans. However, the World Health Organization's cancer arm in 2015 reached a different conclusion, classifying glyphosate as \"probably carcinogenic to humans .\" (Additional reporting by Patricia Weiss, Anshuman Daga and Terje Solsvik; Editing by <mark>Alexander Smith</mark> and <mark>Mark Potter</mark>)", "articleID": "2019042317_00270469_W", "names": {"Alexander Smith": ["Q16847036", "Q43913590", "Q4717808", "Q4717809", "Q4717810", "Q59388956"], "Anshu Jain": ["Q27929708", "Q569798"], "Mark Potter": ["Q6769304", "Q6769305"], "Werner Baumann": ["Q15430152", "Q15854029", "Q20752068", "Q40167560"]}}, {"date": "2019-04-23", "url": "http://feeds.thehollywoodgossip.com/~r/TheHollywoodGossip/~3/yAHBZq-Zj-Y/", "content": "Without any major battles scenes or surprising deaths on Game of Thrones Season 8 Episode 2, viewers really had just one thing to which they could respond with shock and awe on Sunday night: Maisie Williams...got...naked! Kind of. Sort of. We didn't really see any parts that were especiallty private when Williams, as the character of Arya Stark, stripped down to engage in her first-ever sexual experience with a truly stunned Gendry. The character figured she only had hours left to live, due to the impending arrival of the Night King's army, and wanted to know what intercourse felt like before she was crossed off someone else's list. A pretty understandable reaction to near-certain death, right? And the way Arya went about seducing Gendry (basically ordering him to take his clothes off and just do her already) was true to the strong woman she has become...... and yet a debate has been raging on the Internet over this sex scene. Was it empowering? Or was it uncomfortable and sort of gross? Those who take the side of \"Yech, disgusting!\" are reacting that way because Williams started on Game of Thrones when she was 14. We met Arya when the character was 11. So Arya is 18 years old now (of consenting age, we presume, in Westeros) and Williams is 22. Neither age is really too young for sex, yet many social media users have been complaining all week that the scene was \"weird\" or \"uncalled for .\" (These same people have been oddly silent about all the incest on the series. But let's not digress too far here .) Clearly aware of the backlash online, the actress took to Twitter on Tuesday and put an end to it as follows. This is what she wrote: \"if u feel uncomfortable just know that my mother and my step dad and my 2 sisters and my 4 brothers have all probably watched this too ahahakillmeehehe .\" HA! We love it. Previously, Williams admitted in an interview that she thought the Arya sex scene was written as a \"prank\" when she first read it in the script. But it was obviously very real. Said the star to Entertainment Weekly after the episode aired: \"This is something she's stayed away from, an emotion we've never really seen her engage with. [The series creators] were like,\" It's the end of the world, what else would you have her do?' \"This may be is a moment where Arya accepts death tomorrow, which she never does...\"So, it was that moment where she says,\" We're probably going to die tomorrow, I want to know what this feels like before that happens .' \"It's interesting to see Arya be a bit more human, speak more normally about things people are scared of .\" As you can see below, meanwhile, Williams' best friend on the show, <mark>Sophie Turner</mark>, definitely saw no problem at all with the scene: <mark>Sophie Turner</mark> on Maisie Williams Sex Scene We repeat: HA! \"In honor of Easter, I guess Game of Thrones wanted the storyline to have a little Easter bunny hop-hop-hopping into that pussy. And that's the tea,\" <mark>Turner</mark> says in the above video, punctuating the line with a sip of wine. Truly amazing. The question now turns to whether Arya will survive the battle on Game of Thrones Season 8 Episode 3. We've listed her odds for doing so below: Game of Thrones: Who's About to Die!? [Unofficial Rankings By Unofficial Odds] Start Gallery Edit Delete Share on Facebook Email", "articleID": "2019042323_00307607_W", "names": {"Sophie Turner": ["Q240573", "Q735034"]}}]