[{"date": "2019-04-30", "url": "http://www.shropshirestar.com/news/crime/2019/04/30/bridgnorth-police-target-speeding-and-anti-social-drivers/", "content": "Bridgnorth police target speeding and anti-social drivers Less than an hour ago Speeding and anti-social drivers are being targeted by police in Bridgnorth after continuous reports of reckless driving. Subscribe to our daily newsletter Sign Up West Mercia Police has increased its evening and overnight patrols in the town, as well as using a number of speed monitoring devices during the day, following numerous reports of cars being driven recklessly and at speed around Innage Lane and Innage Lane Car Park over the last few weeks. Bridgnorth councillor for Castle ward, <mark>David Cooper</mark>, said the area attracted bad behaviour and suffered significant damage, particularly to the 19th century Innage Lea building, following an arson attack in late 2016. \"Innage Lane has been subject to anti-social behaviour in recent years due to the age of it and parts, especially around Innage Lea, not being developed in recent years--something which is looking like it will soon change,\" he said. PCSO Mal Goddard, of Bridgnorth Safer Neighbourhood Team, said: \"There have been reports of cars being driven at speed and in an anti-social manner in the area of Innage Lane and the Innage Lane Car Park over the last few weeks .\" Unfortunately no witnesses have been able to provide the police with any registration details of the vehicles involved. \"In an effort to deter such activity, a number of patrols have been conducted during the evening and overnight, as well as speed monitoring during the day. This activity will continue to further deter such behaviour .\" Warning notices can also be issued to the registered keeper of vehicles being driven on public roads in an anti-social manner, which in this case is defined as being driven in a manner that is, or likely to, cause alarm and harassment. \"", "articleID": "2019043005_00238946_W", "names": {"David Cooper": ["Q1174057", "Q21466815", "Q21466821", "Q24005495", "Q24005496", "Q24682145", "Q3017703", "Q30602629", "Q5232549", "Q5232551", "Q57427555"]}}, {"date": "2019-04-30", "url": "https://www.dailystar.co.uk/news/latest-news/775597/leicester-hamza-choudhury-tweets-black-people-suicide-england-arsenal-news", "content": "\"I've learned a lot as a person in my early years as a professional--certainly enough to know that some of the thoughtless comments I have made in the past are both hurtful and offensive\" Choudhury The tweets were dug up the wake of the Foxes 3-0 win over Arsenal on Sunday, during which he made his first start under new boss <mark>Brendan Rodgers</mark>. His account was then deleted shortly after the game. Choudhury has apologised and says he has matured as a person since the tweets. He said: \"I've learned a lot as a person in my early years as a professional--certainly enough to know that some of the thoughtless comments I have made in the past are both hurtful and offensive. STAR: Hamza Choudhury made his first start under <mark>Brendan Rodgers</mark> (Pic: GETTY)\" They do not represent my true beliefs. I'm deeply sorry to anyone I have offended--both at the time and since they've been recirculated. \"I've grown up a lot since then and learned a lot about life, but I accept that I have to take responsibility for the comments I have made in the past and will be a better, wiser person for it .\" A Spokesman for Leicester said: \"Hamza's approach to addressing the matter and the remorse he has expressed shows the maturity he has developed in the years that have passed since the comments were made .\" He now has a far greater understanding of the impact his words and behaviour can have and is committed to using that influence in the positive, respectful and accepting manner his more recent growth has demonstrated. \"Related articles", "articleID": "2019043016_00614982_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"]}}, {"date": "2019-04-30", "url": "http://www.oxfordtimes.co.uk/sport/national/17608689.firmino-looks-to-be-winning-fitness-race-ahead-of-barcelona-showdown/", "content": "Firmino looks to be winning fitness race ahead of Barcelona showdown By Press Association 2019 Roberto Firmino could return for Liverpool's Champions League semi-final at Barcelona 0 comment Roberto Firmino appears to be winning his fight to be fit for the first leg of Liverpool's Champions League semi-final against Barcelona. The Brazil forward, who missed last Friday's Premier League victory over Huddersfield with a small muscle tear, was included in Jurgen Klopp's 23-man squad to travel to the Nou Camp for Wednesday's first leg. Firmino featured in training as the Reds allowed media cameras into their Melwood complex for their final preparations before flying to Spain on Tuesday afternoon. A great sight for Liverpool--Firmino training ahead of Barcelona game #LFC pic.twitter.com/8msFIZ9WUq--Andy Hampson (@ andyhampson) April 30, 2019 Manager Klopp told the club's website, www.liverpoolfc.com: \"We all knew from the beginning it would be a race .\" We don't have to make a decision today because there's no game today, we can wait. It looked good so far, but I have until tomorrow to make that decision. \"Midfielder Fabinho has been passed fit after he was forced to miss the 5-0 thrashing of Huddersfield following a blow to the head in the previous game against Cardiff. Fabinho could also return for the Reds (Adam Davy/PA) Klopp said:\" Every human being needs time and he needed that time, but if the Huddersfield game had been a day later he could have played. \"Rumours that forward <mark>Mohamed Salah</mark> had suffered an injury scare proved wide of the mark as the Egyptian played a full part in Tuesday's session. Alex Oxlade-Chamberlain, who returned last week after a year-long lay-off with a knee injury, was also involved. Adam Lallana, who has been sidelined with a muscle problem, did not participate and was not included in the travelling squad. Merseyside?? Barcelona #UCL pic.twitter.com/Vn7Ymh6MNI--Liverpool FC (@ LFC) April 30, 2019 That group did include 19-year-old forward Rhian Brewster, who is building up his fitness after more than a year on the sidelines with knee and ankle injuries. The England Under-17 World Cup-winner is not expected to feature on matchday, but the experience may benefit him ahead of his expected elevation to the first-team squad on a full-time basis next season. Klopp said:\" He is the next really exciting prospect. Next season will be his season, his first real season. \"He is with us, he is our player and we want to have him around. In this case I thought,\" Come on, it's Barcelona, let's give him a first sniff'. \"0 comment", "articleID": "2019043020_00052377_W", "names": {"Mohamed Salah": ["Q1354960", "Q22109496", "Q43975293", "Q50365713"]}}, {"date": "2019-05-01", "url": "http://longisland.news12.com/story/40396397/vigil-planned-after-2-killed-4-wounded-in-campus-shooting", "content": "Vigil planned after 2 killed, 4 wounded in campus shooting Posted: Updated: (David T. Foster III/The Charlotte Observer via AP). UNC Charlotte Chancellor Philip DuBois receives a hug after a news conference regarding a deadly shooting on the campus earlier in the day, Tuesday, April 30, 2019, in Charlotte, N.C. (AP Photo/Jason E. Miczek). People gather across from the campus of UNC Charlotte after a fatal shooting at the school, Tuesday, April 30, 2019, in Charlotte, N.C. (AP Photo/Jason E. Miczek). People gather across from the campus of UNC Charlotte after a shooting incident at the school Tuesday, April 30, 2019, in Charlotte, N.C. (John Simmons/The Charlotte Observer via AP). A University of North Carolina at Charlotte campus police officer carries a tactical shield after a shooting Tuesday afternoon, April 30, 2019, in Charlotte, N.C.. The shooting on the campus left at least a...(John Simmons/The Charlotte Observer via AP). Emergency vehicles cluster on Mary Alexander Road on the campus of University of North Carolina at Charlotte after a shooting Tuesday, April 30, 2019, in Charlotte, N.C.. The shooting on the campus left at l.. . By TOM FOREMAN Jr. and <mark>SARAH BLAKE</mark> MORGANAssociated Press CHARLOTTE, N.C. (AP) - A shooting that killed two and wounded four at a North Carolina university left students scrambling for shelter and prompted fresh calls for ways to keep campuses safe. A vigil was planned for Wednesday on the campus of the University of North Carolina-Charlotte, where the shooting on Tuesday upended the last day of class. The governor vowed a hard look at what happened in order to prevent future shootings. \"A student should not have to fear for his or her life when they are on our campuses,\" Gov. <mark>Roy Cooper</mark>, a Democrat, told reporters. \"Parents should not have to worry about their students when they send them off to school. And I know that this violence has to stop ....In the coming days we will take a hard look at all of this to see what we need to do going forward .\" Campus Police Chief <mark>Jeff Baker</mark> said authorities received a call in the late afternoon that a suspect armed with a pistol had shot several students. Officers assembling nearby for a concert rushed to the classroom building and arrested the gunman in the room where the shooting took place. \"Our officers' actions definitely saved lives,\" <mark>Baker</mark> said at a news conference. Two people were killed, and three remained in critical condition late Tuesday. <mark>Baker</mark> said a fourth person's injuries were less serious. Students were among the victims, but officials would not say how many. The Charlotte-Mecklenburg Police Department identified the suspect as Trystan Andrew Terrell, 22. He's in custody with charges pending. Monifa Drayton, an adjunct professor, was walking onto campus when she heard the shots. She said she directed students fleeing the scene to take cover inside a parking deck. \"I heard one final gunshot and I saw all the children running toward me,\" she said. \"We started to get all the children pulled into the second floor of the parking deck and the rationale was if we're in the parking deck and there's a shooter and we don't know where he is, he won't have a clear shot .\" She added: \"My thought was, I've lived my life, I've had a really good life, so, these students deserve the same. And so, whatever I could do to help any child to safety, that's what I was going to do .\" The shooting prompted a lockdown caused panic across campus. \"Just loud bangs. A couple loud bangs and then we just saw everyone run out of the building, like nervous, like a scared run like they were looking behind,\" said <mark>Antonio Rodriguez</mark>, 24, who was visiting campus for his friend's art show. The suspect's grandfather Paul Rold of Arlington, Texas, said that Terrell and his father moved to Charlotte from the Dallas area about two years ago after his mother died. Terrell taught himself French and Portuguese with the help of a language learning program his grandfather bought him and was attending UNC-Charlotte, Rold said. But Terrell never showed any interest in guns or other weapons and the news he may have been involved in a mass shooting was stunning, said Rold, who had not heard about the Charlotte attack before being contacted by an Associated Press reporter. \"You're describing someone foreign to me,\" Rold said in a telephone interview Tuesday night. \"This is not in his DNA .\" Shortly after UNC Charlotte issued a campus lockdown, aerial shots from local television news outlets showed police officers running toward a building, while another view showed students running on a campus sidewalk. The university has more than 26,500 students and 3,000 faculty and staff. The campus is northeast of the city center and is surrounded by residential areas. Spenser Gray, a junior, said she was watching another student's presentation in a nearby campus building when the alert about the shooting popped up on everyone's computer screens. She said she panicked: \"We had no idea where he was...so we were just expecting them at any moment coming into the classroom .\" Susan Harden, an UNCC professor and Mecklenburg County Commissioner, was at home when she heard of the shooting. She went to a staging area, she said, to provide support. Harden said she has taught inside the Kennedy building, where the shootings occurred. \"It breaks my heart. We're torn up about what's happened,\" Harden said. \"Students should be able to learn in peace and in safety and professors ought to be able to do their jobs in safety .\" ___ Associated Press writers Martha Waggoner and Emery Dalesio in Raleigh contributed to this report. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Can't Find Something?", "articleID": "2019050105_00097229_W", "names": {"Antonio Rodriguez": ["Q19881466", "Q2857425", "Q4776927"], "Jeff Baker": ["Q331064", "Q58331138"], "Roy Cooper": ["Q16106910", "Q7372694", "Q7372695"], "Sarah Blake": ["Q2724605", "Q57826767", "Q57826777", "Q7422106"]}}, {"date": "2019-05-01", "url": "http://www.gamereactor.eu/?system=ps4&sid=3811f52c6576984cc21c4a9b2f425cd7", "content": "PS4 Dóri and Lisa are in LA to get a sneak peek at the Gearbox sequel, and we're able to share some of this with you tonight. Review Assassin's Creed Odyssey gives us Testiklos the Nut Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 14:17 The new mercenary wields the Nutcracker and is the brother of Testikles, so you can see what Ubisoft is getting at here. 0 Catherine: Full Body has a Death By Nightmare trailer Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 12:11 We also get details on the Launch Edition and the Heart's Desire Premium Edition, featuring extra tantalising goodies. 0 Power Rangers: Battle for the Grid gets new DLC Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 11:44 This adds a story mode featuring voiceovers from the original cast, as well as new characters and fresh arenas. 0 Watch 40 minutes of The Sinking City right here Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 11:05 We've been shown the first main quest of the game, so you can take a look at Frogware's title ahead of the June release. 0 Renegades reveals new Rocket League team Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 10 After a year out from the game, they've come back with the roster formerly under the Chiefs banner. 0 Operation Oracle landing in Ghost Recon: Wildlands tomorrow Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 09:54 Players are also getting a free weekend across all platforms until May 5, giving access to all the content including Oracle. 0 Wonder Boy: The Dragon's Trap hitting mobiles this month Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 09:30 We have a new trailer showing us the Android and iOS version, which has been optimised for mobile by Playdigious. 0 The eFootball. Pro League finals are on May 19 Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 09 We know three of the teams attending, and the Last Chance Group will determine who faces Celtic that day. 0 We've got a very special Borderlands 3 livestream today Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 08:49 Dóri and Lisa are in LA to get a sneak peek at the Gearbox sequel, and we're able to share some of this with you tonight. 0 Usmakabyle on controversial PES League celebration: \"I'm a little mad\" Written by David Caballero on the 1st of May 2019 at 08 The AS Monaco player showed a lot of emotion when he finally managed to beat Alex Alguacil in the semi-finals. 0 Team Sonic Racing \"actually feels like you're working with teammates\" Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 16:20 We spoke to Sumo Digital in London about the game's team-based premise, and how they've ensured it's meaningful. 0 Check out all our Team Sonic Racing gameplay Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 16:00 We tried out the multiplayer and the single-player at a recent event, and we've got some races to show you on a number of tracks. 0 Wolfenstein II, Tacoma, and more headed to Xbox Game Pass Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 15:05 Game Pass has expanded with a number of big games, all of which are landing over the next few weeks. 0 Players can earn loot during Borderlands 3's gameplay reveal Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 14:42 Tomorrow streamers will be heading into the game, and you can earn in-game items ahead of release via the ECHOcast extension. 0 Saxophonist Leo Pellegrino latest to launch Fortnite lawsuit Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 14:17 This isn't exactly the same as the other cases we've seen, but he is represented by the same lawyer as the other claims.", "articleID": "2019050114_00184518_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-05-01", "url": "http://www.eveningtimes.co.uk/news/17611457.clutha-fai-engineer-warned-bosses-of-accident-waiting-to-happen-day-before-doomed-glasgow-flight/", "content": "News Clutha FAI: Engineer warned bosses of \"accident waiting to happen' day before doomed Glasgow flight By Catriona Stewart @ LadyCatHT Columnist/reporter File photo dated 30/11/13 of emergency services at the scene of a police helicopter crash at the Clutha Bar in Glasgow. The fatal accident inquiry (FAI) into the crash that claimed 10 lives could hear from up to 85 Crown witnesses. PRESS ASSOCIATION Photo 0 comment THE engineer who worked on the Clutha helicopter the day before its doomed final flight had warned an\" accident is waiting to happen. \"Craig Booth, a licensed engineer at Glasgow Heliport, wrote the words in a handover note at the end of his shift hoping management would take heed, a court heard. Mr Booth told the Clutha Fatal Accident Inquiry (FAI) he was concerned about the workload of engineers at Glasgow Heliport. The inquiry also heard that issues with one of the fuel sensors on helicopter G-SPAO, which crashed in Glasgow on the night of November 29, 2013, were recorded on November 24. However, the observation was made on a sticky note in the base's engineer diary, rather than being formally logged in a deferred defect log. Had it been noted in the log, the fuel sensor would have had to have been replaced within three days. It was not replaced before the Police Scotland helicopter's final flight. The inquiry, at Hampden Park, has previously heard that pilot David Traill would have seen five low fuel warnings in the aircraft before it crashed into the Clutha Vaults Bar at 22.22 pm. Any pilot, the court has heard, should land within 10 minutes of a low fuel warning but the helicopter carried on to other operations following the red warnings. The court was shown Mr Booth's end of shift report, sent to colleagues at 3.53 am on November 28, 2013. In it, he wrote:\" I am extremely concerned at the way we are having to carry out in depth maintenance on our aircraft at Glasgow. \"It is an accident waiting to happen!!\" Mr Booth told the court: \"I didn't think for a moment it would be an air accident. I just wanted my management to know how I felt at the end of a very busy shift .\" Gordon Jackson QC, counsel for the family of victim Gary Arthur, said: \"You put that statement in your report and that report would go to senior management. What response did you get?\" Mr Booth replied: \"None .\" Mr Jackson went on to say: \"It's a pretty strong statement. You might have expected at least someone to discuss it with you .\" And you did expect that, but it never happened. Did you do anything about that? \"Mr Booth replied:\" Circumstances overtook. \"Mr Booth told the court that to keep on top of his workload at Glasgow Heliport he frequently went\" above and beyond, \"working additional hours and was described as\" coming off work absolutely shattered. \"A technical log entry dated July 8, 2013, was shown to the court which detailed an issue with the fuel sensor in the main fuel tank of the Police Scotland helicopter. The helicopter had been re-fueled but the level of fuel shown on a display inside in the cockpit differed from the amount in the tank. Mr Booth's end of shift report of November 28, the court heard, also stated:\" Fuel contents after refuelling drops after a period of time in main tank. \"Main fuel probe in AO bin when if [CORR] we get time to change it .\" The court was shown the technical log from November 24 to November 28 where there was no mention of the fuel sensor problem that had been recorded on the yellow sticky note in the engineer's diary. Donald Findlay, for the family of victim <mark>Robert Jenkins</mark>, questioned whether the engineer taking over on the new shift, in this case <mark>Ian Taylor</mark>, would speak to Mr Booth to go over the details of any outstanding jobs. Mr Findlay suggested Mr Booth's note in the tech log \"didn't carry any urgency\" and was \"almost a suggestion\" that the sensor might need changed. Mr Booth said: \"It's badly written by me .\" Mr Findlay added: \"This is quite important to a number of people .\" Mr Booth replied: \"Yes, I know that .\" In the afternoon the inquiry heard from licensed helicopter engineer Andrew Bochel, now semi-retired but working for Babcock. He was the engineer on duty on the day of the crash at Inverness heliport, where G-SPAO landed twice on the day in question. Pilot David Traill, 51; PC <mark>Tony Collins</mark>, 43; and PC Kirsty Nelis, 36, died along with seven customers who were in the bar, Gary Arthur, 48; Joe Cusker, 59; <mark>Colin Gibson</mark>, 33; <mark>Robert Jenkins</mark>, 61; John McGarrigle, 58; Samuel McGhee, 56; and Mark O'Prey, 44. The inquiry before Principal Sheriff Craig Turnbull continues. 0 comment", "articleID": "2019050116_00294428_W", "names": {"Colin Gibson": ["Q1108462", "Q21465575", "Q22075468", "Q5145138"], "Ian Taylor": ["Q11154675", "Q1438500", "Q14943179", "Q20877307", "Q23409808", "Q28094325", "Q57062399", "Q5983044", "Q5983046", "Q5983056"]}}]