[{"date": "2019-05-01", "url": "http://www.eveningtimes.co.uk/news/17611457.clutha-fai-engineer-warned-bosses-of-accident-waiting-to-happen-day-before-doomed-glasgow-flight/", "content": "News Clutha FAI: Engineer warned bosses of \"accident waiting to happen' day before doomed Glasgow flight By Catriona Stewart @ LadyCatHT Columnist/reporter File photo dated 30/11/13 of emergency services at the scene of a police helicopter crash at the Clutha Bar in Glasgow. The fatal accident inquiry (FAI) into the crash that claimed 10 lives could hear from up to 85 Crown witnesses. PRESS ASSOCIATION Photo 0 comment THE engineer who worked on the Clutha helicopter the day before its doomed final flight had warned an\" accident is waiting to happen. \"Craig Booth, a licensed engineer at Glasgow Heliport, wrote the words in a handover note at the end of his shift hoping management would take heed, a court heard. Mr Booth told the Clutha Fatal Accident Inquiry (FAI) he was concerned about the workload of engineers at Glasgow Heliport. The inquiry also heard that issues with one of the fuel sensors on helicopter G-SPAO, which crashed in Glasgow on the night of November 29, 2013, were recorded on November 24. However, the observation was made on a sticky note in the base's engineer diary, rather than being formally logged in a deferred defect log. Had it been noted in the log, the fuel sensor would have had to have been replaced within three days. It was not replaced before the Police Scotland helicopter's final flight. The inquiry, at Hampden Park, has previously heard that pilot David Traill would have seen five low fuel warnings in the aircraft before it crashed into the Clutha Vaults Bar at 22.22 pm. Any pilot, the court has heard, should land within 10 minutes of a low fuel warning but the helicopter carried on to other operations following the red warnings. The court was shown Mr Booth's end of shift report, sent to colleagues at 3.53 am on November 28, 2013. In it, he wrote:\" I am extremely concerned at the way we are having to carry out in depth maintenance on our aircraft at Glasgow. \"It is an accident waiting to happen!!\" Mr Booth told the court: \"I didn't think for a moment it would be an air accident. I just wanted my management to know how I felt at the end of a very busy shift .\" Gordon Jackson QC, counsel for the family of victim Gary Arthur, said: \"You put that statement in your report and that report would go to senior management. What response did you get?\" Mr Booth replied: \"None .\" Mr Jackson went on to say: \"It's a pretty strong statement. You might have expected at least someone to discuss it with you .\" And you did expect that, but it never happened. Did you do anything about that? \"Mr Booth replied:\" Circumstances overtook. \"Mr Booth told the court that to keep on top of his workload at Glasgow Heliport he frequently went\" above and beyond, \"working additional hours and was described as\" coming off work absolutely shattered. \"A technical log entry dated July 8, 2013, was shown to the court which detailed an issue with the fuel sensor in the main fuel tank of the Police Scotland helicopter. The helicopter had been re-fueled but the level of fuel shown on a display inside in the cockpit differed from the amount in the tank. Mr Booth's end of shift report of November 28, the court heard, also stated:\" Fuel contents after refuelling drops after a period of time in main tank. \"Main fuel probe in AO bin when if [CORR] we get time to change it .\" The court was shown the technical log from November 24 to November 28 where there was no mention of the fuel sensor problem that had been recorded on the yellow sticky note in the engineer's diary. Donald Findlay, for the family of victim <mark>Robert Jenkins</mark>, questioned whether the engineer taking over on the new shift, in this case <mark>Ian Taylor</mark>, would speak to Mr Booth to go over the details of any outstanding jobs. Mr Findlay suggested Mr Booth's note in the tech log \"didn't carry any urgency\" and was \"almost a suggestion\" that the sensor might need changed. Mr Booth said: \"It's badly written by me .\" Mr Findlay added: \"This is quite important to a number of people .\" Mr Booth replied: \"Yes, I know that .\" In the afternoon the inquiry heard from licensed helicopter engineer Andrew Bochel, now semi-retired but working for Babcock. He was the engineer on duty on the day of the crash at Inverness heliport, where G-SPAO landed twice on the day in question. Pilot David Traill, 51; PC <mark>Tony Collins</mark>, 43; and PC Kirsty Nelis, 36, died along with seven customers who were in the bar, Gary Arthur, 48; Joe Cusker, 59; <mark>Colin Gibson</mark>, 33; <mark>Robert Jenkins</mark>, 61; John McGarrigle, 58; Samuel McGhee, 56; and Mark O'Prey, 44. The inquiry before Principal Sheriff Craig Turnbull continues. 0 comment", "articleID": "2019050116_00294428_W", "names": {"Robert Jenkins": ["Q38800320", "Q7346083"], "Tony Collins": ["Q4772556", "Q51095573", "Q7822088", "Q7822089", "Q7822090"]}}, {"date": "2019-05-02", "url": "https://www.sgvtribune.com/2019/05/01/long-beach-opera-offers-an-original-take-on-philip-glass-in-the-penal-colony/", "content": "Ensemble members from CalRep at CSULB in Long Beach Opera's \"In the Penal Colony\" (Photo by Keith Ian Polakoff) By Jim Farber | PUBLISHED: May 1, 2019 at 6:37 pm | UPDATED: May 1, 2019 at 6:37 pm The harrowing scenes that transpire in the current production of Philip Glass' opera, \"In the Penal Colony,\" based on Franz Kafka's gruesome 1919 short story, represent a first collaboration between Long Beach Opera and the Cal Rep theater company of Cal State Long Beach. The production, which continues this weekend at the campus' Studio Theater, also interpolates additional text drawn from interviews compiled by members of the university's program for formerly incarcerated students, Rising Scholars. The result is an unquestionably powerful piece of agitprop theater. But it's an awkward fit with Kafka's metaphorical nightmare of a dystopian state gone mad. As stated in the program by Jeff Janisheski (the production's director and the artistic director of Cal Rep), \"This production is set in the here and now: In a country (America) that has the highest prison population in the entire world...where prison labor is a modern form of slavery and prison culture represents and perpetuates an endless cycle of racism and violence .\" Those are serious allegations, worthy of exploration on \"60 Minutes\" or \"Frontline .\" But it's not what Kafka had in mind. In fact, the author stated that to view his story as a statement against capital punishment, was to miss the point and the bigger picture. A more cogent equivalent at this moment would have been to depict the lives of the immigrant children on the border who have been separated from the parents, placed in cages and held in indefinite detention by an all-powerful government with little or no comprehension of the \"crime\" that have committed. That's Kafka! In the story, the penal colony is set on a desolate sun-parched island. Long Beach Opera's setting by Danila Korogodsky is a sterile glass box populated by baton-wielding guards and a Greek chorus of eight inmates who declaim the dehumanizing effect of their prison environment. As in the short story, a Visitor (sung by tenor <mark>Doug Jones</mark>) arrives. He is there (against his will and with little appreciation of his task) to observe an execution and make comments. He is met by the Officer (baritone Zeffin Quinn Hollis). To the familiar arpeggiated patterning of Glass' score (for string quartet and bass) The Officer describes the wonders of the penal colony's tool of execution. It is a demonic creation that slowly carves the prisoners crime into his flesh until he dies--the details of which Kafka recounts with masochistic delight. Zeffin Quinn Hollis (Officer) and <mark>Doug Jones</mark> (Visitor) in Long Beach Opera's \"In the Penal Colony\" (Photo by Keith Ian Polakoff) \"In the Penal Colony\" is not one of Glass' great creations. Its melodic structural template has the feel of being ready made and suitable for almost any occasion, while the vocal lines of Wurlitzer's English libretto do not come trippingly off the tongue. <mark>Jones</mark> offers a convincing, if not terribly nuanced interpretation of the Visitor--a clockwork bureaucrat anxious to complete his task and go home. He is not prepared for the level of fetishistic pride the Officer takes in the infernal machine, of which he is in charge. It soon becomes clear that the future of the colony and its death machine rests with the report to be filed by the visitor. Hollis offers a strong performance with a convincing dramatic arch as he tries to cover up the fact that the system (and the machine) are falling apart. In his most effective aria, he longs for the golden era of the colony and its crowd-pleasing executions when budgets were flush and his mentor, the Old Commandant, ruled the island with an iron fist. Ultimately he will try to bribe the Visitor. And when that fails prefer to die. As a substitute for the infernal machine, Janisheski choreographs his prisoners as a living mechanism as projections (by Lily Bartenstein) depict a series of abstract schematics. All the while the musicians placed above the set (who were clearly not yet totally comfortable with the score) were conduced by Andreas Mitisek. Before the performance began, Mitisek asked for a show of hands. \"How many of you here tonight have never seen an opera?\" Quite a few hands went up--nearly all young people, presumably students. I would imagine they were quite impressed. Jim Farber is a Los Angeles-based freelance writer. \"In the Penal Colony' Rating: 3 stars Where: CSULB Studio Theater, 1250 N. Bellflower Blvd., Long Beach When: 7:30 p.m. May 2-4, 2:30 p.m. May 5 Tickets: $45 - $150 (sold out) Running time: 90 minutes, no intermission Suitability: Not for younger audiences Information: 562-470-7464, www.longbeachopera.org Related Articles 10 theater productions to see in Southern California this week, April 26-May 2 Theater review: In La Mirada,\" Singin' in the Rain' makes a few splashes \"Tiny Beautiful Things' at the Pasadena Playhouse is a beautiful thing Theater review: At the Geffen,\" The Niceties' is a debate without drama Theater review: \"Fiddler on the Roof' stays grounded, looks backward and forward Get the latest news delivered daily! Subscribe Follow Us Facebook Twitter RSS", "articleID": "2019050201_00236116_W", "names": {"Doug Jones": ["Q1251779", "Q16142774", "Q30122825", "Q461309", "Q5300612", "Q5300613"]}}, {"date": "2019-05-03", "url": "http://www.gamereactor.eu/games/72423/Tennis", "content": "TENNIS WORLD TOUR REVIEW. Written by Jonas Mäki on the 31st of May 2018 at 14 \"It may have a stable foundation but it also has a very uncertain future .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 12th of February 2019 at 10 The esports competition is getting an expanded second edition ahead of the game's full launch in May this year. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 20th of May 2018 at 11:25 PC and Switch players will have to wait a touch longer. 0 NEWS. Written by Sergio Figueroa on the 18th of April 2018 at 15:55 They \"served' us up an\" ace' of a trailer. 0 ESPORTS. Written by Islem Sharouda on the 29th of March 2018 at 14 This will be held at Roland Garros, the French Open.", "articleID": "2019050311_00332192_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-05-03", "url": "http://www.asianage.com/india/politics/030519/bjp-shamelessly-involved-in-horse-trading-aap-leader-gopal-rai.html", "content": "BJP shamelessly involved in horse trading: AAP leader Gopal Rai ANI Published: May 3, 2019, 8:44 pm IST Updated: May 3, 2019, 8:44 pm IST <mark>Vijay Goel</mark> had on Thursday said that 14 AAP MLAs want to leave the party as the party has gone astray from its objectives. All 7 Lok Sabha seats in Delhi are going to polls in a single phase on May 12. (Photo: PTI) New Delhi: The Aam Aadmi Party (AAP) on Friday came down heavily on the Bharatiya Janata Party (BJP) and said that the ruling party is \"shamelessly involved in horse trading .\" \"BJP leader <mark>Vijay Goel</mark> yesterday publicly accepted that 14 AAP MLAs are in contact with him. This shows that BJP is shamelessly involved in horse trading and also indicates that BJP has failed in all its strategies in Delhi and is left with this last option,\" AAP leader Gopal Rai told media here. He added, \"Replying to our accusation, <mark>Vijay Goel</mark> said that BJP is not trying to contact MLAs, rather AAP MLAs are contacting them to join BJP. This is an utter lie. Why would MLAs contact BJP if they have seen what happened with Ved Parkash in Bawana bypolls?\" <mark>Vijay Goel</mark> had on Thursday said that 14 AAP MLAs want to leave the party as the party has gone astray from its objectives. He was replying to the allegations made by Delhi CM Arvind Kejriwal who had alleged on Wednesday that the BJP is trying to buy AAP MLAs. Asserting that the BJP does not need to buy AAP MLAs, <mark>Goel</mark> said, \"14 AAP MLAs want to leave the party because the party has gone astray from its objectives but the BJP does not need to buy these MLAs. Allegations of the BJP offering Rs. 10 crores are false .\" Citing the exit of leaders from Aam Aadmi Party in the past <mark>Goel</mark> said, \"Prashant Bhushan, Yogendra Yadav, Shazia Ilmi and many others left the party saying they are feeling stifled in the party. The party which had come to fight corruption started resorting to corrupt practices .\" All 7 Lok Sabha seats in Delhi are going to polls in a single phase on May 12. General elections in the country are scheduled to be held in seven phases starting from April 11 and ending on May 19. Counting of votes will take place on May 23. Keep yourself updated on Lok Sabha Elections 2019 with our round-the-clock coverage--breaking news, updates, analyses etc all. Happy reading.", "articleID": "2019050315_00327947_W", "names": {"Vijay Goel": ["Q28741461", "Q7929142"]}}, {"date": "2019-05-03", "url": "https://www.star-telegram.com/news/nation-world/national/article229643264.html#storylink=rss", "content": "Can hairstyle lead to discrimination? Listen as Raynita Nebeker and Dennis Horn relate their experiences of discrimination just because of hair style. By Up Next × SHARE COPY LINK Listen as Raynita Nebeker and Dennis Horn relate their experiences of discrimination just because of hair style. By Dennis Horn has endured numerous uncomfortable moments in the workplace, based on the natural hairstyles he's sported in the past. A Fresno resident, Horn said the dreadlocks, cornrows, braids and afros he's worn over the years often spurred unwanted attention. His hair sometimes became a topic of discussion by his peers and supervisors in his corporate job. On top of that were the numerous questions by his co-workers: Is it natural? What did you do to it? Is it extensions? Can you wash it? While the 33 - year-old said he welcomed questions of genuine curiosity, those inquires sometimes had a hint of disdain--whether it was racially motivated or just plain ignorance. \"I remember once, when I actually cut my hair, a comment was made that I was\" ready to be mature' and \"go places,\" ' he recalled. \"That was never my intention in cutting my hair .\" Horn said he knows he's not alone in those feelings. A bill is being discussed in Sacramento that would ban schools and workplaces from discriminating against people based on their natural hairstyles. Proposed by Sen. Holly J. Mitchell, D-Los Angeles, Senate Bill 188 is being referred to as the CROWN Act (Create a Respectful and Open Workplace for Natural Hair). Fresno resident Dennis Horn, shown with his dreadlocks hair style. Courtesy Dennis Horn Hair discrimination is a problem Mitchell and SB 188's supporters said is commonplace. For example, in December, the story of a 16-year-old New Jersey high school varsity wrestler made headlines after he was asked by a referee to cut his dreadlocks on the spot or forfeit his match. There was outrage after the story went viral. A toddler in Fresno was sent home on his first day of school last year because he had a fade haircut with a design on his scalp. The teacher allegedly told his parents the child couldn't return to class until his hair was \"fixed\" because it was \"distracting,\" said Raynita Nebeker, a local special education teacher. In 2016, prior to the Clovis Unified School District revising its controversial dress code, 17-year-old William Pleasant's hair was initially the reasoning behind the teen not being able to enroll at Buchanan High School for his senior year. Boys couldn't have their hair longer than their shirt collar. More recently in 2018, a 14-year-old at Tenaya Middle School was pulled out of class and sent to the vice principal's office due to his hair. The student had lines shaved in a design on his hair, and was told to get it \"fixed .\" The American Civil Liberties Union of Northern California has been involved in a few local hair discrimination cases. \"It's unfortunate that in 2019, black people are being punished for their hair, and that it is so widespread,\" said ACLU staff attorney Abre' Conner, who has helped intervene in some of the local cases. Conner said there are already protections within the schools, but explicitly adding language about \"protective hairstyles\" will help close a chapter in California of discipline that has been \"rooted in a legacy of racism and gender bias .\" State Sen. Holly Mitchell (D-Los Angeles) speaks to the media in Sacramento, Calif. on Jan. 24, 2017. (Gary Coronado/Los Angeles Times/TNS) Gary Coronado TNS Mitchell told The Bee that through the years, there have been court rulings favoring employers against employees who felt they were being discriminated against based on their ethnic hair. She called that system \"racist, antiquated or ill-informed,\" saying there \"should be protections from discrimination in the workplaces and schools .\" Additionally, SB 188 points out there historically has been a double standard in the workplace, in terms of how black employees are expected to wear their hair, compared to their white colleagues. The bill states the idea of \"professionalism\" in the American workplace has typically been tied to European looks, often forcing non-whites to conform to a Euro-centric aesthetic. Consequently, many black women for decades felt they had to chemically process or straighten their hair in order to be accepted in a predominantly white workplace. Meanwhile, black men have often cut their hair short. \"(Hair texture) does not dictate my ability to do my job well,\" Mitchell said. \"I have been shocked by the outpouring of support from people who have told me about their horror stories for wearing natural hair in the workplace .\" If the bill passes both houses and gets signed by Gov. Gavin Newsom, Mitchell said it would put \"employers and schools on notice .\" Horn said he did eventually cut his hair in 2016, although, it wasn't in response to any negative comments or discrimination. \"As of recently, I've never had to deal with anything like that,\" he said of the discomfort and comments he faced prior to cutting his hair. Nebeker said that in many schools, the type of hairstyles allowed often go along with student dress codes. \"They have certain restrictions on what they can and can't do, and their hair is one of the big ones that they have restrictions on, as well,\" she said. \"So, I know, it's (the discrimination) also in the schools .\" She said SB 188 would make an impact, if it becomes law. \"I feel that a lot of students express themselves through their hair...because that's where you are finding your identity, and your real self and being comfortable with yourself .\" A history with deep roots Beyond its aesthetic appeal, black hair has a history and significance that many Americans are unaware of. Many black hairstyles--like various kinds of braids--have been worn on the African continent for thousands of years. During the late 1960s and 1970s, human rights activists like <mark>Angela Davis</mark> wore afros as a political symbol of black pride. Many black Americans have recently adopted natural hairstyles as an alternative to harsh chemicals which can cause permanent damage. <mark>Dominique Jones</mark> has faced discrimination for her hairstyle. Photographed Friday, April 26, 2019 in Fresno. <mark>ERIC PAUL</mark> ZAMORA ezamora @ fresnobee.com Devoya Mayo and <mark>Dominique Jones</mark> of Fresno have held workshops locally about black hair, focusing in particular on headwraps, teaching participants how to wrap their hair. Mayo and <mark>Jones</mark> said that every time a member in a black household is considering a new hairstyle, there's much more to consider aside from the hairdo--including the societal implications. Mayo said she supports the proposed legislation because she hopes there will eventually become a time when those kind of discussions or concerns are no longer necessary. \"I have always worked in the nonprofit industry, no one has advertently or blatantly (been) racist about hairstyles, but there have been spaces that I've been in where, I think all of us have been in, where I know for a fact we're uncomfortable because of our hair, and it shouldn't be that way,\" Mayo said. <mark>Jones</mark> said the workshops were \"to help black women embrace our culture and it helped us connect to our roots, and just express ourselves in a way that is not normalized in our community .\" SB 188 has cleared the Senate, and is now in the Assembly. Related stories from Fort Worth Star Telegram education Does Fresno Unified's 15-year-old dress code need a fix? The superintendent thinks so March 19, 2018 05:00 PM education In face of criticism, Clovis Unified adopts gender-neutral dress code April 06, 2016 10:25 PM education A Fresno honor student got a popular haircut, but school officials didn't like it March 08, 2018 06:56 PM Comments", "articleID": "2019050318_00074075_W", "names": {"Angela Davis": ["Q160456", "Q16979885"], "Dominique Jones": ["Q427428", "Q5291144"], "Eric Paul": ["Q5387251", "Q5387252"]}}, {"date": "2019-05-04", "url": "http://www.dailymercury.com.au/news/former-bill-shorten-blackface-adviser-steve-michel/3718266/", "content": "Bill Shorten adviser Steve Michelson (right) resigned in 2017 after a decade-old photo of him in blackface and wearing a wig at a fancy dress party resurfaced. Picture: Supplied Politics Call for stricter vetting of political candidates by Mandy Squires 4th May 2019 7:55 AM premium_icon Subscriber only 0 POLITICAL parties need to overhaul candidate vetting systems to prevent ugly public rows and attract higher quality candidates, a former senior Labor adviser believes. Following the spectacular dumping of several Federal election candidates this week Steve Michelson - himself no stranger to controversy - has called for the bar to be set higher on background checks. Mr Michelson resigned as Bill Shorten's adviser in October 2017 after a decade-old photo taken at a fancy dress party resurfaced of him in blackface and wearing a curly, black wig. At the time he was seen as a rising star in the Labor party and a potential candidate for the sea of Isaacs. Former Bill Shorten Labor staffer Steve Michelson. Picture: Supplied He has described his decision to don the costume in 2007 as a \"regrettable mistake\". Mr Michelson, now 36 and a corporate adviser in Melbourne, yesterday told News Corp Australia the party vetting process was poor and undertaken too late in the selection process. In \"the new world order\" of social media and everlasting digital footprints, candidate backgrounds needed to be comprehensively checked to ensure there was nothing that could potentially surface down the track to embarrass the party and lead to disendorsement, or worse, legal action. \"What we've seen in this campaign is that political parties need to do more to vet their candidates and clearly need to do more to attract better quality candidates,\" he said. \"I think parties should be thinking about third-party character references and checks .\" He said \"freaks and geeks\" with extreme views were sometimes drawn to the minor parties and needed to be identified early and prevented from throwing their hats into the ring. His call for a tougher selection process comes after a horror week for the major parties as questionable social media posts - including those sharing racist, sexist and homophobic views - and past actions have come back to haunt several candidates. Labor candidate Luke Creasey has stepped down. Picture: Supplied But a former political adviser to several minor party leaders, who did not want to be named, said candidates were already thoroughly investigated before being endorsed, social media accounts checked and character references sought. It was unrealistic to think candidates of any party could have a history in which no mistakes had been made, \"simply because they're human\" , she said. \"I don't think the candidates have changed, I think the environment has changed with social media and digital footprints,\" she said. \"We expect our politicians to be perfect human beings but that's just not realistic. We need to have standards, of course, but we need to be realistic too .\" Tasmanian Liberal candidate for Lyons Jessica Whelan today resigned over racist remarks made online. Hours later Labor's candidate for Melbourne Luke Creasey quit following condemnation over a rape joke and lewd images he posted on Facebook in 2012. Their resignations follow the dumping of a string of other Liberal and Labor candidates, leaving party leaders and officials scrambling. Dumped Liberal candidate Jessica Whelan with Prime Minister <mark>Scott Morrison</mark>. Picture: Gary Ramage Other candidates in the headlines have included the Victorian Liberal candidate for Isaacs Jeremy Hearn for an anti-Islamic rant posted online last year and candidate for Wills Peter Killan for a homophobic comment. Labor's Northern Territory Senate hopeful Wayne Kurnoth also has come under fire for an anti-Semitic conspiracy theory shared on social media. Labor's Western Australian candidate for Curtin Melissa Parke resigned in week one of the campaign after comments about Israel while the Liberal candidate for Lalor, Kate Oski, and for Wills, Vaishali Ghosh, both had to withdraw in Victoria over dual citizenship issues. The Victorian Liberal candidate for Cooper Helen Jackson was asked to withdraw over Section 44 issues because of her status as an employee of Australia Post and the Liberal candidate in the safe seat of Corio Murray Angus was disendorsed in record time after expressing support for unions, his Labor opponent Richard Marles, and likening his campaign to a can of WD40. Bill Shorten with Labor Senate candidate Wayne Kurnoth who resigned over anti-Semitic theories posted to his social media channels. Picture: Supplied One Nation's Steve Dickson also quit his party in Queensland after Facebook footage emerged of him behaving badly in a US strip club. Australian political expert and Deakin University academic <mark>Geoff Robinson</mark> said political candidates needed to be more intensively \"interrogated\" , early on, to ensure they did not hold racist, sexist, homophobic or extreme views. \"The Liberal Party might start by asking candidates up front, have they ever put (controversial) posts or comments on social media,\" Dr <mark>Robinson</mark> said. He said he would not be surpised to see more candidates dumped or resigning before the May 18 election as their posts and pasts came back to haunt them. Other candidates who are in the frame after making controversial comments include One Nation candidate for Leichhardt Ross McDonald who posted about feeding Aboriginal people to crocodiles and has been photographed squeezing a breast in a Thai bar, posing with a topless waitress and shared photoshopped images of a half-woman, half-horse. Disendorsed Liberal candidate for Corio Murray Angus with his poodle Luci. Picture: Alison Wynd More Stories premium_icon Moment PM got in Shorten's face premium_icon Senate shooter's pledge to remove tolls, donate half salary premium_icon Carmichael Mine could be delayed up to five years 0 federal election 2019 Read More Login to follow political candidates Read More Login to follow politics Read More Login to follow scandal Read More Login to follow federal election 2019 political candidates politics scandal", "articleID": "2019050322_00007896_W", "names": {"Geoff Robinson": ["Q16106426", "Q5534291", "Q5534292", "Q5534294"], "Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"]}}]