[{"date": "2019-05-07", "url": "https://www.msn.com/en-gb/lifestyle/beauty/the-36-best-—-and-wildest-—-hair-and-makeup-looks-celebrities-wore-to-the-2019-met-gala/ss-AAB0tnj?srcref=rss", "content": "Full Screen 1/37 SLIDES © Theo Wargo/Getty Images Each year, tons of celebrities attend the Met Gala in New York City wearing their most daring ensembles. But aside from their wild fashion choices, many people also wear showstopping makeup and hair looks to the event. On Monday, a number of stars attended the 2019 Met Gala at the Metropolitan Museum of Art wearing everything from false eyelashes to bright eye makeup in an attempt to match the event's theme of \"Camp: Notes on Fashion .\" Below, take a look at some of the best - and wildest - looks worn to this year's gala. 2/37 SLIDES © Theo Wargo/Getty Images Lady Gaga arrived wearing long eyelashes and fake tears. She also matched her lips to her ensemble with Barbie-pink lipstick, and donned a short blonde hairstyle. 3/37 SLIDES © Theo Wargo/Getty Images Laverne Cox used her makeup to add pops of color to her black ensemble. The actress wore blue eye shadow, purple lipstick, and a light-blue hairstyle. 4/37 SLIDES © Dia Dipasupil/Getty Images <mark>Ashley Graham</mark> added pearls and a bow to her ponytail for a touch of glam. The model also accessorized with Gucci hair clips, green eyeliner, and bright highlighter. 5/37 SLIDES © Theo Wargo Regina Hall dazzled with gems across her eyelids. Her look was completed with bold eye shadow and pink hair. 6/37 SLIDES © Dia Dipasupil/Getty Images Sara Sampaio's eyelashes feathered out at the corners. The model looked fierce, especially thanks to her smoky eye makeup. 7/37 SLIDES © Dia Dipasupil/Getty Images Awkwafina matched her eye shadow to her dress. For her first Met Gala appearance, the actress wore gold glitter across her eyelids, and glossy red lipstick. 8/37 SLIDES © Dia Dipasupil/Getty Images Charli XCX contrasted her yellow dress with a pink-and-red beauty look. As she walked the red carpet, the musician showed off her bright-pink eye shadow, and brown hair with red tips. 9/37 SLIDES © Evan Agostini/Invision/AP Mindy Kaling ditched her usually dark hair for a lighter shade. Kaling's blonde hairstyle perfectly complimented her gold dress. 10/37 SLIDES © Theo Wargo/Getty Images Billy Porter stunned with his golden makeup. His eyelids and eyebrows were entirely covered with sparkles, small pearls, and jewels. He also wore berry-colored lipstick with a gold streak down the middle. 11/37 SLIDES © Charles Sykes/Invision/AP Aquaria donned a bold white hairstyle and equally daring makeup. Her hairstyle appears to have been slicked down with white paint, while her eye makeup looked geometric. 12/37 SLIDES © John Shearer/Getty Images Natasha Lyonne went for a smoky eye look. She also wore her hair in a curled style that sat right above the wings of her suit. 13/37 SLIDES © Dia Dipasupil/Getty Images Darren Criss made a case for blue eye shadow at the 2019 Met Gala. Like Billy Porter, Criss also drew a line down the center of his lips, though in red. 14/37 SLIDES © Dia Dipasupil/Getty Images Madelaine Petsch experimented with bangs on the red carpet. Her pink eye shadow perfectly complimented her turquoise gown. 15/37 SLIDES © Theo Wargo/Getty Images Lucy Boynton also mixed shades of blue and pink. The actress wore a blue hairstyle to the Met Gala, as well as silver lines surrounding her eyes. 16/37 SLIDES © Evan Agostini/Invision/AP Constance Wu opted for a dark version of a 1920s beauty look. She wore dark lipstick, as well as a short and curled hairstyle. 17/37 SLIDES © Evan Agostini/Invision/AP Alessia Cara had black dots drawn across her eyes. The musician paired winged eyeliner with six black circles across her face. 18/37 SLIDES © Mike Coppola/MG19/Getty Images Elle Fanning looked like she stepped out of another decade with her half-up half-down hairstyle. She paired the look with blue winged eyeliner, and shiny pink lipstick. 19/37 SLIDES © Charles Sykes/Invision/AP Kacey Musgraves channeled Barbie in a blonde wig. And to match her outfit, the musician wore simple eye makeup and a bold pink lip color. 20/37 SLIDES © Evan Agostini/Invision/AP Gigi Hadid had some of the longest eyelashes on the red carpet. The model's eyelashes were a stark white color, while the rest of her face was almost bare. 21/37 SLIDES © Mike Coppola/MG19/Getty Images Dua Lipa wore jeweled barrettes in her hair. Her usually short hair was transformed into a long style with a beehive shape. 22/37 SLIDES © Dia Dipasupil/Getty Images Lily Collins wore a similar hairstyle. But rather than wearing jewel hair clips, the actress wore a white headband and flower clips. She also donned purple eye shadow. 23/37 SLIDES © Mike Coppola/MG19/Getty Images Hailey Steinfeld opted for a curled hairstyle with a large bow on top. For her makeup, the star chose green eye shadow, pink lipstick, and matching blush. 24/37 SLIDES © Dia Dipasupil/Getty Images Kylie Jenner matched her hair to her colorful gown. The reality TV star rocked a sleek purple hairstyle at the event. 25/37 SLIDES © Mike Coppola/MG19/Getty Images Dakota Johnson was one of many celebrities to wear pink eye shadow at the Met Gala. Her hair was more simple, styled in natural-looking waves. 26/37 SLIDES © John Shearer/Getty Images Priyanka Chopra Jonas looked like a completely different person on the red carpet. Her usually sleek hair was styled in curls, and her dark eyebrows were made an icy white. She also wore berry-colored lipstick, red eye shadow, and white eyeliner. 27/37 SLIDES © Dia Dipasupil/Getty Images Tessa Thompson's hair doubled as a whip. Her ponytail was covered in latex, and extended past her feet. 28/37 SLIDES © Dia Dipasupil/Getty Images Ciara had one of the biggest--and best--hairstyles of the night. She wore an afro that extended past her shoulders, as well as green eye shadow that matched her dress. 29/37 SLIDES © Dia Dipasupil/Getty Images Ezra Miller turned his face into an optical illusion. Though he carried a mask, the actor mostly walked the red carpet while showing his actual face, which was covered with seven eyes. 30/37 SLIDES © Dia Dipasupil/Getty Images La La Anthony took a unique approach to her hairstyle. To match her money-themed dress, the actress walked the red carpet with coins attached to her head. 31/37 SLIDES © Dia Dipasupil/Getty Images Though Cara Delevingne's makeup was minimal, the model did add one pop of color to her face. From one cheek to the other, the model wore a neon-orange streak across her face. 32/37 SLIDES © John Shearer/Getty Images Lili Reinhart channeled Marie Antoinette with her bold hairstyle. She attached flowers to one side, and completed the look with pink blush and matching eye shadow. 33/37 SLIDES © John Shearer/Getty Images Kristen Stewart paired an orange-and-yellow beauty look with her dark ensemble. Her eyes were decorated with the same colors - Stewart wore an orange shade over her eyebrows, and white shadow directly underneath. 34/37 SLIDES © John Shearer/Getty Images Lupita Nyong' o had one of the most eye-catching beauty looks of the night. She wore five gold combs in her hair, and sparkling eye makeup across her lids. She also donned lipstick in a deep shade of purple. 35/37 SLIDES © John Shearer/Getty Images Nicki Minaj chose to wear pink hair for the occasion. The rest of her beauty look was understated, and included winged eyeliner, minimal blush, and glossy lips. 36/37 SLIDES © Theo Wargo/Getty Images Kim Kardashian West looked stunning in neutral makeup with a smokey eye. Her hairstyle was just as flattering, and came down in lose waves. 37/37 SLIDES © John Shearer/Getty Images <mark>Sophie Turner</mark> and Joe Jonas wore matching slicked-back hairstyles to the Met Gala. <mark>Turner</mark> took an extra step by adding bright-blue eye makeup. 37/37 SLIDES 1/37 SLIDES Next Slide", "articleID": "2019050705_00205291_W", "names": {"Ashley Graham": ["Q4805451", "Q4805452", "Q53680948"], "Sophie Turner": ["Q240573", "Q735034"]}}, {"date": "2019-05-07", "url": "https://www.heart.co.uk/news/uk-world/nurses-london-marathon-record-reinstated-as-o/", "content": "Nurse's London marathon record reinstated as \"outdated' uniform rule axed 7 May 2019, 15:21 | Updated: 7 May 2019, 15:56 An NHS nurse has had her marathon world record attempt reinstated after officials admitted rules over her uniform were\" outdated \"and\" incorrect \". <mark>Jessica Anderson</mark>, who ran the London Marathon in her scrubs with trousers, was initially told her bid would only count if she completed the race wearing a skirt. The decision had sparked outrage online. Guinness World Records (GWR) rules had stipulated that a nurse's uniform must include: a blue or white dress, a pinafore apron, and a traditional nurse's cap. A spokesman confirmed the change of heart:\" Over the weekend it has become quite clear our guidelines for the fastest marathon wearing a nurse's uniform were outdated, incorrect and reflected a stereotype we do not in any way wish to perpetuate. \"I want to take this opportunity to reassure everybody concerned that Guinness World Records is absolutely committed to ensuring we uphold the highest standards of equality and inclusiveness .\" Therefore, we unreservedly apologise and accept full responsibility for the mishandling of <mark>Jessica Anderson</mark>'s application. \"The initial decision sparked a passionate response on social media, where many nurses shared images of themselves in their uniform under the hashtag #WhatNursesWear. Ms <mark>Anderson</mark>'s time of 3.08:22 on 28 April has been confirmed as the record and GWR guidelines will now be reviewed. Ms <mark>Anderson</mark>, who works at the Royal London Hospital and raised more than £ 2,200 for Barts Health NHS Trust, has officially beaten the previous record of 3:08:54 set by Sarah Dudgeon in 2015. Before the latest decision, Ms <mark>Anderson</mark> told magazine Runner's World the rules were\" outdated \", and said:\" I was quite taken aback when I read that they'd rejected my application. \"Some of the nurses I work with do wear dresses, but mostly we wear scrubs or a tunic and trousers .\" (c) Sky News 2019: Nurse's London marathon record reinstated as \"outdated' uniform rule axed", "articleID": "2019050720_00377352_W", "names": {"Jessica Anderson": ["Q29950503", "Q458240", "Q6187084"]}}, {"date": "2019-05-08", "url": "http://www.eveningtimes.co.uk/sport/national/17626050.izzy-christiansen-left-out-of-england-squad-for-womens-world-cup/", "content": "Izzy Christiansen left out of England squad for Women's World Cup By Press Association 2019 Izzy Christiansen, centre, will not be with England in France this summer 0 comment Izzy Christiansen has not been included in Phil Neville's England squad for this summer's Women's World Cup in France. The Lyon midfielder suffered a fractured fibula and ankle ligament damage in the 3-0 win over Japan at the SheBelieves Cup in early March and subsequently underwent surgery. The 27-year-old was aiming to be fit to feature at the World Cup, which starts on June 7, but her name was missing from the 23-player squad announced by the Football Association on Wednesday. We've been here before. But this time it's different. #BeReady / / #Lionesses pic.twitter.com/a0W9alJEwT--Lionesses (@ Lionesses) May 8, 2019 Forward Fran Kirby returns after missing the friendlies against Canada on April 5 and Spain four days later due to a knee problem. Captain Steph Houghton and goalkeeper Carly Telford, who withdrew ahead of the second of those games because of a groin issue and concussion respectively, are also back. Chelsea pair Kirby and Telford and Manchester City's Houghton have all played for their clubs since then. WHEN YOU GET THAT CALL.... WORLD CUP HERE I COME???????????????????????????? LETS GO #Lionesses ❤ ️ pic.twitter.com/7IicjQfnRX--Carly Telford (@ carlytelford1) May 8, 2019 Others not to have made the squad are Orlando Pride forward Chioma Ubogagu and Manchester City defender Gemma Bonner and goalkeeper Ellie Roebuck. Boss Neville said: \"This is a significant moment in our World Cup campaign and I want to congratulate all of the players in our squad .\" I must also thank those who just missed out for all of their efforts. We would not be in this position without them, they have played a big part in our World Cup journey and I know they will be our biggest supporters this summer. We dreamed it, and now we've done it?? Can't wait for this summer in France with the @ Lionesses?????????????? I'm so grateful to be a part of this team?????? #BeReady pic.twitter.com/q7lxL5MDwh--Leah Williamson (@ leahcwilliamson) May 8, 2019 \"Picking a squad is never easy but I believe in this group and I know they will be ready to help us perform at our very best at the finals .\" We know what we are capable of achieving and are determined to do all we can to be successful. We keep saying it but the hard work starts now and we are going to give it everything we have to make the nation proud. \"The members of the squad were announced one by one on the Lionesses Twitter feed on Wednesday via a series of videos featuring famous faces, starting with Houghton's inclusion being confirmed by FA president Prince William. Not a bad way of finding out your off to another @ FIFAWWC...WOW!???????????????? https: //t.co/zyzLtv8I4U--Steph Houghton MBE (@ stephhoughton2) May 8, 2019 The announcement for her club-mate Nikita Parris, the FWA Women's Footballer of the Year, was made by former England skipper David Beckham, and for PFA Women's Young Player of the Year Georgia Stanway, another City player, it was Raheem Sterling who did the honours. Actress Emma Watson, presenter James Corden plus singers Ellie Goulding and Olly Murs also made announcements. Parris and Stanway are among 11 players involved who will be taking part in their maiden World Cup. View this post on Instagram A big day today Congratulations @ nikitaparris17 @ lionesses and @ philipneville18 The whole country is behind you. #BeReady A post shared by David Beckham (@ davidbeckham) on May 8, 2019 at 2:00 am PDT The other 12 were part of the England squad that came third at the last World Cup, in Canada in 2015, under Neville's predecessor Mark Sampson. Two of that group, Karen Carney and <mark>Jill Scott</mark>, will be at a World Cup for a fourth time in France. England are in Group D alongside Scotland, who they face in their opener on June 9, Argentina and Japan. They have two more warm-up games prior to that, against Denmark at Walsall's Banks's Stadium on May 25 and New Zealand at Brighton's Amex Stadium a week later. After winning the invitational SheBelieves Cup for the first time in March, England subsequently lost to Canada 1-0, then beat Spain 2-1. England squad Goalkeepers: Karen Bardsley (Manchester City), Mary Earps (Wolfsburg), Carly Telford (Chelsea). Defenders: Millie Bright (Chelsea), Lucy Bronze (Lyon), Rachel Daly (Houston Dash), Alex Greenwood (Manchester United), Steph Houghton (Manchester City), Abbie McManus (Manchester City), Demi Stokes (Manchester City) Leah Williamson (Arsenal). Midfielders: Karen Carney (Chelsea), Jade Moore (Reading), <mark>Jill Scott</mark> (Manchester City), Lucy Staniforth (Birmingham), Georgia Stanway (Manchester City), Keira Walsh (Manchester City). Forwards: Toni Duggan (Barcelona), Fran Kirby (Chelsea), Beth Mead (Arsenal), Nikita Parris (Manchester City), Jodie Taylor (Seattle Reign), <mark>Ellen White</mark> (Birmingham). 0 comment", "articleID": "2019050812_00172679_W", "names": {"Ellen White": ["Q10911", "Q28233580"], "Jill Scott": ["Q10896", "Q232592", "Q23661775"]}}, {"date": "2019-05-09", "url": "http://www.leighjournal.co.uk/sport/national/17630451.alex-scott-vows-to-keep-leading-the-way-for-female-pundits-despite-sexist-abuse/", "content": "<mark>Alex Scott</mark> vows to keep leading the way for female pundits despite sexist abuse By Press Association 2019 <mark>Alex Scott</mark> has been the target of sexist abuse on social media 0 comment <mark>Alex Scott</mark> has vowed to continue as the standard-bearer for female football punditry despite receiving persistent sexist abuse on social media. <mark>Scott</mark> has made a successful transition from an England star with 140 caps to a respected voice on the women's and men's game for the BBC and Sky Sports since making her on-screen debut at the 2018 World Cup. But the 34-year-old former Arsenal defender has been forced to work against a backdrop of sexist comments that peak after every weekend appearance in the studio. Im not out here trying 2 be better than any Male/Female. There is room for us all to rise! I'm just trying to be the best \"I' can be in the role I am\" employed' to do. Have fun along the way, learn from people around me, grow/be better! FYI. . back in the studio the weekend, haha?? pic.twitter.com/mkUNrl8AoU--<mark>Alex Scott</mark> MBE (@ AlexScott) February 5, 2019 \"Twitter is there for everyone to see. I think I get it (sexist abuse) every single day now,\" <mark>Scott</mark> said. \"I went through a stage over Christmas when it got hard to handle. At the time I was,\" right, I'm going to come off Twitter and move away from social media'. \"But then I thought that it has been my strong presence on social media that's allowed me to connect with fans and that by coming off Twitter I was allowing them to win .\" So that's when I put out a tweet saying, \"actually, I'm not going anywhere and I'm going to keep doing what I'm doing'. View this post on Instagram Why? Cause they lovin the crew, they loving crew'???? #changethegame @ bbcsport A post shared by <mark>Alex Scott</mark> MBE (@ alexscott2) on May 1, 2019 at 11:33 pm PDT\" What keeps me going is knowing that I'm helping. People are now coming up to me on the street and are saying exactly that...they're watching with their daughter or even their boy. \"Me sitting there being strong enough to give my opinions in the way that I do it is normalising it .\" If that's giving more encouragement to young females in that they can see me and I'm visible and that they can do that, then that's great. \"We'll get to the stage when I'm not regarded as a female pundit, I'm just a pundit. When we get to that point we're getting somewhere .\" The 1st time mum gets to watch you live on @ SkySports but is gutted that @ Arsenal lost...LOVE IT?? #COYG?? ⚪ ️ pic.twitter.com/MMPTS6h7PV--<mark>Alex Scott</mark> MBE (@ AlexScott) February 3, 2019 <mark>Scott</mark>'s supporters on Twitter rushed to her defence following an exchange with Graeme Souness when analysing a match between Manchester United and Leicester in February. Souness interrupted the Londoner and was dismissive of her use of the term \"low block', which means to defend from a deep position .\" Every time I'm on with Graeme I get more comments about that than when I'm with any other pundit, \"<mark>Scott</mark> said .\" Graeme Souness is like that with every pundit he sits alongside, but with me it's highlighted because people see me as a female. <mark>Alex Scott</mark> appears on Sky Sports and the BBC (Mike Egerton/PA) \"If he's got a strong opinion and he disagrees with you, he'll say that. I respect that and want people to be like that with me .\" When people say on Twitter that I'm ticking a box, no I'm not ticking a box...I've done the work and deserve to be there. \"I wouldn't want Graeme Souness to change and be different just because I'm female. Treat me the same as everyone else, and he does .\" One term I used--a low block--he didn't know what that is. Football terminology, like everything else, changes and evolves. \"I can explain why a low block is different to being pegged back or holding a high line. Some people at home didn't know what it is .\" People reacted on Twitter because he's disagreeing with a female and it shouldn't be that way. That's how Graeme is. When the camera is off, he's lovely with me. \"0 comment", "articleID": "2019050921_00267539_W", "names": {"Alex Scott": ["Q434354", "Q43882729", "Q4717762"]}}, {"date": "2019-05-10", "url": "https://www.wsaz.com/content/news/Australian-fire-official-comes-to-learn-from-crews-in-West-Virginia--509733781.html", "content": "Australian fire official comes to learn from crews in West Virginia By WSAZ News Staff | Updated: Fri 12:05 AM, May 10, 2019 CHARLESTON, W. Va. (WSAZ)--A man who has spent his entire life working to stop fires in Australia is spending time in West Virginia because he wants to learn from crews in the Mountain State. <mark>Richard Woods</mark> is the director of Wildfire Investigations and Analysis in Canberra, Australia. <mark>Woods</mark> has been spending time this week meeting with the division of Forestry's Special Operation Canine Unit to see how they use bloodhounds to investigate arson cases. He says West Virginia's way is unique because the offenders are not only identified but they work to deter future fires. \"You have a skill here and tool that is very, very effective, and we have a problem of wildfire arson in Australia, and I can see this application being very useful down under,\" <mark>Woods</mark> said. Wildfire arson is a problem all over the world, and <mark>Woods</mark> sees West Virginia's program as a big step in the right direction. <mark>Woods</mark> has has worked to solve cases and teach courses at home in Australia, Europe and Asia.", "articleID": "2019051004_00224959_W", "names": {"Richard Woods": ["Q21467109", "Q7330085"]}}, {"date": "2019-05-11", "url": "http://scores.nbcsports.msnbc.com/en-xl/europe/europe-sport/neymar-scores-on-final-psg-game-before-ban/ar-AABdP4I?li=BBJGC65", "content": "Portals Navigation Outlook.com Skype Microsoft Store Facebook Twitter Office OneDrive Receive your emails here See your recent emails Send a quick email Manage your calendar with easy access Sign in with any Microsoft account: Outlook, Hotmail, MSN, Live What is a Microsoft account? SIGN IN Create Now Sign In Microsoft Store OFFICE 365 - Buy & Download directly from Microsoft UPGRADE TO WINDOWS 10 - Big savings on a huge selection of products Surface Windows Support Facebook Check News Feed See notifications View messages Confirm friend requests Get your Twitter Updates Sign In See your recent documents, or start one for free with Office Online. Sign in Sign in to your Microsoft account to see recent OneDrive contents. Sign in TRENDING TODAY Curtea De Arges / 17 ° C Change Close Set Default Location Search Display Temperature In Fahrenheit Celsius Done Make MSN my home page AFRICA ASIA AUSTRALASIA EUROPE LATIN AMERICA MIDDLE EAST NORTH AMERICA powered by Microsoft News Latest Stories TRENDING Polish far-right supporters protest Reuters Dramatic moment eagle seizes lamb Sky News Royal mothers with their children Photos Top Stories Putin falls on ice after hockey game Mirror Biggest Roman coins' hoard found Sky News Belarus on tainted oil's damages Reuters Seven everyday items that could be making you sick Daily Mail More news Crime kingpin Krejcir is \"suffering' Saturday Star Malta rescues 85 from sinking boat Reuters Sporadic clashes in French protest AFP Celebrities who died broke StarsInsider Best duos of the 2019 Met Gala Wonderwall Celebrity babies of 2019 Photos Celeb Buzz Hailey's heartfelt post for Bieber BANG Showbiz Priyanka's role at Sophie's wedding Cover Media <mark>Will Smith</mark> feels trapped by fame Cover Media Royal watch Archie's edge over other royal babies Mirror Kate & Meghan's royal milestones PopSugar Winnie the Pooh visits baby Archie US Weekly Most read in Europe Ancient\" Sphinx room' found The Independent Comedian found dead at home The Guardian Clooney on royal baby name snub Bang Showbiz Coffee-brewing an art in this Mexican city National Geographic FEATURES The family networks behind the Sri Lanka bombings BBC News Trump's Ukraine interest puzzles Kiev The Washington Post Botswana comes to the party! NewsDay MOST READ ON MSN Ronaldo speaks on Messi, Barca loss Goal.com Fake heiress jailed for 4-12 years Associated Press \"Fatherhood gave me new goal' The Telegraph Take a break Pool vs Billiards: The difference Mental Floss News in pictures Photos Video: Bad joke turns into crash BuzzVideos Sport Bottas claims Spanish GP pole Reuters Juve coach denies exit rumours AFP Herrera confirms Man U departure 90min Greatest frontmen in rock and roll history Purple Clover Travel Limits on visiting Machu Picchu AFP Travel troubles that are worth it Espresso Best budget hotels in Budapest The Independent Tallest, longest, deepest, largest things around the world Photos Health & fitness How to eat to get six-pack abs US News & World Report - Health The yoga pose to sleep in 5 minutes Well + Good Want to get happy? Exercise Houston Chronicle 30 foods you should never eat after age 30 Eat This, Not That! WEDDINGS Iconic movie wedding dresses Wonderwall How to calm pre-wedding jitters? PopSugar Guide to wedding guest dressing Evening Standard Tech & Science Most downloaded app on planet CBS News 2,624 years old tree found BGR Boeing shows off parachute test CNET Previous Slide Next Slide Ex-Nigerian football star shot dead by armed robbers Legit Beckhams pay $50M for full control of brand business The Guardian Security guard killed as gunmen storm Pakistan hotel Dawn Man charged in long-running Hollywood murder mystery Sky News In public for the first time: Celebrity couple debuts Photos Alvin Sargent, Spider-Man screenwriter, dies at 92 The Hollywood Reporter Indian party activist held over see-through dress meme AFP Penguin and seal poop gives life to Antarctica USA TODAY Islamic State claims\" province' in India Reuters Afghan official says female journalist shot dead in capital Associated Press Meet history's most unsinkable woman Ozy $1m allegedly hidden in car's fuel tank ABC News Europe Edit Remove Section Move Section Up Move Section Down Add Section Below Up to 70 drown after boat capsizes off Tunisia Associated Press Latvian athlete joins Olympians snared by doping retests AFP Poland's president to meet Trump at White House in June Associated Press Italian ferry towed to Croatia after problems in Adriatic Associated Press Giuliani urges Ukraine to investigate Democrats Associated Press UN begins hearing case of Ukraine sailors held by Russia Associated Press Serbia holds military parade amid tensions with Kosovo Associated Press Voters to pick successor of Lithuania's popular \"Iron Lady' Associated Press World Edit Remove Section Move Section Up Move Section Down Add Section Below Eyeing Iran, US sending more Patriot missiles to Middle East Reuters US to transfer $1.5 B to border wall Reuters Iran's lake Urmia revival continues Iran Daily Moderate quake hits Iran's west Associated Press World 5.3 magnitude quake strikes Iraq Armed trainees at Kenya MRC camp PIA losses have surged to Rs416B Sri Lanka blasts: IT worker held DCI: Kenya judges, drug lords collude UK holidaymakers cancel SL trips 3 held for raping teen in B'desh SL probes British bride's death Fiji stabbing victim NZ businessman Radio New Zealand Life Edit Remove Section Move Section Up Move Section Down Add Section Below Hailey's heartfelt post for Bieber BANG Showbiz Spider-Man screenwriter dies The Hollywood Reporter <mark>Will Smith</mark> feels trapped by fame Cover Media Britney Spears makes court appearance over conservatorship ETOnline Winnie the Pooh visits baby Archie US Weekly Life Jessie J laughs off misspelled tattoo Rihanna to launch her own luxury fashion brand Zendaya stuns on new Vogue cover Craig working on Bond 25 script Things to discuss before having kids One stretch everyone for desk job Royals' mental health initiative Seven incredible natural wonders Sport Edit Remove Section Move Section Up Move Section Down Add Section Below Juventus coach Allegri denies exit rumours AFP Neymar scores on final PSG game before ban AFP Bottas claims Spanish GP pole Reuters Herrera confirms Man U departure 90min Sport Klopp tells players to channel\" Rocky' Pochettino wants \"clear' Spurs plan Halep reaches Madrid Open final AFL star's surprise visit to old team Weber-led Chiefs edge Sharks Pogba's agent banned by FIFA MI take on CSK in IPL final Lucas still stunned by CL heroics Wanyama a doubt for Everton clash Goal.com Features Edit Remove Section Move Section Up Move Section Down Add Section Below The family networks behind the Sri Lanka bombings BBC News Sports pictures of the week Photos Tiger win electrifies PGA move, but <mark>will</mark> it boost golf? AFP The last surviving member of the first expedition to summit Everest National Geographic Video Edit Remove Section Move Section Up Move Section Down Add Section Below Paddle boarder has incredible encounter with blue whale Newsflare Downhill mountain biking fail BuzzVideos Meerkats fascinated by gorilla fight, try to get involved Rumble Bodybuilder falls attempting squat while lifting Dailymotion Trio of fox pups drag GoPro into their den Rumble Red van drives down the street upside down Dailymotion Alligator caught at front door attempting to ring doorbell BuzzVideos Little girl annoyed at virtual assistant Dailymotion Gorillas take cover from downpour Reuters Baby lies on top of guitar while dad strums Dailymotion Chipmunks hurdle race in toy running wheel Dailymotion Tiger has a fun day playing with water hose Rumble 66-year-old man shows impressive trampoline tricks BuzzVideos This tapir\" smiling' in slow motion is hilarious Newsflare Man films impressive dust devil in desert BuzzVideos Hulk statue withstands storm while Spiderman, Captain America get crashed Newsflare Photos Edit Remove Section Move Section Up Move Section Down Add Section Below In public for the first time: Celebrity couple debuts Photos 30 foods you should never eat after age 30 Eat This, Not That! Tallest, longest, deepest, largest things around the world Photos Greatest frontmen in rock and roll history Purple Clover Royal moms with their children Photos Celebs who changed names for fame Purple Clover 30 amazing parenting tips all moms should know Best Life Travel troubles that are worth it Espresso Best of Disney animated films Wonderwall Most famous baby births in history 24/7 Tempo Sport: Soccer> Championships: 5x UEF...\"src =\" http: //static-global-s-msn-com.akamaized.net/hp-neu/sc/9b/e151e5.gif \"title =\" 5. Cristiano Ronaldo - <mark>Michael Regan</mark> / Getty Images \"> Most successful athletes of the century 24/7 Tempo These stars hate taking selfies with their fans StarsInsider Prince Charles with sons William and Harry through the years Photos The most colorful destinations in the world Espresso Clever ways to instantly add value to your home Best Life Best duos of the 2019 Met Gala Wonderwall Click here for more", "articleID": "2019051117_00294801_W", "names": {"Michael Regan": ["Q21062491", "Q21459008", "Q58249666"], "Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}}, {"date": "2019-05-13", "url": "http://www.fox13memphis.com/news/tennessee/judge-orders-psych-evaluation-for-appalachian-trail-suspect-1/948954442?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Judge orders psych evaluation for Appalachian Trail suspect Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Judge orders psych evaluation for Appalachian Trail suspect By: DENISE LAVOIE, Associated Press Updated: May 13, 2019 - 5:02 PM Judge orders psych evaluation for Appalachian Trail suspect For the past couple of weeks, hikers along the Appalachian Trial had been warning each other about a hiker who was threatening other hikers with a large knife. The man, who used the trail nickname of \"Sovereign,\" was arrested in Tennessee last month after some hikers reported him to authorities. But he was released after pleading guilty to possession of marijuana and other minor charges. Over the weekend, matters turned deadly in southwestern Virginia, where he is accused of stabbing one hiker to death and seriously injuring another. <mark>James Jordan</mark>, 30, of West Yarmouth, Massachusetts, is charged with murder and assault with intent to commit murder. During his initial appearance Monday in U.S. District Court in Abingdon, Virginia, a judge ordered him to be held in custody and to undergo a psychiatric evaluation. <mark>Jordan</mark>'s public defender declined to comment following the hearing. <mark>Jordan</mark> had repeatedly threatened four hikers late Friday and early Saturday before attacking them, according to federal authorities. An FBI agent said in an affidavit filed in court that when <mark>Jordan</mark> initially approached the hikers he was acting in a \"disturbed and unstable\" manner while playing a guitar and singing. Later that night, <mark>Jordan</mark> began randomly approaching the hikers' tents, making noises and threatening them. \"<mark>Jordan</mark> spoke to the hikers through their tents, and threatened to pour gasoline on their tents and burn them to death,\" FBI Special Agent Micah Childers wrote in the affidavit. Fearing <mark>Jordan</mark>, all four hikers decided to pack up and leave their campsite. Two of them were chased by <mark>Jordan</mark> as they tried to leave, but managed to escape by turning off the lights they had strapped to their heads and veering off the trail into the woods, said Sheriff Thomas Roseberry of Bland County, Virginia, whose deputies interviewed the couple after they walked off the trail to report the incident. \"They described this guy as talking crazy and following them down the trail,\" he said. The other two hikers also ran to get away from <mark>Jordan</mark>, but he caught the man first and stabbed him until he collapsed onto the ground, Childers wrote. <mark>Jordan</mark> then stabbed the woman repeatedly. She fell to the ground and played dead, and <mark>Jordan</mark> then left to find his dog, Childers wrote. The woman got help from two hikers who helped her hike another 6 miles (9.7 kilometers) into Smyth County, Virginia, where they called 911. The victim remained hospitalized Monday. Her condition could not immediately be determined. Authorities did not release the names of the victims. The attacks took place where a 1-mile (1.6-kilometer) length of the trail passes through Wythe County. <mark>Jordan</mark> was arrested and taken into custody by officers with the Wythe County Sheriff's Office. The male victim was found dead, with a knife near to his body, Micah wrote in the affidavit. At this time of the year the section of the trail in southwestern Virginia is usually packed with hikers making their way along the entire 2,100-mile length of the trail, from Georgia to Maine, said <mark>Brian King</mark>, a spokesman for the Appalachian Trail Conservancy. \"We give a lot of safety advice, which people tend to follow, but with someone with an intent to do evil, how do you guard against that?\" <mark>King</mark> said. Sheriff Mike Hensley of Unicoi County, Tennessee, said he did everything he could to keep <mark>Jordan</mark> locked up after he threatened hikers there and in other communities along the trail last month. Hensley said hikers called his office in late April and said a man was threatening them and said: \"It's going to be a bad day for hikers on the trail .\" He said he sent officers to the location described by the hikers, but the man was no longer there. The next day, some other hikers complained about a man threatening them. Hensley said his officers found <mark>Jordan</mark>, who was intoxicated, and gave them a fake name and a fake identification. He was arrested and charged with possession of marijuana and drug paraphernalia, and criminal impersonation. <mark>Jordan</mark> pleaded guilty to the charges and was later released. Hensley said the judge ordered <mark>Jordan</mark> not to return to the Appalachian Trail, but he was not charged with making threats because none of the hikers were willing to testify in court. \"The fact is nobody wanted to step up to the plate and press charges,\" Hensley said. \"They were on the trail walking and they didn't want to come back - they told my investigators that .\" \"It's just heartbreaking that this happened, and our prayers go out to the victims' families and to this young girl that was stabbed,\" he said. \"I did everything that I could do. I did get this man off the trail. That's all I could do .\" Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:", "articleID": "2019051322_00090325_W", "names": {"Brian King": ["Q16730866", "Q23017073", "Q57952101"]}}]