[{"date": "2019-05-13", "url": "http://www.fox13memphis.com/news/tennessee/judge-orders-psych-evaluation-for-appalachian-trail-suspect-1/948954442?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Judge orders psych evaluation for Appalachian Trail suspect Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Judge orders psych evaluation for Appalachian Trail suspect By: DENISE LAVOIE, Associated Press Updated: May 13, 2019 - 5:02 PM Judge orders psych evaluation for Appalachian Trail suspect For the past couple of weeks, hikers along the Appalachian Trial had been warning each other about a hiker who was threatening other hikers with a large knife. The man, who used the trail nickname of \"Sovereign,\" was arrested in Tennessee last month after some hikers reported him to authorities. But he was released after pleading guilty to possession of marijuana and other minor charges. Over the weekend, matters turned deadly in southwestern Virginia, where he is accused of stabbing one hiker to death and seriously injuring another. <mark>James Jordan</mark>, 30, of West Yarmouth, Massachusetts, is charged with murder and assault with intent to commit murder. During his initial appearance Monday in U.S. District Court in Abingdon, Virginia, a judge ordered him to be held in custody and to undergo a psychiatric evaluation. <mark>Jordan</mark>'s public defender declined to comment following the hearing. <mark>Jordan</mark> had repeatedly threatened four hikers late Friday and early Saturday before attacking them, according to federal authorities. An FBI agent said in an affidavit filed in court that when <mark>Jordan</mark> initially approached the hikers he was acting in a \"disturbed and unstable\" manner while playing a guitar and singing. Later that night, <mark>Jordan</mark> began randomly approaching the hikers' tents, making noises and threatening them. \"<mark>Jordan</mark> spoke to the hikers through their tents, and threatened to pour gasoline on their tents and burn them to death,\" FBI Special Agent Micah Childers wrote in the affidavit. Fearing <mark>Jordan</mark>, all four hikers decided to pack up and leave their campsite. Two of them were chased by <mark>Jordan</mark> as they tried to leave, but managed to escape by turning off the lights they had strapped to their heads and veering off the trail into the woods, said Sheriff Thomas Roseberry of Bland County, Virginia, whose deputies interviewed the couple after they walked off the trail to report the incident. \"They described this guy as talking crazy and following them down the trail,\" he said. The other two hikers also ran to get away from <mark>Jordan</mark>, but he caught the man first and stabbed him until he collapsed onto the ground, Childers wrote. <mark>Jordan</mark> then stabbed the woman repeatedly. She fell to the ground and played dead, and <mark>Jordan</mark> then left to find his dog, Childers wrote. The woman got help from two hikers who helped her hike another 6 miles (9.7 kilometers) into Smyth County, Virginia, where they called 911. The victim remained hospitalized Monday. Her condition could not immediately be determined. Authorities did not release the names of the victims. The attacks took place where a 1-mile (1.6-kilometer) length of the trail passes through Wythe County. <mark>Jordan</mark> was arrested and taken into custody by officers with the Wythe County Sheriff's Office. The male victim was found dead, with a knife near to his body, Micah wrote in the affidavit. At this time of the year the section of the trail in southwestern Virginia is usually packed with hikers making their way along the entire 2,100-mile length of the trail, from Georgia to Maine, said <mark>Brian King</mark>, a spokesman for the Appalachian Trail Conservancy. \"We give a lot of safety advice, which people tend to follow, but with someone with an intent to do evil, how do you guard against that?\" <mark>King</mark> said. Sheriff Mike Hensley of Unicoi County, Tennessee, said he did everything he could to keep <mark>Jordan</mark> locked up after he threatened hikers there and in other communities along the trail last month. Hensley said hikers called his office in late April and said a man was threatening them and said: \"It's going to be a bad day for hikers on the trail .\" He said he sent officers to the location described by the hikers, but the man was no longer there. The next day, some other hikers complained about a man threatening them. Hensley said his officers found <mark>Jordan</mark>, who was intoxicated, and gave them a fake name and a fake identification. He was arrested and charged with possession of marijuana and drug paraphernalia, and criminal impersonation. <mark>Jordan</mark> pleaded guilty to the charges and was later released. Hensley said the judge ordered <mark>Jordan</mark> not to return to the Appalachian Trail, but he was not charged with making threats because none of the hikers were willing to testify in court. \"The fact is nobody wanted to step up to the plate and press charges,\" Hensley said. \"They were on the trail walking and they didn't want to come back - they told my investigators that .\" \"It's just heartbreaking that this happened, and our prayers go out to the victims' families and to this young girl that was stabbed,\" he said. \"I did everything that I could do. I did get this man off the trail. That's all I could do .\" Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:", "articleID": "2019051322_00090325_W", "names": {"James Jordan": ["Q10305089", "Q6136966", "Q6136968", "Q6136972"]}}, {"date": "2019-05-14", "url": "https://timesofindia.indiatimes.com/world/us/in-echo-of-iraq-war-build-up-us-weighs-proposal-to-deploy-120000-troops-in-middle-east/articleshow/69331089.cms", "content": "In echo of Iraq war build-up, US weighs proposal to deploy 120,000 troops in Middle-East In echo of Iraq war build-up, US weighs proposal to deploy 120,000 troops in Middle-East Chidanand Rajghatta | TNN | Updated: May 14, 2019, 22:15 IST <mark>John Bolton</mark> WASHINGTON: The more things change, the more they remain the same, a weary satirist wrote of the French revolution, and it appears the United States has drawn a page from that playbook, with fresh plans to deploy 120,000 troops in the Middle-East, this time to face-down Iran. In echoes of the run-up that led to eventual decimation of Iraq, hardliners in the Trump administration led by National Security Advisor <mark>John Bolton</mark> are reported to have presented a military plan that envisions sending as many as 120,000 troops to the Middle East should Iran attack American forces or accelerate work on nuclear weapons. This, despite President Trump's well-known anathema towards fighting foreign wars that do not involve American vital interests. The ostensible trigger for floating this proposal is the attack on four oil tankers and an oil pipeline belonging to US allies UAE and Saudi Arabia, which hawks in the Trump administration are blaming on Iran and its proxies in the Gulf. The Saudis, Iran's regional rivals in a Sunni-Shia battle for dominating the region, have said the sabotage was intended to \"undermine the freedom of maritime navigation, and the security of oil supplies to consumers all over the world .\" Teheran, in turn, has suggested they were \"false flag\" operation by the US to provoke a confrontation with Iran. Trump, who hosted an iftar dinner at the White House on Monday, issued a cryptic warning to Teheran amid the US build-up, saying, \"I'm hearing little stories about Iran. If they do anything, they will suffer greatly. We'll see what happens with Iran .\" While it was not clear what the US President meant (clarity has never been his strong point), some analysts recalled the hasty rush into war against Iraq after 9/11 when Baghdad and Saddam Hussein had nothing to do with the attack, which was carried out mainly by Saudi extremists. The New York Times, which first reported the US proposal to return troops to the region, attributed the hawkish move to <mark>Bolton</mark>, calling him \"one of the administration's most virulent Iran hawks\" and recalling his push for confrontation with Tehran was ignored more than a decade ago by President George W. Bush. The paper said the size of the force suggested has shocked some who have been briefed on the proposal, noting that the 120,000 troops would approach the size of the American force that invaded Iraq in 2003. It would reverse years of retrenching by the American military in the Middle East that began with President Barack Obama's withdrawal of troops from Iraq in 2011, it noted. But apparently, hawks in the administration have been arguing that the US drawdown from Syria and its diminished naval presence in the region has emboldened Iran. The US has in recent weeks moved an aircraft carrier group, B-52 bombers, a Patriot missile interceptor battery and more naval firepower to the Gulf region. The Trump administration's dialing up of involvement in the Gulf region, ostensibly at the behest of its ally Israel, comes even as Washington is struggling to manage a rising China, with whom President Trump has initiated a trade war.", "articleID": "2019051417_00043918_W", "names": {"John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"]}}, {"date": "2019-05-15", "url": "http://www.localberkshire.co.uk/news/17642153.northern-ireland-secretary-under-fire-over-abuse-survivors-compensation-scheme/", "content": "News Northern Ireland Secretary under fire over abuse survivors compensation scheme By Press Association 2019 Northern Ireland power sharing 0 comment The Northern Ireland Secretary has been accused of treating abuse survivors like \"political pawns\". Karen Bradley told victims' groups on Tuesday that political parties would be invited to consider the issue as part of negotiations to restore devolved institutions. A redress scheme, in which victims would have been paid between £ 7,500 and £ 100,000, was one of the recommendations of Historical Institutional Abuse Inquiry (HIAI) two years ago. Retired High Court judge Sir <mark>Anthony Hart</mark> chaired the Historical Institutional Abuse inquiry (PA) Its proposals have never been implemented due to the Stormont impasse. Mrs Bradley has been under mounting pressure to introduce the scheme via Westminster. Northern Ireland's two biggest political parties reacted with strong criticism of her on Wednesday. Sinn Fein deputy leader Michelle O’Neill has accused Mrs Bradley of \"abdicating her responsibilities' (Niall Carson/PA) Sinn Fein vice-president Michelle O’Neill accused Mrs Bradley of using victims as political pawns .\" Compensation for victims of historical institutional abuse should not be a matter for the political negotiations and Karen Bradley is morally and politically wrong to attempt to make it so, \"she said .\" Not only is British Secretary of State once again abdicating her responsibilities to victims, she is now attempting to turn them into political pawns where their needs become a matter for negotiation. \"That is shameful. Karen Bradley needs to start putting the needs of victims and survivors before her own political priorities and immediately put in place the required legal and financial framework to assist them .\" DUP leader Arlene Foster has slammed Mrs Bradley over delays to the delivery of compensation to abuse victims (Liam McBurney/PA) DUP leader Arlene Foster said in the ongoing absence of the Northern Ireland Assembly the UK Government has a \"moral duty\" to deliver the compensation. She said: \"I have met many of the families impacted. I want to see them receive justice but also have their suffering recognised financially. The delay is a shame and disgrace .\" A lack of devolution has been a barrier to this matter being progressed. \"This is why devolution should be restored immediately so matters like this--compensation--can be taken forward by ministers .\" In the absence of devolution, the Government has a moral duty to meet this financial commitment but ultimately the institutions who closed their eyes to the abuse must be prepared to make their contribution to this compensation as has happened elsewhere. \"Ulster Unionist MLA <mark>Mike Nesbitt</mark> said:\" In suggesting the issue should be included in the discussions over the Programme for Government, Mrs Bradley is suggesting victims become pawns in a negotiation, potentially bartered against the issues that are holding up the restoration of devolution. \"That is morally wrong and politically crass .\". <mark>Patrick Corrigan</mark> from Amnesty International has called for a public apology and compensation for victims of historical institutional abuse. (Amnesty/PA) Amnesty International said the UK Government has so far failed to deliver either a promised apology or financial redress. <mark>Patrick Corrigan</mark>, Northern Ireland director of Amnesty International, accused Mrs Bradley of \"trying to shirk responsibility\". \"The Secretary of State has been asked by the head of the civil service to fulfil a moral responsibility to abuse victims by bringing forward legislation at Westminster,\" he said. \"Her attempt to shirk that responsibility is a shameful betrayal of victims who have been let down too often by those supposed to be protecting their interests .\" She should listen to the head of the civil service and to victims across Northern Ireland and bring this long, drawn-out process to a conclusion. \"0 comment", "articleID": "2019051515_00169512_W", "names": {"Anthony Hart": ["Q17378082", "Q42565576"], "Mike Nesbitt": ["Q6848174", "Q6848175"], "Patrick Corrigan": ["Q16092601", "Q7146277"]}}, {"date": "2019-05-16", "url": "https://vtdigger.org/2019/05/16/manufacturers-new-china-tariffs-cost-paid-state/", "content": "Share Tweet Share Email 0 Shares The St. Albans headquarters of customs broker A.N. Deringer. Supplied photo A s the U.S. trade dispute with China intensifies, A.N. Deringer in St. Albans, a customs broker, is working closely with its customers on strategies for adapting and surviving. \"We spend a lot of time talking with clients about how they can change their valuation, or in some cases manufacture their product differently, because there's a long list of goods that are subject to the tariffs,\" said CEO Jake Holzscheiter, who estimated existing and expected tariffs will cost the company's clients $500,000 in the coming year. Get all of VTDigger's daily news. You'll never miss a story with our daily headlines in your inbox. Daily Sundays only (Weekly Wrap) Email me stories on these subjects...Business News Courts & Corrections News Education News Energy News Environment News Health Care News People & Places News Politics News Special Topics Final Reading (Evenings) Sanders 2020 News Podcasts & Media \"Some have moved their manufacturing to a country like Vietnam that we're not having a trade war with,\" he said. \"But not everyone has that luxury. If it's a raw material it's easier to change suppliers .\" Businesses of all types have been drawn into the trade battle between the world's two largest economies. The Trump administration has announced plans to put a tax on almost everything that is imported to the U.S. from China. Manufacturing makes up about 9 percent of Vermont's economy, so tariffs on goods have a direct impact on many Vermont employers. One is Ann <mark>Clark</mark> cookie cutters, which employs 50 people in Rutland. President <mark>Ben Clark</mark> said he expects higher steel prices to cost the company about $32,000 over the next year. Chroma Technology, a Bellows Falls company that makes microscope filters, is helping its Chinese customers pay the extra costs of importing Chroma filters. About 15 percent of Chroma's business is in China, said CEO Paul Millman, who on Tuesday relayed an email from Chroma's general manager in China. \"She says,\" Unfortunately this morning Mr. Trump published a note on his Twitter to increase 25 percent on China goods, which increased panic among our customers, \"' said Millman, who was on a sales trip to Israel at the time .\" We're trying to help them so they don't leave us and go to filter companies that are in countries that don't impose tariffs and aren't engaged in a trade war, \"said Millman. VTDigger's business coverage is underwritten by:\" I don't know that this guy has any understanding of the effect of what he is doing, \"he said of Trump. Some of the company owners and managers who are struggling to cope with the tariffs said they see themselves in unaccustomed agreement with President Trump on the need for taking a hard line with China. But they don't see tariffs as a way to improve the relationship .\" I'm not a fan of Trump at all; I dislike this administration like most people in Vermont do, \"said Wolfgang Hokenmaier, who started Green Mountain Semiconductor in 2014 with two partners. The Burlington company now employs 25 people and has important customers in China. Wolfgang Hokenmaier of Green Mountain Semiconductor. Supplied photo\" But it's a double-edged sword, \"Hokenmaeir said .\" I also do see how the Chinese government is actively trying to secure intellectual property from the U.S. \"This is not something that tariffs will help,\" added Hokenmaeir. \"I think the U.S. government should look more into how does China procure our intellectual property and then eventually become a dominant force in technology .\" With some of the politicians who usually oppose Trump showing support for the tariffs, Trump might feel emboldened to keep them in place for a long time, said Holzscheiter. \"I felt a few weeks ago that this was really going to start to go away, and was going to improve, and I feel like it's escalating now,\" he said. \"We are seeing some of the leaders of the Democratic Party are also supporting Trump in this. The more he feels that support from the other side of the aisle, the stronger he's going to be on this .\" China is an important trading partner for the U.S. and for Vermont. The Office of the U.S. Trade Representative said Vermont exported $1.3 billion in goods to Canada, its largest trading partner, in 2018--about 43 percent of its total goods exports. Canada was followed by Hong Kong, with $262 million in exports; Taiwan, with $195 million; South Korea, with $186 million; and China, with $168 million, the office said. A group called the U.S. China Business Council said Vermont's largest areas of export were semiconductors and components; navigational and measuring instruments; dairy products; sawmill and wood products; and manufactured commodities. China was Vermont's third-largest export market for manufactured goods in 2017, after Canada and Hong Kong, according to the Center for Manufacturing Research. Forbes reported that Vermont is the only state where total trade with China has fallen, due to a 4.5% drop in imports in August. Nonetheless, state officials don't seem alarmed by the idea of a prolonged trade impasse. Tim Tierney, director of recruitment and international trade at the Vermont Agency of Commerce and Community Development, said he hadn't heard much discussion about trade restrictions. \"A lot of these have not taken effect and so the impact right now hasn't been felt,\" he said. The issue also affects Vermont's growing cannabis industry, where new laboratories are gearing up to process hemp into CBD. \"We've already spoken to instrumentation companies\" about the tariffs, said Carl Christianson, who recently started Northeast Processors in Brattleboro. Christianson said the company has eight employees and expects to process 400,000 pounds of dried hemp in the coming year. Noah Quist (left) and Carl Christianson (right) prepare CBD products for a photo shoot in their Brattleboro offices at Northeast Processing. Photo by Anne Wallace Allen/VTDigger \"We have had people say,\" order now or it's going to go up by 25% in the next couple of weeks,' \"said Christianson .\" We're talking about instruments that cost hundreds of thousands of dollars, so 25% is pretty substantial. \"It's not even that the new company is buying its instruments from China, Christianson added .\" They're manufactured in America, but the global economy is so intimately tied together that source material comes from all over the world and there are these unintended consequences that affect small business owners, \"he said. Share Tweet Share Email 0 Shares Want to stay on top of the latest business news? Sign up here to get a weekly email on all of VTDigger's reporting on local companies and economic trends. And check out our new Business section here. Daily Sundays only (Weekly Wrap) Email me stories on these subjects...Business News Criminal Justice Education News Environment News Health Care News Politics News Special Topics Final Reading (Evenings) Sanders 2020 News Podcasts & Media Filed under: Business & Economy Tags: A.N. Deringer, <mark>Ben Clark</mark>, Carl Christianson, Chroma Technology, Green Mountain Semiconductor, hemp, Jake Holzscheiter, Northeast Processors, Paul Tillman, Tim Tierney, Vermont Agency of Commerce and Community Development, Wolfgang Hokenmaier", "articleID": "2019051619_00241200_W", "names": {"Ben Clark": ["Q48837098", "Q4885430", "Q4885431", "Q4885432", "Q5725428", "Q57443767"]}}, {"date": "2019-05-17", "url": "http://www.eveningtimes.co.uk/news/17647048.three-charged-after-pregnant-teenager-murdered-and-baby-cut-from-womb/", "content": "News Three charged after pregnant teenager \"murdered and baby cut from womb' By Press Association 2019 Marlen Ochoa-Lopez's family talk to reporters 0 comment A Chicago woman has been charged with murder after allegedly strangling a pregnant teenager and cutting the baby from her womb. Clarisa Figueroa, 46, had previously sold baby clothes to 19-year-old Marlen Ochoa-Lopez, and lured her back to her house with an offer of more clothing, investigators said. Clarisa Figueroa (Chicago Police Department/AP) They added that Figueroa apparently wanted to raise another child two years after her adult son died of natural causes .\" Words cannot express how disgusting and thoroughly disturbing these allegations are, \"Police Superintendent <mark>Eddie Johnson</mark> told reporters at a news conference to announce murder charges against Figueroa and her 24-year-old daughter, Desiree Figueroa. Desiree Figueroa (Chicago Police Department/AP) The mother's boyfriend, 40-year-old Piotr Bobak, was charged with concealment of a homicide. The charges come three weeks after Ms Ochoa-Lopez disappeared and a day after her body was discovered in a bin in the back yard of Figueroa's home on the city's Southwest Side, about four miles from her own home. Piotr Bobak (Chicago Police Department/AP) According to police, the young woman drove from her high school to Figueroa's home in response to an offer of free clothes that Figueroa had posted on Facebook. When she arrived, police said, she was strangled with a cord and the baby cut from her body. A few hours later, Figueroa frantically called 911, claiming that her newborn baby was not breathing. When first responders arrived, the boy was blue. They tried to resuscitate him and took him to hospital, where police said he remained in grave condition and was not expected to survive. Police did not connect the woman's disappearance and the 911 call about the baby until May 7, when friends of Ms Ochoa-Lopez directed detectives to her social media account, which showed she had communicated with Figueroa in a Facebook group for expectant mothers. At the same time, Figueroa had started a GoFundMe campaign for the funeral of what she said was her dying baby, said Sara Walker, a spokeswoman for Ms Ochoa-Lopez's family. Police then conducted DNA tests which showed Ms Ochoa-Lopez and her husband, Yiovanni Lopez, were the baby's parents, Ms Walker said. Yiovanni Lopez (Ashlee Rezin/Chicago Sun-Times/AP) When police arrived to question Figueroa, her daughter said her mother was in hospital with a leg injury, before adding she had just delivered a baby, said Brendan Deenihan, deputy chief of detectives. Police searched the neighbourhood and found Ms Ochoa-Lopez's car a few blocks away. On Tuesday, they returned with a search warrant, finding cleaning supplies as well as evidence of blood in the hallway and the bathroom. They later found the body in a waste bin behind the house and recovered surveillance video that showed Ms Ochoa-Lopez's vehicle driving through the neighbourhood on the day they believed she was killed, authorities said. Missing person notice for Marlen Ochoa-Lopez (Chicago Police/Chicago Tribune/AP) Ms Ochoa-Lopez's family had been looking for her since her disappearance on April 23, organising search parties and holding news conferences as they pushed police for updates. Her father, Arnulfo Ochoa, said relatives were grateful to have found her, and now they want justice. The family was also bracing for the baby's death, while still hoping for a miracle .\" We plead to God that he gives us our child because that is a blessing that my wife left for us, \"Mr Lopez told reporters through a Spanish interpreter outside the morgue where his wife's body was taken. The three suspects are scheduled to appear in court. 0 comment", "articleID": "2019051709_00206721_W", "names": {"Eddie Johnson": ["Q1179451", "Q2325791", "Q376267", "Q5336165", "Q576969", "Q59196952", "Q960818"]}}, {"date": "2019-05-07", "url": "http://www.chardandilminsternews.co.uk/news/17623732.if-i-can-anyone-can-inspirational-ilminster-runner-raises-35k-with-london-marathon/", "content": "News \"If I can, anyone can': Inspirational Ilminster runner raises £ 3.5 k with London Marathon By Oliver Palmen See photos images Skip to next photo 1 / 1 Show caption 1 / 1 0 comment AN ILMINSTER man who decided to take up running after passing the age of 50 has conquered the world-famous London Marathon, and raised £ 3,500 in the process. <mark>Chris Russell</mark> had never been a runner in his life, and before April 28 had only completed the Yeovil Half Marathon as a practice for the main event. While <mark>Chris</mark> wasn't the only person in their 50s to take on the capital challenge, his wife Linda said it was especially impressive as he has never been sporty. The massive fundraising feat was also particularly important to <mark>Chris</mark> as it was a cause close to his heart. Linda <mark>Russell</mark> said:\" He has been raising money for the Round Table Children's Wish. \"He was an Ilminster Round Tabler for many years, until he became too old, and now he is a member of the Yeovil 41 club which is the follow on from Round Table .\" The charity has granted wishes - bespoke wishes - to children with life threatening illnesses. \"This is particularly special for us as our nephew suffered with a life threatening illness .\" He has raised £ 3,500, and is even touching on £ 4,000. \"<mark>Chris</mark> only started running a couple of years ago. He completed the Yeovil Half Marathon last year, and then ran it again in 2019 as a warm up for the Virgin London Marathon. <mark>Chris</mark> said:\" I watched my son, Tom, run the 2017 Yeovil Half Marathon and thought \"I would like to do that' .\" But I have never been a runner, so I started training and I managed to do the 2018 Yeovil Half. \"Since then I haven't stopped running and set myself the massive personal challenge of running the 2019 London Marathon .\" I have never been particularly sporty, and the Yeovil Half was the furthest distance I had run in my life. \"To make this more than a huge achievement for myself, I have decided to run for a charity that is close to my family's heart--The Round Table Children's Wish, which is a registered charity dedicated to granting handcrafted wishes for children and young people with life threatening illnesses .\" More than 444,000 applied in the ballot for a place, with 56,398 successful applicants. This was the 39th year of the London marathon, and the total raised for charities since 1981 passed £ 1billion. \"It was brilliant,\" <mark>Chris</mark> added. \"It was an amazing experience to be honest. It went better than I thought it would .\" On the day it was great and the two pacers I ran with were excellent. \"If I can do it anyone can do it, especially as you get older and start to think about your health .\" <mark>Chris</mark> completed the run in a time of 4 hours, 56 minutes and 22 seconds. 0 comment", "articleID": "2019051914_00111739_W", "names": {"Chris Russell": ["Q5107950", "Q57920886"]}}, {"date": "2019-05-21", "url": "https://ghanasoccernet.com/sources-kompany-wants-man-city-coach-players", "content": "Sources: Kompany wants Man City coach, players Published on: 21 May 2019 G + The FC guys mention Manchester United's '99 treble winners and Arsenal's '98 side when questioning if Man City are the best team of the Premier League era. ESPN FC's Alexis Nunes joins the party in Manchester to get the fans' thoughts on City's treble-winning season and Vincent Kompany's departure. Vincent Kompany says he's given everything to Manchester City as he bids farewell to the supporters at the team's victory parade. Vincent Kompany is hoping to take Manchester City's head of academy coaching and a number of young players on loan with him to Anderlecht, sources have told ESPN FC. Kompany, 33, announced on Sunday that he will leave City this summer, after 11 years with the club, to become player-manager of Anderlecht. TRANSFERS ESPN's step-by-step guide to a transfer Why were Chelsea given a transfer ban? FC Exclusives - PSG to entertain Weah offers - Glazer favourite Martial staying - Man City eye four new signings - Navas won't be No. 1 at Real Madrid - Pogba wants to leave Man United After he announced his departure, Kompany said he wanted to recreate Pep Guardiola's style at the club where he started his career and said: \"It's the football I want to teach .\" City are keen to retain strong links with Kompany and highly rated youth coach <mark>Simon Davies</mark> could further help the development of young players in the Jupiler League. <mark>Davies</mark> was in charge of City's Under-23 side after Patrick Vieira left for New York City FC in Major League Soccer in 2015 before becoming head of academy coaching. The former Manchester United midfielder helped develop the talents of midfielder Phil Foden along with Borussia Dortmund winger Jadon Sancho and Real Madrid forward Brahim Diaz. - Marcotti: Man City are the greatest team of Premier League era - Man City to auction Pep Guardiola's \"coatigan' Kompany said farewell to fans at the club's victory parade in front of 100,000 fans in Manchester on Monday and was presented with the club's goal of the season award for his strike against Leicester in his last game at the Etihad Stadium. And Guardiola said he expects his captain to return to City in the future .\" I think we're going to miss him [Kompany] a lot, \"the City boss told fans .\" I'm going to miss him, but he is going to see us in the future because he is coming back sooner or later. \"It's the best way to say goodbye after an incredible season together. He was a real captain, he helped us a lot .\" Kompany will be back in September for a testimonial match in aid of the homeless at the Etihad Stadium where former players Yaya Toure, Pablo Zabaleta and <mark>Joe Hart</mark> are expected to play. Although plans for a statue to Kompany are still to be confirmed, City have plans to make a \"lasting tribute\" to their most successful ever captain. Source: espn. co. uk", "articleID": "2019052109_00004159_W", "names": {"Joe Hart": ["Q16729685", "Q187184"], "Simon Davies": ["Q310733", "Q3961116", "Q5617815", "Q7518580", "Q7518582", "Q7518583"]}}]