[{"date": "2019-05-21", "url": "http://smh.com.au/entertainment/music/from-the-archives-catcalls-and-curtain-calls-for-judy-garland-20190520-p51p8l.html", "content": "From the Archives: Catcalls and curtain calls for Judy Garland From the Archives: Catcalls and curtain calls for Judy Garland Flashback From the Archives: Catcalls and curtain calls for Judy Garland On May 22, 1964, the legendary Judy Garland boarded a Qantas jet for Hong Kong, ending an Australian tour made notorious by a chaotic appearance at Melbourne's Festival Hall. By Staff reporter Judy Garland leaving Chevron Hotel for Mascot on May 22, 1964. Credit: <mark>Harry Martin</mark> First published in the Sydney Morning Herald on May 21-23, 1964 \"You're late\" : catcalls to Judy Garland (SMH, May 21, 1964) Melbourne, Wednesday. An angry crowd shouting, \"you're late,\" greeted Judy Garland when she arrived for her Festival Hall performance before a crowd of 7,000 tonight. She was due on stage at 8:30 pm. She did not arrive until 9.30 pm. Advertisement As the minutes before she arrived ticked by. The crowd remained generally quiet. There were a few slow hand-claps. Then Judy Garland appeared. She ambled slowly across the stage, smacked the conductor on the head, took his baton and conducted her 30-piece orchestra. Sections of the crowd stamped their feet, cat-called and shouted. \"I love you, too,\" Judy said. Performing at Festival Hall. \"You are late,\" someone shouted. \"I could not get out of that hotel,\" Judy replied. A woman shouted: \"Give her a chance .\" The conductor, Mort Lindsay, pointed his baton at Miss Garland and the orchestra broke into \"When You're Smiling\". Them Miss Garland sang. Within minutes most of the audience had forgiven her. By the end of her fourth number she was completely in control of them. After the show, Miss Garland kept police waiting 25 minutes before she left the stadium. They had to hold crowds back from her car. Quiet Farewell For Judy Garland: 15 Fans At Airport (SMH, May 23, 1964) Judy Garland, accompanied by American actor Mark Herron, left Sydney last night by Qantas jet for Hong Kong in a surprisingly quiet scene at the airport. Only 15 fans farewelled at Mascot, but about a hundred people waited for her outside the foyer of the Chevron Hilton Hotel. Her quiet departure last night was in contrast to arrangements made earlier in the day to get her aboard an aircraft which left Sydney for Hong Kong at 11.30 a.m. Customs, police and airline officials took elaborate steps to ensure that Miss Garland was farewelled without fuss and with dispatch. But she did not turn up. Later, an announcement was made that her booking for the morning flight had been cancelled. Fans who had waited for hours to farewell her dispersed. It was the fourth time Miss Garland had been late for Australian appearances. Remained in hotel She was late for her performance in Sydney, late for her appearance in Melbourne on Wednesday night and late for her flight out of Melbourne on Thursday. She remained in her hotel suite all day yesterday and refused to see anyone. At 9 last night, hotel security officers were told Miss Garland would soon leave the hotel for the airport. But it was 10 p.m., and many false alarms later, when she appeared. People on their way to a ball in the hotel crowded the foyer waiting for her. Finally, Miss Garland, smiling but looking drawn under a huge, floppy hat, stepped out of the lift. She strode quickly through the crowd, clasping at the hands held but to her by dozens of people. There were dozens of warmly spoken farewells: \"Goodbye, Judy, come back .\" and, \"We love you, Judy .\" She arrived at the airport driven straight to a private reception room in the overseas terminal which faces the tarmac. When a crowd of reporters gathered outside the room, her agent, Mr S. Field, arranged an interview with Miss Garland on condition that the reporters would leave immediately they were asked to do so. Would Like To Come Back In the reception room Miss Garland was seated by herself. Miss Garland said she was leaving with good impressions of Australia. \"I would like to come back,\" she said. \"I don't think my fans got a fair impression of me .\" Asked if she had been given fair treatment by the Press, she said: \"Not quite .\" She said a non-committal answer to every question except whether she would return and whether she planned to retire. To that she smiled, and said, \"Oh! Are you offering any money?\" The reporters were then told the interview was at an end. It had lasted two minutes. Miss Garland waited with friends in the reception room. She appeared, smiling and happy, at 10.50 and crossed the tarmac to board the plane. She posed for photographers and waved to the few fans seeing her off. She was dressed in the same yellow coat and hat she had worn when she arrived. Miss Garland and Mr Herron were the last passengers to board the airliner, which left on schedule at 11 p.m. NEW YORK, May 22 (A.A.P.).--Miss Garland's Wednesday concert in Melbourne and her departure from Melbourne on Thursday made headlines in the United States and the United Kingdom. \"Riled Aussies hoot Judy off stage .\" headlined the New York \"World-Telegram\" in a long double column story on the front page. New York's largest circulation evening newspaper, the \"Journal-American,\" ran the story in the middle of its front page under the black heading: \"Judy Booed Off Stage .\" \"Curtain Catcalls\" The tabloid \"Post,\" which carried a local headline and a picture on its front page, put the story over three columns on page three with the headline: \"For Judy: Curtain-Catcalls\" In London, Miss Garland's dramatic night flight from Melbourne was told in front-page stories and pictures in several national newspapers. The five-column headline on the front pace of the \"Daily Herald\" said: \"Tour ends with concert fiasco--and unhappy fans see her leave...Judy is dragged to her plane .\" Judy Garland at Kingsford Smith Airport last night before leaving by Qantas for Hong Kong.", "articleID": "2019052114_00012756_W", "names": {"Harry Martin": ["Q16729680", "Q42277437", "Q5670906"]}}, {"date": "2019-05-21", "url": "https://www.brightonandhovenews.org/2019/05/21/jamies-italian-closes-with-the-loss-of-dozens-of-jobs/", "content": "<mark>Jamie</mark>'s Italian closes with the loss of dozens of jobs Comment: 0 More than 1,000 jobs have been lost with the closure of the chain of Italian restaurants started by celebrity chef <mark>Jamie Oliver</mark>. They include the branch of <mark>Jamie</mark>'s Italian in Black Lion Street, Brighton, and more than 20 others, although three sites at Gatwick airport <mark>will</mark> stay open. Mr <mark>Oliver</mark>, 43, had pledged £ 4 million as the business sought to attract more funding from investors. But today (Tuesday 21 May) the business was placed in administration, with specialist accountants from KPMG given the job of handling its affairs. Five years ago his Brighton branch of Recipease, a cooking school and deli in Western Road, also closed, with the last of the chain folding a year later in 2015. Mr <mark>Oliver</mark> said today: \"I am deeply saddened by this outcome and would like to thank all of the staff and our suppliers who have put their hearts and souls into this business for over a decade. I appreciate how difficult this is for everyone affected .\" I would also like to thank all the customers who have enjoyed and supported us over the last decade. It's been a real pleasure serving you. \"We launched <mark>Jamie</mark>'s Italian in 2008 with the intention of positively disrupting mid-market dining in the UK high street, with great value and much higher-quality ingredients, best-in-class animal welfare standards and an amazing team who shared my passion for great food and service. And we did exactly that .\" KPMG said: \"<mark>Will Wright</mark> and Mark Orton, from KPMG's restructuring practice, have been appointed joint administrators to <mark>Jamie Oliver</mark> Restaurant Group and its subsidiaries <mark>Jamie</mark>'s Italian, <mark>Jamie</mark>'s Italian Holdings, One New Change and Fifteen Restaurant .\" The group employs about 1,300 staff at 25 restaurants across the UK, including 22 under the <mark>Jamie</mark>'s Italian brand, in addition to <mark>Jamie Oliver</mark>'s Diner at Gatwick airport, Barbecoa and Fifteen London. \"The group recently undertook a process to secure additional investment in the business and, since the beginning of this year, <mark>Jamie Oliver</mark> has made additional funds of £ 4 million available to support fundraising .\" However, with no suitable investment forthcoming and in light of the very difficult current trading environment, the directors resolved to appoint administrators. \"Following their appointment, all but three of the group's 25 eateries have closed .\" Both <mark>Jamie</mark>'s Italian restaurants and <mark>Jamie Oliver</mark>'s Diner at Gatwick airport <mark>will</mark> continue to trade in the short term while the joint administrators explore options for the sites. \"Regrettably, these closures <mark>will</mark> result in about 1,000 redundancies .\" <mark>Jamie Oliver</mark> Holdings has made arrangements to ensure all restaurant staff salaries <mark>will</mark> be paid up to the date of the administrators' appointment. \"The international restaurants trading as <mark>Jamie</mark>'s Italian, <mark>Jamie</mark>'s Pizzeria and <mark>Jamie</mark>'s Deli <mark>will</mark> continue to trade as normal and are not affected by the administration of the UK restaurant business .\" Mr <mark>Wright</mark> said: \"The current trading environment for companies across the casual dining sector is as tough as I've seen .\" The directors at <mark>Jamie Oliver</mark> Restaurant Group have worked tirelessly to stabilise the business against a backdrop of rising costs and brittle consumer confidence. \"However, after a sales process that sought to bring new investment into the business proved unsuccessful, the team took the incredibly difficult decision to appoint administrators .\" Unfortunately, with insufficient funds available to be able to trade the business in administration, all but the Gatwick airport restaurants have now closed. \"Our priority in the coming hours and days is to work with those employees who have been made redundant, providing any support and assistance they need .\" See also:", "articleID": "2019052115_00331186_W", "names": {"Jamie Oliver": ["Q1405258", "Q190051"], "Will Wright": ["Q309493", "Q8003199"]}}, {"date": "2019-05-21", "url": "http://www.gamereactor.eu/games/17281/Destiny/?sid=56e4cbef0f2287f1edff55384775f80e", "content": "DESTINY REVIEW. Written by <mark>Paul Davies</mark> on the 26th of September 2016 at 10 \"It feels like the end of the road for Destiny before the true sequel. Having said that, it remains a road well worth travelling .\" 0 REVIEW. Written by <mark>Mike Holmes</mark> on the 21st of September 2015 at 14 \"It builds on the base game and improves it in almost every way, and while it might be pricey, it's an essential expansion for fans .\" NEWS. Written by <mark>Sam Bishop</mark> on the 16th of August 2017 at 15:09 DeeJ cleared the whole thing up for us. 0 NEWS. Written by Ford James on the 23rd of June 2017 at 17:08 But not if you plan to play on PC. 2 NEWS. Written by <mark>Sam Bishop</mark> on the 5th of June 2017 at 12:34 \"Our sole focus at this time is Destiny 2 .\" 1 NEWS. Written by <mark>Sam Bishop</mark> on the 29th of March 2017 at 13:28 Reddit users spotted it.", "articleID": "2019052115_00341318_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Paul Davies": ["Q16669255", "Q21131684", "Q535733", "Q7150145", "Q7150146", "Q7150147", "Q7150148", "Q7150149", "Q7150150", "Q976254"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-05-21", "url": "https://www.wandsworthguardian.co.uk/news/national/17654248.theresa-may-to-set-out-new-deal-on-brexit-in-bid-to-win-support/?ref=rss", "content": "<mark>Theresa May</mark> to set out \"new deal' on Brexit in bid to win support By Press Association 2019 <mark>Theresa May</mark> 0 comment <mark>Theresa May</mark> will set out details of her new plan to get a Brexit deal through Parliament after another difficult Cabinet meeting. The\" new deal \"is an attempt by the Prime Minister to win over critics across the Commons who have rejected her three previous attempts to get an agreement through. The Withdrawal Agreement Bill (WAB) will go to the Commons in early June, with defeat likely to hasten her departure from Number 10. (left to right) Health Secretary Matt Hancock, Education Secretary Damian Hinds and Works and Pensions Secretary Amber Rudd leave the Cabinet meeting (Isabel Infantes/PA) Mrs <mark>May</mark> told the Cabinet:\" The Withdrawal Agreement Bill is the vehicle which gets the UK out of the EU and it is vital to find a way to get it over the line. \"During the two hours spent discussing the Brexit plan, Mrs <mark>May</mark>'s spokesman acknowledged there were\" strong opinions \"around the Cabinet table but also a\" determination \"to get a deal through Parliament .\" The discussions included alternative arrangements, workers' rights, environmental protections and further assurances on protecting the integrity of the UK in the unlikely event that the backstop is required, \"the spokesman said. The talks also covered the\" whole range of topics \"related to the Withdrawal Agreement Bill, including customs arrangements and calls for a second referendum. The meeting was\" characterised by a shared determination to find a way of passing the WAB so that the UK can leave the EU with a deal \", the spokesman said. But\" Brexit is a topic which does carry strong opinions \"and\" they are very often reflected around the Cabinet table \". Downing Street said the package contained\" significant new aspects \"after MPs resoundingly defeated previous versions of the deal three times. Ministers also considered the ongoing preparation for a no-deal Brexit if an agreement has not been ratified by October 31. In a sign of the divisions within the party, Chancellor <mark>Philip Hammond</mark> will use a major speech on Tuesday night to deliver a rebuke to would-be leaders considering a no-deal Brexit. The Chancellor will claim supporters of leaving the bloc without an exit agreement are trying to\" hijack \"the result of the referendum. But Commons leader Andrea Leadsom, who has said she could stand in the contest to replace Mrs <mark>May</mark>, insisted the UK had to be prepared to walk away without a Brexit deal. (PA Graphics) Despite the collapse of cross-party talks with Labour, the WAB contains a series of commitments on workers' rights and environmental protections designed to appeal to opposition MPs. It also contains commitments to look at alternative arrangements to prevent the need for the controversial backstop aimed at keeping a soft border with Ireland, an olive branch for Tory Brexiteers and the DUP. Mrs Leadsom, one of the Cabinet's leading Brexiteers, said she would support the Bill, but warned that could change if its provisions were watered down .\" I continue to support the Prime Minister to get her Withdrawal Agreement Bill through, \"she told BBC Radio 4's Today .\" It is leaving the European Union and so long as it continues to be leaving the European Union, I continue to support it. \"What I do think is that for any negotiation to succeed, you have to be prepared to walk away .\" Justice Secretary David Gauke (Isabel Infantes/PA) But shadow foreign secretary Emily Thornberry dismissed the idea of Labour supporting it, claiming the Bill was a \"piece of political theatre\" for Mrs <mark>May</mark> to have one last shot at getting her deal through. \"It's almost like she is setting up her own political version of the last rites,\" she told Today. \"She cannot realistically expect to see this get through without fundamental changes and we are not going to see fundamental changes, from everything I hear .\" Defeat for the WAB will accelerate Mrs <mark>May</mark>'s departure from Downing Street, with the Prime Minister due to set out the timetable for the contest to replace her after the vote. In a warning to leadership contenders, the Chancellor will use a speech to the CBI's annual dinner in London on Tuesday to highlight the risk of \"right-wing populism\". Boris Johnson (Brian Lawless/PA) He will say that if the Brexit issue is not resolved in the next few weeks, there is a \"real risk\" of a new prime minister moving towards a \"damaging\" no-deal exit policy for \"ideological\" reasons. In what is likely to be seen as a sharp dig at prominent Tory Brexiteers like ex-foreign secretary Boris Johnson, Mr Hammond will say \"all the preparation in the world\" will not avoid the consequences of no deal. 0 comment", "articleID": "2019052118_00114925_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2019-05-21", "url": "http://mideastafrica.foreignpolicy.com/2019/05/21/scott-morrison-won-australias-election-against-all-odds-it-shouldnt-have-come-as-a-surprise-alp-shorten-folau-religion/", "content": "Argument <mark>Scott Morrison</mark> Won Australia's Election Against All Odds. It Shouldn't Have Come as a Surprise. The Australian Labor Party made the same mistakes that have led to failure for center-left leaders across the globe--and the right is reaping the benefits. By <mark>Stan Grant</mark> | May 21, 2019, 4:44 PM Australian Prime Minister <mark>Scott Morrison</mark> (C) shakes hands with Opposition Leader Bill Shorten (L) at a special ecumenical service to mark the start of the parliamentary year at St Paul's Anglican church on Feb. 12 in Canberra, Australia. Tracey Nearmy/Getty Images Understanding Australia's shock election last weekend, in which the right-wing coalition of incumbent Prime Minister <mark>Scott Morrison</mark> unexpectedly won, requires looking to an unlikely source: a conservative Christian rugby star. The pundits didn't see it coming, but they don't spend too much time in church pews. Israel Folau, one of the most outstanding athletes of his generation, has become a lightning rod for debate about freedom of religion in Australia. Folau had his contract with Rugby Australia terminated after he posted a social media message six weeks ago that said, among other things, that gay people were sinners doomed for hell unless they repented and accepted Jesus Christ as their savior. He has been accused of hate speech, causing offense to the LGBTQ community, and breaching the game's code of conduct. What was a heated sports issue spilled over into politics in the final week of election campaigning. <mark>Morrison</mark> shares a similar Pentecostal Christian faith with Folau, and he was asked by journalists if he agreed with the rugby legend and also condemned gay Australians. <mark>Morrison</mark> replied as politicians do: He said he separated his politics and his faith. But within hours, Bill Shorten, the leader of the opposition progressive Labor Party, seized on the remark, seeing a chance to damage the prime minister. But playing politics with faith was a misstep--perhaps a fatal one. Shorten's move raised red flags in the minds of many voters. Just what did he stand for? Did he value the rights of the LGBTQ community not to be offended over the rights of someone to publicly profess their religious beliefs? It came in the same week that Shorten had given a rousing speech pledging to \"change the nation forever .\" But did Australians really want their country changed? Shorten had already outlined an agenda of social change: an ambitious plan for indigenous rights, making Australia a republic (something that had been put to the Australian people and rejected in 1999), as well as higher taxes on what Shorten called \"the big end of town .\" It was old-style class politics, and it spooked some Australians. Retirees, middle-class parents, and those dependent on the mining industry for their livelihoods all felt they were in the firing line. Christian leaders now say that religious freedom was a sleeper issue that turned votes in critical marginal seats. This was the so-called unlosable election for Shorten, who lost to <mark>Morrison</mark>'s predecessor in the 2016 federal election; opinion polls stretching back more than two years said the conservative government was doomed. It was wracked with division, having dumped two prime ministers in internal party coups. They went into the election light on policy but led by a new leader big on faith. Within hours of the vote count, it was clear the polls had been hopelessly wrong. Grand narratives are often foolhardy, and something as complex as an election can't be so tidily explained. But there is a realignment taking place. The wave that has broken across liberal democracies in the West has washed up in Australia. The conservatives have been in power for six years, and after this victory some analysts are predicting at least another six more. Throughout the world, long-silent voices are making themselves heard and it is shaking up politics as usual. In the United States, <mark>Donald Trump</mark> tapped into the frustration of those who felt left behind and promised to make their country great again; Viktor Orban in Hungary has entrenched his leadership by toughening the borders and stopping refugees; in France, Germany, the Netherlands, and Italy, far-right parties are increasing their popularity. At its worst, there are fears of resurgent fascism--certainly nationalism is back. People are saying they want to belong and they want their leaders to put them first. On immigration, trade, climate change policy, and more, countries are putting themselves first amid a blowback against multilateralism and globalization. After two decades marked by Middle East wars, the financial meltdown, and the Great Recession of 2008, whatever consensus had held around the free movement of goods and people and pooled sovereignty is looking frayed. Australia's election is not its <mark>Trump</mark> or Brexit moment as some have suggested--the picture here is too complicated for that. Overall, Australia's democracy is strong: The Economist Intelligence Unit's Democracy Index has placed Australia in the top 10 for the past decade. It is a country not given to political extremes; it is centrist and broadly conservative with a strong ethos of what Australians call a \"fair go\" for all. Australia avoided the worst of the financial crisis and has had nearly 30 years of uninterrupted economic growth in part fueled by a mining boom driven by China's hunger for Australia's natural resources. Compulsory voting also cushions Australia against get-out-the-vote campaigns and voter suppression efforts that can be so decisive in countries like the United States. But there are similarities: The political divide so critical elsewhere in the world is alive in Australia. It has been dubbed the \"quinoa curtain\" --the split between city and country, particularly the heavily mining-dependent state of Queensland, which broke heavily conservative in the election. The other similarity is that Shorten, like progressives globally, lost the ability to talk to big numbers of Australians--whether on religious freedoms, free speech, tax, or climate change policy. He created too many potential losers. Even worse, he lost the ability to listen. He wanted to change Australians, but he didn't think to ask if they wanted changing. Progressive hubris plays into the hands of the conservative right. The right is at home talking about nation and family and faith. <mark>Scott Morrison</mark> is a Christian, rugby-loving, suburban family man. In Australia we would endearingly call him a \"bogan .\" He is also a tough politician who knows his side: As immigration minister in 2013 and 2014 he turned back refugee boats and toughened Australia's border patrol; he once brought a lump of coal into Parliament to argue against shutting down mines to appease environmentalists. <mark>Morrison</mark> dedicated his victory to the \"quiet Australians .\" He claims to like them just as they are and does not seek to change them. Progressive politicians in Australia, like everywhere, are now realizing that if they want change, they need to win power--and that means bringing the people with them rather than telling them what's good for them. Two days before Australia's federal election, one of the country's most loved and popular former prime ministers, Bob Hawke, passed away. He came to power in the 1980s as a former union leader and towering figure of the left, but his message was summed up in one word: consensus. In four elections, he was never defeated. And he was a rugby fan. View Comments Tags: Argument, Australia, Elections, Politics, Religion, Sports Trending Now Sponsored Links by Taboola By Taboola More from Foreign Policy By Taboola Read More Australia's Draconian Refugee Policy Comes Home to Roost The government has gone to great lengths to keep asylum-seekers from its shores. Now it might have to accept some of them after all. Argument | Mark Isaacs The Abuse Scandal Rocking Australia's Special Operations Forces How changing military strategy may have led to misconduct. Argument | C. August Elliott Is China Pulling the Strings Down Under? Revelations about Chinese influence have rocked Australian media and politics. Should the U.S. have the same debate? ChinaFile | <mark>Kerry Brown</mark>, Kevin Carrico, Peter Mattis", "articleID": "2019052121_00224135_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Kerry Brown": ["Q55615855", "Q6394477", "Q6394478", "Q6394480"]}}]