[{"date": "2019-05-21", "url": "http://mideastafrica.foreignpolicy.com/2019/05/21/scott-morrison-won-australias-election-against-all-odds-it-shouldnt-have-come-as-a-surprise-alp-shorten-folau-religion/", "content": "Argument <mark>Scott Morrison</mark> Won Australia's Election Against All Odds. It Shouldn't Have Come as a Surprise. The Australian Labor Party made the same mistakes that have led to failure for center-left leaders across the globe--and the right is reaping the benefits. By <mark>Stan Grant</mark> | May 21, 2019, 4:44 PM Australian Prime Minister <mark>Scott Morrison</mark> (C) shakes hands with Opposition Leader Bill Shorten (L) at a special ecumenical service to mark the start of the parliamentary year at St Paul's Anglican church on Feb. 12 in Canberra, Australia. Tracey Nearmy/Getty Images Understanding Australia's shock election last weekend, in which the right-wing coalition of incumbent Prime Minister <mark>Scott Morrison</mark> unexpectedly won, requires looking to an unlikely source: a conservative Christian rugby star. The pundits didn't see it coming, but they don't spend too much time in church pews. Israel Folau, one of the most outstanding athletes of his generation, has become a lightning rod for debate about freedom of religion in Australia. Folau had his contract with Rugby Australia terminated after he posted a social media message six weeks ago that said, among other things, that gay people were sinners doomed for hell unless they repented and accepted Jesus Christ as their savior. He has been accused of hate speech, causing offense to the LGBTQ community, and breaching the game's code of conduct. What was a heated sports issue spilled over into politics in the final week of election campaigning. <mark>Morrison</mark> shares a similar Pentecostal Christian faith with Folau, and he was asked by journalists if he agreed with the rugby legend and also condemned gay Australians. <mark>Morrison</mark> replied as politicians do: He said he separated his politics and his faith. But within hours, Bill Shorten, the leader of the opposition progressive Labor Party, seized on the remark, seeing a chance to damage the prime minister. But playing politics with faith was a misstep--perhaps a fatal one. Shorten's move raised red flags in the minds of many voters. Just what did he stand for? Did he value the rights of the LGBTQ community not to be offended over the rights of someone to publicly profess their religious beliefs? It came in the same week that Shorten had given a rousing speech pledging to \"change the nation forever .\" But did Australians really want their country changed? Shorten had already outlined an agenda of social change: an ambitious plan for indigenous rights, making Australia a republic (something that had been put to the Australian people and rejected in 1999), as well as higher taxes on what Shorten called \"the big end of town .\" It was old-style class politics, and it spooked some Australians. Retirees, middle-class parents, and those dependent on the mining industry for their livelihoods all felt they were in the firing line. Christian leaders now say that religious freedom was a sleeper issue that turned votes in critical marginal seats. This was the so-called unlosable election for Shorten, who lost to <mark>Morrison</mark>'s predecessor in the 2016 federal election; opinion polls stretching back more than two years said the conservative government was doomed. It was wracked with division, having dumped two prime ministers in internal party coups. They went into the election light on policy but led by a new leader big on faith. Within hours of the vote count, it was clear the polls had been hopelessly wrong. Grand narratives are often foolhardy, and something as complex as an election can't be so tidily explained. But there is a realignment taking place. The wave that has broken across liberal democracies in the West has washed up in Australia. The conservatives have been in power for six years, and after this victory some analysts are predicting at least another six more. Throughout the world, long-silent voices are making themselves heard and it is shaking up politics as usual. In the United States, <mark>Donald Trump</mark> tapped into the frustration of those who felt left behind and promised to make their country great again; Viktor Orban in Hungary has entrenched his leadership by toughening the borders and stopping refugees; in France, Germany, the Netherlands, and Italy, far-right parties are increasing their popularity. At its worst, there are fears of resurgent fascism--certainly nationalism is back. People are saying they want to belong and they want their leaders to put them first. On immigration, trade, climate change policy, and more, countries are putting themselves first amid a blowback against multilateralism and globalization. After two decades marked by Middle East wars, the financial meltdown, and the Great Recession of 2008, whatever consensus had held around the free movement of goods and people and pooled sovereignty is looking frayed. Australia's election is not its <mark>Trump</mark> or Brexit moment as some have suggested--the picture here is too complicated for that. Overall, Australia's democracy is strong: The Economist Intelligence Unit's Democracy Index has placed Australia in the top 10 for the past decade. It is a country not given to political extremes; it is centrist and broadly conservative with a strong ethos of what Australians call a \"fair go\" for all. Australia avoided the worst of the financial crisis and has had nearly 30 years of uninterrupted economic growth in part fueled by a mining boom driven by China's hunger for Australia's natural resources. Compulsory voting also cushions Australia against get-out-the-vote campaigns and voter suppression efforts that can be so decisive in countries like the United States. But there are similarities: The political divide so critical elsewhere in the world is alive in Australia. It has been dubbed the \"quinoa curtain\" --the split between city and country, particularly the heavily mining-dependent state of Queensland, which broke heavily conservative in the election. The other similarity is that Shorten, like progressives globally, lost the ability to talk to big numbers of Australians--whether on religious freedoms, free speech, tax, or climate change policy. He created too many potential losers. Even worse, he lost the ability to listen. He wanted to change Australians, but he didn't think to ask if they wanted changing. Progressive hubris plays into the hands of the conservative right. The right is at home talking about nation and family and faith. <mark>Scott Morrison</mark> is a Christian, rugby-loving, suburban family man. In Australia we would endearingly call him a \"bogan .\" He is also a tough politician who knows his side: As immigration minister in 2013 and 2014 he turned back refugee boats and toughened Australia's border patrol; he once brought a lump of coal into Parliament to argue against shutting down mines to appease environmentalists. <mark>Morrison</mark> dedicated his victory to the \"quiet Australians .\" He claims to like them just as they are and does not seek to change them. Progressive politicians in Australia, like everywhere, are now realizing that if they want change, they need to win power--and that means bringing the people with them rather than telling them what's good for them. Two days before Australia's federal election, one of the country's most loved and popular former prime ministers, Bob Hawke, passed away. He came to power in the 1980s as a former union leader and towering figure of the left, but his message was summed up in one word: consensus. In four elections, he was never defeated. And he was a rugby fan. View Comments Tags: Argument, Australia, Elections, Politics, Religion, Sports Trending Now Sponsored Links by Taboola By Taboola More from Foreign Policy By Taboola Read More Australia's Draconian Refugee Policy Comes Home to Roost The government has gone to great lengths to keep asylum-seekers from its shores. Now it might have to accept some of them after all. Argument | Mark Isaacs The Abuse Scandal Rocking Australia's Special Operations Forces How changing military strategy may have led to misconduct. Argument | C. August Elliott Is China Pulling the Strings Down Under? Revelations about Chinese influence have rocked Australian media and politics. Should the U.S. have the same debate? ChinaFile | <mark>Kerry Brown</mark>, Kevin Carrico, Peter Mattis", "articleID": "2019052121_00224135_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"], "Stan Grant": ["Q7597664", "Q7597665"]}}, {"date": "2019-05-22", "url": "http://www.penarthtimes.co.uk/news/national/17657744.finucane-defies-loyalist-threat-as-he-starts-work-as-belfast-mayor/", "content": "Finucane defies loyalist threat as he starts work as Belfast mayor By Press Association 2019 Lord Mayor of Belfast John Finucane meets the Prince of Wales 0 comment John Finucane has vowed not to be deterred by a loyalist threat, as he met the Prince of Wales on his first day as Belfast's new mayor. The Sinn Fein councillor, whose solicitor father Pat was murdered by paramilitaries 30 years ago, said police have warned him that loyalists were planning to attack his family home. He said officers came to his house to inform of the threat on Tuesday night, just hours after he was formally elected mayor at City Hall. Mr Finucane, a 39-year-old father of four, proceeded with his first day in post as planned, welcoming Charles to the city on Wednesday morning. \"Last night the PSNI came to my home to tell me of a threat by loyalists to attack me in my family home,\" he said. Belfast solicitor Pat Finucane (PA) \"I am committed to serving and representing all the people of this city and I will not be deterred from that by threats from anyone .\" This is not just a threat against me but it is also a threat against democracy. \"Sinn Fein MLA <mark>Gerry Kelly</mark> said:\" This reprehensible threat against John Finucane has to be condemned. \"The reference to his family home was clearly deliberate, given this is where his father was murdered by loyalists .\" It is a cowardly attempt to intimidate the newly-elected first citizen of Belfast. \"0 comment", "articleID": "2019052216_00407608_W", "names": {"Gerry Kelly": ["Q15463074", "Q5552825"]}}, {"date": "2019-05-23", "url": "http://greenwichtime.com/uconn/article/UConn-women-s-notebook-Multiple-UConn-stars-13877208.php", "content": "https: //www.ctpost.com/uconn/article/UConn-women-s-notebook-Multiple-UConn-stars-13877208.php Auriemma: \"Not a great summer' for UConn icons in WNBA By Doug Bonjour Updated 9:12 pm EDT, Wednesday, May 22, 2019 Former UConn teammates <mark>Sue Bird</mark> (6) and Diana Taurasi (12) take a break in the action against Canada during the 2012 Olympics. Former UConn teammates <mark>Sue Bird</mark> (6) and Diana Taurasi (12) take a break in the action against Canada during the 2012 Olympics. Photo: <mark>Christian Petersen</mark> / Getty Images Photo: <mark>Christian Petersen</mark> / Getty Images Image 1 of / 4 Caption Close Image 1 of 4 Former UConn teammates <mark>Sue Bird</mark> (6) and Diana Taurasi (12) take a break in the action against Canada during the 2012 Olympics. Former UConn teammates <mark>Sue Bird</mark> (6) and Diana Taurasi (12) take a break in the action against Canada during the 2012 Olympics. Photo: <mark>Christian Petersen</mark> / Getty Images Auriemma:\" Not a great summer' for UConn icons in WNBA 1 / 4 Back to Gallery BRANFORD--The WNBA season will tip off Friday, albeit without some of its most recognizable stars out of UConn. Breanna Stewart tore her Achilles' tendon, Diana Taurasi had back surgery, and Maya Moore stepped away to spend more time with her family and focus on her faith. And then came news Tuesday that <mark>Sue Bird</mark>, Stewart's teammate on the defending champion Seattle Storm, needs arthroscopic surgery on her knee and will be out indefinitely. \"It's not a great summer, huh, for the UConn icons,\" Geno Auriemma remarked, as the UConn Coaches Roadshow stopped at Stony Creek Brewery on Wednesday. <mark>Bird</mark>, Moore, Stewart and Taurasi are all program icons. And the reality is, they're all expected to miss most, if not all, of the upcoming season. \"It's a really weird coincidence that it all kind of converged at the same time,\" Auriemma said. Sports Videos Seattle didn't specify a timetable for <mark>Bird</mark>'s return, but Auriemma is obviously hoping her absence is short-term. <mark>Bird</mark>, an 11-time All-Star, was one of 17 former Huskies in the WNBA at the start of last season. \"<mark>Sue</mark>'s going to do what she's always done her entire career,\" Auriemma said. \"She's going to make sure she's 100 percent ready to go when she is ready to go. She's not one of these people that does things half way .\" Rivalry continues If Auriemma had it his way--and his way only--he'd schedule more games against marquee opponents after the New Year. UConn had three such contests last year, losing to eventual national champion Baylor and Louisville on the road in January, and beating South Carolina in Hartford in February. The school recently renewed their series with the Gamecocks through 2021-22. The two teams will play this season in Columbia, completing a four-year agreement. \"South Carolina's one of the schools that isn't worried about playing in January and February,\" Auriemma said. \"There's a lot of schools, they all want to play in November and December. Well, you can only play so many games in November and December ....Our kids look forward to those January and February Monday night big games on national TV. They're really cool. The more we can do of those, the better .\" Looking ahead During a question-and-answer session with fans, Auriemma was asked whether he's given thought to how much longer he'd like to continue coaching. His response? \"I don't think there's anybody in life that after you've done something, in my case, 44 years I've been coaching...that doesn't wake up some mornings and say,\" Do I really want to keep doing this?' I think that's just human nature, \"Auriemma, 65, said .\" If you say, \"No, every day's a new day for me,' you're not being honest I bet. We all go through that .\" The difference is, you ask yourself, \"Why would I feel like that?' he continued .\" Is it because it's gotten really hard or it's gotten too easy? Is it because I don't want to deal with the bureaucratic part of it or I'm tired of the travel? If it's, \"I don't like my job because I don't like my practice, I don't like being around the players, I don't like trying to put my team together, I don't enjoy that anymore,' that's not happened .\" dbonjour @ ctpost.com; @ DougBonjour Most Popular 1 The mobs are ruining storm chasing 2 Cabot the great white shark bids farewell to Greenwich 3 Police: Video shows woman abandoning child found asleep in stroller, covered in trash 4 \"Carl's life was nothing but pain': Boy who was badly beaten as a baby dies at 14 5 Greenwich lawyer faces prison time in college admissions scandal 6 Son of Roger Clemens charged with drunken driving 7 Great white shark tracked off Greenwich coast View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019052301_00063908_W", "names": {"Christian Petersen": ["Q1081372", "Q3675690", "Q5110030"], "Sue Bird": ["Q240672", "Q56682147"]}}, {"date": "2019-05-23", "url": "http://www.gamereactor.eu/?system=ps4&sid=ac89f8461540f343d6e8bf40ef18228e", "content": "PS4 Here's everything you need to know ahead of this year's E3. Review The Sinking City gets new gameplay trailer Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 16:00 Frogwares' game is due to launch next month, and here we get another look into <mark>Charles Reed</mark>'s journey into Oakmont. 0 Superhot VR arrives on the Oculus Quest Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 15:49 The team has been working to tailor the game for the tetherless hardware, which they particularly wanted for Superhot. 0 John Wick's Derek Kolstad making Just Cause film Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 15:17 Constantin Film is also on board to bring Avalanche's game to the big screen, as is Adrian Askarieh, Square Enix, and more. 0 Devil May Cry 5 has sold 2.1 million units so far Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 15:00 Capcom's new sales update has also revealed that Resident Evil 2 has shifted 4.2 million units, with both games releasing this year. 0 Parasites invade Just Cause 4 with Los Demonios DLC Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 13:42 This brings a whole new kind of threat to Solis in July, along with new enemies, weapons, and more to experience. 0 THQ Nordic acquires Piranha Bytes Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 13:11 The studio is responsible for the likes of Elex, Gothic, and Risen, and now THQ Nordic is coming on board to extend their existing relationship. 0 Valve \"not really sure what to do\" on AC: Unity review bomb Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 11:05 This was a positive review bomb after the Notre Dame fire, as players flooded into the game to see the virtual version for themselves. 0 A new Grid steers its way towards consoles and PC this year Written by Ben Kerry on the 22nd of May 2019 at 10:07 Codemasters has announced that the racing franchise is back after a five-year hiatus, and Grid 2 is currently free to try as well. 0 The Sims 4 is entirely free on Origin until May 28 Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 10:03 If you haven't experienced Simlish or creating an ideal virtual life for yourself, now you can for no cost whatsoever. 0 Watch us play the opening of Observation Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 09:30 No Code's game is finally here, and we've got a launch trailer as well as our livestream replay to share with you. 0 We're taking on Dauntless on today's stream Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 09:08 Phoenix Labs' action-RPG has just been released, so we're trying it out on today's stream to see what's what. 0 The Dark Pictures - Man of Medan releases in August Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 09:00 Supermassive Games and Bandai Namco have revealed a Curator's Cut as well, offering new perspectives on the story. 0 Toronto Defiant promote Gods and Sharyk to main team Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 08 Both of these players have represented Contenders side Montreal Rebellion, and have now earned a place in the Overwatch League. 0 World of Warships: Legends hits one million global players Written by <mark>Sam Bishop</mark> on the 21st of May 2019 at 15:37 There is plenty still to come though, with the Atlanta Campaign, Free and Starter Packs, and Premium Ships this month. 0 World War Z has been played by almost two million Written by <mark>Sam Bishop</mark> on the 21st of May 2019 at 15:05 A new accolades trailer has also been released a month on from release, showing even more of the zombie game.", "articleID": "2019052302_00301205_W", "names": {"Charles Reed": ["Q22106118", "Q5081968", "Q57412767"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-05-23", "url": "http://blogs.houstonpress.com/music/things-to-do-jaimee-harris-will-perform-at-mucky-duck-with-mary-gauthier-11295374", "content": "Print Article A A There are professions as old as mankind that stand the test of time due to our dependence on them. Musicians make that list and Jaimee Harris knew this was the life for her when she was a little girl in Waco. Her father would fill her ears with music and take her on the road, often playing show in Houston with his cover band and letting young Harris take the stage during intermission, if the bar didn't kick her out first for being underage. Harris, who will appear at Mucky Duck on May 30, grew up in the Clear Channel dominated airwaves of Waco and made it her mission to seek out quality artists who focused on songwriting as a craft. She would spend countless nights at home studying the songs of others in her bedroom and teaching herself how to write. When a friend told her about the bustling music scene in Austin, Harris packed it up and moved on down. \"My heroes and people that I look up to, they are in Austin. I literally got convinced to move to Austin because a guy pointed at Congress and said\" There's a club down there where James McMurtry plays twice a week for less than ten dollars .' So many of the artists that I gravitated towards when I was learning to write songs were all there. \"says Harris. Her passion for the craft of songwriting was instantly recognizable to the artists she sought out and she was quickly embraced by the core of Austin's singer songwriter community. People who she had admired from afar back in Waco were now taking her under their wing, including the late, great Jimmy LaFave .\" I was really attached to his music when I was learning how to write my own songs and learning how to play guitar so the opportunity to get to work with him years later was such a joy for me and then to have a friendship with him and to have him as a mentor, obviously was such an unbelievable dream. \"Two years ago, Harris kicked off LaFave's final concert in Austin; a gut wrenching, soul shaking farewell concert that he organized himself to say goodbye to the city that had embraced him so warmly. LaFave passed away just days after sharing nothing but love on stage that night .\" There's only one of him. I remember after Jimmy left the stage I was standing there with Ray Bonneville, we stood together and we looked at this spot where Jimmy had been. It was like when you see a shooting star in the sky and you keep looking at that spot expecting that to happen again, but you know that it won't. \"Harris adds,\" Jimmy was such a great connector of people. He's how I got connected eventually to <mark>Gretchen Peters</mark>, Eliza Gilkyson and eventually Mary Gauthier. There are still people that I meet as I tour across the country that I'm connected to from Jimmy. \"LaFave guided Harris toward living artists but also pushed Harris to study artists of the past and gave her lessons in all things Woody Guthrie .\" He was the one who sparked my interest and it grew into a minor obsession. \"Harris admits with a chuckle. This year will be her fifth year performing at the Woody Guthrie Folk Festival in Okemah, Oklahoma. A unique experience to say the least; the small town only has one hotel and it gets packed to rim with musicians who come to honor the patron saint of songwriting, Woody Guthrie. LaFave also lent his vocals to the title track of his friends debut album, Red Rescue .\" Jimmy came in to sing on it and at the time we knew that he probably wasn't going to be alive by the time was released. \"says Harris .\" He was such a part of my musical fabric that it still blows my mind that it happened, that he sang on my record. \"\"Red Rescue\" tells the unfortunate and common tale of someone wanting to save another person from their situation without considering that sometimes people don't want to be rescued or don't even realize they need help. The song is based on a true story told to Harris by a friend discussing his ex wife. \"That song was about somebody else but this is a central theme of the record; you can't be saved from your own darkness by somebody else, you have to put in the work. Sometimes that does mean asking for help, but that part has to be voluntary .\" Harris knows a thing or two about dark times and described how music has helped her to progress in life, \"It has given me an opportunity to be a part in a world where I might not be able to function so well without it .\" In her first years in Austin she battled with alcohol and substance abuse and ended up in jail twice. After her second stint she knew it was her responsibility to get her act together. Harris got the usual runaround from state departments and insurance companies on her quest for support towards sobriety. Harris learned firsthand just how flawed the system is. One state employee even advised her to drink again so that she would be covered for a recovery program. \"I think a lot of people who don't have personal experience with the system, don't realize how many things are working against you .\" Her experiences have inspired Harris to reach out to marginalized communities who need more help then the state is willing or able to provide. \"My heart is really with prisons, women in prison specifically, and addicts in prison. I think the real crime is locking away addicts, not helping them and creating this inter-generational incarceration .\" Along with her touring partner, Mary Gauthier, the two women have performed at and worked with centers for women in Texas and Oklahoma. The two met at a songwriting workshop led by Gauthier, Gilkyson and <mark>Peters</mark>. Gauthier reached out to Harris and offered to be part of her support network if she needed it. \"I started realizing how amazing and powerful it is to have women that are in the business around you because you are able to talk about the issues that face you, what we are dealing with and how to move it collectively forward .\" says Harris of her budding friendships with so many women in the music business. If you like this story, consider signing up for our email newsletters. SHOW ME HOW email Both women are a perfect fit to share a bill, carrying the torch for songwriters of the past simply trying to make sense of the world and help others. \"The state of the world is in such chaos and when people are in pain great songs are written and those great songs tap into the universal experience of the people who are suffering. It brings us together and helps to create unity at a time when things could so horribly go off the rails. It gives us hope I think .\" Jaimee Harris will perform with Mary Gauthier Thursday May 30 at McGonigels Mucky Duck, 2425 Norfolk, early shows at 7 p.m. and at 9:30 p.m. $30", "articleID": "2019052321_00251936_W", "names": {"Gretchen Peters": ["Q4818845", "Q51799886"]}}, {"date": "2019-05-23", "url": "https://www.theobserver.ca/news/crime/dirty-dick-retired-nyc-detective-and-wife-plead-guilty-to-running-brothel-and-gambling-rooms/wcm/5f9a3f96-8a85-46a3-bf37-002e23230e48", "content": "DIRTY DICK: Retired NYC detective and wife plead guilty to running brothel and gambling rooms Published on: May 23, 2019 | Last Updated: May 23, 2019 7:04 PM EDT The devious crime couple Arelis Peralta and Ludwig Paz Facebook Share Adjust Comment Print Retired NYPD detective Ludwig Paz and his wife pleaded guilty to masterminding a sex and gambling ring that netted them an eye-popping $2 million. The kingpin of Queens, 51, and his wife, Arelis Peralta, 43, admitted to operating bordellos in Queens, Brooklyn and Nassau Counties as well as underground gambling establishments. The illicit gaming dens were operated behind beauty parlours and other fronts. Arelis Peralta and Ludwig Paz enjoying some of their ill-gotten bounty. (Facebook) The modern-day Bonnie and Clyde allegedly had several other cops lending a hand in their vice empire. Their buddies in blue would give them the heads up when police were planning undercover stings and raids. The seven cops arrested and alleged to be corrupt: Sergeants Cliff Nieves, 37, Steven Nieves, 32, Giancarlo Raspanti, Sergeant <mark>Carlos Cruz</mark>, 41, Rene Samaniego, 43, Giovanny Rojas Acosta, 40, and Sergeant Louis Failla. Bound body found in suitcase identified as New York woman The allegedly crooked cops traded tips for cash and sex, prosecutors said. Former vice squad detective Paz was savvy on how to avoid the cops from his previous work on the force. He forced new johns to get naked in front of hookers when first entering to prove they weren't undercover cops. Officers are forbidden from exposing their genitals in front of prostitutes when on duty. \"I want to commend the NYPD's Internal Affairs Bureau and members of this office's Organized Crime and Rackets and Integrity Bureaus for their hard work and dedication in closing down the defendant's illegal businesses,\" Queens District Attorney <mark>John Ryan</mark> told the New York Post. Arelis Peralta and Ludwig Paz in happier times. (Facebook) Prosecutors say the brothels and illicit casinos were run for around 13 months. Patrons of the brothels were charged $40 for fifteen minutes of sex or $160 for an hour. Paz faces 12 years in prison when he's sentenced at the end of June. His wife was immediately given 364 days in jail after admitting to being her husband's Duchess of Windsor to his Duke.", "articleID": "2019052323_00055075_W", "names": {"Carlos Cruz": ["Q16337071", "Q21005272", "Q5041960", "Q5041962", "Q5750097"], "John Ryan": ["Q16232393", "Q1701635", "Q20738089", "Q20980454", "Q21030342", "Q21166170", "Q3182407", "Q34797535", "Q6256071", "Q6256072", "Q6256074", "Q6256076", "Q6256085", "Q6256088", "Q6256090", "Q6256092"]}}]