[{"date": "2019-05-24", "url": "https://adage.com/article/cmo-strategy/why-nike-picked-tiny-atelier-make-its-denim-shoe/2174001", "content": "CMO Strategy Why Nike picked this tiny atelier to make its denim shoe Denim is enjoying a widespread resurgence Published on May 24, 2019. Credit: Nike In the back corner of a clothing boutique in downtown Manhattan, past the bolts of denim hanging from the wall, eight tailors and one cutter are at work sewing custom jeans. Each will make just two or three pairs in a day. The shop, called 3x1 (three-by-one), has intrigued shoppers and industry insiders alike. It is known for experimenting with selvedge denim sourced from mills around the world and for playing with new designs. Fans include professional athletes such as Lebron James, <mark>Tony Parker</mark> and Victor Cruz, whose superhuman physiques are ill-served by off-the-rack denim. A fully bespoke 3x1 pair can run upward of $1,200, but there are other ways for a high-end label to gain exposure to new shoppers. On Friday, 3x1 and Nike Inc. are releasing three limited-edition selvedge denim shoe styles, putting the type of fabric on the Air Force 1 for the first time ever, after 1,500 iterations. The sneakers cost $130 and come in stonewash blue, raw indigo and black denim. It's an important moment for the small denim house. \"We've had so many Nike relationships over the years,\" said owner and denim industry veteran <mark>Scott Morrison</mark>. \"I hope that this will be the first of many things we get to do .\" Nike is under constant pressure to develop new styles, so it often collaborates with outside fashion houses and designers. Drops happen every few days in an eternal cycle of hype, long lines and sellouts. Nike delivered strong results globally last quarter, but had weak sales in North America due to a slow period at its U.S. retail partners. Using non-traditional materials is one way to stand out, but the new collaboration won't be the first denim sneaker. Adidas, Puma and Converse have all sold denim styles. Nike previously made denim skateboarding sneakers and Air Jordans in collaboration with Levi's. The relationship between Nike and 3x1 began, at least in part, like many New York relationships: thanks to forced proximity. The 3x1 store is right next door to NikeLab 21 Mercer, a high-concept shop that's frequented by celebrities and hosts regular sneaker drops. Nike Chief Executive Officer Mark Parker began visiting the neighboring shop in 2011, and <mark>Morrison</mark> often chats with Al Baik, senior creative director of men's footwear at Nike Sportswear. Baik wanted to put high-end denim on people's feet. \"It only made sense to leverage <mark>Scott</mark>'s passion and expertise to get us there,\" he said. Denim is enjoying a widespread resurgence at the moment, having mounted a comeback in the past two years after shoppers passed over the classic style in favor of leggings and yoga pants throughout the mid-2010s. <mark>Morrison</mark> was along for that whole ride: He's been in the denim business for decades, first with Paper Denim & Cloth, then Earnest Sewn, before going on to run Japanese denim company Evisu. At 3x1, the custom jeans are its standout product, but the bulk of its business is in wholesale. The label's regular jeans run for around $200 to $400 and can be found in luxury retailers such as Saks Fifth Avenue, Bloomingdale's and Net-a-Porter. <mark>Morrison</mark> hopes to open additional 3x1 stores in California and Europe. He declined to share revenue numbers, but said the business is now \"as close to I've ever seen to profitable .\" --Bloomberg News In this article: CMO Strategy Retail and E-commerce", "articleID": "2019052416_00032433_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"], "Tony Parker": ["Q193108", "Q19588477", "Q52151028", "Q52899347"]}}, {"date": "2019-05-25", "url": "http://highschoolsports.nj.com/news/article/-4425574274652336114/county-champs-nottingham-ww-p-north-chase-sectional-track-and-field-titles-video/", "content": "County champs Nottingham, WW-P North chase sectional track and field titles (VIDEO) By Andrew Borders | For NJ Advance Media on May 24, 2019 9:05 PM Central Jersey, Group 2 and 3 Meet Results Nottingham and West Windsor-Plainsboro North claimed the Mercer County boys and girls track and field titles two weeks ago, and now that the NJSIAA postseason has begun, those two teams are aiming high. Nottingham got a win in the 100 from Dana Ridley in the 100 (10.50) and WW-P North got wins from Nadia Elhossieni in the shot put (38-4 3/4) and Aditi Parekh in the long jump (18-0 1/4) to stand fifth and second their respective Central Jersey, Group 3 meets at Jackson Liberty heading into Saturday's 9 a.m. resumption. With both the Central Jersey, Group 2 and 3 boys discus results outstanding from Friday, as well as the Group 3 triple jump, WW-P North's boys lead Central Jersey, Group 3 28.5-26 over host Jackson Liberty with Hopewell Valley third at 16 and Nottingham fifth at 14. Colts Neck's girls lead WW-P North 47-44 with Northern Burlington third at 39. In Group 2, Matawan's boys lead Rahway 48-34, and Rumson-Fair Haven's girls lead Matawan 47.5-47. Competitors who finish in the top six in their events will advance to next weekend's group meet at Central Regional. \"Outperforming seeds is helping us out,\" WW-P North coach Matthew Warren said. \"When we showed up today, I said just like, girls, go for it. So far, they have. The performances have been either, like I said, outperforming seeds or just overwhelmingly incredible PRs from, like, Aditi. Tomorrow, we have another day .\" Parekh's previous outdoor long jump best was 17-3 1/2 from the sectional meet two years ago. Ridley's time surpassed the section record of 10.62 in fully-automated time as well as the hand-timed marks of 10.6, but the wind level of 3.6 meters per second surpassed the standard of 2.0 meters per second for the record to stand. \"I didn't have a time (goal) because I knew it was going to be wind-aided, so I just was going for place,\" Ridley said. Nottingham was dealt a tough blow when sprinter Louis Akpadago's hamstring did not recover in time for the meet after an injury suffered at the Mercer County meet. \"We thought that he had enough time to recover, but obviously, he didn't, so he won't run again until the nationals now. That's a big, big hole, but we needed something, we needed a spark, and (Ridley) kind of gave us one,\" Nottingham coach <mark>Jon Adams</mark> said. \"Dana kind of came to the rescue. Really, he's been working hard. We needed Superman to step up, and he showed up. The kid is a warrior and he proved that he's one of the top sprinters, and that's great for him .\" Carteret's Stephon Kelley-Gordon surpassed his own sectional record distance of 46-9 in the triple jump, leaping 48-0 3/4 to win that event in Central Jersey, Group 2, but those results had the No Wind Instrument designation to measure the gusts on an afternoon that saw its share of them. All in Central Jersey, Group 3, Steinert's Terris Burton won the high jump in 53.73, Hopewell Valley's Sean Dolan won the 1600 in 4:22.59, and Northern Burlington had two wins, from Kaneisha Raymond in the 400 hurdles in 1:07.37 and from Nathina Wright in the javelin at 111-0. Among the performances of note at the meet from outside the capital region, Metuchen's Nina Suss, Caroline Schleif, Camille Lussier and Mary Malague won the 4x800 in 9:40.90 to break the Central Jersey, Group 2 meet record of 9:42.64 Matawan set two years ago. When the meet resumes on Saturday, Nottingham will be looking to move up a spot from the runner-up finish it had to WW-P North last year, and the Knights' will be aiming to jump four spots from their fifth-place finish in 2018. <mark>Adams</mark> feels confident about where the Northstars stand. \"We'll see what happens tomorrow when we run our wheelhouse events, the 110 hurdles, the 200, the 4x1 and the javelin,\" <mark>Adams</mark> said. \"We put ourselves in pretty good position .\" ", "articleID": "2019052501_00116662_W", "names": {"Jon Adams": ["Q29650168", "Q42392966"]}}, {"date": "2019-05-25", "url": "http://www.bromsgroveadvertiser.co.uk/news/national/17664618.tory-battle-intensifies-as-new-candidates-emerge/", "content": "Tory battle intensifies as new candidates emerge By Press Association 2019 Tory leadership front runner Boris Johnson (David Mirzoeff/PA) 0 comment The Tory leadership race has exploded into life, with Cabinet minister <mark>Rory Stewart</mark> launching an attack on Boris Johnson and Health Secretary Matt Hancock entering the contest. As the battle heated up, International Development Secretary Mr <mark>Stewart</mark> said he could not serve in a government led by Mr Johnson because of his stance on a possible no-deal exit from the EU. The comments came as Labour insisted it would force a Commons vote of no confidence in the new prime minister as soon as possible. As Tory tensions rose, Mr <mark>Stewart</mark> told BBC Radio 4's Today programme a no-deal exit would be \"damaging and dishonest\". He said: \"I could not serve in a government whose policy was to push this country into a no-deal Brexit .\" I could not serve with Boris Johnson. \"I spoke to Boris, I suppose, about two weeks ago about this and I thought at the time he had assured me that he wouldn't push for a no-deal Brexit .\" So, we had a conversation about 20, 25 minutes and I left the room reassured by him that he wouldn't do this. \"But, it now seems that he is coming out for a no-deal Brexit .\" Mr <mark>Stewart</mark> said there was no majority in the Commons for no deal, stating: \"I think it would be a huge mistake. Damaging, unnecessary, and I think also dishonest .\" Former foreign secretary Mr Johnson, who has emerged as the bookies' favourite, stressed he would be prepared to back a no-deal departure to ensure the UK leaves the EU on October 31. Mr Hancock said he was running for leader because the party needed to look to the future and attract younger voters. He said he would take a different approach to try and get Commons support for a Brexit deal than the one <mark>Theresa May</mark> used. He said: \"She didn't start by levelling with people about the trade-offs .\" I think it is much, much easier to bring people together behind a proposal if you are straightforward in advance. \"Mr Hancock warned against an early election, saying:\" Some of my contenders <mark>may</mark> say that if they don't get their preferred option, whether it be no deal or something else, then they'll have a general election. \"I put it to you that would be a disaster for the country and it would risk Corbyn by Christmas .\" Asked if Labour would force a Commons no confidence vote in the new prime minister when they take office, shadow chancellor <mark>John McDonnell</mark> told the Today programme: \"Yes .\" Because we believe any incoming prime minister in these circumstance should go to the country anyway and seek a mandate. \"Mr <mark>McDonnell</mark> said that Labour needed to have a new\" conversation \"about the way forward on Brexit. International Trade Secretary <mark>Liam Fox</mark> has refused to rule himself out as a Tory leadership candidate. Asked if he would stand, Dr <mark>Fox</mark> told the BBC:\" Well, I don't think it's likely to happen, but, as you say, it's an unusual contest. \"Dr <mark>Fox</mark> said:\" It is best for us to leave with an agreement. \"But, I think that it is possible, and probably increasingly likely now, that we could leave without a deal because I think there's a limited patience from the European Union with Britain's constant delay .\" Work and Pensions Secretary Amber Rudd, who has said she will not stand for the top job, told the BBC: \"I would be very concerned about somebody who is too enthusiastic about no deal .\" It is very important that whoever takes this on looks for a solution and tries to work to find where the majority of the House (of Commons) is. \"More than a dozen Tories are understood to be considering a bid, with Foreign Secretary <mark>Jeremy Hunt</mark> indicating he will be in the race and former work and pensions secretary Esther McVey putting herself forward\" as a future leader \". (PA Graphics) The new Tory leader looks set to take over as prime minister at the end of July after Mrs <mark>May</mark> finally laid out a timetable for her exit from Downing Street. The timetable for the contest will see nominations close in the week of June 10, with MPs involved in a series of votes to whittle down what is set to be a crowded field to a final two contenders. Tory party members will then decide who wins the run-off. Hosting a radio call-in on LBC, Ms McVey said:\" I'll put my hands up here, I better declare an interest straight away. I have put myself forward as a future leader. \"And Sir Graham Brady quit as the leader of the 1922 Committee--a position which gave him a significant role in the Prime Minister's departure--in order to consider a leadership bid. Environment Secretary Michael Gove--who stood in the 2016 leadership race and <mark>may</mark> consider another bid--said Mrs <mark>May</mark>\" deserves our respect and gratitude \". Home Secretary Sajid Javid, who had a\" frank \"discussion with Mrs <mark>May</mark> about her deal on Thursday, said\" nobody could have worked harder or had a greater sense of public duty \". Leading Eurosceptic <mark>Steve Baker</mark> said he is\" considering \"running. 0 comment", "articleID": "2019052508_00262293_W", "names": {"Jeremy Hunt": ["Q333533", "Q929730"], "John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "Liam Fox": ["Q16300641", "Q332374", "Q6539597"], "Rory Stewart": ["Q328892", "Q55363983"], "Steve Baker": ["Q10379857", "Q15973457", "Q1991602", "Q2346812", "Q260111", "Q6380444", "Q7611849", "Q7611850", "Q7611852", "Q9345785"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2019-05-26", "url": "http://scores.nbcsports.msnbc.com/en-xl/asia/nepal/four-killed-seven-injured-in-three-explosions-in-nepali-capital-police/ar-AABWzwA?li=BBJGzsi", "content": "Portals Navigation Outlook.com Skype Microsoft Store Facebook Twitter Office OneDrive Receive your emails here See your recent emails Send a quick email Manage your calendar with easy access Sign in with any Microsoft account: Outlook, Hotmail, MSN, Live What is a Microsoft account? SIGN IN Create Now Sign In Microsoft Store OFFICE 365 - Buy & Download directly from Microsoft UPGRADE TO WINDOWS 10 - Big savings on a huge selection of products Surface Windows Support Facebook Check News Feed See notifications View messages Confirm friend requests Get your Twitter Updates Sign In See your recent documents, or start one for free with Office Online. Sign in Sign in to your Microsoft account to see recent OneDrive contents. Sign in TRENDING TODAY Curtea De Arges / 23 ° C Change Close Set Default Location Search Display Temperature In Fahrenheit Celsius Done Make MSN my home page AFRICA ASIA AUSTRALASIA EUROPE LATIN AMERICA MIDDLE EAST NORTH AMERICA powered by Microsoft News Latest Stories TRENDING Thaci seeks a joint Albania border Bloomberg Sasha Obama steps out for prom Newsweek Why Jasmine does not bare her belly? USA TODAY News Storm unearths \"sunken' forest Mirror Final votes cast in Europe polls AFP Federer makes winning return AFP You can't\" starve' cancer, but you might help treat it with food The Atlantic More news Germany's Jews in Kippah warning The Hill Gove joins race to be next UK PM The Independent Chernobyl beats GoT in IMDb chart Sky News Best of week Directed by: <mark>James Cameron</mark>> Starring: <... \"src =\" http: //static-global-s-msn-com.akamaized.net/hp-neu/sc/9b/e151e5.gif \"title =\" 92. Titanic (1997) - Courtesy of Paramount Pictures \"> 100 saddest movies of all time 24/7 Tempo Most unlikely celebrity couples Photos Game of Thrones finale details INSIDER Celeb Buzz <mark>Sophie</mark> hints about wedding No. 2 ETOnline Nick's sweet tribute to Priyanka BANG Showbiz Ed Sheeran may become billionaire BANG Showbiz Royal watch Diana's statue at Palace delayed Daily Mail Charles to discuss climate change Daily Mail Harry\" s pal posts a tribute to new dad US Weekly Most read in Europe Russia ordered to free sailors Associated Press Contest to replace ex-British PM Reuters Ukraine polls campaign kicks off AFP How linen became favourite sustainable summer wardrobe staple The Independent FEATURES British spy lied to Nazis to protect the man she loved Daily Mail How cartoons saved my life BBC News Opinion: Europe's real threat - Oligarchs Newsweek MOST READ ON MSN Messi writes history again SB Nation Trans model accused of rape The News International Clooney fears for family's safety USA TODAY Take a break Guess the location of famous statues Photos News in pictures Photos Video: Pole vault fail injures athlete BuzzVideos Sport Hamilton wins Monaco GP Reuters Kerber loses opener in Paris Associated Press Juventus shortlist Sarri & Pochettino The Guardian Odd jobs of famous people before they made it big Photos Weddings How to travel with a wedding dress PopSugar Royal guest styles you can afford Evening Standard Tips to buy a bridal gown The Independent Actors who hated their on-screen character StarsInsider Health New way to treat Down's syndrome Mirror Meet the ultra runner The Telegraph VR app could help spot Alzheimer's Daily Mail The 100 greatest <mark>James Bond</mark> cars Motoring Research Travel Experience the midnight sun National Geographic Why you need to visit Montenegro TravelPulse The rebirth of Anguilla The Telegraph Tech & Science Announcement's on Alexa devices The Verge SpaceX satellites are driverless Quartz Space mud hits Earth Popular Science Previous Slide Next Slide Man killed in shark attack in Hawaii beach The Independent Everest ice melt reveals dozens of dead bodies Newshub Travolta thanks Pitbull for helping him accept baldness FOX News Zimbabwe crowns albino pageant king and queen New York Daily News Famous football players on and off the pitch Photos Rare albino panda caught on camera in China AFP Sources: Three dead in new attack on Burkina Faso church AFP The lost Leonardo? Louvre show ditches Salvator Mundi The Guardian Four killed, seven injured in three explosions in Nepali capital Reuters To accommodate Trump, Japan alters the rules of sumo Quartz Scientists witness birth of submarine volcano for first time Gizmodo Australia Strong quake rocks northern Peru, one dead Reuters Europe Edit Remove Section Move Section Up Move Section Down Add Section Below Orban hopes for anti-immigration shift in Europe in vote Reuters Papal audience: Māori King invites Pope Francis to New Zealand Radio New Zealand Countries to watch as divided Europe chooses its parliament Associated Press Russia, eyeing Arctic future, launches nuclear icebreaker Reuters Malta rescues 216 migrants from Mediterranean Sea Associated Press Lithuanian candidates say tone down Russia rhetoric Associated Press EU votes as populists seek historic breakthrough AFP Greek PM calls EU poll a vote of confidence Reuters World Edit Remove Section Move Section Up Move Section Down Add Section Below F-15 pilots saw jet crash into ocean Sun Sentinel Iran scribes \"insult' Sunnis, get fired AFP Woman leads prayer in Ghana Legit 12 civillians killed in Syria bombing AFP World Tornado hits US state, 2 dead Iraq to execute 3 French IS recruits Venezuela-Norway back to crisis talks Case against Solomons PM quashed 25 Nigerian troops killed in ambush 10 die from ship gas leak in China Tanzania to boost dairy production B'desh man killed by India's BSF SL detain nearly 100 in raids AFP Life Edit Remove Section Move Section Up Move Section Down Add Section Below Nick's sweet post for Priyanka on their first dating anniversary BANG Showbiz Diana statue set to go on display is delayed Daily Mail Ed Sheeran may become a billionaire as he turns 30 BANG Showbiz Moby apologises to Portman Bang Showbiz <mark>Sophie Turner</mark> drops hints about wedding no. 2 to Joe Jonas ETOnline Life Mel B reacts to sound issues Meghan to miss meeting Trump Ariana's wax figure criticised Lindsay praises Paris Hilton What did GoT ending mean? Cannes race wide open Kim, Kanye mark 5th anniversary Ingredient for scrambled eggs Sport Edit Remove Section Move Section Up Move Section Down Add Section Below Neymar arrives at Brazil camp ahead of Copa America AFP Federer makes winning return AFP Hamilton wins Monaco GP in the spirit of Lauda Reuters Kerber loses opener in Paris Associated Press Sport Rooney gives DC United 1-1 tie Valverde vows to fight on at Barca Mourinho undecided on next role Smith unfazed by\" cheat' chants Cowboys NRL player hospitalised DRC's Ngalina makes MLS debut Fiji eyeing World Series summit Keita in Guinea's AFCON squad Iran set for Volleyball Nations League Iran Daily Features Edit Remove Section Move Section Up Move Section Down Add Section Below Alarming trend of beached whales filled with plastic Vox.com Sports pictures of the week Photos British spy lied to Nazis to protect the man she loved Daily Mail Why combating mistrust is hard in Ebola-ravaged Africa National Geographic Video Edit Remove Section Move Section Up Move Section Down Add Section Below Real-life Iron Man flies jet-powered rocket suit Newsflare Hospital staff celebrates end of baby girl's chemo treatment Rumble Stunning look inside an obsidian rock revealed Newsflare Drone captures guy's phone sliding off a cliff's edge Dailymotion Mom hilariously gets stuck in locker BuzzVideos Orca pod surfaces from right underneath sightseeing boat Rumble Snow and stairs are painful enemies BuzzVideos <mark>Sophie Turner</mark> misses smelly Game of Thrones filming Dailymotion The world's largest moving ice carousel BuzzVideos The Queen is being Trumped Dailymotion How Chinese Bai ethnic minority tie-dye clothes Newsflare Police releases extreme near-miss footage Rumble It's snow joke! Prank ends in face-first fall BuzzVideos Water-loving horse hilariously drinks water from the hose Rumble Giant anaconda bites firefighter BuzzVideos Killer whale incredibly strikes stingray with its fin Rumble Photos Edit Remove Section Move Section Up Move Section Down Add Section Below Actors who hated their on-screen character StarsInsider Odd jobs of famous people before they made it big Photos Cannes red carpet looks over the years Photos Highest grossing Oscar-winning films of all time Photos Voices behind famous animated characters Photos Dazzling tiaras worn by the royals Photos Jaw dropping pictures of world's most dangerous roads Love Exploring The 100 greatest <mark>James Bond</mark> cars Motoring Research They said what? Most controversial quotes by sports stars Photos Stunning pictures of beautiful train stations Love Exploring Directed by: <mark>James Cameron</mark>> Starring: <... \"src =\" http: //static-global-s-msn-com.akamaized.net/hp-neu/sc/9b/e151e5.gif \"title =\" 92. Titanic (1997) - Courtesy of Paramount Pictures \"> 100 saddest movies of all time 24/7 Tempo Wedding dresses from the 1900s to today Photos Famous fathers with lots of kids Photos Incredible images that are optical illusions Photos Vintage photos of famous landmarks Photos Famous languages from shows Photos Click here for more", "articleID": "2019052617_00335146_W", "names": {"James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"]}}]