[{"date": "2019-05-27", "url": "https://www.philstar.com/entertainment/2019/05/27/1921358/disneys-live-action-aladdin-casts-box-office-spell", "content": "Disney's live-action \"Aladdin' casts a box-office spell (Agence France-Presse) - May 27, 2019 - 7:33 pm HOLLYWOOD--\"Aladdin\" apparently still has the old magic, as the new Disney film took in an estimated $86.1 million in the Friday-to-Sunday period in North America to lead all box-office offerings, industry watcher Exhibitor Relations reported. The film, released on the US's four-day Memorial Day weekend, is expected to earn $105 million when Monday's ticket sales are included, well beyond earlier estimates of around $80 million, according to the Hollywood Reporter. The live-action movie, directed by Guy Ritchie, stars <mark>Will Smith</mark> as the genie and the Egyptian-born Canadian actor Mena Massoud as the wily charmer who pretends to be a prince to catch the attention of the lovely Jasmine (Naomi Scott). The new version is an adaptation of Disney's 1992 \"Aladdin,\" which featured the unforgettable voice of <mark>Robin Williams</mark> as the fast-talking genie (and the less well-known actor Scott Weinger as Aladdin). Last week's box-office leader, Lionsgate's \"John Wick: Chapter 3 - Parabellum,\" slipped to second, taking in $24.4 million for three days ($30.5 million for four). Keanu Reaves again stars as retired hitman John Wick, this time being chased by an army of killers after a contract is put on his head. Also starring are Halle Berry, Laurence Fishburne, <mark>Ian McShane</mark> and Anjelica Huston. In third was Disney blockbuster \"Avengers: Endgame,\" taking in an estimated $16.8 million for three days ($21.9 million for four). \"Avengers,\" with an all-star cast including Robert Downey Jr., Mark Ruffalo, <mark>Chris Evans</mark>, Chris Hemsworth, <mark>Bradley Cooper</mark>, Scarlett Johansson and Josh Brolin, has broken domestic records but, with a worldwide take of $2.68 billion, is still shy of the $2.79 billion earned by all-time leader \"Avatar\" in 2009. Fourth place went to Warner Bros.' \"Pokemon: Detective Pikachu,\" at $13.3 million ($17 million). Its animated title character (voiced by <mark>Ryan Reynolds</mark>) teams up with a young boy (<mark>Justice Smith</mark>, in a live-action role) to seek the boy's missing father. And in fifth was new Sony horror thriller \"Brightburn,\" at $7.5 million ($9 million). <mark>Elizabeth Banks</mark>, David Denman and Jackson A. Dunn star in the story of an alien tot who arrives on Earth and realizes, as he grows up on a Kansas farm, that he has superpowers. Together with The Walt Disney Company Philippines, SM Cinema opened the streets of Agrabah to mall-goers and movie fans alike with The Magic of Aladdin at the SM City North Edsa. Everyone can get a chance to go around the country in their magical exhibit until May 31 at the SM North EDSA The Block Atrium. Step into the streets of Agrabah when you see the grand entrance arch to the marketplace. Enter the mystery-filled Cave of Wonders and try your hand in getting the Magic Lamp to meet the Genie. Next stop, make your musical entrance to the Streets of Agrabah when you ride Aladdin's camel and take in the sights of the country. Get in the shoes of the Sultan when you snap your photos at the Sultan's Palace. Disney's live-action adaptation of \"Aladdin\" tells the story of Aladdin (Mena Massoud), a kindhearted street urchin, and power-hungry Grand VizierJafar (Marwan Kenzari) as they vie for a magic lamp that has the power to make their deepest wishes come true .--Video from Disney", "articleID": "2019052714_00180198_W", "names": {"Ryan Reynolds": ["Q192682", "Q7384463"], "Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}}, {"date": "2019-05-28", "url": "http://www.thisiswiltshire.co.uk/news/17667787.pensioner-writes-novels-as-a-hobby/", "content": "News Pensioner writes novels as a hobby By <mark>John Baker</mark> Reporter See photos images Skip to next photo 1 / 1 Show caption 1 / 1 0 comment A MELKSHAM pensioner who started writing historical fiction after he retired has just published his fifth novel and started work on the sixth. <mark>John Michael</mark> <mark>Doyle</mark>'s latest book, Requiem for a Reiver is published by Olympia Publishers and is about the lawless border region between England and Scotland in 1588. He says: \"My wife Shireen comes from the north of England. We did some family history research on her ancestry and found that she is descended from a notorious Reiver family, the Elliotts, who raided the borders of Scotland .\" This intrigued me so I decided to write about it. It has taken me about three years to produce but I don't write for a living, I write for a hobby. \"Mr <mark>Doyle</mark>, who is just about to celebrate his 81st birthday, was born in Ireland in 1938 and moved to England at the age of 17 .\" My mother Lillian was English and my father William was from County Kerry. We moved back to England and I worked in a sawmill in Bath. \"Mr <mark>Doyle</mark> later spent three years in the Royal Artillery and, after leaving the army, joined an engineering company in Bath. He later moved into the aerospace industry to work for Dowty in Atworth for 22 years and then worked as deputy secretary for the Institution of Engineering Designers. After several years of study, he gained a BA (Hons) degree from the Open University, and later became an associate lecturer for the OU. On retirement, he took up writing historical fiction after delving into his own family history and unearthing a story about his Irish grandfather <mark>Michael Doyle</mark>.\" He was a bit of mystery. Nobody knew much about him and I found out that he had been the last coachman on a large country estate in Ireland. \"He lost his job when the house closed during the First World War and he moved to Scotland to help build the Great Munitions Factory at Dornock .\" He died of a heart attack on the train from Dornock to Carlisle and was buried in a pauper's grave because no-one knew where he came from or where his family was. \"The story written for his granddaughter in 2006 was then turned into his first novel, The Last Coachman, and was published by Olympia in 2010. Mr <mark>Doyle</mark>'s career as a novelist has taken off from there. He says:\" I always wanted to write historical fiction and since then I have written four more novels. \"They are This Bitter Land, Shake Hands With A Connaught Ranger, An Tanaiste (The Heir) and the latest, Requiem for a Reiver. All have been meticulously researched by Mr <mark>Doyle</mark>, who lives with Shireen in The Close, Melksham. The couple have one daughter, Catherine, and two granddaughters. He is now working on his sixth novel, which is set against the Monmouth Rebellion in 17th century England and the Battle of Sedgemoor .\" My son-in-law is descended from people who were involved in the Monmouth Rebellion. One was hung at the Bloody Assizes which started in Winchester in 1685 following Monmouth's defeat and another was transported. \"Mr <mark>Doyle</mark> is also much in demand to speak at local libraries and societies, although he does a lot less public speaking these days. He says:\" It's a catch 22--you have to be famous to sell lots of books but you have to sell lots of books to become famous! \"Published by Olympia Publishers, part of Ashwell Publishing Ltd, Requiem for a Reiver is priced £ 12.99. It is available on Amazon and from all good book stores. 0 comment", "articleID": "2019052806_00034035_W", "names": {"John Baker": ["Q12633672", "Q15109473", "Q18379494", "Q26220645", "Q26220647", "Q28946020", "Q3180978", "Q42871706", "Q51585141", "Q55990560", "Q59155019", "Q59201610", "Q6007104", "Q6111119", "Q6220376", "Q6220386", "Q6220388", "Q6220400", "Q6220402"], "John Michael": ["Q16209656", "Q21556337", "Q6248613", "Q6248615"], "Michael Doyle": ["Q165639", "Q19957594", "Q6829941", "Q6829942", "Q6829945", "Q6829946", "Q6829947", "Q6829948"]}}, {"date": "2019-05-29", "url": "http://www.renewamerica.com/news.php?s=20083", "content": "Statesville tries to stop RV dealership from flying massive American flag WSOC TV--The controversy over a massive American flag is now reaching a new level as the company responsible for flying the flag is rallying community support to fight the City of Statesville, which has reportedly filed a lawsuit to have the flag removed...(more) May 21, 2019 Judgment, trust, LGBT issues driving millennials from Mormon church UPI--Mormon millennials are leaving the church at about double the rate of their parents and grandparents, according to a new book that draws on a study of four generations of current and former members of The Church of Jesus Christ of Latter-day Saints...(more) May 20, 2019 Alan Keyes targets \"Deathocrats' for lulling Americans into support ALAN KEYES--As a black American, I cannot pretend to be surprised that many people who profess the truth of the Gospel of Jesus Christ nonetheless support the. Many black Americans, including members of my own family, have done so throughout my adult life. Like other so-called Democrats, black Americans pretend to see a valid trade-off between the murder of millions of innocent, helpless human beings and the good supposedly done by government programs assisting low-income families...(more) Deathocratic Party May 20, 2019 America is starting to run out of Americans BRYAN FISCHER--America is beginning to run out of Americans. We are breeding ourselves out of existence. Our fertility rate has plunged to 1.7 births per woman, the lowest it has ever been. Since the replacement rate is 2.1, this generation isn't even making enough babies to replace itself...(more) May 20, 2019 Romney says he doesn't support Alabama abortion law POLITICAL--Sen. Mitt Romney on Sunday said he doesn't support a recently enacted law prohibiting nearly all abortions at any point during pregnancy in Alabama .\" I don't support the Alabama law, \"the Utah Republican and 2012 GOP nominee for president told CNN's Jake Tapper on\" State of the Union. \"\"I believe that there ought to be exceptions. I'm pro-life, but there ought to be exceptions for rape and incest and where the life of the mother is at risk .\" ...(more) May 20, 2019 AOC: \"GOP doesn't care about babies' because they won't support the Green New Deal WASHINGTON EXAMINER--Rep. Alexandria Ocasio-Cortez, D-N.Y. claimed Friday that Republicans do not care about babies because they refuse to sign onto her signature climate change legislation .\" The GOP doesn't care about babies at all - especially brown, black, or poor ones. If they did, they'd: cosponsor the Green New Deal or at LEAST have a real climate plan - guarantee healthcare so ALL can get prenatal care - not stand for the death + caging of babies on our border, \"Ocasio-Cortez tweeted...(more) May 20, 2019 Physician says threat of world ending in 12 years no\" joke' WORLDNETDAILY--Public officials making threats about the end of the world is no \"joke,\" according to a health expert who says socialist U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., stepped out of line. The freshman lawmaker warned the earth would end in 12 years unless extreme action, such as her \"Green New Deal,\" is undertaken. Cortez later claimed she was joking...(more) Mueller changed everything BYRON YORK--From now on, the Trump-Russia affair, the investigation that dominated the first years of <mark>Donald Trump</mark>'s presidency, will be divided into two parts: before and after the release of the Mueller report. Before the special counsel's findings were made public last month, the president's adversaries were on the offensive. Now, they are playing defense...(more) May 20, 2019 The <mark>Steele</mark> Dossier and the \"verified application' that wasn't <mark>ANDREW MCCARTHY</mark>--Here's what you need to know: In rushing out their assessment of Russia's interference in the 2016 election, Obama-administration officials chose not to include the risible Steele-dossier allegations that they had put in their\" VERIFIED APPLICATION \"for warrants from the Foreign Intelligence Surveillance Court (FISC) because...wait for it...the allegations weren't verified...(more) May 19, 2019 The Guardian: Ecuador to give Assange belongings to U.S. NEWSMAX--Ecuador will hand over to U.S. prosecutors on Monday the belongings of Julian Assange that remain in the country's London embassy, WikiLeaks told The Guardian on Sunday. Ecuadorian officials are travelling to London to permit the Americans to\" help themselves \"to the possessions, which include two of Assange's manuscripts, other legal papers, medical records and electronic equipment, so that they can expand their extradition case before the British deadline on June 14, WikiLeaks editor-in-chief Kristinn Hrafnsson told The Guardian...(more) David Limbaugh looks forward to\" glorious day' when SCOTUS overrules Roe v. Wade DAVID LIMBAUGH--Alabama's mostly Republican lawmakers and governor passed a strong abortion ban this week, and liberals are fit to be tied. \"Today, I signed into law the Alabama Human Life Protection Act, a bill that was approved by overwhelming majorities in both chambers of the legislature,\" said Gov. Kay Ivey. \"To the bill's many supporters, this legislation stands as a powerful testament to Alabamians' deeply held belief that every life is precious and that every life is a sacred gift from God .\" ...(more) May 19, 2019 \"Unplanned' is driving abortion workers out of the industry DAILIY SIGNAL--The pro-life movie\" Unplanned \"surpassed all expectations in theaters, and is now leading abortion workers to leave the industry. In this episode, Rachel del Guidice talks to <mark>Abby Johnson</mark>, a former Planned Parenthood worker, about the stunning trend. Plus: Alabama is set for a legal showdown after passing a law that bans abortion. Thomas Jipping joins us to unpack what could come next and analyzes the prospects of overturning Roe v. Wade...(more) May 19, 2019 DNA tests reveal 30% of suspected fraudulent migrant families were unrelated WASHINGTON EXAMINER--Some of the migrant families arrested at the southern border weren't actually families. In a pilot program, approximately 30% of rapid DNA tests of immigrant adults who were suspected of arriving at the southern border with children who weren't theirs revealed the adults were not related to the children, an official involved in the system's temporary rollout who asked to be anonymous in order to speak freely told the Washington Examiner Friday...(more) May 19, 2019 Socialism is about taking, not giving NATIONAL REVIEW--The snakiest of snake-oil pitches goes like this: Give us some of your freedom and we'll take care of you. Socialists have been making similar claims back as far as Plato. The end result doesn't have to be Venezuela. It can just be...Europe...(more) May 16, 2019 NEWSMAX--Nearly three decades ago, when Democratic Louisiana Gov. John Bel Edwards' wife was 20 weeks pregnant with their first child, a doctor discovered their daughter had spina bifida and encouraged an abortion. The Edwardses refused...(more) May 16, 2019\" The time is coming for the Supreme Court' to act WORLDNETDAILY--Lawmakers in Alabama have adopted a law that makes conducting an abortion punishable by up to 99 years in prison. The governor signed it late Wednesday. And lawsuits from the American Civil Liberties Union or Planned Parenthood are likely, rulings that inevitably would be appealed...(more) White House creates online portal for reporting social media censorship HUMAN EVENTS--This afternoon, the White House launched a new online portal that will allow users who have been banned or suspended from social media platforms to share their stories with the White House. The portal, called the \"Tech Bias Story Sharing Tool,\" asks users if any social media platform--Facebook, Instagram, Twitter, Youtube, or any other--has taken action against the user's account. The user is given an opportunity to explain the circumstances of their banning, link to the offending post or tweet, and include any screenshots of emails from the social media platforms explaining why they took adverse action against the user's account...(more) WORLDNETDAILY--A former Justice Department official said Democrats should be \"quite worried\" about U.S. Attorney General Barr's appointment of a U.S. attorney to look into the origins of the FBI's Trump-Russia investigation...(more) May 15, 2019 Why was FBI so wrong in Trump-Russia wiretap warrant? BYRON YORK--A huge controversy erupted last year when President Trump declassified parts of the FBI's secret request to wiretap former Trump campaign volunteer foreign policy adviser Carter Page. Defenders and critics of the president argued over whether the October 2016 warrant application to the Foreign Intelligence Surveillance Act court relied extensively on the so-called <mark>Steele</mark> dossier, which was a collection of anti-Trump allegations compiled by the former British spy <mark>Christopher Steele</mark> on behalf of the Hillary Clinton campaign...(more)", "articleID": "2019052911_00091866_W", "names": {"Abby Johnson": ["Q306885", "Q321125"], "Andrew Mccarthy": ["Q30122369", "Q457836", "Q55187938"], "Christopher Steele": ["Q28216818", "Q51167589"], "Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-05-30", "url": "http://modernghana.com/news/935810/friday-editorial-presenter-kevin-taylor-threatens-ghana-with.html", "content": "30.05.2019 Feature Article Friday Editorial Presenter <mark>Kevin Taylor</mark> Threatens Ghana with Rainof Brimstone & Fire Over the EC Boss Jean Mensah Come Election 2020 By Rockson Adofo 2 HOURS AGO FEATURE ARTICLE Friday Editorial Presenter <mark>Kevin Taylor</mark> In a recent video posting by the presenter of Friday Editorial, a likely social media platform, one could see <mark>Kevin</mark> Ekow-Baidoo <mark>Taylor</mark>, raving and ranting in condemnation and bastardization of the Chair of the Ghana Electoral Commission, Mrs Jean Mensah. I wish I could find the Web, YouTube or Facebook link of this said video which was forwarded to me on my WhatsApp page, to attach to this publication for the scrutiny of the Ghana and worldwide general public. From the video postings by, and postures of, this self-styled social critic, who indeed is excessively biased and fanatically partisan in his submissions, he could clearly be seen to incite through indoctrination, the Ghanaian public to uprise against His Excellency Nana Addo Dankwa Akufo-Addo and his NPP government in the event of NDC of which he is affiliated, failing to regain power in December 2020. He is using his spurious condemnations of the persons of Mrs Jean Mensah and Mr Boosman Asare, the Chair of the Electoral Commission and Deputy Electoral Commissioner respectively, to propagate his malicious agenda of goading people to revolt in case NDC failed to come to power in December 2020 after the general election. He always wants to play smart in his video presentations by first defining or telling the public, his listeners or public viewers, the normal functions of, and the expectations of the public from the persons and institutions he attacks. He then cunningly proceeds to unveil his real intentions through insults on, and spewing lies about, the personalities he wants to pull down to advance the cause of the NDC party of which he is inextricably fanatically affiliated. I am going to outsmart him, belittle him and prove him a nonstarter in the propaganda he has embarked on in the hope of persuading Ghanaians to vote for the NDC come Election 2020 or else, they will witness deadly uprising in the country. I am going to refer to some of the unfounded allegations he made against Mrs Jean Mensah, Messrs Bossman Asare, Mac Manu and Joseph Anokye, to prove not only his malignity towards these individuals but also, how ignorant of the laws in place he is about, and how by his apparent stupidity he can be lawfully sued for defamation of character if his victims so desire. He questions why the NPP Government fired Mrs Charlotte Keeson Osei, the former Chair of the Electoral Commission? If <mark>Kevin</mark> has not outgrown his intelligence and does possess an iota of wisdom, he could realise that Charlotte Osei self-incriminated herself when rebutting the criminal committals alleged against her by her three deputies. She went her own way to award contracts and at costs of her choice to people without going through the Electoral Commission's laid down procurement procedures. A contract the procurement panel agreed to award for US $7 million was later discovered to have single-handedly been awarded at the inflated cost of US $14 million by Charlotte Osei. Did she not renovate her office at a whopping sum of hundreds of thousands of Ghana Cedis without approval and the knowledge of the EC Procurement Board? Did she not say in her defence that her Deputy of Operations, Mr Amadu Sule, was accepting huge sums of money from some political parties and was transferring illegal votes at the Electoral Commission? What did she do about such illegalities being committed by her deputy when she discovered them? Nothing! What an incompetent leader and a colluding criminal she was by this simple inaction by her. The above assertions by Charlotte Osei and her deputies clearly constitute criminal offences the committal of which in the Civilized Western Whiteman's land, would have them by now languishing behind prison bars. Therefore, for <mark>Kevin</mark> to naively assert that the NPP got rid of Charlotte Osei because she posed a threat to them in Election 2020 proves the extent of the folly, silly partisanship and unpatriotic <mark>Kevin Taylor</mark> is. He claims some people are interfering with the independence of the Electoral Commission but unfortunately, he had not the solid balls to name who they are but just making wild allegations meant to throw dust into people's eyes. He went on further to question how credible is the Ghana Electoral system with Mrs Jane Mensah as its head? He questions the posture and the integrity of Jane Mensah and Bossman Asare and accused them of acting like NPP foot soldiers. He goes on to say there will be war in Ghana if the Chair of the Electoral Commission did not re-invent herself to gain the confidence of the people before the 2020 general election. He asserts on authority that what happened in Ayawaso by-election is only the tip of the iceberg, or will pale to nothing compared to what will happen in 2020 if the Electoral Commission do not change their posture? What posture and how does he expect them to act differently? Why is he allowed to beat the war drums the way he does with impunity? He has intent to plunge Ghana into war and has audaciously been declaring them in his videos through fabrications and public incitements. As said in my previous publication, Ghanaians are not proactive but reactive. We are waiting for the harm to be caused before we react in search of solutions by which time it may be too late. He gleefully seriously tags Jane Mensah as a slave queen appointed to head the Electoral Commission. How and why is she a slave queen and who are her slaves? He continues to assert without the least shame that Jean Mensah cannot part with her party colours? What political party does she belong to and where are the proofs to confirm such reckless accusations levelled against her by the hallucinating <mark>Kevin Taylor</mark> so imbued with NDC madness? Does this guy, <mark>Kevin Taylor</mark>, a one-eyed man in the land of the blind hence becoming the King, know that he can be sued for assassination of character by the woman if it were not that Ghana is a nation where sadly, laws are not enforced, and laws do not work satisfactorily as I have asserted in some of my recent publications? Again, as childish as he is although in his mind's eye, he is the most intelligent and wisest man in Ghana, he questions why Jane Mensah has unilaterally appointed an Information Technology (IT) Director to head the IT Department of the Electoral Commission. Why should Jane Mensah and her selected people want to have the PASSWORD to the Electoral Commission Systems, something Dr Kwadwo Afari Gyan, [the man who at the Supreme Court could not define \"Over Vote\" and \"No Verification No Vote (NVNV)--my emphasis, clearly eating back his sputum], and Charlotte Osei, did never ask for? He claims, she asking for the password means she wants to control what goes in and comes out of the systems. No wonder <mark>Kevin Taylor</mark>, although has embarked on what Ghanaians have lately coined as\" Pull Him Down \"malicious agenda, he is so little-minded and markedly incompetent going about it. He cites,\" Microsoft has administrator's password to their software, etc. so why does she want to hand over the EC Information infrastructure password to only one person by collecting it from the Israeli company, Super Tech Ltd (STL) that has been handling the biometric database of the voters' register for several years or since its inception? This explains it all, the utter ignorance and the stupidity of a Ghanaian who claims to know it all but in fact knows absolutely nothing. Let me help give him some tutorials here as I have many friends who work in the IT Departments in various capacities as IT analysts hence I have insights into some of their jobs. When the manufacturer supplies you with a software, you are given a password to access it. Within your firm, you appoint certain persons, especially the heads or the managers of the various departments within the firm that may need to use the software to carry out their duties, as the administrators. They will be assigned different passwords as the administrator for that department. Then, they will also create passwords for the various individuals who will within the chain downwards be using the software. Once the individual is granted access to the software for the first time using the password created for him/her by the firm's IT Department, the person is always advised to set up their own password after first accessing the software using the one created for them by the IT Department. The Manager or the Head of each department appointed as the administrator will then permit you access to certain documents at their own volition according to your job requirements. With this little said, it should not be the manufacturer or the supplier of your IT equipment that must be the sole handler of the password to your systems. No, no, and no! The manufacturer can only remotely access your system with your permission and with you logging on your password which is unknown to them. This even only comes in for major repairs where it is only the manufacturer that can help. Does <mark>Kevin</mark> now know who we call administrators and how one becomes an administrator of a firm's IT Infrastructure? If we had not been stupid all this while, why should we as a buyer of IT Equipment and software not be able to access them but done by a foreigner? Is it not like having nuclear weapons installed in your country and permitting the foreign manufacturer and installer to continue to keep the password to the weapons usage instead of the President or the Prime Minister of the Nation or a nominated body in the country? Will the nation's safety not be in the hands of the foreign manufacturer or installer holding the password to the nuclear weapons in which case the purpose of having the weapons could be compromised? Why should an outsider hold on to such a sensitive password without which and whom the buyer nation cannot use the equipment so purchased? With such ideas as postulated by <mark>Kevin Taylor</mark>, there is no wonder that Ghanaians are not progressing but overwhelmed with corruption, pandering to criminals, being denigrated by our white contemporaries and treated in some circles as subhuman. From my years of experience gained staying in Europe and working, I have never come across a firm that has its IT Equipment's password solely known to the foreign manufacturer doubling as the company contracted to manage them. It is only in Ghana. Am I wrong therefore to publish an article recently questioning if the black men, especially Ghanaians, are capable of managing their own affairs? From the nonsense being told by <mark>Kevin Taylor</mark>, the answer is a no! \"Ghanaian voters' biometric data completely controlled by foreigners--EC laments\" If you read the reasons as per the written and live video explanations by Jean Mensah as found below which I entreat the publishers to activate them for easy accessibility by the public readers, one will understand whether or not the Chair of the Electoral Commission is wrong in her actions taken. As I am conversant with how things work within the IT Department, I support the actions of Jean Mensah 100%. It is only selfish individuals who for what they stand to gain by their silly intentional throwing of dust into people's eyes that will side with the nonsensical views espoused by <mark>Kevin Taylor</mark>, a traitor. . https: //www.myjoyonline.com/politics/2019/May-21st/ghanaian-voters-biometric-data-completely-controlled-by-foreigners-ec-laments.php <mark>Kevin</mark> now questions why Mac Manu, the Campaign Manager of NPP in Election 2016 and Joseph Anokye, the IT Analyst assisting with the collation of polling stations results for NPP in Election 2016, were denied access to Kenya ahead of the Kenyan 2017 election when they had intended to go there to assist in some capacity of some sort? What proof has <mark>Kevin Taylor</mark> claiming that these two gentlemen had been denied access to Kenya because of the American Security raising the red flag of their involvement in hacking Ghana's electoral machines in 2016 election? He claims Mac Manu and Joseph Anokye were meddling in the Kenya's election. If his allegation is anything to go by, why did he not submit the evidence to the Kenyan authority for them to be arrested and arraigned? Finally, he claims Anokye hacked the Electoral Commission's computers to tilt the results in favour of the NPP. I have never come across a stupid person like <mark>Kevin Taylor</mark> and his ilk making wild allegations bordering on criminality yet, are without the balls to take the perpetrators to court. Do they know that it is a crime to hack any computer let alone, sensitive computers like those of the Electoral Commission? If they are very convinced and have the evidence that Anokye by virtue of being once an IT Analyst at NASA in America had hacked the computers of the EC, he must prefer criminal charges against him. As said by Asiedu Nketiah, \"Every fool can go to court\" He concludes by saying Anokye has been rewarded with the post of the Boss of the National Communications Authority (NCA) for successfully hacking the computers of the Electoral Commission to the advantage of the NPP. Why should he not sue Anokye if he has any evidence to substantiate his allegation? Does he know that Anokye has every right to, and can, sue him for character assassination for his stupid adventure of meandering in the wilderness with his treacherous Friday Editorials? CONCLUSION: There is a saying that \"When you spot a stump that has the likelihood to injure you, you do not sharpen it but uproot it\". Therefore, those people and institutions that are on constant reckless attacks by <mark>Kevin Taylor</mark> had better take him to court to substantiate his allegations against them before it gets out of hand. The more you give him the leeway or unfettered freedom to tarnish your reputation, the harder it becomes for you to redeem your image later on. Rockson Adofo Rockson Adofo, © 2019 This author has authored 1764 publications on Modern Ghana. Author column: RocksonAdofo Disclaimer: \"The views/contents expressed in this article are the sole responsibility of the author (s) and do not neccessarily reflect those of Modern Ghana. Modern Ghana will not be responsible or liable for any inaccurate or incorrect statements contained in this article .\" Reproduction is authorised provided the author's permission is granted. View comments", "articleID": "2019053014_00306381_W", "names": {"Kevin Taylor": ["Q52908963", "Q57412238", "Q6397603", "Q6397604", "Q6397605", "Q6397606"]}}]