[{"articleID": "2014070521_00061504_W", "names": {"Brendan Shanahan": ["Q4961093", "Q739144"], "Michael Russo": ["Q6834031", "Q6834032"], "Mikael Granlund": ["Q16298348", "Q520141"], "Tim Murray": ["Q16215018", "Q3012564", "Q59194608", "Q7804026", "Q7804027", "Q7804029"], "Josh Cooper": ["Q6288775", "Q6288777"], "James Neal": ["Q24557998", "Q539743"]}, "date": "2014-07-05", "url": "http://bleacherreport.com/articles/2119868-nhl-rumors-latest-buzz-for-leagues-best-remaining-free-agents", "content": "NHL's top free agents have been signed, rumors continue to surround the select few who remain. Entering the fifth day of the league's free agency, here are the latest rumblings for the best unsigned talent on the open market. USA TODAY Sports G Martin Brodeur, New Jersey Devils The 42-year-old Brodeur has spent his entire NHL career, which began in 1991, with the Devils. But after leading them to three Stanley Cup Championships, their working relationship seems to be officially over. Brodeur had backed up Cory Schneider this past season, but instead of re-signing Brodeur this summer, New Jersey opted to sign Scott Clemmensen to fill the reserve role. The Devils aren't the only team to pass on the future Hall of Famer. Pierre LeBrun of ESPN reported that his representatives talked to the Tampa Bay Lightning and Pittsburgh Penguins. However, Pittsburgh decided to sign Thomas Greiss and Tampa Bay went for Evgeni Nabokov instead: Brodeur camp did talk to likes of TB and Pitt but obviously no deals there...Will be very patient...even if it takes all summer...July 2, 2014 Brodeur has struggled to find a home this offseason. But despite his age, he still has the ability to be a valuable contributor - and not just in the locker room. His 19 wins this season were 26th-best in the NHL, and his 2.51 goals against average and .901 save percentage are without a doubt still second-string worthy. Dan Rosen of NHL.com, the Boston Bruins and Toronto Maple Leafs are the most likely landing spots for Brodeur. Of course, Joe McDonald of ESPN reported otherwise on the Boston front. Bruins have no interest in Marty Brodeur, according to a league source. July 2, 2014 That leaves Toronto as Brodeur's top option right now. Tom Gulitti of The Record reported that the Maple Leafs' president of hockey operations, <mark>Brendan Shanahan</mark>, said, \"Why wouldn't there be interest in him?\" this summer. USA TODAY Sports C/LW Steve Ott, St. Louis Blues The Minnesota Wild already made a major splash this offseason by signing one of the top free agents, Thomas Vanek, and they may not be finished recruiting. LeBrun reported that the Wild are interested in Ott (h/t Star Tribune), who scored 23 points last season playing for the Blues and Buffalo Sabres. <mark>Michael Russo</mark> of the Star Tribune believes Ott would fill a hole in Minnesota that doesn't show up on the stat sheet, though. The Wild does lack toughness in my opinion (especially defensively), and when I say toughness, I'm not necessarily talking fighting. I just mean physicality, clearing bodies from the net...and some scare factor. There are times <mark>Mikael Granlund</mark> and Jared Spurgeon have been targeted. Heck, Nik Backstrom's health really began to derail last season after Nazem Kadri ran him AFTER running <mark>Granlund</mark> in the same game. <mark>Russo</mark> reported that the Maple Leafs are interested in Ott as well. Bill Hoppe of the Times Herald also reported that - despite signing Brian Gionta, Cody McCormick, Andrej Meszaros and Matt Moulson on the first day of free agency - Buffalo general manager <mark>Tim Murray</mark> \"wouldn't rule out\" an Ott return. <mark>Tim Murray</mark> wouldn't rule out signing Steve Ott, talked to his agent last night. Yesterday's moves could make it less likely. USA TODAY Sports C Derek Roy, St. Louis Blues <mark>Josh</mark> Rimer of Sportsnet reported Roy is close to signing a new contract. UFA Derek Roy is close to signing. It's down to two teams. One in the east and one in west. July 4, 2014 Roy finished with 37 points last season, 28 of which were assists. The Nashville Predators are one of the main teams he's linked to. And <mark>Josh Cooper</mark> of The Tennessean is a fan for a variety of reasons, one of which is because he'd help the recently acquired <mark>James Neal</mark> - who the Penguins traded to Nashville. New acquisition <mark>James Neal</mark> needs someone who can simply feed him the puck. Roy is an excellent distributor. He has had over 40 assists four times in his career. All he'll have to do is feed <mark>Neal</mark> the puck--something he did playing with sniping winger Thomas Vanek in Buffalo. If Rimer's report holds true, <mark>Neal</mark> will find out if Roy will be playing alongside him soon. How to Recover from a Devastating Sports Loss We'd like to send you the most entertaining"}, {"articleID": "2011102114_00114740_W", "names": {"Ron White": ["Q16937459", "Q3441473", "Q7364531"], "Mark Martin": ["Q16200207", "Q6768736", "Q6768737", "Q6768738", "Q719186"]}, "date": "2011-10-20", "url": "http://wcnc.com/sports/nascar/Friends-roast-absent-Darrell-Waltrip-for-charity-132245653.html", "content": "nashville, tenn. (ap)--michael waltrip said it was a good thing brother darrell wasn't around to defend himself at a charity roast. otherwise, nobody would have gone home until the wee hours of the morning after the man nicknamed jaws had finished responding. as michael said about his brother, darrell sure can talk. nascar president mike helton, x games gold medalist and future nationwide driver travis pastrana, kyle petty and comedian <mark>ron white</mark> were among those at the waltrip brothers' charity championship dinner wednesday night with darrell the man being roasted in honor of his january induction into the nascar hall of fame. darrell was called away on business and missed the silent auction and dinner wednesday night. he also will miss golf outing thursday, benefiting motor racing outreach and victory junction gang camp. his brother made sure everyone knew not to look around for darrell, announcing at the start: \"he ain't here .\" \"he gave me something to shoot for and made me know leaving owensboro, ky., with a dream was possible,\" michael said about his big brother, who won 84 cup races and three championships. \"he certainly made a difference in my life. we're here to honor darrell, and he didn't show up .\" darrell did get in the last word with a videotaped response from australia where he is working for fox, and he went on long enough that his brother asked once how much longer dw would go. \"i'm glad you guys had fun at my expense,\" darrell said. \"i'm out. i'm out representing the sport. i'm out spreading the gospel. i'm out being a good ambassador for nascar and for what we do while y' all are sitting there feeding your faces .\" darrell said he almost speechless at his brother setting him up to be roasted. he pointed out he owned the car michael won his first race in at dover. \"if i was there, i would be so embarrassed,\" darrell said. \"but i'm not and i wouldn't have been .\" he might have. helton shared details on how cale yarbrough started calling darrell \"jaws\" for how much he talked. helton also said nascar officials breathed a sigh of relief when darrell retired from racing as a driver until fox signed him to a contract. helton also joked that darrell put the pressure on until finally being voted in as a member of the hall of fame's third class. \"i'm especially not going to roast a guy who has a microphone every sunday and has the opportunity to pay me back and who by the way doesn't need an opportunity to,\" helton said. the night had plenty of star power even at the silent auction tables with an autographed guitar by singer darius rucker, a cowboy hat from richard petty, and gear from dale earnhardt jr., <mark>martin</mark> truex, <mark>mark martin</mark> and denny hamlin. as the roasting began, someone pretended to be darrell dressed in a fire suit and wearing a helmet. nascar team owner rick hendrick, who won nine races with darrell driving for him over four years, pointed out by video that country singer brad paisley chose jeff gordon to drive his race car in a music video leaving darrell to drive a four-wheeler. \"i know that you are one of the all-time winningest drivers in nascar. you tell us that every week on tv,\" hendrick said. attorney ed silva, who helped negotiate darrell out of a contract to sign with junior johnson, said darrell texted him on his way to australia. \"he said good luck. under no circumstance am i waiving the attorney-client privilege,\" silva said before wadding up a couple pieces of paper and tossing them away. print print email email this article share tweet facebook share share! x digg delicious myspace google buzz linkedin stumbleupon newsvine reddit next article wheldon's death returns safety issue to forefront"}, {"articleID": "2013102819_00045353_W", "names": {"Colin Evans": ["Q16210795", "Q5145074"]}, "date": "2013-10-28", "url": "http://www.4barsrest.com/news/detail.asp?id=17704", "content": "Welsh League climax set for Blaenavon 28-Oct-2013 The destination of the various Welsh League titles will be decided in Blaenavon next month. The exciting climax of the domestic Welsh contesting season takes place in Blaenavon on Saturday 26th November, with the various titles to be decided in all five sections. Champions 37 bands will take to the stage in the World Heritage town's Workmen's Hall, with Derek Broadbent and Paul Holland charged with the task of separating out the contenders looking to be claimed' 2013 Welsh League Champions'. With Wales currently boasting no less than five National Champions as well as British Open, European and Masters title winners, there is sure to be plenty of high class playing on show. Wide open <mark>Colin Evans</mark>, Secretary of the South East Wales Brass Band Association, who is organising the contest, told 4BR: \"This year, more than ever, the situation is wide open and it is not possible to predict - except, possibly in one Section, who will end the year as Champion Bands .\" He added: \"Welsh banding is on a real high at the moment, so players, conductor, supporters and the general public can expect some great battles .\" \"Welsh banding is on a real high at the moment, so players, conductor, supporters and the general public can expect some great battles' Tickets The contest starts with the Fourth Section at 9.30 am, and admission is by ticket priced £ 6.00, with concessions £ 4.00, available from the Box Office at the Hall on the day. Regionals 2014 Featuring YBS, Cory, Black Dyke and Grimethorpe All five test pieces for the National Brass Band Pontardulais town Band Pontardulais Town Band have a vacancy on the front row cornet bench, Percussion section and 1st Horn. Band room is 5mins off...Venue: Skyline Resort, Skegness, Lincolnshire PE25 1NJ Date: 8-Nov-2013 Venue: Embassy Theatre Skegness PE25 2UG Simon Platford BA (Hons), LTCL, ABSM, PGCE"}, {"articleID": "2017081321_00561709_W", "names": {"Alexander Hamilton": ["Q43390357", "Q43914913", "Q56556511"]}, "date": "2017-08-13", "url": "http://www.huffingtonpost.com/entry/a-priests-confession-i-am-racist_us_59908b33e4b063e2ae058099?section=us_religion", "content": "BrianAJackson via Getty Images My siblings in Christ, after the events that have been unfolding in Charlottesville, the Spirit has moved within me and compels me to share with you an important and serious confession. I am racist. It's not something I'm proud of. I like to consider myself woke. I like to consider myself a good white person. I was born and raised in multicultural Northern Virginia. I went to a high school in which there were more kids of color than there were white kids like me. My life partner is a beautiful dark-skinned man. But I am still racist. Rarely does a day go by when I am not confronted with my own internalized racism. When I'm walking my dog early in the morning or late at night, I have to consciously be aware of my body's reaction when walking past a black man. When I am around other white people and occasionally hear a racist remark--whether in the form of a sincere opinion or an attempt at humor--I don't always speak up to condemn such talk. When I am in a setting where I am the only white person, I am uncomfortable. I may do a convincing job of not showing it (or so I think), but internally I am analyzing every move I make and every thing I say to try and convince my company that I am a good white person. Even still, I am racist. And whether you think so or not, I'm sorry to tell you: you are racist, too. As columnist Courtney Martin writes, \"If you are white, if you've been socialized in the United States of America in the twenty-first century, you are racist. You will be racist until the day you die. There is nothing you can do to escape that fundamental fact .\" There may be nothing we can do to change this. But there is plenty we can do in response to this. I think step one is confession. Admission of guilt. It's easy to criticize someone like President Trump for failing to acknowledge what's happening around him. The racism of the white nationalists who gathered in Charlottesville yesterday is easier to spot. It's out in the open. But our racism? Our racism is bottled up on our shelf next to all the books we've read about racism, or the prison industrial complex, or <mark>Alexander Hamilton</mark>. Our racism is kept hidden in the faces of all our friends of color on Facebook, or the diploma on our wall from a good liberal university, or the people we march beside at protests. Yes, self-confessing neo-Nazis or members of the Klan are easy to identify as racists. But it's not so for you and me. For us, it's well hidden. We don't like to show it. But we're still racist. And to those reading this who are black or brown, I'm sorry. I'm sorry I have to preach a sermon like this. I'm sorry for the ways that I have failed you. I'm sorry for all the times I've been too weak to relinquish the ways that my life is easier because I don't look like you. I'm sorry for the ways our world demonizes you, hurts you, calls you names, and kills those who look like you. I'm sorry you have to worry about your children's survival each day. I'm sorry you have to have \"the talk\" with them at such a young age. I'm sorry for the ways our Church has failed you. But I'm here to say that despite the ways we humans fail constantly, God does not fail. God's steadfast love endures forever (Psalm 136). Last night I recalled a conversation I recently had with a client at Charlie's Place. (Charlie's Place is our parish's feeding and social services program for the hungry and homeless in our community .) This conversation I'm thinking of is exemplary of a number of conversations I have had with clients who on the whole, despite the poor hands they have been dealt in life, remain quite resilient and firm in their faith in God. This is true for Franklin, originally from Nigeria, who in response to my asking if he missed his home told me, \"I find God no matter where I am. And I know that God is with me .\" Later he added \"It's so simple yet so difficult for many people to accept. Jesus is Lord. Once you accept this, everything else follows .\" This was like Franklin's confession. The kind of confession Paul advocates in his letter to the Romans. Now I want to talk about this Romans passage. Because I think it has something very relevant for all of us and contains part of the ways that we can respond to our racism. The main point Paul is trying to make here, which some argue is in fact the main point he's trying to make in the entirety of this massive epistle to the Romans, is this: \"If you confess with your lips that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved\" (Romans 10:9). The end. Or, as Franklin put it, \"It's so simple yet so difficult for many people to accept. Jesus is Lord. Once you accept this, everything else follows .\" So it occurs to me that if we progressive Christians struggle to admit we're racist, then I think we sometimes also struggle to think about confessions of faith. And we don't like to talk about our path to salvation. That kind of talk we're used to hearing from other kinds of Christians. But not in an Episcopal church! But Paul simply says: Everyone who calls on the name of the Lord will be saved. Simple maybe. But that's not the same as easy. It's simple (maybe) to accept the fact that we're racist, and that we have no control over the ways that internalized racism shapes our daily lives. But it's not easy to know how to respond to that. I think Paul is challenging us to set aside any queasiness we might have about his assertion, and to trade in our own self-righteousness about who's right and who's wrong in the cultural and political wars of our day. Then we can truly consider what it would mean to believe Paul when he writes that \"there is no distinction between Jew and Greek, there is no longer slave or free, or male and female,\" (Romans 10:12; Galatians 3:28). Everyone who confesses that Jesus is Lord will be saved. My friends, we need Jesus to be Lord. Because if Jesus is Lord, then Caesar is not. If Jesus is Lord, then white supremacy is not. Racism and white nationalism cannot and will not have the final answer if Jesus is Lord. So confess with me first: I am racist. Then confess your faith in Jesus Christ. And trust that because of Jesus' lordship, the rest will follow. Notes: A version of this message was originally preached at St. Margaret's Episcopal Church, Washington, DC, on Sunday, August 13. \"Franklin\" is a pseudonym to protect the anonymity of the individual mentioned. Download MORE: U.S. News Arts And Entertainment Hate Speech Christianity Jesus"}, {"articleID": "2010102107_00024745_W", "names": {"James Patterson": ["Q311671", "Q6141039", "Q6141040"]}, "date": "2010-10-21", "url": "http://universe.byu.edu/node/11608", "content": "the department of chemistry celebrates national chemistry week with a magic show by lindsay christensen - wed, 10/20/2010 - 23:52 ilm has brought things of the past, things of the future and even things that seem impossible to life through special effects. how do filmmakers turn things we can only dream of into reality? chemistry. \"behind the scenes with chemistry\" makes its way to campus this week, starring the department of chemistry and biochemistry. to celebrate national chemistry week, byu's department of chemistry and biochemistry presents its annual magic show tonight and friday. \"national chemistry week is designed to further public awareness of chemistry's contributions to everyday life and the world people live in,\" said a news release. this celebration is put on each year, and byu's department of chemistry and biochemistry join in the fun by putting on a magic show and other activities. <mark>james patterson</mark>, a professor of chemistry, said byu has been entertaining students and the community with magic for more than 15 years. this long-standing tradition provides a way to help students and people in the community understand that chemistry is more exciting than they might think. \"i think it's an effective way to demonstrate some of the fun side of science,\" <mark>patterson</mark> said. \"the community seems to enjoy it because they keep coming back each year .\" audiences can experience entertaining demonstrations of exploding balloons, glowing chemicals and even inflamed marshmallows. \"our biggest goal here,\" said matt asplund, a professor of chemistry, \"is to take science which is often seen as boring and difficult and at least talk about some of the ways that it is exciting and it is useful .\" a packed crowd gathered this week to watch asplund and his son, a byu chemistry student, demonstrate how the things we see in the movies are possible because of science. \"we've greatly expanded our offerings,\" asplund said. \"the demand was so high so we have expanded to have two shows a night .\" even with two rooms of 250 people each for five nights, all the spaces fill up. \"we think that is kind of exciting,\" asplund said. \"normally chemistry is the hard course that everyone hopes to run away from. we're just trying to create something that gets a little enthusiasm going amongst the students for something they normally try to avoid .\" chemistry professors present all the demonstrations except for tonight's shows, which will be put on by a group of chemistry students. celebrations for national chemistry week will also include a lecture series and a research poster session."}, {"articleID": "2013021603_00048294_W", "names": {"William Martin": ["Q19043795", "Q27983590", "Q28440509", "Q3568813", "Q43395027", "Q53953099", "Q54556222", "Q8015179", "Q8015186"], "Clare Higgins": ["Q274616", "Q5126182"]}, "date": "2013-02-16", "url": "http://recorder.com/home/4479035-95/group-homeless-housing-county", "content": "greenfield - \"the best solution to homelessness is housing,\" according to a group that plans to tackle the issue in greenfield and other franklin county towns over the next few months or years. the task force, as mayor <mark>william martin</mark> calls it, which formed late last year, is hoping to find a way to eventually provide the housing needed to put an end to what it calls a \"growing problem .\" the group consists of the mayor and several heads of local social services agencies. it first met last november to start looking at the homeless problem in franklin county, especially in greenfield. <mark>martin</mark> said the reason for the focus on greenfield is that it is where most services to homeless are located, so that's where they congregate. <mark>clare higgins</mark>, executive director of community action and a member of the group, said she thinks it is a really good group of people working together on a common cause. \"i want to thank the mayor for coming to the table and wanting to be a part of this,\" said <mark>higgins</mark>, a former mayor herself, of northampton. \"this is a very important issue .\" pamela schwartz, director of western massachusetts network to end homelessness, which helps create collaboratives to end homelessness throughout the area through a \"housing first\" approach, said the homeless coalition will act as facilitator and provide support to the group. the group includes the mayor, community action, servicenet, franklin county regional housing and redevelopment authority, greenfield housing authority, franklin regional council of governments, and the interfaith council of franklin county. servicenet runs homeless shelters in the county as well as other social service programs with state and federal funding. schwartz said the task force will be looking at socio-economic and housing issues, as well as what the homeless need and where they need it. \"later, the group will develop a timeline and the strategies to get there,\" said schwartz. john counter, executive director of the greenfield housing authority, said the group has agreed to concentrate on three main areas. \"we'll look at whether housing authorities in franklin county can set aside a certain number of units for the homeless, do an assessment of how many more affordable units are needed in franklin county and where, and find out what state resources are being under-utilized,\" said counter. he said the homeless crisis in massachusetts is \"beyond any of us,\" but said that he's glad to see it is being addressed locally. \"one of the things we'll have to talk about is that with new affordable housing will have to come massive amounts of support for people,\" said counter. \"the bulk of homeless people are chronically homeless, and they need so much more assistance to become sustainable, even living in public housing units .\" schwartz said the forming of the group did not happen in response to the governor's recent announcements about the state eliminating its temporary placement of the homeless in hotels and motels within a couple of years, or his pledge for 10,000 new affordable dwellings across the state each year for the next 10 years. she said shelters and hotels, because of the limits to what they can provide people, are not the solution to homelessness. she said the group will not be talking about creating more shelters, but rather getting people out of them permanently. \"the group formed because there is a problem locally, and people want to find ways to fix that problem,\" she said. schwartz said most homeless people will relocate to the place in their area where there are the most services, because they have no way to get around. robin sherman, executive director of franklin county regional housing and redevelopment authority in turners falls, said the group will meet monthly. \"we've met three times,\" she said. \"we've been sharing our general concerns and will be working closely with each other to collect the information we need to move forward .\" sherman said that includes data, which will be collected by the frcog over the next several months. according to frcog executive director linda dunlavy, the council plans to gather data on how many homeless people there are in franklin county, and how many new or renovated units would be needed to accommodate them. \"we haven't even created the scope of work yet, because we are in the very early stages,\" said dunlavy. \"we're hoping eventually to come up with some sort of number, so the group has something to work with as it moves forward. we'll be educating each other on current conditions. that will help us understand where we are headed .\" she said frcog will pay for the assessment and analysis it is about to do with grant money from the department of housing and community development. \"we have a grant that we are supposed to use to focus on housing needs,\" said dunlavy. \"this is perfect timing .\" sherman said the group will also be looking at where the county's current homeless are getting services from, and what kind of services they are receiving. \"then, we'll be looking at short - and long-term solutions,\" she said. once the group has agreed on solutions, it will shift its focus to strategies and implementation, she said. miscellaneous: queen pillow top mattress set. new in plastic, serta made. $150. dan (413) 977-6144 tires/parts/accessories: four p225/50r/16 all season tires off bmw. $40 for all. (413) 774-7678 full time help wanted: join our team! visit us at www.servicenet.org for all the details. apartments for rent: spacious 1 bedroom studio in a nice rural area of bernardston, close to i-91. great kitchen. $800/mo incls heat & hw. 1st and last, plus sec dep. refs required. (413) 498-2278"}, {"articleID": "2010020208_00140334_W", "names": {"Dave Wilson": ["Q1173390", "Q14950791", "Q2494426", "Q27683615", "Q3019005", "Q5230125", "Q5230128", "Q5230129", "Q5230130", "Q5230131", "Q5241195"], "Tom Benson": ["Q18581263", "Q21461359", "Q7814941"], "Jim Mcmahon": ["Q1689159", "Q17306267", "Q6196886"], "Mike Singletary": ["Q1777632", "Q26706931"]}, "date": "2010-02-02", "url": "http://latimes.com/sports/football/nfl/la-sp-saints-white2-2010feb02,0,6949273.story?track=rss", "content": "lonnie white recalls sights, sounds and (gulp!) smells of saints' bad old days white, a former usc and new orleans wide receiver (and a former times sportswriter), was with saints in 1987, when they ran a third-class program and were treated like second-class citizens around the nfl. lonnie white was a wide receiver/kick returner for usc from 1982-86, which included appearances in the rose, aloha and citrus bowls. in 1986, white established a single-season school record for kickoff return yardage (716 in 29 returns), a record that still stands. a former sportswriter with the times, he made the new orleans saints roster in the strike-shortened 1987 season. garrett hartley's game-winning field goal to give the new orleans saints a 31-28 overtime victory over minnesota in last week's nfc championship game was still in the air when the phone rang. on the line was my former saints roommate derrick taylor, who did not hesitate to ask me: \"how do you feel? are you happy for them?\" that's when it hit home. the new orleans saints, the onetime laughingstock nfl franchise that had paid my bills many years ago, were super bowl-bound. some might think 43 seasons is a long time to wait for a trip to the big game, but as a former employee...i didn't see it coming so fast. how in the name of jim mora, sam mills and <mark>dave wilson</mark> did that happen? taking a telephone trip down memory lane with taylor, we couldn't believe this was the same franchise that had given us so many laughs back in the day. well, laughs as in...\"someday we will laugh about this .\" from the team's outdated practice facility--which featured arguably the worst weight room in the league--to the undersized, brick-hard beds used for training camp, the saints were still considered a franchise joke when i joined the team as an undrafted rookie free-agent wide receiver in 1987. think burt reynolds' \"longest yard\" meets peter gent's \"north dallas forty .\" yes, these football movie \"classics\" are a good way to describe being an employee for the saints in the late 1980s. a collection of misfits, an incredibly awful setting, and stories more like a farfetched hollywood script than an nfl franchise game plan. after spending four seasons on the big stage in the coliseum as a member of the powerhouse usc trojans, the biggest surprise was to see how rundown the saints' facilities were. built in 1967 when the team joined the nfl, the building had more of a prison feel than that of a professional football facility. the paint on the walls was old, worn and dingy, and the place had a musty aroma that reminded you of past saints teams--it stunk. the practice fields weren't well-kept either. they were uneven, always wet and slightly muddy. most players complained, but the sloppy fields turned into a plus for me, thanks to fellow free-agent rookie quarterback erik kramer ., it was difficult to get quality repetitions as a rookie wideout, but when i did i was able to keep my footing on the muddy grass, unlike some of the faster wideouts. kramer, who eventually played 13 nfl seasons and still holds the chicago bears' single-season passing record, helped keep me with the team with his strong arm and accurate throws. when it was time to hit the weight room, the fields didn't seem so bad. \"i couldn't believe it when i first walked into their weight room,\" said taylor, who played three games as a replacement player for the saints in 1987 and then spent five years in the canadian football league. \"it was so small and smelled really bad. you would have to wait a long time in line just to bench press and there were always people rushing you .\" maybe that's why many veteran players owned memberships at local fitness gyms. think about that--nfl players working out at bally total fitness just to get in shape for the season. mora, in his second year as coach when i got there, was determined to get this team shipshape, despite the conditions. in fact, he turned the saints' lack of respect around the league into a rallying cry for his team. with two usfl championships under his belt and a roster filled with former players from the united states football league, mora went to work...and more work...and more work...despite temperatures that rose above 100 degrees for daytime practices at southeastern louisiana university in hammond, la., mora's workouts were unrelenting. he didn't care about the horrible facility or sleep conditions, or the fact that the lousy training-camp food wasn't helping the players' bodies to revive. finally, some of the veteran players talked to team owner <mark>tom benson</mark> about the food, and he hired a gourmet chef from north carolina who took special pride in his meals. this did not go over well with mora, who criticized some players for eating too much and thought that the high-end plates were making his team soft, not to mention fat. we all discovered how thin this club really was when the saints spent several days in wisconsin practicing against the chicago bears, who were still riding the success of their super bowl xx victory over new england. for the entire week, the saints were treated like a jv team compared with the bears, who were led by marquee players like walter payton, <mark>jim mcmahon</mark> and <mark>mike singletary</mark>. and we felt like one. when we arrived on buses and the fans discovered we weren't the bears, they would just walk away. guess they figured we were practice scrubs. people thought nothing of walking through our workouts and team practices. in town when people asked and discovered we were the saints, they would say: \"is there a player we would know?\" talk about humbling."}, {"articleID": "2012030900_00047875_W", "names": {"Min Zhu": ["Q21518107", "Q8071131"]}, "date": "2012-03-09", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://us.rd.yahoo.com/finance/news/topfinstories/*http://finance.yahoo.com/news/strong-greece-bond-swap-offer-000752346.html?l=1", "content": "tip: use comma (,) to separate multiple quotes. by george georgiopoulos and lefteris papadimas athens (reuters) - greece successfully closed its bond swap offer to private creditors on thursday, opening the way to securing the funding it needs to avert a messy default on its debt, according to several senior officials. one official, speaking on condition of anonymity, said take-up of bonds regulated by greek law, the most significant part of the overall debt, was around 95 percent. the official said the figure referred to the voluntary take-up of the offer, however another official said it assumed the activation of collective action clauses (cac) that would impose the deal on all creditors holding greek law bonds. the biggest sovereign debt restructuring in history will see bond holders accept losses of some 74 percent on the value of their investments in a deal that will cut more than 100 billion euros from greece's crippling public debt. preliminary results from the offer are expected to be announced officially at 0600 gmt on friday and will hold a news conference before a call with euro zone finance ministers in the afternoon. after initial fears that the deal could fail altogether, pitching greece and the euro zone into fresh crisis, the result provides a rare piece of good news for the government of. athens had said it would enforce the deal on all its bondholders, activating collective action clauses on the 177 billion euros worth of bonds regulated under greek law. that would potentially trigger payouts on the credit default swaps (cds) that some investors held on the bonds, an event which would have unknown consequences for the market. the so-called private sector involvement (psi) deal is a key element in a broader international bailout aimed at averting a chaotic default by greece and a potentially disastrous banking crisis across the euro zone. have made a successful bond swap a pre-condition for final approval of the 130 billion euros ($170 billion) bailout agreed last month. optimism despite the apparent success, the deal will not solve greece's deep-seated problems and at best it may buy time for a country facing its biggest economic crisis since world war two and crushed under debt equal to 160 percent of its gross domestic product. however financial markets rose strongly in the run-up to the deadline as the threat of an immediate and uncontrolled default receded. \"this does not mean the debt situation in greece is resolved, and this is not the last time we will be hearing about this. but it is a relief that it didn't go the other way. it could have been a lot worse,\" said tim ghriskey, chief investment officer at solaris group in new york. bank stocks rose sharply and the risk premium on italian and spanish government bonds fell as investors hoped a greek deal would curb the likelihood of any contagion spreading to other weaker euro zone economies. euro zone ministers could decide whether to clear the overall bailout package in their conference call on friday afternoon, although they may leave the final decision until a face-to-face meeting on monday. athens must have the funds in place by march 20 when some 14.5 billion euros of bonds are due, which it cannot hope to repay alone. greece has staggered from deadline to deadline since the crisis broke two years ago and several of its international partners have expressed open doubts about whether its second major bailout in two years will be the last. underlining the severe problems facing greece after five years of deep recession, data on thursday showed unemployment running at a record 21 percent in december, twice the euro zone average, with 51 percent of young people without a job. there has been growing resentment over the austerity medicine ordered by international creditors which has compounded the pain from a slump which has seen the economy shrink by a fifth since 2008. but greece, totally reliant on international support to stave off bankruptcy, has also infuriated both the european union and the international monetary fund with its repeated failure to push through promised reforms. \"we have shown a lot of solidarity with greece,\" german finance minister wolfgang schaeuble said late on wednesday. \"everyone knows that the real problems of greek society are in greece and not abroad .\" ($1 = 0.7625 euros) <mark>min zhu</mark>, deputy managing director, international monetary fund (imf),? luxembourg's prime minister and eurogroup chairman juncker talks with? your most recently viewed tickers will automatically show up here if you type a ticker in the \"enter symbol/company\" at the bottom of this module. copyright? 2012 reuters limited. all rights reserved. republication or redistribution of reuters content is expressly prohibited without the prior written consent of reuters. reuters shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon. quotes delayed, except where indicated otherwise. delay times are 15 mins for nasdaq, nyse and amex. see also delay times for other exchanges. quotes and other information supplied by independent providers identified on the yahoo! finance partner page. quotes are updated automatically, but will be turned off after 25 minutes of inactivity. quotes are delayed at least 15 minutes. all information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. neither yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. by accessing the yahoo! site, you agree not to redistribute the information found therein. capital iq. historical chart data and daily updates provided by"}, {"articleID": "2011072215_00030861_W", "names": {"Mary Jane": ["Q16056069", "Q56878198", "Q7145596"]}, "date": "2011-07-21", "url": "http://chrisd.ca/blog/42287/culinary-team-manitoba-selkirk-cooking-competition-fundraiser/", "content": "tweet culinary team manitoba will have the backing of some of the province's best chefs during a fundraiser on saturday, july 23 in selkirk. chefs will cook up delicious fare using the best local ingredients to prepare wood-fired pizza, bbq chicken, sizzling pork, tasty salads and delicious desserts. the feast will be served up at benjamin's gourmet foods, 397 eveline street. six team members of culinary team manitoba are gearing up to attend the world culinary olympics in erfurt, germany this october, the premier competition for chefs around the globe. the prestigious competition only takes place every four years and is the biggest and most traditional culinary exhibition of its kind. \"competition is a vital part of keeping local chefs current with the world's food trends as well as a way to showcase what both manitoba and canada have to offer both in product and chef talent,\" said <mark>mary jane</mark> feeke, pastry chef for culinary team manitoba and owner of benjamin's. the public is encouraged to purchase tickets to the meal in advance and make a reservation by calling (204) 482-4429 or e-mailing benjamins @ mts.net. two seatings will take place at 4:30 p.m. for families and 7 p.m. with a silent auction and local entertainment. tickets are $40 per person or $5 for children 12 and under."}, {"articleID": "2017102606_00276745_W", "names": {"Mike Williams": ["Q11339601", "Q16873065", "Q18162727", "Q1843112", "Q18619126", "Q18627293", "Q19663901", "Q27449445", "Q30122685", "Q3313590", "Q3313595", "Q3857466", "Q3857468", "Q3857469", "Q55361153", "Q6831667", "Q6849276", "Q6849279", "Q6849281", "Q6849282", "Q6849283", "Q6849284", "Q6849285", "Q6849286", "Q6849287"], "Kevin White": ["Q16145878", "Q18159165", "Q20738243", "Q40158721", "Q6397748", "Q6397750"]}, "date": "2017-10-26", "url": "https://www.inquisitr.com/opinion/4579003/chicago-bears-trade-for-los-angeles-chargers-dontrelle-inman-can-he-save-their-passing-game/", "content": "Former Los Angles Chargers' wide receiver Dontrelle Inman will give Chicago Bears' quarterback Mitch Trubisky a veteran wide receiver to help in the passing game. The Bears hope that Inman and Trubisky can give opposing defenses some concerns outside of the running game. According to ESPN's Adam Schefter, the Chicago Bears acquired Dontrelle Inman from the Los Angeles Chargers on Wednesday. The Bears agreed to send a conditional draft pick to the Chargers. That pick will likely be a seventh-round selection in the 2018 NFL draft. Dontrelle Inman, a 28-year-old veteran immediately becomes the Bears most established wide receiver on the roster. At 6-foot-3, he has the size to win jump ball passes. Inman became expendable for the Chargers, who have Pro Bowler Keenan Allen, Tyrell Williams, and a healthy <mark>Mike Williams</mark>. The L.A. Chargers want to take a long look at rookie <mark>Mike Williams</mark>. The former Clemson star was taken No. 7 by the Chargers in last April's NFL draft. <mark>Williams</mark>' presence left Dontrelle Inman inactive in Week 7. It left open the possibility of him landing at with a new team. Chargers' head coach Anthony Lynn explained why they decided to deal Inman. \"He got hurt and never really got a good chance to see him, and some other guys stepped ahead of him. We just wanted to get him someplace where he can be happy and play football .\" Despite being buried as the fourth or fifth receiver on the L.A. Chargers' depth chart, when healthy, Dontrelle Inman has the potential to be a lead pass-catcher. Dontrelle Inman gives the Chicago Bears a wide receiver with the ability to go up and get the football. [Image by Streeter Lecka/Getty Images] The addition of Dontrelle Inman is a timely one for the Chicago Bears. Just days after the Bears only completed four passes in their 17-3 win over the Carolina Panthers, they add Dontrelle Inman in the trade with the Chargers. Versus the Panthers, Mitch Trubisky only attempted seven throws. None of those passes went to Bears' receivers, despite Trubisky dealing with nine defenders at the line of scrimmage. With opposing teams looking to stop the Bears from running the football, the Bears had a need for a vertical threat. The receivers the Bears had on the roster have had their struggles separating from defenders. The presence of Dontrelle Inman could change things a bit. Inman hauled in 58 catches last season for the Chargers. He tallied up 810 yards and four touchdowns. This year Inman was seldom used, only catching two passes, while sitting behind Keenan Allen and Tyrell Williams. With the Bears, that is expected to change. Season ending injuries to Cameron Meredith and <mark>Kevin White</mark> forced the Bears to alter their depth chart. That left the Bears to rely on Kendall Wright, Tre McBride, and Tanner Gentry, among others. The addition of Dontrelle Inman will allow the incumbent receivers to be slotted in the positions they are best suited for. The timing of the Bears' acquisition of Inman is ideal. With Mitch Trubisky under center, the Bears have already scaled back their offensive playbook. Trubisky having a learning curve helps matters in a sense. If Inman makes his Bears' debut this week versus the New Orleans Saints, all the coaching staff has to do is implement a few routes to help him get acclimated early. The Bears have a bye week in Week 9. That gives Trubisky and Inman two weeks to get acquainted before the second half of the season starts. The #Bears added to their WR corps via a trade with the #Chargers: https: //t.co/ASHdSNwzHf--Pro Football Rumors (@ pfrumors) October 25, 2017 Few should expect Dontrelle Inman to make an immediate impact for the Bears in terms of the stat sheet. His true impact on the Bears may not be realized for weeks. Two weeks may be enough time for Inman and Trubisky to develop some chemistry going forward. The Bears' rookie quarterback knows that he has to develop rapport with his wide receivers (courtesy of AP News). \"It's all about rhythm, staying in a groove and really just continuing to evolve and find our identity and what works best for our offense to help out our defense .\" Dontrelle Inman's size and resume will dictate that be becomes the Chicago Bears' top receiver. Inman allows the Bears to play Kendall Wright as the slot receiver, with either Tanner Gentry or Tre McBride flanked on the other side. If a double-team is forced with regularity, it opens up the Bears' offense. Inman's presence alone could help the Chicago Bears going forward. It would be simply due to the fact that he is a big target for Mitch Trubisky to find down the field. Gaining separation will be paramount for Inman as he joins a Bears' team that struggles in that department. Mitch Trubisky establishing some continuity with Dontrelle Inman opens up the Chicago Bears' running game, as well as opportunities for Kendall Wright. If the Bears use the former L.A. Chargers' receiver properly, they could contend for the NFC North. The second half of the Bears' schedule is not as formidable as the first eight weeks. Not only does the Chicago Bears face the Cincinnati Bengals, who are struggling, they also have the Cleveland Browns and San Francisco 49ers to play. Both teams are currently winless. #Bears are eager to get newly-acquired receiver Dontrelle Inman up to speed, writes @ CEmma670: https: //t.co/bp4D0nsnqW pic.twitter.com/FVOTtOFpi7--670 The Score (@ 670TheScore) October 25, 2017 There is one primary reason for Bears' fans to have optimism for the pick up of Dontrelle Inman--free agency. Inman is a free agent at the end of the season. The Bears would benefit greatly from a motivated Inman, who can earn his return to the team next season with a strong showing. As for the Los Angeles Chargers, receiving a late draft pick from the Chicago Bears is better than not receiving any compensation for a solid receiver. The Chargers are deep at the position and could afford to trade Dontrelle Inman to the Bears. The trade currently stands as a win for both the Bears and the Chargers. It is also a win for Dontrelle Inman and Mitch Trubisky. Inman gets a fresh start with a Chicago Bears' team, which finds themselves quietly in a race for the NFC North. Trubisky gets a proven target to help the Bears win games. A hefty payday awaits the former Los Angeles Chargers' receiver if the he can help the Bears make things interesting in the second half of the season. [Featured Image by Donald Miralle/Getty Images]"}]