[{"date": "2019-05-30", "url": "http://feeds.marketwatch.com/~r/marketwatch/software/~3/wJTeg3koqSg/story.asp", "content": "Uber Technologies Inc. shares bounced in late trading Thursday, after the ride-hailing company lived up to its expectations in the first earnings report since a gargantuan initial public offering. Uber UBER, -0.35% reported first-quarter losses of $1.01 billion, or $2.26 a share, on revenue of $3.1 billion. Shares gained about 1% in after-hours trading immediately following the report, then fell to a loss of about 1%, then continued to bounce around between slight gains and losses. The stock has yet to touch its IPO price of $45 a share in regular trading since the first trading day on May 10. Uber disclosed ahead of the IPO that it expected to lose at least $1 billion and up to $1.11 billion in the first quarter, on net revenue of $3.04 billion to $3.1 billion. In the year-ago quarter, Uber reported massive earnings of $3.75 billion on revenue of $2.58 billion, though that outsize profit was linked to the sale of some of its international operations, with a stated operational loss of about half a billion dollars in the year-ago quarter. \"Our Q1 2019 results were at or near the high end of the ranges we shared last month in our IPO prospectus,\" Chief Financial Officer Nelson Chai said in a statement. \"Our investments remain focused on global platform expansion and long-term product and technology differentiation, but we will not hesitate to invest to defend our market position globally .\" Not enough analysts projected Uber's first-quarter earnings to form a solid consensus for this report. Analysts for banks that underwrite an initial public offering tend to wait 25 days from the offering before initiating coverage of a stock, and most of Wall Street helped out on Uber's IPO, which listed an astounding 29 banks as underwriters. Expect a wave of Uber initiations next week with analysts' thoughts on this earnings report. Uber reported bookings--which represents the total amount of money spent on the Uber platform, instead of just the part that Uber takes and is counted as revenue--of $14.65 billion, up from $10.9 billion a year ago. Uber said in its pre-IPO disclosure that it expected gross bookings of $14.44 billion to $14.66 billion, with about 78% of that total attributed to its ride-sharing platform and most of the rest coming from the Uber Eats food-delivery business. Uber lived up to its forecast with ride-hailing bookings of $11.45 billion and Uber Eats bookings of $3.07 billion in the first quarter, with the rest credited to the company's \"Other Bets\" ventures. Uber Eats bookings more than doubled from a year ago, increasing 108%, while ride-hailing increased about 22%. Rival Lyft Inc.. LYFT, -2.54% stopped disclosing bookings information in its first earnings report after its earlier IPO, despite providing the information in pre-IPO filings. Chief Financial Officer <mark>Brian Roberts</mark> said at the time that Lyft \"really wanted to try to avoid investor confusion\" in not providing the information. More: Lyft stops providing key data after IPO, then insults investors' intelligence The revenue breakdown was roughly similar to bookings. Uber said that about 76.7% of revenue came from ride-hailing, and 17.3% from Uber Eats, with the rest credited to Other Bets and \"Vehicle Solutions .\" Uber did not provide a forecast for the second quarter in its announcement. A conference call with executives was scheduled for 4:30 p.m. Eastern time. Uber stock closed Thursday with a 0.4% loss at $39.76. Jeremy C. Owens Jeremy Owens is MarketWatch's technology editor and San Francisco bureau chief. You can follow him on Twitter @ jowens510. We Want to Hear from You Join the conversation Comment", "articleID": "2019053020_00383518_W", "names": {"Brian Roberts": ["Q1057730", "Q27978787", "Q4964404", "Q4965138", "Q4965139", "Q4965141", "Q4965143", "Q4965145", "Q913008"]}}, {"date": "2019-05-31", "url": "https://www.mirror.co.uk/sport/boxing/boxing-news-anthony-joshua-praised-16230700", "content": "Get the biggest daily news stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Anthony Joshua has already established himself as a British sporting superstar as he looks to crack the American market on his US debut on Saturday night. The Watford-born heavyweight king has regularly sold out huge stadiums in the UK over the last few years leading him to take the step across the pond to Madison Square Garden against Andy Ruiz Jr.. Joshua is undoubtedly the biggest name in British boxing - and he's been praised for \"carrying\" the sport in this country by Tony Bellew. The recently-retired former cruiserweight champion says Joshua has catapulted the sport to another level on his own and deserves a huge amount of credit. Anthony Joshua makes his US debut against Andy Ruiz Jr on Saturday night (Image: Action Images via Reuters) Read More Boxing news: Andy Ruiz Jr's gruesome claim before Anthony Joshua title challenge \"For the UK, Anthony Joshua is flying the flag, he really is,\" said Bellew, speaking as a guest of the SportPesa Racing Point F1 team at last weekend's race in Monaco. \"He's carrying boxing and single handedly taking it to another level, that's what he's done for boxing in this country .\" His impact has been unbelievable, and he's been absolutely phenomenal so far in his career. \"Tony Bellew has hailed Joshua for his impact on British boxing (Image: Glenn Dunbar/LAT Photographic) Read More Boxing news: What Andy Ruiz Jr texted Eddie Hearn to earn himself Anthony Joshua fight Joshua defends his WBO, WBA, IBF and IBO straps against Ruiz this weekend after the California-based Mexican was drafted in as a late replacement for Jarrell Miller. Bellew reckons Ruiz is a strong replacement after Miller's failed drugs tests - but he reckons Joshua's class will shine through having labelled him the\" best heavyweight in the world \"ahead of rivals Tyson Fury and Deontay Wilder .\" The opponent change to Ruiz is a very good chance to be fair, in such short time, \"Bellew commented. Bellew reckons Andy Ruiz Jr is a strong late replacement for Jarrell Miller (Image: Sportsfile via Getty Images) Read More Boxing news: Tyson Fury's hilarious guide to Anthony Joshua and the heavyweight division\" It's a good change, I'm looking forward to it. I'll be there watching and I can't wait to see it. \"I believe Anthony Joshua is the best heavyweight in the world, then it's Fury, then Wilder .\" I'm excited to see how it goes against Ruiz, but everyone just wants to see them fight each other now. \"Tony Bellew is an ambassador for SportPesa. Find out more about SportPesa's products and SportPesa Racing Point here. Read More Boxing stories Anthony Joshua may ban\" curse' Drake Tyson Fury's fierce message to Whyte <mark>Mike Tyson</mark> on whether he'd beat Joshua Fury's x-rated advice to rival Joshua", "articleID": "2019053105_00198478_W", "names": {"Mike Tyson": ["Q30122587", "Q6849116", "Q79031"]}}, {"date": "2019-05-30", "url": "https://www.kansascity.com/sports/article230993738.html?src=rss", "content": "Scott McCarron watches his tee shot on the first hole during the final round of the Senior PGA Championship golf tournament, Sunday, May 26, 2019, in Rochester, N.Y. Adrian Kraus AP Photo DES MOINES, Iowa <mark>Tom Lehman</mark> won the PGA Tour Champions event in Iowa last year without swinging a club on Sunday. <mark>Lehman</mark> will look for a measure of vindication this weekend at Wakonda Club in Des Moines after finding out he'd won in 2018 while waiting out a weather delay in a local mall. <mark>Lehman</mark> shot a 13-under 131 total last year in Iowa, two shots better than Bernhard Langer, before the final round was canceled because of thunderstorms. \"Everyone loves to win. There's no doubt about it, so I'd never trade in a victory for any reason,\" <mark>Lehman</mark> said. \"However, it's a hollow ending for everybody ....I think part of the deal with golf is to sleep on the lead and then go out and win it .\" <mark>Lehman</mark> will likely be in the mix to at least prove that last year's two-round victory wasn't a fluke though. He has never finished worse than eighth at Wakonda, including a tie for fifth two years ago. Unlimited Digital Access: Only $0.99 For Your First Month Get full access to The Kansas City Star content across all your devices. SAVE NOW <mark>Lehman</mark> won the season opener in Hawaii in January and is eighth on the money list. \"I think it plays to my strengths,\" <mark>Lehman</mark> said of Wakonda, a 97-year-old course tucked into downtown Des Moines that ranked as the fourth-easiest on the senior circuit a year ago. \"It's a tricky golf course. You have to keep it in play .\" No one might do that better this weekend than circuit leader Scott McCarron. He has two wins and over $1.3 million in earnings so far this season--nearly $500,000 more than last week's Senior PGA Championship winner, Ken Tanigawa--and scored his first senior win in Iowa in 2016. McCarron has won nine more times since then. He has also finished in the top 10 in seven tournaments in 2019. McCarron and Tanigawa, who rallied from three shots down to beat McCarron by one stroke last weekend, will play together again Friday in the opening round. They will be joined by 2017 Iowa winner Brandt Jobe. All three went to UCLA and have remained close friends. \"Having the lead right now really doesn't mean too much,\" McCarron said. \"But I can keep increasing that lead, and that's what I'm trying to do. I want to go into the playoffs with a big enough lead that I can secure this thing up .\" Langer, who entered the week ranked third on the money list, withdrew Thursday to attend the funeral of his son's father-in-law. Langer always seemed to struggle at Wakonda, but he'd begun to turn it around in recent seasons. He was fourth in 2017 and finished tied for second a year ago. <mark>Vijay Singh</mark> (back) also withdrew from the field. Comments", "articleID": "2019053112_00075369_W", "names": {"Tom Lehman": ["Q26922239", "Q949710"], "Vijay Singh": ["Q16122677", "Q21170857", "Q24005696", "Q331942", "Q3558246", "Q58483984", "Q58484934", "Q7929210"]}}, {"date": "2019-05-31", "url": "http://mobile.sfgate.com/entertainment/article/Kim-Kardashian-visited-San-Quentin-kevin-cooper-13912025.php", "content": "Kim Kardashian visited San Quentin's death row on Thursday Michelle Robertson, SFGATE | on May 31, 2019 In this file photo taken on June 16, 2018 US TV personality Kim Kardashian attends the 2018 MTV Movie & TV awards, at the Barker Hangar in Santa Monica. In this file photo taken on June 16, 2018 US TV personality Kim Kardashian attends the 2018 MTV Movie & TV awards, at the Barker Hangar in Santa Monica. Photo: Valerie Macon, AFP/Getty Images Photo: Valerie Macon, AFP/Getty Images Image 1 of / 22 Close Image 1 of 22 In this file photo taken on June 16, 2018 US TV personality Kim Kardashian attends the 2018 MTV Movie & TV awards, at the Barker Hangar in Santa Monica. In this file photo taken on June 16, 2018 US TV personality Kim Kardashian attends the 2018 MTV Movie & TV awards, at the Barker Hangar in Santa Monica. Photo: Valerie Macon, AFP/Getty Images Kim Kardashian visited San Quentin's death row on Thursday 1 / 22 Back to Gallery Kim Kardashian West continued her prison reform crusade with a Thursday visit to San Quentin State Prison. Gossip site TMZ spotted West entering the prison Thursday, where she reportedly spent two hours chatting with death-row inmate <mark>Kevin Cooper</mark>. A spokesperson for the California prison system would not confirm West's visit with SFGATE for privacy reasons. <mark>Cooper</mark>, 61, was convicted of four murders in Chino Hills, Calif., in the 1980s and sent directly to death row. Since the conviction, <mark>Cooper</mark> has vehemently asserted his innocence and protested racism in the criminal justice system as well as the death penalty. In 2018, after widespread media coverage of <mark>Cooper</mark>'s case--some of which put forth the possibility that <mark>Cooper</mark> had been framed for the Chino Hills murders--Former Governor of California <mark>Jerry Brown</mark> ordered new DNA testing of the evidence. Governor Gavin Newsom, who has suspended state executions since taking office, expanded the order in February. The testing is ongoing. Related Stories Kim Kardashian West shares picture studying for law exam West, who is studying to become a lawyer at a San Francisco law firm, has been publicly involved with the <mark>Cooper</mark> case since last year. In June, she tweeted: \"Governor <mark>Brown</mark>, can you please test the DNA of <mark>Kevin Cooper</mark>?\" During her Thursday visit with <mark>Cooper</mark>, West \"spent 2 hours with him and is more convinced than ever he was framed,\" TMZ reported. Last year, she played a crucial role in the release of Alice Marie Johnson, a 63-year-old woman imprisoned since 1996 on nonviolent drug charges. West plans to take the bar in 2022 and began an apprenticeship at a law firm last summer. Michelle Robertson is an SFGATE producer. Email: michelle.robertson @ sfgate.com | Twitter: @ mrobertsonsf Michelle Robertson | Producer", "articleID": "2019053120_00065484_W", "names": {"Jerry Brown": ["Q152451", "Q717620"], "Kevin Cooper": ["Q1740103", "Q19877167", "Q58150295", "Q6396066", "Q6584008"]}}, {"date": "2019-06-03", "url": "https://www.bworldonline.com/ultra-lagree-caters-to-busy-bodies-who-want-to-stay-fit/", "content": "Advertisement Font Size A A A Lagree Fitness is both high intensity and low impact, which means one's body works harder and burns more calories while the joints and connective tissues are kept safe from potential damage due to overexertion .--ULTRA LAGREE THE local Lagree Fitness scene has taken further root with the recent opening of a studio dedicated to the workout. Ultra Lagree, located at the second floor of Estancia Mall at Capital Commons in Pasig City, promises members another good reason to wear their gym clothes and experience a different approach to staying fit. Introduced in Hollywood by noted fitness practitioner Sebastian Lagree, the 45-minute workout effectively combines strength, endurance, core, cardio, balance and flexibility training. It is both high intensity and low impact, which means one's body works harder and burns more calories while the joints and connective tissues are kept safe from potential damage due to overexertion. Proponents of the fitness workout said is suitable for people who can't get started or sustain their fitness regimen because of their busy schedules. The Lagree Fitness workout is done on a machine called the Megaformer, which has tension springs that can be adjusted according to the preference of the client. It allows one to perform coach-guided routines efficiently and at optimal form, which results in more calories burned. Because of the high intensity of the activity, you continue to burn calories even after the workout--up to 800 calories, studies show. \"You can hit so many things with this one full-body workout which uses tension springs in order for you to get the best workout. You cannot plateau with this. That's the beautiful thing about this,\" said Will Devaughn, master instructor at Ultra Lagree, in an interview with BusinessWorld. \"Forty-five minutes on this is more than enough. Of course, it depends on the intensity of the client and how they want to push themselves. This is for everybody. All walks of life, all shapes and sizes. The instructors here are very skilled and can help members in their fitness journey,\" added Mr. Devaughn, who personally trained under Mr. Lagree in Los Angeles. Mr. Devaughn went on to say that Lagree Fitness is suitable for Filipinos and that part of the reason they put up Ultra Lagree is to grow the community in the Philippines for the workout. \"Fitness is really blowing up in the Philippines and we see this enhancing that. We want to make the workout more accessible to more Filipinos, and, at the same time, create a space for like-minded individuals to thrive together,\" he said. He added, \"For me, Lagree is in a class of its own. It really is. It works your mind and body at the same time. It's very cerebral. This is a lifelong exercise. You can do this for the rest of your life .\" Ultra Lagree is part of a network of less than 300 Lagree Fitness-certified studios all over the world. In the Philippines, it is the only Lagree Fitness-certified studio in a convenient mall setting. Those who are interested to try the Lagree Fitness workout at Ultra Lagree can inquire at info @ ultralagree.ph, or check them out on Facebook (/ ultralagree. ph) or Instagram (@ ultralagree. ph). The studio is open every day from 6 a.m. to 9 p.m.--<mark>Michael Angelo</mark> S. Murillo Advertisement SPOTLIGHT Economy Alternative investments in emerging economies There's a continued increase in alternative investment asset classes throughout the ASEAN nations--a breakaway from traditional established financial assets. This was made...LATEST NEWS Price hikes could have steadied from Apr.. PEZA approved pledges drop in first 4 months Analysts' May Inflation Rate Estimates Q4 2018 labor turnover flat from third quarter Your fish is your future Policy continuity Innovation: The only way Advertisement", "articleID": "2019060217_00165017_W", "names": {"Michael Angelo": ["Q24705684", "Q56000278"]}}, {"date": "2019-06-02", "url": "http://wboc.com/story/40578763/protest-in-hungary-over-govt-plan-to-seize-research-network", "content": "Protest in Hungary over govt plan to seize research network - WBOC-TV 16, Delmarvas News Leader, FOX 21 - Protest in Hungary over govt plan to seize research network - WBOC-TV 16, Delmarvas News Leader, FOX 21 - Member Center: Protest in Hungary over govt plan to seize research network Posted: Friday, May 31 2019 6:11 PM EDT 2019-05-31 22:11:21 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:42 GMT Scientists tasked with reviewing the government's plans to lift protections for gray wolves across most of the U.S. say the proposal has numerous factual errors and other problems. More Scientists tasked with reviewing the government's plans to lift protections for gray wolves across most of the U.S. say the proposal has numerous factual errors and other problems. More Friday, May 31 2019 2:51 PM EDT 2019-05-31 18:51:17 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:41 GMT (Summit County Solid Waste Collection Office via AP). This undated photo provided by the Summit County Solid Waste Collection Office on Friday, May 24, 2019, shows deer near a landfill at the Three Mile Canyon Landfill in Coalville, Utah. The Division...(Summit County Solid Waste Collection Office via AP). This undated photo provided by the Summit County Solid Waste Collection Office on Friday, May 24, 2019, shows deer near a landfill at the Three Mile Canyon Landfill in Coalville, Utah. The Division...The Division of Wildlife Resources has announced their findings from their investigation into the cause of death for more than 30 deer near a landfill in northeast Utah. More The Division of Wildlife Resources has announced their findings from their investigation into the cause of death for more than 30 deer near a landfill in northeast Utah. More Sunday, June 2 2019 9:11 AM EDT 2019-06-02 13:11:10 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:28 GMT President Donald Trump claims Mexico has taken advantage of the United States for decades but that the abuse will end when he slaps tariffs on Mexican imports next week in a dispute over illegal immigration. More President Donald Trump claims Mexico has taken advantage of the United States for decades but that the abuse will end when he slaps tariffs on Mexican imports next week in a dispute over illegal immigration. More Sunday, June 2 2019 7:31 AM EDT 2019-06-02 11:31:14 GMT Updated: Sunday, June 2 2019 1:31 PM EDT 2019-06-02 17:31:26 GMT (Courtesy City of Virginia Beach via AP). This combination of photos provided by the City of Virginia Beach on Saturday, June 1, 2019 shows victims of Friday's shooting at a municipal building in Virginia Beach, Va.. Top row from left are Laquita C. Bro...(Courtesy City of Virginia Beach via AP). This combination of photos provided by the City of Virginia Beach on Saturday, June 1, 2019 shows victims of Friday's shooting at a municipal building in Virginia Beach, Va.. Top row from left are Laquita C. Bro...The 11 city employees among the 12 people killed by a gunman at a Virginia Beach government building had worked for the community for a total of more than 150 years. More The 11 city employees among the 12 people killed by a gunman at a Virginia Beach government building had worked for the community for a total of more than 150 years. More More BUDAPEST, Hungary (AP) - A few thousand mostly academics and students held a protest march against a plan by Prime Minister Viktor Orban's government to seize control of the research network of the Hungarian Academy of Sciences. Critics say the government plan threatens academic freedom and autonomous scientific research in Hungary, a \"de facto nationalization of the academy's property\" which would put scientific research under close government scrutiny. The government, which held several rounds of unsuccessful talks with the academy, says its wants to improve innovation in scientific research and have publicly funded research projects that create \"direct economic profit .\" Viktor Oliver Lorincz, a junior research fellow attending Sunday's march, said \"we don't want to belong to the government because we are afraid that the government will decide what we should research .\" Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Sunday, June 2 2019 1:31 PM EDT 2019-06-02 17:31:18 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:41 GMT A few thousand mostly academics and students held a protest march against a plan by Prime Minister Viktor Orban's government to seize control of the research network of the Hungarian Academy of Sciences. More A few thousand mostly academics and students held a protest march against a plan by Prime Minister Viktor Orban's government to seize control of the research network of the Hungarian Academy of Sciences. More Sunday, June 2 2019 5:41 AM EDT 2019-06-02 09:41:03 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:15 GMT (Peter Klaunzer/Keystone via AP). U.S. Secretary of State Mike Pompeo, front left, and his wife Suzan, front center, listen to a tourist guide during a sightseeing walk as part of Pompeo's visit in Bern, Switzerland, Saturday, June 1, 2019. (Peter Klaunzer/Keystone via AP). U.S. Secretary of State Mike Pompeo, front left, and his wife Suzan, front center, listen to a tourist guide during a sightseeing walk as part of Pompeo's visit in Bern, Switzerland, Saturday, June 1, 2019. U.S. Secretary of State Mike Pompeo is holding talks with his Swiss counterpart expected to focus on Iran. More U.S. Secretary of State Mike Pompeo is holding talks with his Swiss counterpart expected to focus on Iran. More Sunday, June 2 2019 4:31 AM EDT 2019-06-02 08:31:01 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:08 GMT (AP Photo/Michael Sohn, file). FILE--In this Monday, May 27, 2019 photo taken with a long time expsure Andrea Nahles, chairwomen of the German Social Democratic Party (SPD), leaves after a press conference following a party's board meeting in Berlin,...(AP Photo/Michael Sohn, file). FILE--In this Monday, May 27, 2019 photo taken with a long time expsure Andrea Nahles, chairwomen of the German Social Democratic Party (SPD), leaves after a press conference following a party's board meeting in Berlin,...The leader of Germany's center-left Social Democrats, a junior party in Chancellor Angela Merkel's governing coalition, is resigning after poor elections results. More The leader of Germany's center-left Social Democrats, a junior party in Chancellor Angela Merkel's governing coalition, is resigning after poor elections results. More Sunday, June 2 2019 1:11 PM EDT 2019-06-02 17:11:15 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:07 GMT (Kirsty O'Connor / PA via AP). Veteran <mark>John Roberts</mark>, 95, in a jeep as he arrives to the cruise terminal to board the MV Boudicca, seen behind, ahead of its departure from the port of Dover, England, Sunday June 2, 2019, for a trip to France arranged by t.. . (Kirsty O'Connor / PA via AP). Veteran <mark>John Roberts</mark>, 95, in a jeep as he arrives to the cruise terminal to board the MV Boudicca, seen behind, ahead of its departure from the port of Dover, England, Sunday June 2, 2019, for a trip to France arranged by t.. . About 300 veterans of the Normandy invasion have left Dover, England for a six-day trip that will take them back to the landing beaches on the 75th anniversary of D-Day. More About 300 veterans of the Normandy invasion have left Dover, England for a six-day trip that will take them back to the landing beaches on the 75th anniversary of D-Day. More", "articleID": "2019060217_00201203_W", "names": {"John Roberts": ["Q11153", "Q14949621", "Q16196671", "Q19325651", "Q20895752", "Q21542199", "Q2913257", "Q320178", "Q41805076", "Q44155502", "Q47430963", "Q54610143", "Q56187938", "Q56253587", "Q56597924", "Q6255164", "Q6255170", "Q6255174", "Q6255177", "Q6255184", "Q6255195", "Q6255202"]}}, {"date": "2019-06-04", "url": "http://www.live5news.com/2019/06/04/red-meat-white-meat-study-says-it-really-doesnt-matter/", "content": "Red meat? White meat? Study says it really doesn't matter Eat nonmeat proteins to cut cholesterol A new study published this week in the American Journal of Clinical Nutrition shows red and white meats are equally bad for cholesterol. (Source: Achim Bongard from Pexels) By | June 4, 2019 at 1:29 PM EDT - Updated June 4 at 3:15 PM Ed Payne (Gray News)--Conventional wisdom says to eat white meat and shun the red. During the last few decades, red meat's association with increased heart disease made it an unpopular choice for many. Government dietary guidelines encouraged the consumption of poultry as a healthier alternative. A new study published this week in the American Journal of Clinical Nutrition shows red and white meats are equally bad for cholesterol, one of the risk factors for heart disease. \"When we planned this study, we expected red meat to have a more adverse effect on blood cholesterol levels than white meat, but we were surprised that this was not the case--their effects on cholesterol are identical when saturated fat levels are equivalent,\" said the study's senior author <mark>Ronald Krauss</mark>, professor of medicine at University of California--San Francisco. Randomized controlled trial: Effects of red meat, white meat, and nonmeat protein sources on atherogenic lipoprotein Conclusion: White meat has the same negative effect as red meat. @ PlantDietitian https: //t.co/14iRp79tqC @ VeganHeartDoc", "articleID": "2019060419_00105514_W", "names": {"Ronald Krauss": ["Q25212076", "Q7365031"]}}, {"date": "2019-06-05", "url": "http://express.co.uk/comment/expresscomment/1136487/donald-trump-Left-protests-US-President-silent-China", "content": "True allies--President <mark>Donald Trump</mark> and Her Majesty the Queen (Image: Press Association) At his happiest among banner-waving demonstrators, he demeans his position as Leader of the Opposition by refusing to attend a state banquet and yet flocks to a crowd of EU fanatics, eco-warriors and pro-Palestinian Leftists to beat the drum of anti-Americanism. That's just his mark--the eternal student protester--still holding the same views he held half a century ago. Then, Left-wingers would throng outside the US embassy complaining of US imperialism. Strangely, though, they'd be very quiet about atrocities against citizens in the Soviet Union or communist China. A lot of noise about Vietnam but nothing about the Cultural Revolution in which millions of Chinese were persecuted and thousands executed. <mark>Donald Trump</mark> Piers Morgan interview video: WATCH IN FULL <mark>Donald Trump</mark>'s SHOCK reply when asked about Labour's Jeremy Corbyn The Left-wing intellectuals and student activists were wrong then and are wrong now. Hilariously, shadow foreign secretary Emily Thornberry declared yesterday: \"If Mr <mark>Trump</mark> wants to see us, we're more than happy to see him. But we don't think that it's appropriate for him to have a state visit .\" Apparently, Mr <mark>Trump</mark> did decline such an invitation from what he called \"a negative force\" but it makes you wonder at her judgment when senior Labour members were more than happy to line up to welcome Chinese leader Xi Jinping on his state visit in 2015. Was it possibly because Xi heads a communist state and no matter what crimes a Left-wing tyranny perpetuates, they can never be as bad as the capitalist USA? Chillingly, Chinese state media has censored all references to the student protests in Beijing 30 years ago this week which left hundreds, possibly thousands dead. Just one Chinese media outlet referred to it as a necessary \"immunisation\" against political turmoil. Now that really is something worth protesting about, but we have more fury on the streets of London from fuzzy-headed Lefties against US chlorinated chicken then against human rights violations in China now. Chinese students protest in Tiananmen Square, Peking (Image: Peter Turnley/Corbis/Getty) The full craziness of the Labour view of the world was expressed by London Mayor Sadiq Khan when he insulted the US President by saying: \"He is just one of the most egregious examples of a growing global threat .\" Really? That's more of a danger than a totalitarian nuclear power run by a president for life who is busy interning whole swathes of his population, militarising the South China Sea, rigging world trade and stealing our intellectual property? In contrast, Mr <mark>Trump</mark> is offering us a continued strong alliance and our most important post-Brexit trade deal. I know which I prefer, but maybe Corbyn, Thornberry and Khan know better than me? The visuals say it all. While Leftists rejoiced in floating a baby blimp of <mark>Trump</mark> over London yesterday, in Portsmouth today the US President and Her Majesty the Queen stand side by side to commemorate the launch of the greatest armada for freedom. On that occasion, US and British servicemen sacrificed their lives to defeat a real fascist regime, not the fake \"global far-Right movement\" , supposedly headed by <mark>Trump</mark>, as described by the London Mayor. The ridiculous Emily Thornberry, Lady Nugee (Image: Ian Forsyth/Getty) President <mark>Trump</mark> is simply standing up for sovereign nation states against genuine global threats against our liberty. He is right to stand tall against China's dubious trade practices. He is right to cast suspicion on giving Huawei access to sensitive parts of our communications system. All firms in China come under the shadow of the police state. Fearlessly he stands up against a European Union that bullies its poorer members and does not make a fair contribution to its own defences through Nato. The USA accounts for nearly 70 percent of all Nato expenditure and is entitled to wonder why a rich nation such as Germany doesn't pay more. President <mark>Trump</mark> backs Brexit to the hilt and wishes us well. He has his doubts about entrusting Jeremy Corbyn with joint defence intelligence. It's not surprising when you see Corbyn virtue signalling in Trafalgar Square about diversity, attacking the democratically elected <mark>Trump</mark>, yet being so quiet about human rights abuses in a range of socialist dictatorships from China to Venezuela. I'd rather listen to President <mark>Trump</mark> who said in his speech at the state banquet, recalling the Second World War: \"In that dark hour, the people of this nation showed the world what it means to be British,\" and made certain this country's destiny remained \"in your own hands\". Thank you, Mr President, and with your continued support, we will ensure it remains that way.", "articleID": "2019060507_00249094_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}]