[{"date": "2019-06-07", "url": "http://www.bournemouthecho.co.uk/sport/national/17692990.santi-cazorla-relishing-dream-return-to-spain-squad/", "content": "Santi Cazorla relishing \"dream' return to Spain squad By Press Association 2019 Santi Cazorla is enjoying life back in the Spain squad 0 comment Santi Cazorla hailed captaining Spain in the 4-1 win over the Faroe Islands as a\" dream \". The former Arsenal midfielder took the armband when <mark>Sergio Ramos</mark> left the field, as the Spaniards cruised to victory in Torshavn. Villarreal star Cazorla made his first Spain appearance since 2015, then topped it off with the captaincy in a remarkable return to the international arena. Two years ago Cazorla was told he would never play football again after an infection had eaten away at his heel--now the 34-year-old is relishing a new lease of sporting life .\" Wearing the armband is another dream fulfilled for me, \"Cazorla told reporters .\" I'm enjoying this a lot but the important thing is for me to help the team. \"The important thing was to win .\" We knew it would be difficult because of the pitch and that they were going to close us down. \"But we were better in many aspects of the game and we're happy .\" Jesus Navas fired his first international goal in six years as Spain romped home to stay top of Group F in the Euro 2020 qualifiers. <mark>Sergio Ramos</mark> toasted his world-record 122nd international victory with his 19th Spain goal, with Jose Gaya on target and goalkeeper Teitur Gestson putting through his own net. Klaemint Olsen turned in a smart strike for the Faroes, but the hosts were ultimately outclassed and forced to bow to Spain's supremacy. Spain host Sweden at home on Monday, with new boss <mark>Luis Enrique</mark> keen to extend his side's promising run. \"Sweden will be a complicated game,\" said Cazorla. \"But we're playing at home and we want to give our all .\" Hopefully we can get the three points. \"0 comment", "articleID": "2019060722_00284842_W", "names": {"Luis Enrique": ["Q222789", "Q322350"], "Sergio Ramos": ["Q483309", "Q514286"]}}, {"date": "2019-06-09", "url": "http://www.croydonguardian.co.uk/sport/national/17694838.davies-time-is-not-on-our-side/", "content": "<mark>Davies</mark>: Time is not on our side By Press Association 2019 <mark>Ben Davies</mark> File Photo 0 comment <mark>Ben Davies</mark> has warned that Ryan Giggs' youngsters must grow up fast on the international stage or Wales' Euro 2020 qualification ambitions will perish. Wales meet Hungary in Budapest on Tuesday in a game which has taken on added importance after the weekend's Group E results. Hungary moved to the top of the section by winning 3-1 in Azerbaijan, three points ahead of Wales--who have a game in hand--after the Dragons were beaten 2-1 by Croatia. FT |???? 2-1?????????????? | #CROWAL Croatia hold on to their lead here in Osijek and confirm the first defeat for #Wales in the #EuropeanQualifiers. #TheRedWall #YWalGoch pic.twitter.com/8aYSlXGAPN--Wales?????????????? (@ Cymru) June 8, 2019 The youthful nature of Giggs' side was reflected by the fact that six of the starting XI have made their international bows since the Manchester United great was appointed Wales manager 17 months ago. \"This is their first real taste of international football,\" Tottenham defender <mark>Davies</mark>, one of the few survivors from Wales' Euro 2016 squad to start in Osijek on Saturday, said of the young players in Giggs' squad. \"But we haven't really got too much time for that learning curve if we want to qualify for the Euros .\" Sometimes it doesn't matter how you win games. Wales are three points off the top of Group E (Adam Davy/PA) \"It's just making sure that we stop the opposition from doing their thing and show a better account of ourselves .\" Wales were forced to play catch-up on a scorching afternoon in Osijek, when the thermometer reached 30 degrees and players took water breaks at the halfway point of the first and second periods. Croatia led 2-0 through a <mark>James Lawrence</mark> own goal and an Ivan Perisic strike at the start of the second half as the home side dominated courtesy of Luka Modric's midfield mastery. But Wales fought back through substitute <mark>David Brooks</mark>' deflected drive and had late chances to snatch a draw as Giggs' side finished strongly. Hungary Croatia Slovakia Wales Azerbaijan \"We have to start games better,\" <mark>Davies</mark> said. \"We can't afford to concede sloppy goals like we did. Hopefully when those chances come it's to win a game .\" I think we're a better team than we showed. \"But it's not great to play in the middle of the day in 30 degree heat. It took a lot out of us .\" Wales manager Ryan Giggs (centre) looks dejected during his side's 2-1 defeat in Croatia (Adam Davy/PA) Wales' visit to the Groupama Arena now looks a pivotal fixture in the race for qualification. Hungary's win against Croatia in March has generated belief they can secure a top-two spot, and victory on Tuesday would give them a six-point advantage over Wales. \"If we'd have won here it would have put us in an unbelievable position,\" <mark>Davies</mark> said. \"But it hasn't really changed from the first week. We've got six more games and they're all massive for us .\" 0 comment", "articleID": "2019060921_00201371_W", "names": {"Ben Davies": ["Q41251646", "Q4885504", "Q4885507", "Q4885508", "Q4885509", "Q4885510", "Q4885511", "Q4888471", "Q53951851", "Q723161", "Q93555"], "David Brooks": ["Q16105043", "Q19948555", "Q27909737", "Q28498255", "Q31151243", "Q5231788", "Q5231789", "Q5231790", "Q938475"], "James Lawrence": ["Q10547424", "Q30121940", "Q6137843"]}}, {"date": "2019-06-10", "url": "http://daijiworld.com/news/newsDisplay.aspx?newsID=595430", "content": "<mark>Chris Pratt</mark>, Katherine Schwarzenegger get married <mark>Chris Pratt</mark>, Katherine Schwarzenegger get married Mon, Jun 10 2019 09:19:02 AM Los Angeles, Jun 10 (IANS): Hollywood star <mark>Chris Pratt</mark> has followed up the mega success of \"Avengers: Endgame\" by taking the next big step in his personal life. He married actor Arnold Schwarzenegger's daughter Katherine at a ceremony in the presence of close friends and family members, the US media reported. According to multiple media reports and photographs that emerged online, the couple exchanged wedding vows at a luxury resort in Montecito, California. It is the first marriage for Katherine, the eldest child of Schwarzenegger and Maria Shriver, and the second for <mark>Pratt</mark>, who had earlier wed Anna Faris and has a six-year-old son named Jack with her. Jack too was present at his father's wedding, which also saw \"Guardians of the Galaxy\" director <mark>James Gunn</mark> and Schwarzeneggers' family friend Rob Lowe, apart from Katherine's siblings Patrick, Christopher and Christina in attendance, reports said. <mark>Pratt</mark>, 39, and Katherine, 29, were first linked together last June. They continued to be seen on dates, but they made their relationship official on social media when <mark>Pratt</mark> shared a collage last December. In January, <mark>Pratt</mark> shared the news of their engagement in an Instagram post. \"Sweet Katherine, so happy you said\" yes'! I'm thrilled to be marrying you. Proud to live boldly in faith with you. Here we go, \"he had captioned an Instagram photo of himself cuddling up to Katherine. Top Stories You have 2000 characters left. Disclaimer: Please write your correct name and email address. Kindly do not post any personal, abusive, defamatory, infringing, obscene, indecent, discriminatory or unlawful or similar comments. Daijiworld.com will not be responsible for any defamatory message posted under this article. Please note that sending false messages to insult, defame, intimidate, mislead or deceive people or to intentionally cause public disorder is punishable under law. It is obligatory on Daijiworld to provide the IP address and other details of senders of such comments, to the authority concerned upon request. Hence, sending offensive comments using daijiworld will be purely at your own risk, and in no way will Daijiworld.com be held responsible. Security Validation", "articleID": "2019061004_00018326_W", "names": {"Chris Pratt": ["Q503706", "Q5107796"], "James Gunn": ["Q1152925", "Q715505", "Q717015"]}}, {"date": "2019-06-10", "url": "http://euronews.com/2019/06/10/zampa-uses-hand-warmers-says-finch-amid-ball-tampering-claims", "content": "Zampa uses hand warmers, says Finch amid ball-tampering claims Zampa uses hand warmers, says Finch amid ball-tampering claims By Reuters • last updated: 10/06/2019 - 11:33 Cricket - ICC Cricket World Cup - India v Australia - The Oval, London, Britain - June 9, 2019 Australia's Aaron Finch speaks to Adam Zampa Action Images via Reuters/Andrew Boyers - Copyright Text size Aa Aa (Reuters)--Australia spinner Adam Zampa may have been using hand warmers during his bowling spell in Sunday's 36-run Cricket World Cup defeat by India, captain Aaron Finch has said in response to a flood of ball-tampering accusations on social media. Video footage showed Zampa putting his hand into his pocket before rubbing the ball prior to bowling the 24th over. Zampa's team mates <mark>Steve Smith</mark> and <mark>David Warner</mark> have just returned to the national setup after serving 12-month bans for their roles in a ball-tampering scandal in South Africa early last year. \"I haven't seen the photos, but I know that he has hand warmers in his pocket,\" Finch told reporters. \"He has them every single game he plays .\" I honestly haven't seen them (the images), so I can't comment too much on it. But I know for a fact that he has hand warmers every game. \"Australia next play Pakistan in Taunton on Wednesday. (Reporting by Rohith Nair in Bengaluru; Editing by Peter Rutherford) euronews provides breaking news articles from reuters as a service to its readers, but does not edit the articles it publishes. Articles appear on euronews.com for a limited time. Share this article", "articleID": "2019061009_00231235_W", "names": {"David Warner": ["Q3018962", "Q363271", "Q57408725"], "Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"]}}, {"date": "2019-06-10", "url": "http://www.northwichguardian.co.uk/news/national/17696043.campaigners-to-urge-msps-to-back-move-for-20mph-residential-streets-limit/", "content": "Campaigners to urge MSPs to back move for 20mph residential streets limit By Press Association 2019 20 mph zone 0 comment Campaigners are to hold a demonstration outside of the Scottish Parliament, calling for a 20mph default speed limit on residential streets. Demonstrators will place 60 chairs outside of the parliament building in Edinburgh on Tuesday to represent the number of lives they say could have been saved had the limit been put in 1999--when the parliament was first convened. Travel and environmental groups including Friends of the Earth Scotland, Cycling UK, Pedal on Parliament, Spokes Lothian, Go Bike and 20s Plenty, will join together as part of the demonstration, along with other campaigners, between 1pm and 2pm. My #saferstreets 20 mph bill has its Stage 1 debate this Thursday. Below are ten reasons why you should ask your MSP now to support the bill??--Mark Ruskell MSP (@ markruskell) June 7, 2019 Last month, Holyrood's rural economy committee refused to back a Bill seeking to make 20mph the standard speed limit on residential streets. It had been put forward by Scottish Green MSP Mark Ruskell with the aim of reducing deaths and serious injuries on roads. Of the committee's 11 members, eight MSPs said they were unable to recommend the general principles of the Bill, while three--<mark>John Finnie</mark>, <mark>John Mason</mark> and Colin Smyth--disagreed with the majority conclusion and argued that \"the current inconsistent use of 20mph speed limits is confusing and undermines road safety\". MSPs will vote on Stage 1 of Mr Ruskell's Bill at the Scottish Parliament on Thursday. Gavin Thomson, an air pollution campaigner at Friends of the Earth Scotland, said MSPs must take the chance to demonstrate they are taking action to tackle climate change. \"This Bill is vital to making our streets healthier and safer,\" said Mr Thomson. \"Our politicians have a chance to show that they're to take action to face up to the climate emergency .\" This means making our roads safer so more of us can walk and cycle safely, and leave our polluting cars behind. It is shocking that MSPs are planning to put the need for motorists' speed ahead of the need for public safety. \"In April, First Minister Nicola Sturgeon declared a\" climate emergency \"at the SNP conference in Edinburgh. The Scottish government has also committed to achieving net-zero greenhouse gas emissions by 2045--five years ahead of the UK as a whole. This morning, the Committee has published its report on the Restricted Roads (20mph Speed Limit) (Scotland) Bill, it concluded that it did not agree the general principles of the Bill. Read the report here--https: //t.co/vZWE14JmWi pic.twitter.com/kW2EnxMBVd--REC Committee (@ SP_RECcttee) May 31, 2019 Sally Hinchcliffe, from Pedal on Parliament, said that MSPs must explain what measures they will take to reduce road danger if they do not back Mr Ruskell's proposed Bill. Ms Hinchcliffe said:\" This legislation presents a perfect opportunity to make our towns and cities safer right across Scotland, eliminating the postcode lottery of safer streets for children walking or cycling. \"If MSPs don't want to support this bill, we challenge them to tell us what measures they will enact that would reduce road danger for vulnerable road users as effectively as this .\" Duncan Dollimore, of Cycling UK, added: \"Despite acknowledging the safety benefits of 20mph limits, the Scottish government seems to want to carry on regardless, leaving local authorities to decide whether or not to introduce lower limits .\" But had such a limit been introduced when the Scottish Parliament was founded, 60 families might have been spared the agony of losing a loved one in a road collision. \"They might ask, why won't their government lead and assume, rather than duck responsibility?\" 0 comment", "articleID": "2019061012_00247078_W", "names": {"John Finnie": ["Q1495635", "Q29057429", "Q57097730"]}}]