[{"date": "2019-06-10", "url": "http://www.northwichguardian.co.uk/news/national/17696043.campaigners-to-urge-msps-to-back-move-for-20mph-residential-streets-limit/", "content": "Campaigners to urge MSPs to back move for 20mph residential streets limit By Press Association 2019 20 mph zone 0 comment Campaigners are to hold a demonstration outside of the Scottish Parliament, calling for a 20mph default speed limit on residential streets. Demonstrators will place 60 chairs outside of the parliament building in Edinburgh on Tuesday to represent the number of lives they say could have been saved had the limit been put in 1999--when the parliament was first convened. Travel and environmental groups including Friends of the Earth Scotland, Cycling UK, Pedal on Parliament, Spokes Lothian, Go Bike and 20s Plenty, will join together as part of the demonstration, along with other campaigners, between 1pm and 2pm. My #saferstreets 20 mph bill has its Stage 1 debate this Thursday. Below are ten reasons why you should ask your MSP now to support the bill??--Mark Ruskell MSP (@ markruskell) June 7, 2019 Last month, Holyrood's rural economy committee refused to back a Bill seeking to make 20mph the standard speed limit on residential streets. It had been put forward by Scottish Green MSP Mark Ruskell with the aim of reducing deaths and serious injuries on roads. Of the committee's 11 members, eight MSPs said they were unable to recommend the general principles of the Bill, while three--<mark>John Finnie</mark>, <mark>John Mason</mark> and Colin Smyth--disagreed with the majority conclusion and argued that \"the current inconsistent use of 20mph speed limits is confusing and undermines road safety\". MSPs will vote on Stage 1 of Mr Ruskell's Bill at the Scottish Parliament on Thursday. Gavin Thomson, an air pollution campaigner at Friends of the Earth Scotland, said MSPs must take the chance to demonstrate they are taking action to tackle climate change. \"This Bill is vital to making our streets healthier and safer,\" said Mr Thomson. \"Our politicians have a chance to show that they're to take action to face up to the climate emergency .\" This means making our roads safer so more of us can walk and cycle safely, and leave our polluting cars behind. It is shocking that MSPs are planning to put the need for motorists' speed ahead of the need for public safety. \"In April, First Minister Nicola Sturgeon declared a\" climate emergency \"at the SNP conference in Edinburgh. The Scottish government has also committed to achieving net-zero greenhouse gas emissions by 2045--five years ahead of the UK as a whole. This morning, the Committee has published its report on the Restricted Roads (20mph Speed Limit) (Scotland) Bill, it concluded that it did not agree the general principles of the Bill. Read the report here--https: //t.co/vZWE14JmWi pic.twitter.com/kW2EnxMBVd--REC Committee (@ SP_RECcttee) May 31, 2019 Sally Hinchcliffe, from Pedal on Parliament, said that MSPs must explain what measures they will take to reduce road danger if they do not back Mr Ruskell's proposed Bill. Ms Hinchcliffe said:\" This legislation presents a perfect opportunity to make our towns and cities safer right across Scotland, eliminating the postcode lottery of safer streets for children walking or cycling. \"If MSPs don't want to support this bill, we challenge them to tell us what measures they will enact that would reduce road danger for vulnerable road users as effectively as this .\" Duncan Dollimore, of Cycling UK, added: \"Despite acknowledging the safety benefits of 20mph limits, the Scottish government seems to want to carry on regardless, leaving local authorities to decide whether or not to introduce lower limits .\" But had such a limit been introduced when the Scottish Parliament was founded, 60 families might have been spared the agony of losing a loved one in a road collision. \"They might ask, why won't their government lead and assume, rather than duck responsibility?\" 0 comment", "articleID": "2019061012_00247078_W", "names": {"John Mason": ["Q14945665", "Q1700987", "Q21077155", "Q21597927", "Q25344506", "Q27925051", "Q53953104", "Q6247048", "Q6247051", "Q6247057", "Q6247072", "Q6247074"]}}, {"date": "2019-06-11", "url": "https://www.sportingnews.com/us/nascar/news/nascar-at-michigan-live-race-updates-results-highlights-firekeepers-casino-400/yi5p93lp0ynd1k31rdulh9zex?src=rss", "content": "NASCAR results at Michigan: Joey Logano dominates FireKeepers Casino 400, wins in OT Written By Thomas Schlarp Motorsports Drivers spent nearly the entire race looking at the rear of Joey Logano's yellow No. 22 car, but a caution on the final laps and an overtime finish made things close as Logano held on for his second victory of the season. The weekend could not have gone much better for Logano after the defending Monster Energy Cup Series champion won pole position in Saturday's qualifying. The No. 22 car capitalized on his prime track position and led 163 of the FireKeepers Casino's 203 laps. The win was Logano's third career win at Michigan International Speedway and 23rd overall victory of his career. MORE: Watch NASCAR live & on demand with fuboTV (7-day trial) <mark>Kurt Busch</mark> sailed by Martin Truex Jr. on the overtime's restart to claim second place, tying his season-best finish of second at Bristol. Truex, <mark>Daniel Suarez</mark> and points leader Kyle Busch rounded out the top five. Austin Dillon claimed the first stage victory of his career by winning Stage 2. Contact with William Byron and the wall midway through the final stage, however, spelled near-disaster for the No. 3. Dillon finished 26th. Monday's race was the result of a postponement from a Sunday afternoon start time due to persisting rain showers. The Monster Energy Cup Series now takes a week off for Father's Day before heading to Sonoma Raceway for the first road course of the season. Sporting News tracked live updates and highlights from the FireKeepers Casino 400. NASCAR at Michigan: Live updates, highlights from FireKeepers Casino 400 (All times Eastern .) Caution flags: 7 Lead changes: 19 Lap leaders: Joey Logano (161), Kevin Harvick (15), Austin Dillon (7), Brad Keselowski (6), Denny Hamlin (5), William Byron (2), Aric Almirola (1), Ryan Blaney (1), Clint Bowyer (1), Chase Elliott (1), FireKeepers Casino 400: 2019 winner, top 20 order of finish Finish Hendrick Motorsports (9) 1 8:03 p.m.: Logano holds on to beat <mark>Kurt Busch</mark> by two car lengths for his his second win of the year. RETWEET to congratulate @ joeylogano on his 2 ️ ⃣ 3 ️ ⃣ rd career victory! @ MISpeedway | @ Team_Penske pic.twitter.com/c8ZuABfmA5 8:01 p.m.: Green! Two laps to victory. 8:00 p.m.: Going to be some overtime. We'll have our first crack at overtime. Restart order: Logano-Truex-Kurt Busch-Kyle Busch-Bowman-Suarez-Harvick-Keselowski-Hemric-Blaney #FireKeepersCasino 400 7:53 p.m.: Caution with five laps to go. <mark>Erik Jones</mark> is in the infield. This restart is going to be CRAZY. CAUTION: @ erik_jones goes around and everybody will be ready to fight for the lead! Get to @ FS1 to catch the end of this one! pic.twitter.com/j6cwvQDT9U 7:49 p.m.: Ten to go. Logano has a 1.4-second lead over Truex. Kyle Busch has climbed to fourth. The battle for second is hot, but can either catch the leader? @ MartinTruex_Jr | @ KurtBusch pic.twitter.com/o5jIYLuJ0r - #NASCARSalutes (@ NASCAR) June 10, 2019 7:45 p.m.: Everyone has pitted now with 15 laps to go. Logano is back in first followed by Truex and <mark>Kurt Busch</mark>. 7:40 p.m.: Logano is among a herd of drivers to go to pit road with 24 laps remaining. The rest of the front-runners make their green-flag stops. - #NASCARSalutes (@ NASCAR) June 10, 2019 7:37 p.m.: Harvick heads to pit road from second place with 27 laps left. He took four tires. 7:32 p.m.: David Ragan and Matt Tifft both hit the wall and take damage, but we stay green. 7:30 p.m.: 40 laps remain, and it's still Logano's race to lose. Truex, Harvick, <mark>Kurt Busch</mark> and <mark>Daniel Suarez</mark> round out the top five. 7:22 p.m.: Logano quickly blasts back into first. Bubba Wallace is going to the pits with a lot of smoke behind him. . @ joeylogano wins the drag race down the backstretch to reclaim the lead! 7:07 p.m.: Green flag with 66 laps to go. 7:02 p.m.: That puts an end to Bowyer's day. 7:00 p.m.: Caution. Clint Bowyer made contact with the No. 20 car, and sent Bowyer crashing into the wall. A hard lick with the outside wall is not how @ ClintBowyer wanted to end the day. @ MISpeedway | #FireKeepersCasino 400 pic.twitter.com/nk9SgAEO6c 6:59 p.m.: Wow, <mark>Larson</mark> and Logano hit each other hard, but both managed to save it. 6:58 p.m.: Green flag for the final stage. 6:55 p.m.: Logano will be right where he's spent the majority of the race, after winning the battle off pit road. . @ joeylogano, @ chaseelliott, and @ erik_jones gain tons of positions by taking only two tires. 6:52 p.m.: Aric Almirola will restart from the rear after being penalized for driving through too many pit boxes. Stage 2 winner: Austin Dillon 6:46 p.m.: Austin Dillon wins his first stage. Harvick and Truex follow close behind. 6:43 p.m.: <mark>Larson</mark> took tires. Logano and Blaney also make their way to pit road. Clint Bowyer takes the lead with four to go. 6:40 p.m.: Eight laps to go in Stage 2. It's still Logano, <mark>Larson</mark>, Blaney in the top positions. Everyone in the top five may need to fuel. 6:34 p.m.: <mark>Larson</mark>'s team has informed him he won't be able to complete the stage with his current fuel levels. It sounds like the top 7 drivers will have to pit before the end of Stage 2. If not, they're going to be veeerrryyyy close on fuel. Austin Dillon is the highest-running driver who should be safe on fuel in 8th. #FireKeepersCasino 400 - PRN (@ PRNlive) June 10, 2019 6:28 p.m.: <mark>Kyle Larson</mark> passes Blaney for second with 26 laps remaining in Stage 2. 6:21 p.m.: Well all those pit road visits for Harvick apparently paid off. He's improved 10 spots to 16th since the restart. 6:17 p.m.: Back under green on Lap 76 of 200. 6:14 p.m.: <mark>Johnson</mark> took more damage for another collision on pit road. Here's how <mark>Jimmie</mark> picked up damage on pit road pic.twitter.com/th5S6ScLIU - FOX: NASCAR (@ NASCARONFOX) June 10, 2019 6:13 p.m.: A lot of drivers gambling on fuel, believing they can make it 52 laps until the end of the stage. Big strategy moves as nine cars stay out during the caution. Take a look at where everyone will line up: https: //t.co/Yh360hGfss pic.twitter.com/1FTuGcO0Ey 6:07 p.m.: Caution on Lap 71. Kyle Weatherman hit the wall and lost a piece from the back of his No. 51 car. That's not good pic.twitter.com/KopXsgyn0u - FOX: NASCAR (@ NASCARONFOX) June 10, 2019 6:05 p.m.: Matt Tifft was too fast entering pit road. He'll restart at the back. 6:01 p.m.: After taking four tires on his initial trip down pit road, Harvick is going back. Issues continue for the No. 4 team as they make yet another unscheduled stop. They'll remain one lap down. pic.twitter.com/jiZcFCV1Qe 5:59 p.m.: Logano won the race of pit road. Pretty much everyone took four tires. Stage 1 winner: Joey Logano 5:54 p.m.: Logano beats Bowman by a single car length to win his sixth stage of the season, the most among all drivers. <mark>Erik Jones</mark> finished third. Joey Logano wins Stage 1 with Alex Bowman right behind him pic.twitter.com/AppsmrdEiT - FOX: NASCAR (@ NASCARONFOX) June 10, 2019 5:51 p.m.: <mark>Kyle Larson</mark> has improved 16 spots since the competition caution to seventh. 5:48 p.m.: Harvick hits pit road with seven laps remaining. He was complaining of a loose wheel. It may cost him a lap. A loose wheel forces @ KevinHarvick down pit road with a hand full of laps remaining in Stage 1. pic.twitter.com/kUt7kTC2Fp - #NASCARSalutes (@ NASCAR) June 10, 2019 5:44 p.m.: Aric Almirola passes <mark>Erik Jones</mark> for second with 13 laps left in Stage 1. 5:40 p.m.: <mark>Kurt Busch</mark> hit the wall with some decent force. It caused Harvick to hit the brakes, dropping him seven spots to ninth. <mark>Kurt Busch</mark>: \"Got right rear damage, don't know how bad. Check it please .\" He killed the wall exiting turn 2 last time by but we carry on under green. <mark>Kurt</mark> is P5. #FireKeepersCasino 400 - PRN (@ PRNlive) June 10, 2019 5:34 p.m.: Halfway through Stage 1, and Martin Truex has skyrocketed to third. 5:29 p.m.: <mark>Jimmie Johnson</mark> collided with Matt DiBenedetto on pit road. Pretty heavy damage to <mark>Johnson</mark>'s front right. Early-race repairs to @ JimmieJohnson's No. 48 machine after an incident leaving his pit box. pic.twitter.com/Mt5QwBtjMB 5:26 p.m.: Logano took two tires but still won the race off pit road. 5:23 p.m.: Competition caution after 20 laps for rain from overnight. 5:20 p.m.: Kyle Busch is all the way back in 22nd. 5:17 p.m.: Ten laps in, it's Logano, Harvick and Hamlin at the top. Back and forth for the lead as @ joeylogano gets back to the front of the field. pic.twitter.com/ppL5AMFyQ5 5:11 p.m.: Clint Bowyer had the worst start, dropping eight spots to 13. 5:10 p.m.: Green flag! Monday, 5:01 p.m.: Looks like much better weather today for some fast racing. Engines fired. Stages 60-60-80. No cars to the rear. Competition caution Lap 20. #nascar @ NASCARONFOX - Bob Pockrass (@ bobpockrass) June 10, 2019 Sunday, 4:31 p.m.: Official word is the race has been postponed until Monday at 5 p.m. E.T. .", "articleID": "2019061117_00232323_W", "names": {"Daniel Suarez": ["Q1162833", "Q16302254"], "Erik Jones": ["Q16239574", "Q57422872"], "Jimmie Johnson": ["Q217238", "Q6199355"], "Kurt Busch": ["Q201820", "Q42507470"], "Kyle Larson": ["Q11751789", "Q21184548", "Q5308142"]}}, {"date": "2019-06-11", "url": "http://thechronicleherald.ca/business/wall-street-treads-water-after-recent-rally-320985/", "content": "Wall Street treads water after recent rally Aparajita Saxena Updated: just now By Caroline Valetkevitch NEW YORK (Reuters) - U.S. stocks ended near flat and the Dow snapped a six-day winning streak on Tuesday, as investors paused following a run of gains and fresh worries emerged over the U.S. trade war with China. President Donald Trump said Tuesday he was holding up a trade deal with China and had no interest in moving ahead, unless Beijing agrees to four or five \"major points\" which he did not specify. Separately, Trump said he would impose more tariffs on Chinese imports if there was no progress in talks with Chinese President Xi Jinping at the Group of 20 summit later this month. Stocks were mostly higher in early trading amid lingering optimism over Trump's decision late on Friday to hold off import tariffs on Mexico. \"Trade sentiment is driving everything,\" said Chris Zaccarelli, chief investment officer at Independent Advisor Alliance in Charlotte, North Carolina. \"What we're seeing today is the more pessimistic view on what might happen by the end of the month. Most selling in the month of May could be put down to China and Mexico .\" Investors also may be reluctant to push stocks higher without a fresh catalyst for support, some strategists said. Data showed U.S. producer prices increased solidly for a second straight month in May, in line with expectations of economists polled by Reuters, pointing to a steady pickup in underlying inflation pressures. Industrials and utilities indexes led the way lower Tuesday, with the S & P 500 industrial index falling 0.9%, weighed down by losses in United Technologies Corp and Raytheon Co.. The Dow Jones Industrial Average fell 14.17 points, or 0.05%, to 26,048.51, the S & P 500 lost 1.01 points, or 0.03%, to 2,885.72 and the Nasdaq Composite dropped 0.60 points, or 0.01%, to 7,822.57. Recent optimism over trade tensions and the prospect of an interest rate cut by the Federal Reserve had helped stocks rally in recent sessions. The benchmark S & P 500 is just 2% away from its early May all-time high. The market is betting the Fed will cut interest rates in July and cut two more times this year as Trump's hard bargaining on trade with Beijing and others could push the economy back into recession. United Technologies fell 4% and Raytheon shed 5.1%, a day after Trump gave mixed signals on whether he believed the $121 billion merger between the companies should go forward. On Monday, Raytheon edged higher while United Technologies lost 3.1%. The S & P utilities index on Tuesday was down 0.7%. Symantec Corp fell after Morgan Stanley downgraded the antivirus software maker's stock, citing increased competition. Advancing issues outnumbered declining ones on the NYSE by a 1.08-to-1 ratio; on Nasdaq, a 1.19-to-1 ratio favored decliners. The S & P 500 posted 53 new 52-week highs and three new lows; the Nasdaq Composite recorded 54 new highs and 88 new lows. Volume on U.S. exchanges was 6.76 billion shares, compared to about 6.92 billion average for the full session over the last 20 trading days. (Reporting by Caroline Valetkevitch; Additional reporting by Sinead Carew in New York and Aparajita Saxena and Shreyashi Sanyal in Bengaluru; Editing by Leslie Adler and <mark>Tom Brown</mark>) More Business stories", "articleID": "2019061122_00184011_W", "names": {"Tom Brown": ["Q1305209", "Q15992805", "Q16194983", "Q16195439", "Q28209484", "Q500029", "Q7002060", "Q7815092", "Q7815094", "Q7815097", "Q7815099", "Q7815100"]}}, {"date": "2019-06-11", "url": "https://dailytimes.com.pk/410328/stoinis-to-miss-pakistan-game-marsh-flown-in-as-cover/", "content": "Australia all-rounder Marcus Stoinis has been ruled out of their next World Cup match against Pakistan with a side strain, captain Aaron Finch said on Tuesday. Stoinis, who has played in all three games for Australia in the tournament, picked up the injury in the match against India at The Oval on Sunday. All-rounder Mitchell Marsh has been flown over to England as back-up, but the Australians will wait to make a call on whether he permanently replaces Stoinis in their 15-man squad. \"Marcus Stoinis has a bit of a side strain. He won't be available for tomorrow,\" Finch told a news conference ahead of Wednesday's match against Pakistan in Taunton. \"We've got Mitch Marsh flying over just as a bit of a precaution. He was meant to fly over with the Australia A side on Friday .\" He's just coming a couple days early as a bit of precaution, if Stoinis doesn't recover quick enough or doesn't respond to treatment well enough over the next few days. \"Stoinis bowled seven overs for 62 runs against India, picking up the wickets of Virat Kohli and Mahendra Singh Dhoni. But he was dismissed for a duck and Australia fell 36 runs short of India's total of 352 to lose the match. Australia's pace duo Mitchell Starc and Pat Cummins found their rhythm early against India but the supporting cast of leg-spinner Adam Zampa and seamers Stoinis and Nathan Coulter-Nile struggled to keep it tight in the middle overs. The absence of Stoinis could open up a spot for seamers Kane Richardson and Jason Behrendorff, off-spinner <mark>Nathan Lyon</mark> or middle-order batsman Shaun Marsh against Pakistan, who lost all five ODIs against Australia earlier this year .\" It's just about trying to weigh up whether we go with (Shaun) Marsh tomorrow, or we go with a extra bowler and play Alex Carey at six, \"Finch added .\" We've got to find a few more overs now, whether we play the extra batter or extra bowler, we'll wait and see, and especially tomorrow with the conditions. \"Defending champions Australia won their opening two games against Afghanistan and West Indies.", "articleID": "2019061200_00184513_W", "names": {"Nathan Lyon": ["Q6969216", "Q6969217"]}}, {"date": "2019-06-12", "url": "http://www.gamereactor.eu/?system=ps4&sid=d03e71169118b8cc95d0d5caba3f5137", "content": "PS4 We got our chance to take on the Wolves at E3, and along with some tactical buddies we got a taste of what Breakpoint is cooking. Preview The Sinking City is heading to Nintendo Switch later this year Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 13:01 One announcement that might have slipped you by last night is the news that the upcoming Lovecraftian horror-adventure is also heading to Nintendo's console. 0 We share our thoughts on Cyberpunk 2077's E3 demo Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 12:43 We got to see another slice of CDPR's sci-fi RPG and there are a few things to tell you about. 0 Watch Dogs Legion's NPCs: \"their lives don't turn off\" Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 12:09 We talked to game design lead Kent Hudson about characters, classes, and customisation in the next Watch Dogs. 0 Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 11:32 We talk all things Ghost Recon after getting our hands on the game at this year's E3. 0 Alien: Isolation is heading to the Switch Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 10:47 One of the surprise announcements of last night's Direct was the news that Creative Assembly's stellar sci-fi horror game is heading to Nintendo's console. 0 Written by Kerry-Lee Copsey on the 12th of June 2019 at 10:31 Meat Fortress, The Walking Dead, Budget Cuts sequel and more VR announcements inbound. 0 Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 08:33 Tactics game based on the upcoming Netflix series was revealed during tonight's Direct. 0 Spyro to star in Crash Team Racing, Reignited hitting PC & Switch Written by <mark>Mike Holmes</mark> on the 11th of June 2019 at 18:00 Reignited Trilogy is heading to PC and Nintendo Switch, and the little purple dragon is landing in CTR as post-launch DLC. 0 The Witcher 3: Wild Hunt - Complete Edition confirmed for Switch Written by <mark>Mike Holmes</mark> on the 11th of June 2019 at 17:27 We knew it was coming, but Geralt's third outing is indeed heading to Nintendo's console later this year. 0 Warframe Empyrean expansion teased at E3 2019 Written by Ben Kerry on the 11th of June 2019 at 16:38 The full reveal is coming next month, but we still got a sneak peek at the upcoming content during the PC Gaming Show yesterday. 0 Written by Ben Kerry on the 11th of June 2019 at 16:24 The new content drops landed alongside a new trailer shown at the Ubisoft press conference. 0 In Breakpoint \"the narrative really drives the action\" Written by <mark>Sam Bishop</mark> on the 11th of June 2019 at 15:20 Writer Emil Daubon joined us at E3 to talk about the world Ubisoft has created, including the story that we'll be experiencing. 0 Conan Chop Chop is a cutesy top-down tale of barbaric slaughter Written by <mark>Mike Holmes</mark> on the 11th of June 2019 at 14:26 We love the name, and the premise seems pretty neat too, as Funcom reveals the game that is definitely not an April Fool's joke. 0 Written by <mark>Mike Holmes</mark> on the 11th of June 2019 at 13:51 We've collected together the best trailers from Square Enix's presser. 0 Written by Fabrizia Malgieri on the 11th of June 2019 at 13:44 We talked to Creative Director Nicolas Guérin at E3 2019.", "articleID": "2019061212_00150962_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}}]