[{"date": "2019-06-13", "url": "http://www.surreycomet.co.uk/news/national/17704953.uk-ready-to-assist-over-suspected-attacks-on-tankers-in-gulf-of-oman/", "content": "UK ready to assist over suspected attacks on tankers in Gulf of Oman By Press Association 2019 Iran Persian Gulf Tensions 0 comment The UK is prepared to assist in any rescue effort or investigation over the \"completely unacceptable\" suspected attacks on two oil tankers in the Gulf of Oman, Downing Street has said. The two civilian ships were damaged off the coast of Iran on Thursday amid heightening tensions between the US and Tehran, but many details remain unclear. An oil tanker is on fire in the sea of Oman (AP Photo/ISNA) An alert urging \"extreme caution\" was issued by the Navy-run United Kingdom Maritime Trade Operations following reports of explosions. Sailors were forced to evacuate when one of the tankers was left ablaze and the other adrift. <mark>Theresa May</mark>'s official spokesman told a Westminster briefing: \"Attacks on civilian vessels like these are completely unacceptable .\" We are in contact with international partners and are ready to assist in any rescue effort or investigation. \"0 comment", "articleID": "2019061315_00273145_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2019-06-14", "url": "http://www.gamereactor.eu/call-of-duty-black-ops-4/?sid=81f7318c7e544211aa9393726529dd2e", "content": "CALL OF DUTY: BLACK OPS 4 REVIEW. Written by Eirik Hyldbakk Furu on the 12th of October 2018 at 05 \"It sets the bar both in terms of quality and quantity for the franchise .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 7th of June 2019 at 10 See how the action will unfold between the biggest and best Call of Duty teams in California this month. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 5th of June 2019 at 12:13 This has introduced plenty for PS4 players to see, including changes to Blackout's map, new weaponry, and more. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 4th of June 2019 at 08 As the CWL Pro League goes on, Nolson is coming into the main roster as Accuracy becomes a substitute. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 23rd of May 2019 at 09 The player might have had a lot of success in the past, but he's moving to a substitute role as Ricky comes into the roster.", "articleID": "2019061406_00222656_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-06-14", "url": "http://wcqs.org/post/aldis-hodge-30-year-acting-veteran-age-32-city-hill", "content": "Aldis Hodge, A 30-Year Acting Veteran At Age 32, On \"City On A Hill' By <mark>Noel King</mark> & Daniel Hajek • 6 minutes ago Share Tweet Email City on a Hill, Aldis Hodge plays Assistant District Attorney Decourcy Ward, who is new to the corrupt criminal justice system of 1990s Boston .\" href = \"https: //mediad.publicbroadcasting.net/p/shared/npr/styles/x_large/nprshared/201906/732447198.jpg\" > City on a Hill, Aldis Hodge plays Assistant District Attorney Decourcy Ward, who is new to the corrupt criminal justice system of 1990s Boston. \"> In City on a Hill, Aldis Hodge plays Assistant District Attorney Decourcy Ward, who is new to the corrupt criminal justice system of 1990s Boston. Eric Ogden / Showtime Listen Listening.../ Originally published on June 14, 2019 8:27 am A new TV show, set in Boston in the 1990s, centers on some action-packed armored-car robberies. A crime drama in Boston: You've heard this before. But City on a Hill, which premieres Sunday on Showtime, is aiming for distinction. It stars actor Aldis Hodge as a straight-and-narrow assistant district attorney working within a crooked justice system. He's new in town, and determined to take on these robbery cases .\" In order to do his job right, he has to kind of play their game and play kind of by their rules a little bit, \"Hodge says in an interview .\" So he's got to get his hands dirty. \"And that means teaming up with a corrupt, racist FBI agent, played by <mark>Kevin Bacon</mark>. The two form something like a buddy-cop duo--except they certainly aren't buddies .\" I keep saying that these guys are two titans in a ring, boxing it out, \"Hodge says. In an interview, he spoke about the racism in the world of the show, his\" disciplinarian \"mother and a career that began as a child actor on Sesame Street and in Die Hard with a Vengeance. Interview Highlights On the racism of <mark>Kevin Bacon</mark>'s character I remember talking to the director of the show when we did the pilot, and even the writers now, about the tone of how this character handles racism ....I grew up around racism. I grew up between New York and [New] Jersey. And most people didn't realize that there was a KKK presence in Jersey in the part of town where I grew up. So I grew up around it. So as far as it comes to dealing with our characters together, we play the honesty of it. And this is what we go through today. I've even been through it this year alone in New York...I've had a Caucasian man a couple of months ago call me the n-word ....To my face, yeah. I've had another Caucasian man in his 50s call me to my face, said,\" You're intimidating because you're black. \"I said,\" What? What did you say? \"And in that, I had to invoke my own power within myself to understand my value, because: I'm a human being. I'm not intimidating. And I know what I bring to the table, and I know how I treat people. I was brought up with respect, and in that, I mean I give respect because I see the value in other people. That's what my mother taught me. It's weird that people don't realize that we live in this reality continuously. Aldis Hodge stars opposite <mark>Kevin Bacon</mark> as unlikely collaborators in the period cop drama City on a Hill. Claire Folger / Showtime On his mother Both my parents were Marines; so they met in the Corps. My brother [Edwin Hodge, also an actor] and I were both born while they were in service. And moms--so she was a single parent; I was raised in a single-parent household--but moms was, she was no joke. She was not a game up in here! Oh man! My mother was very much a disciplinarian. On time is late, early is on time, that kind of thing. And us, even though we were in the business, back in Jersey and New York we were still poor. We've been homeless three different times. I believe the last time I was homeless was when we moved to LA--I think I was 10. We used to live in our car at a certain point and all that. And for everything, my mom was like: Education is your way out. So she was not playing about the education. My mom reinforced the value of who we were in us continuously. And she--you know, she sacrificed a lot so that we may pursue our dreams ....Look, she was very conscious of the fact that she's a single mom raising two black men in a world that would not be so kind to them. What happens when the acting goes south? What will you know? So with acting, she made us earn it. She said,\" Look, if you're not bringing home As and Bs, you ain't going to see no audition. I don't care what's happening. \"And you know, on set--my mom, she's from the South, she's from Florida--like, she'll snatch us up in front of anybody. You acting out, you gon' get your butt whooped here, now, today, in front of everybody, and you gon' go back...you gon' do your job, because you chose this. On having a 30-year acting career at age 32 I've had to reevaluate my relationship with this industry. Because when I was a teenager, all I was getting was, like, thug role auditions and athlete role auditions. And I remember, I was always a science nerd. I was like: Black people are more than this. Like, that's cool and all, but it has to have a purpose. It can't just be for the sake of\" this is all we see you as. \"Now, 30 years in the game, I've spent this entire time trying to figure out...what I'm doing here, and demanding more of this career for me. So I've made sacrifices. There are jobs I didn't take, auditions I didn't go on. It all amounts to where I am now. And you have to actively participate in your fate, in your future. So I got a mission. And make sure that when people see me, they see a man of content and moral fiber. And somebody who didn't sell out. And that's the path I hope to walk for the rest of my career. Jacob Conrad edited this interview for broadcast. Patrick Jarenwattananon adapted it for the Web. Copyright 2019 NPR. To see more, visit https: //www.npr.org. Share Tweet Email", "articleID": "2019061413_00126097_W", "names": {"Kevin Bacon": ["Q23823432", "Q3454165", "Q6395762", "Q6395763", "Q6395764"], "Noel King": ["Q42914343", "Q7047049"]}}, {"date": "2019-06-14", "url": "http://shadow.foreignpolicy.com/2019/06/14/europes-dream-escaping-the-dictatorship-of-the-dollar/", "content": "Report Europe's Dream: Escaping the Dictatorship of the Dollar Trump's hostile behavior is reinvigorating efforts to turn the euro into an alternative to the world's dominant currency. If only the Europeans could find some way to do it. By <mark>Keith Johnson</mark> | June 14, 2019, 3:20 PM A photo illustration of euro, U.S. dollar, and British pound notes on Oct. 13, 2017. Matt Cardy/Getty Images Europe's quest to find an alternative to U.S. financial dominance and the global rule of the dollar has only intensified since French and German leaders first howled about the need to recover their economic sovereignty last summer. But European governments are finding that coming up with a workable plan is a lot easier said than done--leaving them fuming but still vulnerable to Washington's strong-arm tactics. That doesn't mean, however, the Europeans are going to give up trying--and that poses a long-term danger to U.S. power. Countries such as France and Germany first bristled at the Trump administration's decision to unilaterally pull out of the 2015 Iran nuclear deal and reimpose crippling sanctions on Iran, putting European firms squarely in the crosshairs of U.S. sanctions. America's Iran policy still rankles, and Europe's efforts to create a so-called special purpose vehicle to enable some trade with Iran continue, with meetings taking place this week even with oil tankers ablaze just outside the Persian Gulf. But since the return of the Iran sanctions last year, the Trump administration has dramatically stepped up its use of sanctions and other economic weapons to force friends and foes alike to cow to its foreign-policy wishes. In addition to a tougher line on Iran, there have been increasing, crippling sanctions on Venezuela, including a blanket prohibition on any countries providing help for Venezuela's oil industry; further sanctions on Russian banks and individuals and repeated threats of U.S. sanctions on European firms working on a Russian gas pipeline in Germany; threats of sanctions against Turkey, a NATO ally, for its defense procurement decisions; and even an unprecedented application of 1990s-era Cuba legislation that is a direct threat to companies in Europe and elsewhere. Those sanctions come on top of a slew of heavy-handed trade actions, from huge tariffs on China meant to force Beijing to change its entire economic system to a tariff threat on Mexico designed to strong-arm the country into changing its migration policies--not to mention the Trump administration's campaign to get countries around the world to blacklist China's Huawei, the world's biggest telecoms equipment-maker. All this bullying from Washington is made possible because the U.S. dollar remains the world's reserve currency and the most used in cross-border transactions. Even so, the Trump administration is taking a risk in resorting to this financial weapon with an abandon seldom seen before, said John E. Smith, who stepped down last year as head of the U.S. Treasury Department's sanctions arm. \"It's of deep concern that the more the U.S. pushes Europe away from a common policy, the more they push Europe into finalizing true alternatives to the U.S. financial system,\" which will ultimately weaken the United States' economic power and its ability to effectively wield sanctions, said Smith, now the co-head of the national security group at Morrison & Foerster. So far, adverse reaction to U.S. financial actions is boosting the euro's prospects--a bit. \"[G] rowing concerns about the impact of international trade tensions and challenges to multilateralism, including the imposition of unilateral sanctions, seem to have lent support to the euro's global standing\" over the past year, the European Central Bank (ECB) concluded Thursday in its annual report on the use of the euro. While the euro's share of cross-border transactions stayed about the same--just under one-third of all transactions--the euro's share in global foreign exchange reserves grew over the last year, while the dollar dropped to its lowest level in almost 20 years. The ECB said some central banks are reducing dollar exposure due to the risk of unilateral actions. This week, French Finance Minister Bruno Le Maire rebuffed U.S. pressure to ban Huawei, citing the need to protect French sovereignty. This month, the governor of the Banque de France and a contender to become the next head of the ECB, called for a greater role for the euro to restore Europe's financial sovereignty. Leading French lawmakers, meanwhile, rail against U.S. extraterritorial sanctions and fret for the future of the trans-Atlantic alliance. Even Spain has fought back furiously against the U.S. revival of Cuba sanctions that threaten its leading businesses. While the United States has aggressively used its central position in the global financial system to impose sanctions on rogue actors since the 1990s, what President Donald Trump is doing is a whole new order of magnitude, Smith said. \"The Trump administration is far more willing to confront even allies and seek to force changes to their foreign-policy position using threats of sanctions, as well as trade threats,\" he said. \"We're hearing now from France and Germany what we used to hear from China and Russia .\" The problem for U.S. allies in Europe, Asia, and elsewhere that are seeking a way around U.S. financial muscle is that it is proving extremely tough to unwind more than seven decades of dollar dominance. The U.S. financial system remains the central nervous system for the bulk of financial transactions. That gives U.S. policymakers the ability to squeeze other countries that is simply unmatched anywhere else, despite decades of sporadic efforts by countries like Japan, China, and others to make their currencies and banking systems an alternative. That is especially evident with Europe's effort to sustain trade with Iran through \"INSTEX,\" a special financial vehicle designed to allow limited trade in humanitarian goods and medicine despite U.S. sanctions. After a year of trying, Europe and Iran still don't have the system up and running. More to the point, however much European governments (and Brussels) would like to honor their commitments to Iran under the auspices of the 2015 accord, European businesses have a calculus of their own--and that doesn't include taking on the U.S. Treasury. \"Companies, even Russian and Chinese companies, do what is in their best interest. And even in Russia and China, they don't automatically subordinate that self-interest to the wishes of the government,\" said Barry Eichengreen, a professor of economics and political science at the University of California, Berkeley. \"For the moment, using dollars remains convenient and economical from the company point of view .\" That's one reason why since last year the European Union has been redoubling efforts to carve out a greater international role for the euro, the world's second-most important currency. Last fall, European Commission President Jean-Claude Juncker called for deeper economic and monetary reforms to boost the euro's role in the global economy, which would help shield Europe from \"selfish unilateralism\" by others. \"The euro must become the face and the instrument of a new, more sovereign Europe,\" Juncker said. Late last year, the European Commission rolled out a road map to strengthen the euro's international role, including completing true monetary union 20 years after the launch of the European currency by creating real pan-European banking and capital markets, which remain fragmented along national lines. Another key plank is to use the euro more, and the dollar less, in the energy sector; despite being the biggest energy importer in the world, Europe mostly pays in dollars for oil, coal, and natural gas. This week, the commission reported that consultations with a wide range of industries showed \"broad support for reducing dependence on a single dominant global currency\" and \"recognition that the EU, through the euro, can reinforce its economic sovereignty .\" The euro, the commission found, is the only currency that can realistically compete with the dollar. But Europe is still struggling to make its own money the currency of choice for seemingly logical things, such as the 300 billion euros the continent spends every year importing energy--the overwhelming share of which is actually paid for in dollars, which go through U.S. banks under the eye of U.S. authorities. And European Commission officials stress that a lot more progress must be made on creating the European monetary and banking union, and especially a true pan-European capital market, to better be able to compete with the dollar and U.S. financial might. \"What's holding the euro back? National financial markets in Europe still lack the breadth and liquidity of U.S. financial markets because they're segmented along national lines,\" Eichengreen said. Still, he said, \"Rome wasn't built in a day. These pilot projects augur what is to come. It will just take time to get there .\" The United States and Europe have had plenty of deep-seated economic spats before, from disputes over trade and monetary policy in the 1970s to decades-long fights over agriculture, industrial subsidies, and tariffs. But America's recent insistence on using its financial might to strong-arm even its closest allies into doing its bidding is a whole new ballgame--with potentially lasting consequences, Smith said. \"The United States has pushed Europe on this issue to the breaking point, where capitals across Europe are looking for alternatives, and at some point some of those alternatives will bear fruit .\" View Comments Tags: Economics, European Union, Finance, Trade Trending Now Sponsored Links by Taboola By Taboola More from Foreign Policy By Taboola Read More The Buck Stops Here: Europe Seeks Alternative to U.S.-Dominated Financial System Germany and France complain that the U.S. is abusing sanctions power to bully even its allies. Report | <mark>Keith Johnson</mark> EU Offers Up a Meager Workaround to U.S. Iran Sanctions The new vehicle will do little to ease Iran's economic pain, though it should help humanitarian trade. Report | <mark>Keith Johnson</mark> China and the EU Are Growing Sick of U.S. Financial Power They are trying their best to erode Washington's rules. Shadow Government | Elizabeth Rosenberg, Edoardo Saravalle", "articleID": "2019061500_00187284_W", "names": {"Keith Johnson": ["Q1526015", "Q16104893", "Q24703001", "Q6384563", "Q6384564"]}}, {"date": "2019-06-15", "url": "http://www.newcastlestar.com.au/story/6219240/hk-readies-for-new-protests-by-residents/?cs=7314", "content": "HK readies for new protests by residents whatsapp Hong Kong's Chief Executive <mark>Carrie Lam</mark> has sidestepped questions over whether she should quit. Thousands of Hong Kong residents are expected to return to the streets on Sunday to protest a controversial extradition bill, which the government has decided to suspend under pressure from massive protests in the past week. Protesters said on Saturday afternoon that Hong Kong leader <mark>Carrie Lam</mark>'s about-face decision to put the bill on ice did not appease them. \"I think the majority of Hong Kong people will not accept temporary suspension,\" said protester Thomas Hong, who was participating in a 10-person hunger strike outside government offices. <mark>Lam</mark> said she decided to suspend the proposed legislation, which is controversial because it would allow extraditions to China, as much of the public still has \"concerns and doubts about the bill .\" She emphasised the bill would not be revoked but simply suspended for further consultation. Protest organiser Civil Human Rights Front said Sunday's rally will serve to condemn the excessive use of force against demonstrators in the past week. Police used tear gas, pepper spray and rubber bullets against protesters on Wednesday, injuring 81 people. The organisers say they wanted to see the bill fully revoked and for <mark>Lam</mark> to step down. They were also asking the government to reclassify Wednesday's rally from riot to protest and release and not prosecute those arrested. Anger at the bill has united Hong Kong in a way not seen since major pro-democracy protests in 2014, as many fear it is a sign that the city is losing its autonomy to China. Australian Associated Press", "articleID": "2019061603_00232819_W", "names": {"Carrie Lam": ["Q19217", "Q5046264"]}}, {"date": "2019-06-16", "url": "http://www.eppingforestguardian.co.uk/news/national/17709913.police-launch-murder-probe-after-glasgow-death/", "content": "Police launch murder probe after Glasgow death By Press Association 2019 Police 0 comment A murder investigation has been launched after the death of a man in Glasgow. <mark>Paul Kelly</mark> was found with serious injuries in Hermitage Avenue, Knightswood, around 10am on Saturday. Emergency services attended however the 50-year-old died at the scene. His relatives have been made aware and a report will be sent to the Procurator Fiscal. Officers say a 46-year-old man has been arrested in connection with the death. Murder Inquiry Launched--Knightswood Police are treating the death of <mark>Paul Kelly</mark> (50) who died in Knightswood on Saturday 15 June 2019 as murder. A 46-year-old man has been arrested bot not charged at this time. Police enquiries continue. https: //t.co/oULe3UqDJn--GreaterGlasgPolice (@ GreaterGlasgPol) June 16, 2019 However he has not been charged and police inquiries are continuing. Detective Inspector Steven Elliot said: \"A man has lost his life in what I can only describe as a very violent attack .\" We are still trying to establish exactly what happened yesterday in Hermitage Avenue but are keen to speak to anyone who saw a man in the vicinity around the time Mr <mark>Kelly</mark> was assaulted. \"This man is described as white, in his 40s, around 6ft tall, slim build and was wearing a black jacket and carrying a large orange carrier bag .\" Anyone who may have seen this man or has any other information that could assist our enquires is asked to contact police at Govan CID via telephone number 101 quoting incident number I314 of 15 June 2019. \"0 comment", "articleID": "2019061616_00208027_W", "names": {"Paul Kelly": ["Q14913044", "Q2060579", "Q25190216", "Q2682390", "Q6382232", "Q7151728", "Q7151729", "Q7151730", "Q7151731", "Q7151732", "Q7151737", "Q7151738", "Q952656"]}}, {"date": "2019-06-16", "url": "http://msn.com/en-au/entertainment/movies/14-music-biopics-in-the-works-after-rocketman-from-elvis-presley-to-aretha-franklin-photos/ss-AACYddE?li=AAgfVR9", "content": "Full Screen 1/15 SLIDES © Getty Images With the box office and awards season success of \"Bohemian Rhapsody,\" music biopics are roaring back. \"Rocketman,\" based on the life of <mark>Elton John</mark>, just released this past weekend, and several others are currently in the works, including films about Elvis Presley, Aretha Franklin, Bob Marley, <mark>John Lennon</mark> and <mark>Yoko Ono</mark>. 2/15 SLIDES © Getty Images Amy Winehouse Monumental Pictures' Alison Owen and Debra Hayward are producing a film on the life of the late Amy Winehouse. They'll be working in coordination with Winehouse's father Mitch, who previously said in a statement that he felt finally the \"time was right .\" Although no one has been cast yet as the soul singer, Owen tells TheWrap the project is in development and the plan is to shoot next year. 3/15 SLIDES © Getty Images \"Respect\" - Aretha Franklin Before her death in 2018, Aretha Franklin chose Jennifer Hudson to portray her on film. The biopic follows the Queen of Soul from her childhood singing in her father's choir, through the tumultuous, cultural revolution in the 1960s at the start of her career, and on the way to becoming an international icon. Tommy Liesl is directing the film from a script by Oscar winner Callie Khouri. MGM has the movie slated for release on Aug. 14, 2020. 4/15 SLIDES © Photo by Mike Prior/Redferns Bob Marley Bob Marley's son Ziggy is producing the currently-in-development biopic about the iconic reggae singer's life with Paramount Pictures. Marley helped introduce reggae to mainstream audiences around the globe and helped change the landscape of music before dying of cancer at age 36. 5/15 SLIDES © TheWrap Boy George Most recently, MGM announced it is set to produce a feature biopic on the life of Boy George, the flamboyant and charismatic frontman of the pop band Culture Club. Sacha Gervasi (\"Anvil: The Story of Anvil\" ) is writing and directing the film that will chart his childhood in a working class Irish family up through his international success as a solo artist. 6/15 SLIDES © Getty Images \"Beautiful\" - Carole King The film adaptation of the Tony-winning Broadway musical \"Beautiful\" about the life and career of Carole King was first announced back in 2015, and an individual with knowledge of the project told TheWrap that \"Beautiful\" is still in development. While no cast or director has been set, Tom Hanks, Paul Blake and Gary Goetzman are set to produce an adaptation based on the musical book by Douglas McGrath. The play is a jukebox musical featuring many of King's hits as it charts the early part of her career, including \"You've Got a Friend,\" \"One Fine Day,\" \"Will You Love Me Tomorrow,\" \"Natural Woman\" and many more. 7/15 SLIDES © Getty Images \"The Power of Love\" - Celine Dion Valérie Lemercier will star in and direct this feature inspired by the life and career of Canadian singing powerhouse Celine Dion, which will also feature her songs. The film is in the French language, and Gaumont is handling, but a representative says sales have not yet begun on the film. 8/15 SLIDES © Getty Images Elvis Presley \"Moulin Rouge\" director Baz Luhrmann is helming an untitled biopic about the life of Elvis Presley at Warner Bros., and as of March, Tom Hanks was in talks to portray Elvis' manager \"Colonel Tom\" Parker. No word on casting for the King himself however. 9/15 SLIDES © Getty Images Gucci Mane In February, Paramount Players and Imagine Entertainment acquired the life rights to Gucci Mane and kicked off development on a music biopic based on the rapper's book \"The Autobiography of Gucci Mane .\" Imagine's Brian Grazer and Erica Huggins are producing the project, and Mane is executive producing with Todd Moscowitz. His book talks about how Mane released mixtapes from prison alongside other rappers like Migos and Young Thug. 10/15 SLIDES © Photo by Tony Russell/Redferns \"I Am Woman\" - Helen Reddy Tilda Cobham-Hervey stars in this biopic of Australian singer Helen Reddy, who became a smash with her feminist anthem \"I Am Woman .\" Evan Peters and <mark>Danielle MacDonald</mark> also star in the film directed by Unjoo Moon from a script by Emma Jensen. The biopic follows Reddy's career as a musician and as an activist during the 1970s. WestEnd Films is handling sales. 11/15 SLIDES © John Shearer \"I Still Believe\" - Jeremy Camp Lionsgate had a surprise box office hit on their hands with the faith-based music biopic \"I Can Only Imagine,\" and their next is about another Christian rock star, Jeremy Camp. \"Riverdale\" star KJ Apa stars alongside Shania Twain, as well as Britt Robertson, Melissa Roxburgh and Nathan Dean Parsons. 12/15 SLIDES © Wikimedia Commons <mark>John Lennon</mark> and <mark>Yoko Ono</mark> Bohemian Rhapsody \"scribe Anthony McCarten wrote the screenplay for an untitled biopic about the romance between <mark>John Lennon</mark> and <mark>Yoko Ono</mark>, along with their activism and strive for peace. <mark>Ono</mark> herself approved the story after producer Josh Bratman lobbied her to bring it to the screen. Jean Marc Vallée (\"Big Little Lies,\" \"Dallas Buyers Club\" ) is directing the film, which is currently in active development, an individual with knowledge of the project tells TheWrap. 13/15 SLIDES © Courtesy: Allan Warren \"Leonard\" - Leonard Bernstein <mark>Bradley Cooper</mark> is following up \"A Star Is Born\" by taking on the life story of the legendary composer Leonard Bernstein. <mark>Cooper</mark> will direct and star in the music biopic, as well as write the script with Josh Singer (\"First Man,\" \"Spotlight\" ). Paramount Pictures and Amblin Partners are co-financing the project about the New York Philharmonic music director and composer of \"West Side Story .\" At one point Jake Gyllenhaal was attached to star in a separate Bernstein biopic from director Cary Fukunaga. 14/15 SLIDES © Getty Images \"Blond Ambition\" - Madonna The script for \"Blond Ambition\" by Elyse Hollander was the number one ranked title on the 2016 Black List of the best un-produced screenplays, and Universal acquired the project in 2017 for Brett Ratner and John Zaozirny to produce. It's described as the story of how Madonna struggled to get her first album made in 1980s New York, as she navigates fame and a struggle with her gender in show business. Immediately after news broke that the script was acquired, the Material Girl in a now-deleted Instagram post called the project \"all lies .\" \"Nobody knows what I know and what I have seen. Only I can tell my story,\" she said in a separate post. \"Anyone else who tries is a charlatan and a fool. Looking for instant gratification without doing the work. This is a disease in our society .\" An individual with knowledge says the film is still in active development. 15/15 SLIDES © Getty Images Teddy Pendergrass Tyrese Gibson will play R & B legend Teddy Pendergrass from Warner Bros., who acquired the rights to the singer's life in February. Pendergrass' story is ripe for adaptation, as he rose to fame as part of the group Harold Melvin & The Blue Notes before breaking out as a solo artist. Pendergrass suffered a major spinal cord injury in a car crash in 1982 that left him paralyzed, leading him to fight to come back as part of the Live Aid concert in 1985. He died in 2010. Gibson is also producing with the \"Empire\" creator Lee Daniels and Donald De Line. Pendergrass' widow is an executive producer. 15/15 SLIDES 1/15 SLIDES Next Slide", "articleID": "2019061621_00306601_W", "names": {"Bradley Cooper": ["Q205707", "Q4954898"], "Danielle Macdonald": ["Q20745002", "Q37610021"], "Elton John": ["Q16209157", "Q2808"]}}]