[{"date": "2019-06-16", "url": "http://msn.com/en-au/entertainment/movies/14-music-biopics-in-the-works-after-rocketman-from-elvis-presley-to-aretha-franklin-photos/ss-AACYddE?li=AAgfVR9", "content": "Full Screen 1/15 SLIDES © Getty Images With the box office and awards season success of \"Bohemian Rhapsody,\" music biopics are roaring back. \"Rocketman,\" based on the life of <mark>Elton John</mark>, just released this past weekend, and several others are currently in the works, including films about Elvis Presley, Aretha Franklin, Bob Marley, <mark>John Lennon</mark> and <mark>Yoko Ono</mark>. 2/15 SLIDES © Getty Images Amy Winehouse Monumental Pictures' Alison Owen and Debra Hayward are producing a film on the life of the late Amy Winehouse. They'll be working in coordination with Winehouse's father Mitch, who previously said in a statement that he felt finally the \"time was right .\" Although no one has been cast yet as the soul singer, Owen tells TheWrap the project is in development and the plan is to shoot next year. 3/15 SLIDES © Getty Images \"Respect\" - Aretha Franklin Before her death in 2018, Aretha Franklin chose Jennifer Hudson to portray her on film. The biopic follows the Queen of Soul from her childhood singing in her father's choir, through the tumultuous, cultural revolution in the 1960s at the start of her career, and on the way to becoming an international icon. Tommy Liesl is directing the film from a script by Oscar winner Callie Khouri. MGM has the movie slated for release on Aug. 14, 2020. 4/15 SLIDES © Photo by Mike Prior/Redferns Bob Marley Bob Marley's son Ziggy is producing the currently-in-development biopic about the iconic reggae singer's life with Paramount Pictures. Marley helped introduce reggae to mainstream audiences around the globe and helped change the landscape of music before dying of cancer at age 36. 5/15 SLIDES © TheWrap Boy George Most recently, MGM announced it is set to produce a feature biopic on the life of Boy George, the flamboyant and charismatic frontman of the pop band Culture Club. Sacha Gervasi (\"Anvil: The Story of Anvil\" ) is writing and directing the film that will chart his childhood in a working class Irish family up through his international success as a solo artist. 6/15 SLIDES © Getty Images \"Beautiful\" - Carole King The film adaptation of the Tony-winning Broadway musical \"Beautiful\" about the life and career of Carole King was first announced back in 2015, and an individual with knowledge of the project told TheWrap that \"Beautiful\" is still in development. While no cast or director has been set, Tom Hanks, Paul Blake and Gary Goetzman are set to produce an adaptation based on the musical book by Douglas McGrath. The play is a jukebox musical featuring many of King's hits as it charts the early part of her career, including \"You've Got a Friend,\" \"One Fine Day,\" \"Will You Love Me Tomorrow,\" \"Natural Woman\" and many more. 7/15 SLIDES © Getty Images \"The Power of Love\" - Celine Dion Valérie Lemercier will star in and direct this feature inspired by the life and career of Canadian singing powerhouse Celine Dion, which will also feature her songs. The film is in the French language, and Gaumont is handling, but a representative says sales have not yet begun on the film. 8/15 SLIDES © Getty Images Elvis Presley \"Moulin Rouge\" director Baz Luhrmann is helming an untitled biopic about the life of Elvis Presley at Warner Bros., and as of March, Tom Hanks was in talks to portray Elvis' manager \"Colonel Tom\" Parker. No word on casting for the King himself however. 9/15 SLIDES © Getty Images Gucci Mane In February, Paramount Players and Imagine Entertainment acquired the life rights to Gucci Mane and kicked off development on a music biopic based on the rapper's book \"The Autobiography of Gucci Mane .\" Imagine's Brian Grazer and Erica Huggins are producing the project, and Mane is executive producing with Todd Moscowitz. His book talks about how Mane released mixtapes from prison alongside other rappers like Migos and Young Thug. 10/15 SLIDES © Photo by Tony Russell/Redferns \"I Am Woman\" - Helen Reddy Tilda Cobham-Hervey stars in this biopic of Australian singer Helen Reddy, who became a smash with her feminist anthem \"I Am Woman .\" Evan Peters and <mark>Danielle MacDonald</mark> also star in the film directed by Unjoo Moon from a script by Emma Jensen. The biopic follows Reddy's career as a musician and as an activist during the 1970s. WestEnd Films is handling sales. 11/15 SLIDES © John Shearer \"I Still Believe\" - Jeremy Camp Lionsgate had a surprise box office hit on their hands with the faith-based music biopic \"I Can Only Imagine,\" and their next is about another Christian rock star, Jeremy Camp. \"Riverdale\" star KJ Apa stars alongside Shania Twain, as well as Britt Robertson, Melissa Roxburgh and Nathan Dean Parsons. 12/15 SLIDES © Wikimedia Commons <mark>John Lennon</mark> and <mark>Yoko Ono</mark> Bohemian Rhapsody \"scribe Anthony McCarten wrote the screenplay for an untitled biopic about the romance between <mark>John Lennon</mark> and <mark>Yoko Ono</mark>, along with their activism and strive for peace. <mark>Ono</mark> herself approved the story after producer Josh Bratman lobbied her to bring it to the screen. Jean Marc Vallée (\"Big Little Lies,\" \"Dallas Buyers Club\" ) is directing the film, which is currently in active development, an individual with knowledge of the project tells TheWrap. 13/15 SLIDES © Courtesy: Allan Warren \"Leonard\" - Leonard Bernstein <mark>Bradley Cooper</mark> is following up \"A Star Is Born\" by taking on the life story of the legendary composer Leonard Bernstein. <mark>Cooper</mark> will direct and star in the music biopic, as well as write the script with Josh Singer (\"First Man,\" \"Spotlight\" ). Paramount Pictures and Amblin Partners are co-financing the project about the New York Philharmonic music director and composer of \"West Side Story .\" At one point Jake Gyllenhaal was attached to star in a separate Bernstein biopic from director Cary Fukunaga. 14/15 SLIDES © Getty Images \"Blond Ambition\" - Madonna The script for \"Blond Ambition\" by Elyse Hollander was the number one ranked title on the 2016 Black List of the best un-produced screenplays, and Universal acquired the project in 2017 for Brett Ratner and John Zaozirny to produce. It's described as the story of how Madonna struggled to get her first album made in 1980s New York, as she navigates fame and a struggle with her gender in show business. Immediately after news broke that the script was acquired, the Material Girl in a now-deleted Instagram post called the project \"all lies .\" \"Nobody knows what I know and what I have seen. Only I can tell my story,\" she said in a separate post. \"Anyone else who tries is a charlatan and a fool. Looking for instant gratification without doing the work. This is a disease in our society .\" An individual with knowledge says the film is still in active development. 15/15 SLIDES © Getty Images Teddy Pendergrass Tyrese Gibson will play R & B legend Teddy Pendergrass from Warner Bros., who acquired the rights to the singer's life in February. Pendergrass' story is ripe for adaptation, as he rose to fame as part of the group Harold Melvin & The Blue Notes before breaking out as a solo artist. Pendergrass suffered a major spinal cord injury in a car crash in 1982 that left him paralyzed, leading him to fight to come back as part of the Live Aid concert in 1985. He died in 2010. Gibson is also producing with the \"Empire\" creator Lee Daniels and Donald De Line. Pendergrass' widow is an executive producer. 15/15 SLIDES 1/15 SLIDES Next Slide", "articleID": "2019061621_00306601_W", "names": {"John Lennon": ["Q11979004", "Q6244563"], "Yoko Ono": ["Q11464149", "Q117012", "Q16264827"]}}, {"date": "2019-06-18", "url": "http://home.nzcity.co.nz/news/article.aspx?id=292244&fm=psp,tst", "content": "Home> News> Entertainment <mark>Chris Martin</mark> has reportedly split from Dakota Johnson The 42-year-old musician - who was previously married to Gwyneth Paltrow - has told friends that he's no longer in a relationship with Dakota, who is best-known for starring in the \"Fifty Shades' movies 18 June 2019 A source told The Sun newspaper:\" <mark>Chris</mark> and Dakota were very easygoing and always seemed really happy together. \"There was talk of engagement but now he says they have gone their separate ways, which has come as a real surprise to everyone .\" The high-profile duo dated for 20 months and had previously discussed tying the knot. Last year, an insider described their romance as \"serious\". The source shared: \"They will probably get married. It's serious .\" <mark>Chris</mark> (likes that) she doesn't thrive on the spotlight and is very understated. \"Meanwhile, Gwyneth previously revealed plans to write a book about her experiences of divorce. The Oscar-winning actress - who is now married to Brad Falchuk - went through a divorce from the Coldplay frontman in 2016 and she now wants to pen a tome about her experiences with <mark>Chris</mark>, because she thinks their bond is special. Gwyneth - who has kids Apple, 15, and Moses, 13, with <mark>Chris</mark> - said:\" Both <mark>Chris</mark> and I have made a commitment to continue to love the things about each other that we've always loved and to really continue to develop our friendship and to find ways to continue to communicate. There's been a long process to it. \"At some point maybe I'll write a book, because you really have to focus on forgiveness and spite that comes up; you have to let it go .\" ", "articleID": "2019061722_00089012_W", "names": {"Chris Martin": ["Q16724461", "Q17744566", "Q21020921", "Q21663261", "Q25171658", "Q28678811", "Q30122010", "Q43133913", "Q48589106", "Q5107345", "Q5107346", "Q5107348", "Q5107349", "Q5107350", "Q5107353", "Q5107354", "Q5107355", "Q5107356", "Q519982", "Q712860"]}}, {"date": "2019-06-18", "url": "http://www.ledburyreporter.co.uk/news/national/17714422.hyponatraemia-whistleblower-was-failed-inquiry-says/", "content": "Hyponatraemia whistleblower was failed, inquiry says By Press Association 2019 <mark>Sir John</mark> O'Hara 0 comment The wrong conclusions were reached following an investigation into how a whistleblower's hyponatraemia concerns were handled by officials, an inquiry said. Chairman <mark>Sir John</mark> O’Hara QC scrutinised the deaths of five children from the condition last year and heavily criticised a \"cover-up\" by some consultants, accusing some doctors of behaving \"inadequately, evasively, dishonestly and ineptly\". On Tuesday he published an update on the adequacy of searches in 2004 of what were then Western Health Board properties for documents relevant to the probe. <mark>Sir John</mark> identified a failure at leadership level after the whistleblower raised concerns in the public interest. He added: \"However, there was a serious failure to address these concerns, whether to investigate them properly or judge them fairly .\" The wrong conclusions were reached. \"This was a failure at leadership level within the healthcare service .\" Not only was the whistleblower failed but so too was the service. \"He said confidence in the critically important systems of whistleblowing depended upon fairness and professionalism .\" These were absent. It is unsettling to be compelled to this conclusion given the many reassurances urged upon me by senior Health and Social Care Board officials. \"He added:\" Whilst it is for others to determine why this particular whistleblower's concerns were not accorded proper response, I reiterate my recommendation that the highest priority be accorded the development and improvement of leadership skills within the healthcare service. \"The brothers of Raychel Ferguson, who died of hyponatraemia in 2001, (from left) Stephen, Jamie and Jason (Brian Lawless/PA) The High Court judge found three deaths from hyponatraemia, a lack of sodium in the blood, were avoidable and the youngsters received unacceptable care during the administration of intravenous fluids. His update said an internal investigation by the Health and Social Care Board ought to have concluded that:--There were gaps in the search for documents in 2004 .--The senior civil servant in the department of health was misled in 2004 as to the completeness of the searches undertaken within the board, for documentation relating to the deaths of Lucy Crawford and Raychel Ferguson .--There was a failure by the health and social care board in 2013 to bring relevant information to the attention of the inquiry, leaving it misinformed. The update said:\" That the Western Health and Social Services Board should have failed to conduct appropriate searches, and misled as to the extent of those searches, is profoundly unsatisfactory and is to be criticised. \"The Health and Social Care Board welcomed the fact that no amendment to the\" essential findings \"of <mark>Sir John</mark>'s report as published in January 2018 is required. It acknowledged issues raised in the summary report and accepted there was scope for learning .\" It is also important to stress that the panel members carried out a very complex investigation within a constrained timeline with honesty, integrity and dedication. \"This was done in line with the whistleblowing policy which provides for anonymity of the whistleblower in accordance with relevant legislation .\" The panel members were acutely aware of the seriousness of the whistleblower's concerns, given the tragic circumstances which led to the Hyponatraemia Inquiry, and strived to consider the issues raised in a fair and impartial manner. \"The HSCB is firmly committed to working with the wider healthcare system to ensure that any learning is fully taken on board .\" 0 comment", "articleID": "2019061816_00408990_W", "names": {"Sir John": ["Q28124344", "Q45996744"]}}, {"date": "2019-06-19", "url": "http://newsandstar.co.uk/news/17714665.true-farmers-man-david-thomlinson-is-laid-to-rest/", "content": "News True farmer's man <mark>David</mark> Thomlinson is laid to rest By Maureen Hodges @ DancingSheep1 Farming and Rural Affairs Editor See photos images Skip to next photo 1 / 1 Show caption 1 / 1 0 comment IT WAS a poignant moment as hundreds of people gathered at a Carlisle mart to pay their respects to a giant in the livestock auctioneering world. Farmers, livestock breeders and business leaders' from all corners of the UK had gathered not for the usual hustle and bustle of a busy livestock mart sale day, but to pay their respects to <mark>David</mark> Thomlinson. His funeral was being live streamed on a giant screen in the Borderway Auction Mart at Rosehill, where he had spent 57 years of his working life. Anecdotes were exchanged about a man they counted as a friend and mentor, who liked nothing better than standing in the rostrum and selling anything presented in front of him - with the challenge of achieving the best price. A hush descended as mourners were asked to stand while on the screen an image appeared of <mark>David</mark>'s coffin being carried into the tiny Scaleby Church where he had been a regular worshipper. Warm tributes have flooded in from all over the globe for <mark>David</mark>, one of the best-known auctioneers of his generation, after he passed away two weeks ago following a tragic accident on the family farm at Scaleby. He had been working with a newborn calf in a pen. The decision to webcast <mark>David</mark>'s service at the mart and Scaleby Village Hall was taken by family and colleagues at Harrison & Hetherington after it was realised the tiny village could not cope with the numbers of mourners, which tallied more than 1,000. The service was led by Reverend Elizabeth Gough, who said perhaps it was no coincidence that she, a farmer's daughter, should lead <mark>David</mark>'s service. Then a tiny ripple of laughter went through the watching crowd as Rev Gough added there was a chaplain standing by \"just in case technology fails'. In a tribute to the auctioneer's early life, Rev Gough said it would have been <mark>David</mark> and wife Sheila's 49th wedding anniversary. The couple met back in the sixties at the Cosmo in Carlisle, when Sheila, a farmer's daughter from Yorkshire who was then living in Annan, caught his eye. The couple moved to Park View, <mark>David</mark>'s parents' farm in 1988 .\" Sheila mentions that <mark>David</mark> said, \"when you get to Scaleby and got clay on your clogs you never moved',\" said Rev Gough. \"He loved his dogs Tink and Pip, who miss him, and was proud of the many young auctioneers he had mentored. I hope you've only picked up his good habits and ensure his legacy lives on through future generations .\" Ask yourself what would <mark>David</mark>, or DT or Tommo as I know some of you called him say or do. \"H & H joint managing director, <mark>David Pritchard</mark> said <mark>David</mark> was also a livestock breeder, an acclaimed and valued judge of livestock and an inspiration character for the younger generations he had mentored through their early days .\" <mark>David</mark> could tell you many a story in his early days in the office, and not all of it was work - playing cards was one of them, antics with the office bike to name but a few. \"I remember him telling me the first item he sold was a child's cot for one shilling. He said when he first started to sell he was very nervous and the thought of a fortnightly market used to play havoc with his digestive system two or three days before a sale .\" Brampton vet <mark>David</mark> McCrea, before reading the poem The Auctioneer, said: \"A neighbour told me he had asked <mark>David</mark> why he didn't take things a little easier and retire from the auction? <mark>David</mark> replied he couldn't give up the auction because he needed to look after his customers. But he didn't mean customers, he meant his friends .\" n News & Star attended with permission from <mark>David</mark>'s family. 0 comment", "articleID": "2019061906_00107155_W", "names": {"David Pritchard": ["Q10264436", "Q245816", "Q5238723"]}}, {"date": "2019-06-19", "url": "https://sports.nbcsports.com/2019/06/19/coric-khachanov-progress-in-halle-open/?share=email", "content": "Click to email this to a friend (Opens in new window) HALLE, Germany (AP) Defending champion Borna Coric outlasted Portuguese qualifier Joao Sousa 7-6 (4), 5-7, 7-6 (4) to reach the quarterfinals of the Halle Open on Wednesday. Coric, who defeated Roger Federer in last year's final, saved seven of the nine break points he faced and took his match point after a 26-shot rally to beat Sousa in just under 3 hours. The 14th-ranked Coric next faces France's Pierre-Hugues Herbert, who earlier defeated Ukrainian qualifier Sergiy Stakhovsky 2-6, 7-6 (2), 6-4 in their second-round match. Karen Khachanov defeated home favorite Jan-Lennard Struff 6-3, 3-6, 6-4 at the grass-court tournament, a warm-up for Wimbledon. Khachanov, ranked a career-high No. 9, hit 11 aces and converted two of his seven break chances to win in 1 hour, 43 minutes. The Russian will next face an Italian, Stuttgart Open champion Matteo Berrettini or Andreas Seppi. David Goffin defeated Radu Albot 4-6, 6-4, 6-3 and awaits the winner between the second-seeded <mark>Alexander Zverev</mark> or American <mark>Steve Johnson</mark>, who play on Thursday. Nine-time champion Roger Federer also returns Thursday against Jo-Wilfried Tsonga of France. Tsonga won their only previous match on grass, at Wimbledon in 2011 .--Click to email this to a friend (Opens in new window) LONDON (AP) Tennis player Feliciano Lopez has denied any wrongdoing after being linked by Spanish media to a doubles match at Wimbledon in 2017 that was allegedly fixed. Lopez said on Wednesday at the Queen's Club tournament in London that \"I feel it is extremely important to come to you and absolutely deny any link with the events described in relations to the allegations of match fixing .\" Spanish online newspaper El Confidencial reported earlier this week that a match played by Feliciano Lopez and doubles partner Marc Lopez at Wimbledon two years ago had been mentioned in a phone conversation by a former soccer player who is being investigated as part of a match-fixing probe in Spanish soccer. According to El Confidencial, Carlos Aranda said that he knew the Lopez pair would lose a certain match, which they did. The report does not say that the tennis players were involved or that they threw the match. Feliciano Lopez said that he and Marc Lopez had contacted the Tennis Integrity Unit, a competition watchdog in the sport, to say they would \"fully cooperate .\" Wash-out at Queens' Club means <mark>Murray</mark>'s comeback delayed Getty Images Click to email this to a friend (Opens in new window) LONDON (AP) <mark>Andy Murray</mark>'s comeback has been delayed after rain washed out the entire day's play at the Queen's Club grass-court tournament for only the third time in 18 years on Tuesday. <mark>Murray</mark>, who is competing in the doubles alongside Feliciano Lopez as he makes a tentative return to action five months after hip surgery, was due to play on Wednesday. But their first-round match against top-seeded Juan Sebastian Cabal and Jean-Julian Rojer has now been put back until Thursday. That is because Lopez's singles match against Marton Fucsovics was one of those affected by Tuesday's bad weather. The Spaniard is now first on Court One on Wednesday. Queen's Club organizers gave full refunds to spectators left frustrated by the rain. The only previous total wash-outs at the tournament since the turn of the century was finals day in 2011, which meant <mark>Murray</mark>'s title match against Jo-Wilfried Tsonga was played on the Monday, and the opening day in 2012.", "articleID": "2019061921_00224025_W", "names": {"Alexander Zverev": ["Q13990552", "Q24689242", "Q4189526"], "Andy Murray": ["Q10125", "Q526811"], "Steve Johnson": ["Q1341137", "Q1469682", "Q18688075", "Q18922000", "Q19364140", "Q24007397", "Q25466909", "Q27916976", "Q3498969", "Q46037545", "Q53569", "Q7612949", "Q7612950", "Q7612951", "Q7612953", "Q7612954", "Q7612956"]}}, {"date": "2019-06-19", "url": "https://www.dailymail.co.uk/wires/aap/article-7160543/Williams-key-reclaiming-No-1-Day.html?src=rss", "content": "<mark>Williams</mark> key to reclaiming No. 1: <mark>Day</mark> e-mail <mark>Jason Day</mark> says his exciting new partnership with accomplished caddie <mark>Steve Williams</mark> has restored his hunger to reclaim golf's world No. 1 ranking. Winless since earning two US PGA Tour victories between January and May last year, former world No. 1 <mark>Day</mark> admits he was struggling to find a spark in his career. But the Queenslander believes he has turned a corner with <mark>Williams</mark> on the bag - admitting that hitting practice balls after his Wednesday pro am at the Travelers Championship was effort he had not put in for some time. The Travelers event at TPC River Highlands in Connecticut is the second event <mark>Williams</mark> will caddie for <mark>Day</mark>, following his tie for 21st at last week's US Open. <mark>Day</mark> knows New Zealand's <mark>Williams</mark> will not tolerate slacking, having caddied for Tiger Woods during 13 of his 15 major championship wins in addition to Australian <mark>Adam Scott</mark> when he won the 2013 Masters at Augusta. \"I think the most exciting thing for my game right now is the hunger and desire to get better again is back,\" <mark>Day</mark> told AAP at TPC River Highlands. \"<mark>Steve</mark> has been integral in that feeling because he is huge on hard work .\" That's why I'm back trying to do the things I need to do to improve; I'm going to do more work after a pro am which I wasn't really doing previously. I'm excited about getting on top of it all. \"<mark>Day</mark>, whose 12 PGA Tour titles includes the 2015 US PGA Championship, has not lifted a trophy since winning the Wells Fargo Championship in May last year. He admits there is a long road ahead to climb golf's rankings and usurp four-time major winner Brooks Koepka's hold on the position .\" Once you get that desire to get back to the top, working is very easy and becomes more of a habit, \"<mark>Day</mark> said .\" I'm going to be patient and let the results come however difficult that may be. \"<mark>Day</mark> will play the opening rounds of the Travelers with <mark>Paul Casey</mark> and Bryson DeChambeau. Other Australians in the field include 2012 winner Marc Leishman, <mark>Matt Jones</mark>, Rod Pampling, Curtis Luck, <mark>Cameron Smith</mark>, Aaron Baddeley and <mark>Cameron Davis</mark>. Headlining the Travelers are major champions Bubba Watson, Koepka, <mark>Francesco Molinari</mark> and <mark>Justin Thomas</mark>. TPC River Highlands, a par 70 that measures only 6,841 yards, is the second-shortest course on the PGA Tour behind Pebble Beach (6,816 yards). Share or comment on this article: <mark>Williams</mark> key to reclaiming No. 1: <mark>Day</mark>", "articleID": "2019062003_00116406_W", "names": {"Adam Scott": ["Q201842", "Q350869"], "Cameron Davis": ["Q16207340", "Q44741988", "Q54225074"]}}]