[{"date": "2019-06-19", "url": "https://www.dailymail.co.uk/wires/aap/article-7160543/Williams-key-reclaiming-No-1-Day.html?src=rss", "content": "<mark>Williams</mark> key to reclaiming No. 1: <mark>Day</mark> e-mail <mark>Jason Day</mark> says his exciting new partnership with accomplished caddie <mark>Steve Williams</mark> has restored his hunger to reclaim golf's world No. 1 ranking. Winless since earning two US PGA Tour victories between January and May last year, former world No. 1 <mark>Day</mark> admits he was struggling to find a spark in his career. But the Queenslander believes he has turned a corner with <mark>Williams</mark> on the bag - admitting that hitting practice balls after his Wednesday pro am at the Travelers Championship was effort he had not put in for some time. The Travelers event at TPC River Highlands in Connecticut is the second event <mark>Williams</mark> will caddie for <mark>Day</mark>, following his tie for 21st at last week's US Open. <mark>Day</mark> knows New Zealand's <mark>Williams</mark> will not tolerate slacking, having caddied for Tiger Woods during 13 of his 15 major championship wins in addition to Australian <mark>Adam Scott</mark> when he won the 2013 Masters at Augusta. \"I think the most exciting thing for my game right now is the hunger and desire to get better again is back,\" <mark>Day</mark> told AAP at TPC River Highlands. \"<mark>Steve</mark> has been integral in that feeling because he is huge on hard work .\" That's why I'm back trying to do the things I need to do to improve; I'm going to do more work after a pro am which I wasn't really doing previously. I'm excited about getting on top of it all. \"<mark>Day</mark>, whose 12 PGA Tour titles includes the 2015 US PGA Championship, has not lifted a trophy since winning the Wells Fargo Championship in May last year. He admits there is a long road ahead to climb golf's rankings and usurp four-time major winner Brooks Koepka's hold on the position .\" Once you get that desire to get back to the top, working is very easy and becomes more of a habit, \"<mark>Day</mark> said .\" I'm going to be patient and let the results come however difficult that may be. \"<mark>Day</mark> will play the opening rounds of the Travelers with <mark>Paul Casey</mark> and Bryson DeChambeau. Other Australians in the field include 2012 winner Marc Leishman, <mark>Matt Jones</mark>, Rod Pampling, Curtis Luck, <mark>Cameron Smith</mark>, Aaron Baddeley and <mark>Cameron Davis</mark>. Headlining the Travelers are major champions Bubba Watson, Koepka, <mark>Francesco Molinari</mark> and <mark>Justin Thomas</mark>. TPC River Highlands, a par 70 that measures only 6,841 yards, is the second-shortest course on the PGA Tour behind Pebble Beach (6,816 yards). Share or comment on this article: <mark>Williams</mark> key to reclaiming No. 1: <mark>Day</mark>", "articleID": "2019062003_00116406_W", "names": {"Cameron Smith": ["Q27840142", "Q27840143", "Q28343824", "Q2934778", "Q44614454", "Q5026380"], "Francesco Molinari": ["Q1363419", "Q15791396", "Q55965506"], "Jason Day": ["Q24005613", "Q246992", "Q6162329", "Q6162331"], "Justin Thomas": ["Q15877245", "Q19666564", "Q22098319", "Q51084062", "Q52504008", "Q775036"], "Matt Jones": ["Q16231732", "Q1793338", "Q18688093", "Q19879351", "Q20744464", "Q3299493", "Q3299747", "Q59550247", "Q6380972", "Q6788860", "Q6788861", "Q6788863", "Q6788864", "Q6788866", "Q6788867", "Q6788868"], "Paul Casey": ["Q10557500", "Q683113", "Q7149753", "Q7149754"], "Steve Williams": ["Q1179916", "Q12573034", "Q1283673", "Q1364352", "Q14403908", "Q16244764", "Q21094780", "Q2347408", "Q3499167", "Q3506825", "Q4583412", "Q7614311", "Q7614312", "Q7614313", "Q7614314", "Q7614315", "Q7614316", "Q7614317", "Q7614318", "Q7614319"]}}, {"date": "2019-06-20", "url": "http://www.yeovilexpress.co.uk/news/national/17718197.chinese-president-arrives-in-north-korea-for-talks-with-kim-jong-un/", "content": "Chinese president arrives in North Korea for talks with <mark>Kim Jong Un</mark> By Press Association 2019 China North Korea Summit 0 comment Chinese President Xi Jinping has arrived for a two-day state visit to North Korea where he is expected to talk with leader <mark>Kim Jong Un</mark> about the stalled negotiations with Washington over Pyongyang's nuclear weapons. China's official Xinhua news agency reported that Mr Xi was accompanied by his wife, Peng Liyuan, and several Communist Party officials. He is the first Chinese president to visit North Korea in 14 years. The summit comes as both leaders are locked in separate disputes with the United States--Mr Xi over trade and Mr <mark>Kim</mark> over his nuclear weapons. There has been tension over the North's relentless push for nuclear weapons (Korean Central News Agency/Korea News Service via AP, File) A Xinhua commentary said China could play a unique and constructive role in breaking the cycle of mistrust between North Korea and the US so they can work out a roadmap to achieve denuclearisation. The US has demanded that North Korea abandon its nuclear weapons development before international sanctions are lifted. North Korea has sought a step-by-step approach in which a step toward its denuclearisation would be matched by a concession from the US, notably a relaxation of economic sanctions. China backs what it calls a \"suspension for suspension\" proposal. Xinhua said both sides \"need to have reasonable expectations and refrain from imposing unilateral and unrealistic demands\". Experts say Mr Xi will likely endorse North Korea's calls for an incremental disarmament process. Mr Trump last met Mr <mark>Kim</mark> in February (AP/Evan Vucci, File) Chinese and North Korea media have said Mr Xi would stay in Pyongyang for two days. His meeting with Mr <mark>Kim</mark> would be their fifth summit since Mr <mark>Kim</mark> entered nuclear diplomacy with the United States and South Korea early last year. In an essay published in both countries' official media before his trip, Mr Xi praised North Korea for moving in the \"right direction\" by politically resolving issues on the peninsula. He did not mention Mr <mark>Kim</mark>'s nuclear diplomacy with the US in the article, much of which focused on lauding the neighbours' seven-decade relationship. Mr Xi said his visit will \"strengthen strategic communication and exchange\" between the traditional, though sometimes strained, allies. The nations fought together in the 1950-53 Korean War against the United States, South Korea and their allies, but there has been friction in recent years, especially over the North's relentless push for nuclear weapons. 0 comment", "articleID": "2019062004_00024725_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}}, {"date": "2019-06-21", "url": "http://www.gamereactor.eu/overwatch/?sid=14e75d26e5e2c3016656ee2a7bc43a45", "content": "OVERWATCH REVIEW. Written by Rasmus Lund-Hansen on the 26th of May 2016 at 16 \"Overwatch is, without a doubt, the best multiplayer-shooter I've ever had my hands on .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 20th of June 2019 at 09 Mayhem are continuing to add to their team as the 2019 season progresses, including plenty of former Armament Esports talent. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 20th of June 2019 at 07 Overwatch League exhibition matches will be played, alongside music artists like Lil Yachty, Marshmello, and Snoop Dogg. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 10 The former Toronto Defiant player has a new home, and joins various other Korean players on the Chinese side. 0 ESPORTS. Written by Ben Lyons on the 18th of June 2019 at 10 The South Korean marks the latest addition to the ever-changing Overwatch League roster.", "articleID": "2019062102_00034742_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-06-21", "url": "https://www.insurancebusinessmag.com/au/news/breaking-news/major-names-converge-to-form-lloyds-of-london-advisory-committees-170567.aspx", "content": "Major names converge to form Lloyd's of London advisory committees by Terry Gangcuangco 21 Jun 2019 SHARE PERILS issues third loss estimate for Sydney hailstorms Major names converge to form Lloyd's of London advisory committees | Insurance Business Scandal-hit Lloyd's of London has assembled what looks like \"The Avengers' of insurance to serve as members of its new advisory committees. Created to support the (re) insurance market's transformative strategy, the global and London advisory committees are made up of the likes of Association of British Insurers chair Amanda Blanc, Willis Towers Watson chief executive <mark>John</mark> Haley, and Marsh & McLennan Companies (MMC) president and CEO <mark>Dan Glaser</mark>. Also part of the mix are top names such as Chartered Insurance Institute chief executive Sian Fisher, Aon CEO Greg Case, and Chubb chair and chief executive Evan Greenberg. The committees will be in charge of aiding the creation of\" The Future at Lloyd's, \"whose focus centres on simplifying market access, reducing the cost of doing business, building an inclusive and innovative culture, and offering better value for customers .\" Ensuring that Lloyd's is best placed to meet future challenges and opportunities is vital so that the UK remains a world-leading insurance market, \"commented Blanc, who is also chief executive of EMEA (Europe, the Middle East, and Africa) and global bank distribution at Zurich Insurance .\" I look forward to working with colleagues in the insurance industry in developing a strategy that helps Lloyd's to deliver best value for customers through cutting edge technology, with an inclusive culture that attracts the best talents. \"For London & International Insurance Brokers' Association (LIIBA) CEO Christopher Croft, the move\" further fulfils Lloyd's commitment to a collaborative, cross-market approach. \"Croft noted that he and LIIBA chairman Roy White--who also serves as chair of UK specialty for Marsh--are happy to be part of what he described as important work for the industry's future. Meanwhile London Market Group chair and Beazley chief executive <mark>Andrew Horton</mark> expressed strong support for the ideas set out in the Lloyd's prospectus. <mark>Horton</mark> said he is\" keen to continue working with colleagues across the market to help take these forward. \"Also looking forward to working in partnership with Lloyd's and on behalf of Lloyd's Market Association members is the trade body's CEO <mark>Sheila Cameron</mark>, who believes this will ensure that the work undertaken now will define the future success of the market. <mark>Cameron</mark> also pointed to the goal of delivering\" truly outstanding outcomes \"for the market's clientele .\" The Future at Lloyd's is a unique opportunity to transform the marketplace and cater to the growing and diverse needs of its customers, \"concurred MMC's <mark>Glaser</mark>.\" Lloyd's is an important partner for Marsh & McLennan and our clients, and I'm thrilled to help position it for the future. \"Case, meanwhile, cited Aon's commitment to anticipating client needs and collaborating with leading organisations to innovate on customers' behalf .\" With this new strategy, Lloyd's is accelerating its own evolution and charting a path forward for London to continue playing a significant role in the global insurance market, \"asserted the Aon boss .\" We're pleased to contribute to this important discussion. \"Lloyd's chief executive <mark>John Neal</mark> couldn't be more excited .\" This is an exciting time for us all as we drive forward the next stage in Lloyd's evolution, and I am delighted that we have the support of a number of global industry leaders, as well as the market associations representing some of our key stakeholders, \"he declared .\" Together with the feedback and insights we are gathering from our wide-ranging consultation, the advisory committees will play a critical role in providing guidance and advice as we develop and implement a blueprint for the future at Lloyd's. \"", "articleID": "2019062106_00161209_W", "names": {"Andrew Horton": ["Q4757340", "Q55991762"]}}]