[{"date": "2019-06-23", "url": "http://stamfordadvocate.com/entertainment/article/Raconteurs-Salute-Beatles-With-Butcher-14031715.php", "content": "https: //variety.com/2019/music/news/raconteurs-jack-white-beatles-butcher-cover-parody-1203251055/ Raconteurs Salute Beatles With \"Butcher Cover' Parody Hidden Within New LP Sleeve Chris Willman, provided by Published 3:43 pm EDT, Sunday, June 23, 2019 Photo: Chris Willman Photo: Chris Willman Image 1 of / 1 Caption Close Image 1 of 1 Photo: Chris Willman Raconteurs Salute Beatles With\" Butcher Cover' Parody Hidden Within New LP Sleeve 1 / 1 Back to Gallery Raconteurs fans who thought they heard a hint of the Beatles embedded within the group's new album, \"Help Us Stranger,\" may have been more intuitive than they realized. There's a more blatant homage to the Fab Four in the LP that was sent out to Third Man Vault subscribers, but it's not in the grooves--it's in the cardboard. The lenticular cover that is exclusive to the Vault edition is adhesively applied to the LP jacket, as is the case with all 3D album sleeves. Since <mark>Jack White</mark>'s Third Man label is known for its packaging mischief, fans quickly wondered if there might be some different image underneath, and risked destroying their limited-edition covers to find out. It was worth the \"damage\" : what lies beneath is a dead-on parody of the Beatles' famous \"butcher cover .\" The cover-within-the-cover spoofs the Beatles' scandalous and withdrawn \"Yesterday and Today\" jacket nearly to the last detail. Related stories Album Review: The Raconteurs' \"Help Us Stranger' Third Man Records' 5 Greatest Moments, by Co-Founder Ben Blackwell Record Store Day Unveils 2019 Lineup Don't go looking for this version of\" Help Us Stranger \"at your nearest record store. It was only sent to those who sign up for a $60 quarterly subscription to the Vault, with orders having closed weeks before the record landed on doorsteps this weekend. The only way to pick up a copy now is on the resale market. A standard edition arrived in stores Friday. On the secret cover, the Third Man logo sits in the corner where the Capitol branding sat in 1966, and the typography for the album title and track listing appears identical. But if you want to credit the band members with going to the effort of finding the same lab coats, turtlenecks and wristwatches worn by the Beatles, not to mention cutting identically shaped slabs of beef and dismembering the same vintage dolls in the same fashion, do note that they appear to have skipped those steps and merely Photoshopped their heads onto <mark>John</mark>, Paul, <mark>George</mark> and Ringo's bodies. Like the Beatles, the Raconteurs split singer/songwriter duties between two primary frontmen. So if you've always wondered whether <mark>White</mark> considers himself the <mark>Lennon</mark> or McCartney of the group, this pose may provide a clue: In this recreation, at least, he's Paul, and Brendan Benson is <mark>John</mark>. That positioning, though, may have more to do with <mark>White</mark> as the likely ringleader of this particular prank, just as McCartney was the motivating force behind the avant-garde\" Yesterday and Today \"art. CREDIT: Chris Willman Related Stories Album Review: The Raconteurs'\" Help Us Stranger' Third Man Records' 5 Greatest Moments, by Co-Founder Ben Blackwell Record Store Day Unveils 2019 Lineup In 1966, the Beatles commissioned photographer <mark>Robert Whitaker</mark> to shoot a surreal cover image for \"Yesterday and Today,\" an odds-and-ends collection of singles and British album tracks that hadn't previously made it onto an American LP. The photographer \"knew we liked black humor and sick jokes,\" Paul McCartney said in the \"Anthology\" series. \"And he said,\" I have an idea--stick these <mark>white</mark> lab coats on .' It didn't seem too offensive to us. It was just dolls and a lot of meat. I don't really know what he was trying to say, but it seemed a little more original than the things the rest of the people were getting us to do. \"<mark>John Lennon</mark> tied the cover concept (which originally involved a much more elaborate triptych) to current events, saying,\" It's as relevant as Vietnam. If the public can accept something as cruel as the war, they can accept this cover. \"(The other popularly accepted explanation--that the Beatles were mad at Capitol for\" butchering \"their albums in the U.S.--appears never to have occurred to the group .) <mark>George Harrison</mark> was less enthused by the photo shoot, calling it\" gross \"and\" stupid. \"Nonetheless, Capitol Records went along with it--for a minute. It was reported that 60,000 copies were sent to stores before the label issued a recall the day before the album was to have gone on sale. A few copies were sold by stores anyway, but most were shipped back, as requested. The vast majority were destroyed, but so as not to delay the release of\" Yesterday and Today \"much further, Capitol took some of the existing LPs and pasted new, more generic cover art over the offensive image. Thus was born a cottage industry for Beatles collectors, in which pristine versions of the original\" Yesterday and Today \"cover have sold for as much as six figures, and copies with the cheerful cover still slapped on or professionally peeled off are worth thousands. Of course, not everyone steamed off the application with as much care, and damaged butcher covers can be had for the bargain price of a mere few hundred dollars. The manufacturing of the Raconteurs' parody cover appears to have damage built in. If the cover art doesn't rip as the lenticular application is peeled off, the ink still appears to have been absorbed into the glue anyway, leaving a series of...<mark>white</mark> stripes. See our somewhat tortured\" unpeeling \"video, here: This isn't the first time Third Man has released a collectors' item in which you have to risk damaging one element in the process of getting to something else beneath. The label has released extremely limited-edition\" triple decker \"records in which a 7-inch 45 is encased within a 12-inch LP--including a re-release of a 1960s album by the group Public Nuisance that had embedded within it an otherwise unavailable single featuring the <mark>White</mark> Stripes covering a Public Nuisance tune .\" It's one of the many mind games we like to play with you here at Third Man Records, \"said <mark>White</mark> in a video showing off a Dead Weather triple decker release in 2010. Sign up for Variety's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram. Most Popular 1 Lawyer claims Jennifer Dulos created own\" Gone Girl' disappearance 2 Jennifer Dulos case: \"Daunting' trash search continues in Hartford 3 One Stamford firefighter injured in\" stubborn' blaze 4 Stamford PD to undocumented: Do not fear local police 5 I ate the same meal at both Texas Roadhouse and Outback Steakhouse, and one was the clear winner 6 Trump delays ICE raids 2 weeks; Blumenthal reacts 7 Stamford reacts: Suicide--The dark side of 8th-grade bullying View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019062320_00078101_W", "names": {"Robert Whitaker": ["Q3453369", "Q459366", "Q7351003", "Q7351005"]}}, {"date": "2019-06-24", "url": "https://newstodaynet.com/index.php/2019/06/24/vijay-sethupathi-speaks-about-sindhubaadh/", "content": "\"Sindhubaadh is about a man who goes in search of his abducted wife,\" says actor Vijay Sethupathi. Directed by S U <mark>Arun Kumar</mark>, the movie has Anjali as heroine. Vijay Sethupathi's son Surya plays a pivotal role. Music is by Yuvan Shankar Raja. Speaking to News Today, Vijay Sethupathi, says, \"<mark>Arun Kumar</mark> and I share an excellent rapport. We worked together in Pannayarum Padminiyum and Sethupathi before. It is our third collaboration. He is a wonderful filmmaker and I am confident that after Sindhubaadh, he will direct other actors .\" Excerpts from his interview Q: On working with <mark>Arun Kumar</mark> for third time...A: After we did two films, we became very close. <mark>Arun</mark> is like family to me. He had approached many actors in vain and finally I told him we would work together. Hopefully after Sindhubaadh, he will work with others. He is a phenomenal talent. Q: What is Sindhubaadh all about? A: It is about a beautiful emotional connect between husband and wife. It is about a man, who goes in search of his wife abducted by a gang. Q: Tell us about sharing screen with your son Surya? A: <mark>Arun</mark> was keen to cast Surya in the film after watching him in Naanum Rowdy Thaan. We coaxed him a lot and convinced him. He has done a wonderful job. Q: How was it to join hands with Yuvan Shankar Raja again? A: He is a wonderful music composer. There is a soul in his songs. One can easily connect oneself with his numbers. His background score in Sindhubaadh is a big plus. Q: Anjali is a spontaneous performer. Tell us about her role in the movie. A: I essay the role of a person who is short of hearing. Anjali's character has to speak loudly in the film. She is a person who speaks loudly in real life. Whole story revolves around her.", "articleID": "2019062403_00217223_W", "names": {"Arun Kumar": ["Q17068009", "Q18126997", "Q22006074", "Q29477899", "Q33087911", "Q46316835", "Q47120558", "Q4802105", "Q48877186", "Q56451611", "Q58422867", "Q59186893"]}}, {"date": "2019-06-24", "url": "http://www.whig.com/article/20190624/AP/306249815", "content": "The Latest: Woman regrets livestreaming as officer killed The Associated Press Posted: Jun. 24, 2019 7:00 am Updated: Jun. 24, 2019 1:58 pm ST. LOUIS (AP)--The Latest on the fatal shooting of a Missouri police officer (all times local): 1:50 p.m.. A store clerk who livestreamed the aftermath of a confrontation in which a Missouri police officer was killed says she regrets doing it. Officer Michael Langsdorf of the North County Police Cooperative was killed Sunday afternoon in the St. Louis suburb of Wellston after responding to a call about someone trying to pass a bad check at a small market. Authorities on Monday announced that 26-year-old Bonette Kymbrelle Meeks has been charged in the officer's death. Kashina Harper works at the market where the confrontation occurred and aired live Facebook video showing the dying officer bleeding. She told the St. Louis Post-Dispatch that she doesn't know why she did it. Harper says she only began taking video of the officer on the ground after she called for help, using the radio near his belt. She then livestreamed for more than two minutes. The Post-Dispatch briefly provided a link to the video on its website, STLtoday.com, before deleting the link. The newspaper said Monday that posting the link was \"bad news judgment,\" and apologized to readers for doing so. Harper says she is getting death threats because of the video. ___ 12:35 p.m.. A man who authorities say had a violent criminal history in North Carolina is charged with first-degree murder and other crimes in the shooting death of a Missouri police officer. Officer Michael Langsdorf of the North County Police Cooperative was killed Sunday afternoon in the St. Louis suburb of Wellston after responding to a call about someone trying to pass a bad check at a small market. Langsdorf was a 40-year-old father of two. Authorities on Monday announced that 26-year-old Bonette Kymbrelle Meeks has been charged in the officer's death. Meeks is jailed without bond. Assistant Police Chief <mark>Ron Martin</mark> says authorities believe that Meeks arrived in the St. Louis area from the Raleigh, North Carolina, area in January. <mark>Martin</mark> says Meeks has \"an extensive criminal record, and violent .\" ", "articleID": "2019062419_00171387_W", "names": {"Ron Martin": ["Q7364119", "Q7364120"]}}, {"date": "2019-06-25", "url": "http://www.wsbtv.com/news/national-news/ap-top-news/tributes-to-michael-jackson-flow-on-10th-death-anniversary/961240786", "content": "Tributes to <mark>Michael Jackson</mark> flow on 10th death anniversary Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Tributes to <mark>Michael Jackson</mark> flow on 10th death anniversary By: ANDREW DALTON, AP Entertainment Writer Updated: Jun 25, 2019 - 9:19 AM Loading...Tributes to <mark>Michael Jackson</mark> flow on 10th death anniversary LOS ANGELES (AP) - <mark>Michael Jackson</mark>'s estate paid tribute to his artistry and charity Tuesday as fans make final preparations for gatherings to celebrate his memory on the 10th anniversary of the King of Pop's death. \"Ten years ago today, the world lost a gifted artist and extraordinary humanitarian,\" the <mark>Jackson</mark> estate said in a statement to The Associated Press. \"A decade later, <mark>Michael Jackson</mark> is still with us, his influence embedded in dance, fashion, art and music of the moment. He is more important than ever .\" The estate has doggedly worked to protect and enhance <mark>Jackson</mark>'s legacy, a task made more challenging this year when two men accused <mark>Jackson</mark> of molesting them as boys in the HBO documentary \"Leaving Neverland,\" sparking new scrutiny of years-old claims that <mark>Jackson</mark> preyed on children. <mark>Jackson</mark> was acquitted of abuse allegations in 2005 and always vehemently denied such allegations, and the estate and his family angrily refuted the men's claims when the documentary was released in March, noting the men had at one time been among <mark>Jackson</mark>'s biggest defenders and one testified on his behalf at his criminal trial. The estate is using the anniversary of <mark>Jackson</mark>'s death to celebrate and accentuate <mark>Jackson</mark>'s vast humanitarian work. It called on fans to honor <mark>Jackson</mark>'s memory by engaging in charitable acts \"whether it's planting a tree, volunteering at a shelter, cleaning up a public space or helping someone who is lost find their way ....This is how we honor <mark>Michael</mark>,\" the statement read. Fans plan to gather at <mark>Jackson</mark>'s last home in the Holmby Hills neighborhood of Los Angeles, where the singer received a fatal dose of the anesthetic propofol on the afternoon of June 25, 2019 from his doctor. <mark>Jackson</mark> was declared dead at a hospital at age 50. They also plan a vigil at Forest Lawn Memorial Park in Glendale, California, where <mark>Jackson</mark> was laid to rest two months later. Some planned to gather around <mark>Jackson</mark>'s star on the Hollywood Walk of Fame. One group of fans planned a Hollywood rally Tuesday to declare his innocence of molestation allegations. Co-executors John Branca and John McClain, both major figures in <mark>Jackson</mark>'s career when he was alive, have taken his badly debt-ridden estate and grossed over $1.3 billion through various Jackson-related projects in the past decade, including the film \"This Is It,\" a pair of Cirque du Soleil shows and the sale of <mark>Jackson</mark> assets that included The Beatles catalog. <mark>Jackson</mark> left everything to his mother, his children and charity in his will. The singer's father, Joe, died last year and is buried in the same cemetery as his son, but <mark>Michael</mark>'s 89-year-old mother, five brothers, three sisters and three kids remain alive and well 10 years later. The death of <mark>Jackson</mark> was a massive cultural phenomenon, bringing an outpouring of public affection and revival of his songs and largely erasing the taint that remained after his criminal trial, despite his acquittal. It was one of the earliest instances of the mass mourning on social media that would soon become common, and a massive worldwide audience both on TV and online watched his July 27, 2009 public memorial that included touching tributes from family members including daughter Paris and performances from Stevie Wonder, Mariah Carey and Lionel Richie. ___ This story has been corrected to show only one, not both of the \"Leaving Neverland\" accusers testified on <mark>Jackson</mark>'s behalf at his criminal trial. ___ Follow AP Entertainment Writer Andrew Dalton on Twitter: https: //twitter.com/andyjamesdalton. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:", "articleID": "2019062513_00114914_W", "names": {"Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}}, {"date": "2019-06-25", "url": "https://www.irishexaminer.com/breakingnews/ireland/man-shouted-at-ex-wife-on-sideline-as-they-watched-son-play-football-court-hears-932987.html", "content": "Man shouted at ex-wife on sideline as they watched son play football, court hears By Liam Heylin Tuesday, June 25, 2019 - 09:04 PM A woman was put in fear when her ex-husband screamed at her to let their young son go to another soccer club after his team had lost yet again. The 40-year-old man pleaded guilty at an in-camera sitting of Cork District Court to breaching a safety order by putting his wife in fear on the sideline of a pitch after a match. The woman told Judge Con O’Leary that she and the defendant were separated for years and were, at this stage, divorced. \"I kept as far away from him as possible,\" the woman testified at the sentencing hearing. \"I keep out of his way. It is an ongoing fear I have with him. These issues have to stop .\" Judge O’Leary wanted to know what had triggered the outburst by her husband on this occasion. \"He wants the child to change soccer clubs,\" she said in relation to their primary school-age son. Inspector <mark>Seán McCarthy</mark> said the defendant had two previous convictions for engaging in threatening behaviour and three convictions for breaching domestic orders by putting his wife in fear. Judge O’Leary asked: \"What does he expect if he breaches an order for the fourth time? What is wrong with him?\" Donal Daly, solicitor, said: \"The young fella was playing with this club. They had lost again. He was anxious his son would play with another club. He thought he would be less upset if he was on a team that was winning .\" Mr Daly said the defendant did not verbally abuse his wife. He said that the defendant did ask her: \"Why the hell don't you leave the young fella join the other club?\" Judge Con O’Leary said following submissions from Mr Daly that he would put the defendant on a 12-month probation bond. READ MORE", "articleID": "2019062609_00029828_W", "names": {"Seán Mccarthy": ["Q7459558", "Q7459560"]}}, {"date": "2019-06-26", "url": "http://www.winsfordguardian.co.uk/sport/national/17731142.john-mcenroe-cautious-over-andy-murray-singles-return/", "content": "<mark>John McEnroe</mark> cautious over <mark>Andy Murray</mark> singles return By Press Association 2019 <mark>Andy Murray</mark>, right, and Feliciano Lopez won the doubles title at Queen's Club 0 comment <mark>John McEnroe</mark> remains cautious about <mark>Andy Murray</mark>'s hopes of a successful singles comeback. The former world number one made a brilliant return to the match court at Queen's Club last week following a second hip operation in January, winning the doubles title with Feliciano Lopez. <mark>Murray</mark> has also restricted himself to doubles at Wimbledon but spoke about the possibility of a singles return as early as the US Open at the end of August. <mark>John McEnroe</mark>, left, is unsure about <mark>Murray</mark>'s singles prospects (Toby Melville/POOL Wire) <mark>McEnroe</mark> is thrilled to see <mark>Murray</mark> back but is not reading too much into his doubles achievements. Speaking on behalf of espn. co. uk, the American said: \"Doubles is obviously a completely different animal than singles. Best of five (sets) is totally different than best of three .\" But it was nice to see him eager and into it and looking like he was relatively healthy. You can't really determine it until he starts playing singles matches and how the body reacts if you're on a hard court, for example, as opposed to grass. \"It looked very promising, which is great, and I think everyone wants him to be able to come back and then be able to retire on his own terms .\" <mark>Murray</mark> has not yet put himself through the physical rigours of singles (Steven Paston/PA) In <mark>Murray</mark>'s absence from singles, British hopes of a title challenger rest with Johanna Konta following her surprise run to the French Open semi-finals. American great Chris Evert declared herself speechless at Konta's performance in her quarter-final victory over Sloane Stephens, but the British number one was ultimately disappointing in a semi-final loss to Marketa Vondrousova where her old problems with nerves resurfaced. \"I was calling a match at the French, and she could have won the tournament the way she played, and then I see her play a match where she could have lost to almost anybody,\" said Evert. \"I think she's still a work in progress with the mental side of the game, but I think she's working really hard at it. Just the way she's wired, she has to work a little bit more on taking the emotion out of the game and just being fully focused .\" Johanna Konta struggled to hold herself together mentally in her French Open semi-final (Richard Sellers/PA) In the women's tournament, a lot of focus will again be on the form of Serena Williams as she continues her pursuit of Margaret Court's all-time record of 24 grand slam singles titles. The American reached the finals of Wimbledon and the US Open last year but this season has been disappointing, with the 37-year-old hampered by a knee problem and desperately short of matches. Williams did not follow through with her suggestion that she might play a warm-up tournament and arrives at the All England Club having completed just six matches since January. Evert feels Williams made a mistake not playing in Birmingham or Eastbourne, saying: \"I think definitely she should have done, just so she can gauge where she is on the grass and what she needs to work on. The flawless service motion is back. The eye of the tiger is back. The Dynamic Duo is back. @ serenawilliams is back. #Wimbledon prep underway. pic.twitter.com/WYoI6hXBmJ--Mouratoglou Tennis Academy?? (@ MouratoglouAcad) June 20, 2019\" Maybe she doesn't need to be 100 per cent, but she certainly needs to be 80, 90 per cent to really have a chance. \"The one difference that I see in Serena is since she's come back, she's been one or two steps slower than normal. I think that's a little bit of fitness. I think it's a little bit of match play. I think it's a little bit of confidence .\" But it's hard for me to bet against Serena. I would have said in January, if there was any grand slam she was going to win, it would probably be Wimbledon, and I just think with her game, she just loves hitting the ball. She just loves that power. And, if her serve is on, she's going to be tough to beat. \"?? Aorangi?? @ serenawilliams #Wimbledon pic.twitter.com/5TOmLh0L9b--Wimbledon (@ Wimbledon) June 26, 2019 <mark>McEnroe</mark> feels the pressure of time will be playing on the mind of Williams, who turns 38 in September .\" As you get older, at least for me, I felt there was more pressure because you realise that your window is closing and you don't know how much longer you're going to be doing it, \"he said .\" I don't know what she's thinking. But I'm thinking she can't be thinking, \"I'm going to be playing much more than a year or two' .\" 0 comment", "articleID": "2019062611_00088748_W", "names": {"Andy Murray": ["Q10125", "Q526811"], "John Mcenroe": ["Q16474", "Q37772659"]}}, {"date": "2019-06-26", "url": "http://www.theargus.co.uk/news/national/17731985.scottish-conservative-leader-backs-jeremy-hunt-to-be-next-pm/", "content": "Scottish Conservative leader backs <mark>Jeremy Hunt</mark> to be next PM By Press Association 2019 Ruth Davidson 0 comment Ruth Davidson has announced she is backing <mark>Jeremy Hunt</mark> in the Tory leadership contest. The Scottish Conservative leader tweeted: \"Any Conservative leadership candidate must put the Union first. <mark>Jeremy</mark> has done so and will get my vote .\" She referenced a news article in her tweet in which Mr <mark>Hunt</mark> said preserving the union is more important than ensuring Brexit goes ahead. <mark>Jeremy Hunt</mark> visited Aberdeenshire at the weekend and pledged his support to the union (PA) Mr <mark>Hunt</mark> made the comments in a visit to the north east of Scotland on Sunday, in response to a YouGov poll suggesting a majority of Conservative members want Brexit even if it means Scotland gaining independence. Asked if he would choose Brexit or the union, the Foreign Secretary said: \"The union every time .\" Mr <mark>Hunt</mark> is Ms Davidson's third pick for the next prime minister, after her first two choices were knocked out of the contest. She initially backed Home Secretary Sajid Javid, who exited the contest after the third round of voting among Tory MPs, and she then switched to Environment Secretary Michael Gove, who was eliminated in the final parliamentary ballot. 0 comment", "articleID": "2019062615_00159068_W", "names": {"Jeremy Hunt": ["Q333533", "Q929730"]}}, {"date": "2019-06-28", "url": "https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-icc-cricket-world-cup-2019-indian-pacers-mastering-the-art-of-asphyxiating-and-striking-when-it-matters-6895301.html", "content": "News India vs West Indies, ICC Cricket World Cup 2019: Indian pacers mastering the art of asphyxiating and striking when it matters In this World Cup, the Indian pacers have played a vital role. They have set the tone, suffocated the batsmen into frustration, kept striking when it mattered the most, at crucial stages and then delivered the knockout blow as well. Jigar Mehta, Jun 28, 2019 07:44:33 IST \"The last two games, things haven't gone the way that we thought. But we've found ways of winning .\" That's what a champion team does, isn't it? Even if you are under the pump with things not going your way, you find ways to win. The Australian teams of the yore mastered it when they were under pressure, even if rarely. That's what this current Indian side is doing at the 2019 World Cup. And that's the crucial fact Virat Kohli pointed out at the presentation ceremony after India's thumping win over West Indies. There have been times the Indian batsmen haven't really set the stage on fire, and doubts have crept into the minds as to whether they can defend it. But they have found a way. This is where the pacers have played a vital role, in helping Kohli find that way. They have set the tone, suffocated the batsmen into frustration, kept striking when it mattered the most, and then delivered the knockout blow as well. India's Mohammed Shami acknowledges the applause from the crowd after taking two wickets against West Indies. AP In this World Cup, the Indian pacers have had the best average--20.62, best economy rate--4.70 and best strike-rate--26.3, so far. Talk about bossing it. Against West Indies at Old Trafford, the lethality of Indian pacers was on full display. After opting to bat, India posted 268 runs. Kemar Roach, who finished with impressive figures of 3/28, thought it was a par score and \"we stand a chance .\" Many others thought that West Indies could chase it down. They had the Universe Boss Chris Gayle opening the batting and a supply line of attacking batsmen to come. The key was to build pressure from the start. You know that once you frustrate Chris Gayle, he will give you a chance. Jasprit Bumrah and Mohammed Shami did just that with accuracy and variations. They suffocated Gayle with tight lines and lengths. Bumrah played the holding role and bowled in that corridor or uncertainty while Shami varied his lengths to stay unpredictable and generated movement off the track. The two pacers aced the Powerplay and set the tone. West Indies were 29/2 in the first 10 overs, the lowest Powerplay score by any team in this World Cup. This was a team that had averaged 5.4 runs an over in the Powerplays prior to this. Gayle left alone five deliveries in the first over of the innings bowled by Shami. The one that touched the bat was a kiss off the inside edge, flying tantalisingly wide of the stumps and into the fine leg fence. In the next over, from Bumrah, he left alone four balls and a survived a close LBW shout. Shami beat the other opener Sunil Ambris' inside edge in the next over. Gayle was beaten in Bumrah's following over. The pressure was building. Shami again beat Gayle with a snorter that flew past the outside edge. West Indies had played out 21 dots from 28 balls now. The Universe Boss had had enough of it. He's not used to being cornered. He's used to bossing. So he clears his front leg the next ball and attempts the bludgeoning glory shot. Shami bangs it in short and into his body, and cramps Gayle for room. The glory shot lands straight into the hands of mid-on. The plan has worked. More dot balls follow, an edge falls short of the second slip. Shami is bowling beautifully. And then again, that variation of length does the trick. Shami delivers three short of good length deliveries in a row to Shai Hope and then dangles the carrot with a full one, sucking him into the drive and bringing it back in to disturb his furniture. The pacers bowled 41 dot balls in the first 10 overs. The pressure was built and so did the frustration, and West Indies could never really escape from this tangle, much like the other teams. A partnership started to build between Ambris and Nicholas Pooran but Pandya cut it short. The wrist-spinners then feasted on that frustration. Carlos Brathwaite showed he could change games single-handedly, against New Zealand. He arrives at the crease. Bumrah is called upon. He has figures of 5-0-9-0. He sends back Brathwaite first ball and then Fabian Allen. A double wicket maiden. West Indies are paralysed. 107/7. Shami returns to perform the wrap-up job with wickets of Shimron Hetmyer and Oshane Thomas. India have handed West Indies their third-biggest defeat. Shami finishes with figures of 6.2-0-16-4 and Bumrah with 6-1-9-2. The pacers together have bowled 70 dots in 17.2 overs, roughly 4 dots per over and taken seven of the 10 wickets. Against Afghanistan, on a slow Rose Bowl track, the Indian pacers were the difference between the two sides. While the Afghanistan pacers were targeted (16-1-105-3) with their spin applying the choke, Indian pacers offered no release and finished with figures of 29.5-3-130-8 at an economy rate of 4.41 compared to Afghanistan's 6.56. The package also included 9 brilliant yorkers off Bumrah's last 12 deliveries and a Shami hat-trick to seal a close game. It has all been about setting the tone and the platform. India's bowling figures in the Powerplays read: 34/2 (vs SA), 48/0 (vs Aus), 38/1 (vs Pak), 27/1 (vs Afg) and 29/1 (vs WI). Not a single match over five runs an over and just one over four an over. Overall, India have the second-best average--31 and best economy rate in the first 10 overs--3.72. They are the only team that have conceded less than 200 runs in the Powerplays combined. It all began with the spell of a lifetime by Bumrah against South Africa in Southampton and has carried on. It's not just the powerplay, the pacers have turned partnership breakers and the need of the hour at crucial junctures too. Against Australia, at The Oval, it was Bumrah's two wickets that of a set <mark>Steven Smith</mark> (69 off 70) and Marcus Stoinis in the 40th over that turned the tide. Bumrah applied the finishing touches. In Manchester, against Pakistan, Pandya maintained the stranglehold with wickets of the experienced <mark>Mohammad Hafeez</mark> and Shoaib Malik off consecutive deliveries. At the Rose Bowl, Bumrah sent back the set Rahmat Shah and Hashmatullah Shahidi in one over to break Afghanistan's spine when called upon to break the partnership that was beginning to threaten India's low total. It's not as if they have been receiving bowler-friendly pitches and conditions. They have conjured pace and movement on these non-pacer-friendly wickets with aggression and guile. Shami has stepped up in absence of the injured Bhuvneshwar and bowled with venom while Bumrah has stayed true to the No 1 bowler credentials with his control and yorkers at the death. In between, Pandya has operated like the bed bug to slowly and irritatingly suck opposition's blood with his clever slower ball variations including the effective bouncers. \"Over a period time it was a big challenge for him (Hardik Pandya) to bowl those 10 overs, and he realised that to be able to bowl those 10 overs I need to develop a certain armoury in my bowling,\" India's bowling coach Bharat Arun had explained in the build-up to the match. \"And that's what he's worked on. He's worked on his slow balls, his slow bounces also, and also he's worked on perfecting his bouncers. So all these, put together, have given him the confidence to go through those 10 overs .\" While Pandya's batting has gone one notch above, his bowling has sort of progressed to the \"improving' zone. For years India had craved for a pace attack that would leave the world envious. And an all-rounder who could genuinely create an impact and provide balance. They have found that package. Add Yuzvendra Chahal and Kuldeep Yadav's flight and guile to it and they have a proper world class bowling attack. That attack is in full flow right now. The fielding agile. Catching safe. Captaincy impressive. Now if only that batting unit clicks consistently! With stat inputs from Umang Pabari Updated Date: Jun 28, 2019 07:44:33 IST", "articleID": "2019062803_00106447_W", "names": {"Mohammad Hafeez": ["Q21662941", "Q25189338", "Q3535271"], "Steven Smith": ["Q1302695", "Q19794125", "Q3499273", "Q378949", "Q465812", "Q57733375", "Q57904651", "Q7613977", "Q7615281", "Q7615283", "Q925535"]}}]