[{"date": "2019-06-29", "url": "http://greenwichtime.com/news/crime/article/Congressman-Block-evidence-of-trysts-in-14060285.php", "content": "https: //www.greenwichtime.com/news/crime/article/Congressman-Block-evidence-of-trysts-in-14060285.php Congressman: Block evidence of trysts in corruption case Updated 9:42 pm EDT, Friday, June 28, 2019 FILE - In this Aug. 23, 2018, file photo, Republican U.S. Rep. <mark>Duncan Hunter</mark>, R-Calif ., leaves an arraignment hearing in San Diego after he and his wife, <mark>Margaret</mark>, pleaded not guilty to charges they illegally used his campaign account for personal expenses. Federal prosecutors say <mark>Hunter</mark> illegally used campaign funds to finance romantic flings with a series of women, spending thousands of dollars on meals, drinks and vacations. Allegations about the married Republican congressman's affairs were outlined in a government court filing late Monday, June 24, 2019, connected to charges he and his wife misspent more than $200,000 on trips and personal expenses. less FILE - In this Aug. 23, 2018, file photo, Republican U.S. Rep. <mark>Duncan Hunter</mark>, R-Calif ., leaves an arraignment hearing in San Diego after he and his wife, <mark>Margaret</mark>, pleaded not guilty to charges they illegally...more Photo: Gregory Bull, AP Photo: Gregory Bull, AP Image 1 of / 1 Caption Close Image 1 of 1 FILE - In this Aug. 23, 2018, file photo, Republican U.S. Rep. <mark>Duncan Hunter</mark>, R-Calif ., leaves an arraignment hearing in San Diego after he and his wife, <mark>Margaret</mark>, pleaded not guilty to charges they illegally used his campaign account for personal expenses. Federal prosecutors say <mark>Hunter</mark> illegally used campaign funds to finance romantic flings with a series of women, spending thousands of dollars on meals, drinks and vacations. Allegations about the married Republican congressman's affairs were outlined in a government court filing late Monday, June 24, 2019, connected to charges he and his wife misspent more than $200,000 on trips and personal expenses. less FILE - In this Aug. 23, 2018, file photo, Republican U.S. Rep. <mark>Duncan Hunter</mark>, R-Calif ., leaves an arraignment hearing in San Diego after he and his wife, <mark>Margaret</mark>, pleaded not guilty to charges they illegally...more Photo: Gregory Bull, AP Congressman: Block evidence of trysts in corruption case 1 / 1 Back to Gallery LOS ANGELES (AP)--Indicted California Rep. <mark>Duncan Hunter</mark> is asking a judge to reject an attempt by prosecutors to introduce evidence that the congressman used campaign funds to finance a string of extramarital relationships. In a motion Friday, the congressman's lawyers say prosecutors are seeking permission \"to focus the jury's attention on Mr. <mark>Hunter</mark>'s infidelity .\" They say evidence that some of <mark>Hunter</mark>'s relationships were romantic isn't necessary for a jury to evaluate the case. Allegations about the married Republican congressman's affairs were outlined in a government court filing Monday, connected to charges he and his wife illegally spent more than $250,000 in campaign funds. <mark>Margaret Hunter</mark> pleaded guilty this month to one corruption count. <mark>Duncan Hunter</mark> has said prosecutors have targeted him for political reasons. The trial is scheduled for September. Most Popular 1 Families in Dominican Republic tourist deaths have ordered independent autopsies 2' I floated inside': Man returns to site of 1973 UFO \"abduction' as it gets a historical marker 3 Elon Musk is worth about $22 billion and has never taken a paycheck from Tesla--here's how the notorious workaholic and father of 5 makes and spends his fortune 4 Ozzy and Sharon Osbourne Slam Trump Over Unauthorized Use of\" Crazy Train' 5 Latest UFO sightings in Connecticut 6 An Apollo astronaut explains how he nearly killed himself \"horsing around' on the moon in 1972 7 Stratford crash that caused 33 miles of delays on Merritt cleared View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019062901_00058676_W", "names": {"Duncan Hunter": ["Q527493", "Q540521"], "Margaret Hunter": ["Q21456080", "Q43390035", "Q57408454"]}}, {"date": "2019-06-29", "url": "http://www.wsbtv.com/news/national-news/ap-top-news/castro-orourke-both-hit-texas-capital-after-debate-dustup/962388469?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Castro, O'Rourke both hit Texas capital after debate dustup Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Castro, O'Rourke both hit Texas capital after debate dustup By: CLARICE SILBER and WILL WEISSERT, Associated Press Updated: Jun 28, 2019 - 9:20 PM Loading...Castro, O'Rourke both hit Texas capital after debate dustup AUSTIN, Texas (AP) - One Texan became a political sensation waging a longshot Senate campaign, then stormed into the presidential race with even more momentum, climbing in the polls, running up monster fundraising and dominating the national conversation. The other announced his 2020 bid earlier and to far less fanfare, then struggled for months to even stay relevant. Both Beto O'Rourke and Julián Castro were in Austin on Friday night staging dueling events within an hour - and a few blocks - of each other. But, suddenly, those gatherings unfolded as Castro is the Texas presidential candidate on the rise, at least partially at the expense of O'Rourke, whose early buzz has fallen away. Castro, a former Obama administration housing chief and mayor of San Antonio, has been buoyed by a well-received performance during Wednesday's first night of Democratic debates in Miami, when he railed on O'Rourke for not backing his idea of decriminalizing the act of crossing the U.S.-Mexico border illegally. O'Rourke, a former congressman from the U.S.-Mexico border city of El Paso who sees immigration as an issue of strength, responded that doing so might shield drug - and human-smugglers from punishment. Looking for a breakout debate moment to catapult him back among the race's leaders, O'Rourke instead saw Castro upstage him. The fallout from that exchange followed both back to Texas' capital. And, despite being longtime friends, the pair's paths didn't cross. Castro held a Texas Democratic Party fundraiser at one bar. At another, O'Rourke had a meet-and-greet with his supporters recalling the feel-good days of his Senate bid last year, when he nearly upset Republican Ted Cruz in the country's largest red state. \"To all of you, who made everything possible in 2018, starting with meetings like this one,\" O'Rourke told a large crowd that filled an outdoor patio. Spokesman <mark>Chris Evans</mark> said O'Rourke had an open day on his calendar before a previously planned weekend trip to Houston and decided to hit Austin. He said it had nothing to do with Castro being there: \"When scheduling a presidential campaign, we don't look through what 23 other Democratic candidates are doing .\" Anna Guerrero, 45, saw O'Rourke before heading to Castro's event, saying, \"I decided why not, let's come and see what I think of them up close and personal .\" Asked if she'd support O'Rourke, Guerrero said: \"I don't know right now, and immigration is my biggest concern, and I'm not sure he is where I want him to be for me to be comfortable voting for him in that area .\" <mark>Evans</mark> said he wouldn't comment until the final numbers are ready, but O'Rourke's campaign advisers are privately worried they'll fail to meet key targets ahead of the end-of-quarter deadline Sunday. Supporters were hoping for a bump after the debate, but O'Rourke failed to deliver a breakout moment. Russell Buyse, 54, attended O'Rourke's event and said O'Rourke could have been stronger during the debate and seemed a little bit nervous. \"His empathic way of connecting with voters is one of his great strengths,\" Buyse said, \"and that doesn't come across quite as well on a debate stage with nine other people on the podium .\" In a role reversal, Castro finds himself on a post-debate upswing. Although his campaign didn't disclose exact figures, Castro said Friday that nearly 16,000 people donated on Thursday alone, 71% of whom were new donors. \"I think he gave a great performance at the debate. Before that, he wasn't exactly on my radar,\" said 28-year-old Arturo Garza, who attended the Castro party fundraiser. \"I was hopeful, but after that, I was like,\" OK, he's definitely a solid contender that's willing to put himself out there .' \"Not everyone was convinced, though. Tiam Leyva, a 36-year-old wearing a black T-shirt emblazoned with\" Beto Days Are Coming, \"drove three-plus hours from Plano for O'Rourke's gathering. She said of Castro:\" He changed my mind in a negative way because last year I know he campaigned for Beto. \"She said the debate dustup\" kind of made me get turned off to him because he bullied his friend for gain. \"___ Weissert reported from Washington. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:", "articleID": "2019062901_00060604_W", "names": {"Chris Evans": ["Q17490263", "Q178348", "Q21538587", "Q23418578", "Q27918241", "Q2964709", "Q2964710", "Q303577", "Q466583", "Q5106513", "Q51990270", "Q5392352"]}}, {"date": "2019-06-29", "url": "http://tewkesburyadmag.co.uk/sport/national/17738907.murray-calls-for-doubles-shake-up-at-wimbledon/", "content": "<mark>Murray</mark> calls for doubles shake-up at Wimbledon By Press Association 2019 <mark>Andy Murray</mark> warming up to compete in the doubles at Wimbledon 0 comment <mark>Andy Murray</mark> would like to see matches at Wimbledon shortened to encourage more singles players to play doubles. The Scot is making his return to grand slam tennis purely in doubles as he builds up his fitness and stamina following a hip resurfacing operation in January. <mark>Murray</mark>'s presence will certainly mean a lot more focus than normal on the men's doubles this fortnight, where he is playing with Frenchman Pierre-Hugues Herbert and could meet brother Jamie and Neal Skupski in the third round. How many words will be written about this doubles partnership over the next week, and maybe more? <mark>Andy Murray</mark> and Pierre-Hugues Herbert practising together. pic.twitter.com/Ppn1d6hw9A--Eleanor Crooks (@ EleanorcrooksPA) June 28, 2019 Singles and doubles have become almost different sports in terms of the players who compete, with few of the leading singles players also committing themselves to doubles. It is especially hard at Wimbledon, with the doubles tournament, uniquely among the slams, also being played over best of five sets. <mark>Murray</mark> said: \"Beforehand you had a lot more of the top singles players that were playing the doubles. Like when (<mark>John</mark>) <mark>McEnroe</mark> was playing, around that time .\" A lot of the top doubles teams, they were pretty well known, like the Woodies (Todd Woodbridge and Mark Woodforde) and stuff. I grew up kind of watching quite a bit of doubles myself, too. <mark>John McEnroe</mark>, right, with <mark>Peter Fleming</mark> after winning the Wimbledon men's doubles title for the third time in 1983 (PA Archive) \"I think when the top singles players are involved in the doubles, it does draw a little bit more attention to it. That's something that I think will be a positive thing for tennis, if more guys were playing doubles .\" But here it's difficult because of the format, the best-of-five sets. For me, even though I'm playing doubles here, it's even a consideration if I'm going to play mixed, as well. I would never expect a top singles player to enter the doubles here because playing potentially 10 sets in one day is just too much. \"That's something that maybe would be worth looking at, to give more value to the doubles event, to get more of the top singles players playing, is to reduce the length of the matches a bit .\" It will be a different Wimbledon experience for <mark>Murray</mark> this year, with the former world number one having to wait until Wednesday at the earliest to get his campaign under way. <mark>Andy Murray</mark> insists he has not been watching very much tennis during his rehabilitation (Steven Paston/PA) And <mark>Murray</mark>, known as an obsessive follower of tennis, revealed he has mostly stayed away from the sport while he has been working his way back from surgery. \"I haven't really hardly watched any tennis in the last 12 months\" he said. \"Since the operation I had in January, I literally didn't watch anything hardly at all .\" When you're around the event, there's matches on the TV. I wouldn't sit from the first point of a match and watch a best-of-five-set match because it can be four hours of the day. I'm here to do stuff. I want to be with my family and things. I'll watch bits and pieces of it. \"<mark>Murray</mark> had a remarkably successful first outing as a doubles player at Queen's Club, winning the title last weekend with Feliciano Lopez, before a first-round loss at Eastbourne alongside Marcelo Melo. View this post on Instagram Dreams Do Come True???? #QueensTennis #FeverTreeChampionships A post shared by Fever-Tree Championships (@ fevertreechampionships) on Jun 23, 2019 at 11:56 am PDT He admitted his first practice with Herbert, who has won all four slam titles alongside countryman Nicolas Mahut, on Friday did not go particularly well and, although he would love to challenge for another Wimbledon title, he will not be putting too much pressure on himself. The Scot said:\" I think that's probably one of the things that I will try to make sure doesn't change over the next few years. I think a lot of that stuff kind of comes out from other people. I'm just happy to be playing tennis again really. \"I would like to do well when I get on the court. I play to win. I'm really competitive. But four or five weeks ago I didn't know if I'd even be playing over the grass. I shouldn't be expecting too much .\" 0 comment", "articleID": "2019062915_00118819_W", "names": {"Andy Murray": ["Q10125", "Q526811"], "John Mcenroe": ["Q16474", "Q37772659"], "Peter Fleming": ["Q21463755", "Q729789"]}}, {"date": "2019-06-30", "url": "http://www.wpxi.com/news/national-news/ap-top-news/rescued-hiker-in-california-used-sunwarmed-rocks-for-heat/962799058?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Rescued hiker in California used sun-warmed rocks for heat Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Rescued hiker in California used sun-warmed rocks for heat Updated: Jun 30, 2019 - 5:55 PM Loading...Rescued hiker in California used sun-warmed rocks for heat LOS ANGELES (AP) - A hiker who went missing in the mountains north of Los Angeles survived by wrapping himself with a jacket and towel and staying by sun-warmed rocks for heat, authorities said on Sunday. <mark>Janet Henderson</mark> of the Los Angeles County Sheriff's Department Search and Rescue told KCBS-TV that Eugene Jo, 73, stayed alive for a week by getting close at night to rocks that warmed by the daytime sun and drinking water from a creek. \"He got in close next to the hot rocks because it is very hot up there and those rocks do heat up and that's how he kept himself warm at night,\" <mark>Henderson</mark> said. Jo heard rescuers' voices on Saturday and yelled for help, she said. He was taken to the hospital and later released. Jo went hiking with a group to the 8,000-foot (2,438-meter) summit of Mount Waterman on June 22 when he became separated from them. More than 70 people were searching for him in the mountains Saturday, said Los Angeles County Sheriff's Sgt. <mark>Greg Taylor</mark>. Jo's daughter Grace told KCBS-TV in a statement that her father was home and resting and grew emotional when he learned how many people were out looking for him. \"We're still barely comprehending the extent of this miracle,\" she said. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:", "articleID": "2019063022_00121166_W", "names": {"Greg Taylor": ["Q16940539", "Q17011015", "Q24688832", "Q5606323", "Q5606325", "Q5606326"], "Janet Henderson": ["Q43392640", "Q43393947", "Q6153388"]}}, {"date": "2019-07-01", "url": "http://msn.com/en-au/entertainment/celebrity/why-prince-william-and-duchess-catherines-upcoming-trip-is-an-exciting-royal-first/ar-AADFoB7?li=AAgfYrC", "content": "© Provided by Bauer Media Pty Ltd In news that has delighted the masses, <mark>Kate Middleton</mark> and Prince William are set to jet off on another royal tour to Pakistan later this year - but the trip is all the more special for this unexpected reason. In news that has delighted royal fans in Asia, it has been confirmed Prince William and <mark>Kate Middleton</mark> will tour Pakistan later this year. Indeed the exciting news comes as a result of the UK's intention to strengthen ties with the South-Asian country - both of which share \"historical links\" according to the official press release from Kensington Palace. The trip, which was initially rumoured to be happening earlier in June, was confirmed on Sunday, with the press release explaining: \"Her Majesty The Queen visited Pakistan in 1961 and 1997, and The Prince of Wales and The Duchess of Cornwall visited in 2006 .\" The insight into the previous royal visits has thus revealed something that makes William and <mark>Kate</mark>'s trip ahead quite special - this will mark the first time a royal trip has taken place there in over a decade. While royal tours are big operations in terms of security, the reasoning for such a long period of time between royal visits could have been to do with the safety situation on the ground in Pakistan. However, it has been reported the situation in the country has stabilised recently due to crackdowns on insurgents. © Provided by Bauer Media Pty Ltd <mark>Kate</mark> and William will visit Pakistan later this year, a trip that marks a special royal milestone. What are the dates of William and <mark>Kate</mark>'s tour of Pakistan? While the Palace is yet to confirm the exact dates of the royal tour, it is understood it will occur later this year in the British autumn, according to the press release. In June, it was also reported that the tour would occur within weeks of Prince Harry and Duchess Meghan's visit to South Africa, which is touted to take place in October. © Provided by Bauer Media Pty Ltd Meghan and Harry will also be going on their own royal tour to Africa around the same time. Why are <mark>Kate</mark> and William going to Pakistan? <mark>Kate</mark> and William's tour comes after the Duke of Cambridge's five-day visit to Israel, Jordan and other occupied Palestinian territories in 2018. While the British Foreign Office has urged visitors to be careful with their travel in light of terrorist attacks and risk of kidnapping, there are signs that the threat is easing, and an opportunity for Britain to make the most of strengthening their ties with the country. Indeed royal visits pose a fantastic opportunity for countries to strengthen their ties as international press and global attention turns towards the country in question as the royals partake in a number of formal events, many of which highlight the varying cultures there. Further affirming their intention to better connect with the country, British Airways has just resumed their direct flights to Islamabad, which is the capital of Pakistan. © Provided by Bauer Media Pty Ltd <mark>Kate</mark> and William are no strangers to a royal tour. In the official press release, the High Commissioner for Pakistan, Mohammad Nafees Zakaria shared the positive anticipation ahead of the tour: \"The Government and the people of Pakistan warmly welcome the announcement of the Royal Visit by Their Royal Highnesses The Duke and Duchess of Cambridge to Pakistan this year .\" \"The upcoming Royal Visit is a reflection of the importance the United Kingdom attaches to its relations with Pakistan,\" he added. \"The two countries enjoy historical links which both sides wish to strengthen further .\" © Provided by Bauer Media Pty Ltd Princess Diana paid several visits to Pakistan over the years. What will <mark>Kate</mark> and William do in Pakistan? While details around the couple's engagements are yet to be confirmed, we can definitely speculate on something that is likely to keep royal fans riveted throughout the whole duration of the tour. Indeed the ever-stylish <mark>Kate Middleton</mark> is no doubt set to wear some stunning outfits from her enviable wardrobe. As part of the country's culture, we can expect <mark>Kate</mark> will dress modestly, keeping her shoulders and legs covered. If the pair visit any mosques or certain holy places, she will also be required to cover her head. The tour will also echo a similar trip undertaken by Princess Diana in 1997, which took place in 1997. Indeed the people's princess made the trip over to Pakistan several times through her charity work - so it's even more special to see her son and his wife follow in her footsteps. Read more", "articleID": "2019070104_00012691_W", "names": {"Kate Middleton": ["Q10479", "Q17506155"]}}, {"date": "2019-07-01", "url": "http://kidderminstershuttle.co.uk/news/national/17740075.eu-leaders-pull-all-nighter-at-summit-on-key-posts/", "content": "EU leaders pull all-nighter at summit on key posts By Press Association 2019 Journalists rest during a late-night negotiating session at an EU summit in Brussels 0 comment European Union leaders have pulled an all-nighter at a summit but failed to agree on the list of candidates for the bloc's key posts, with the marathon talks entering a second day. The leaders trickled in for bilateral contacts throughout Sunday before officially convening at around 8pm. They have been locked in talks ever since amid deep divisions over how best to balance political, geographic and gender considerations among the 28 member nations. With the selection process bogged down for the second EU summit meeting in a row, the leaders are still considering Dutch socialist Frans Timmermans to replace Christian Democrat Jean-Claude Juncker as president of the EU's powerful executive arm, the European Commission. European Commission president Jean-Claude Juncker sits prior to a round table meeting at the EU summit in Brussels (Geoffroy Van Der Hasselt, Pool Photo via AP) \"Let's see,\" Italian Prime Minister <mark>Giuseppe Conte</mark> said of Mr Timmermans's chances when briefly descending from the meeting room at EU headquarters at around breakfast time. The Timmermans option has deeply divided the European People's Party (EPP) as it would surrender the key post to the rival Socialists and Democrats (S & D) bloc despite the EPP remaining the biggest group in the EU following last month's election. Bulgarian Prime Minister Boyko Borissov, an EPP stalwart, posted a video on his Facebook account of a discussion with Mr Timmermans in which Mr Borissov said the Dutchman should get the commission job while the less coveted parliament presidency should go to EPP candidate <mark>Manfred Weber</mark>. But Irish Prime Minister Leo Varadkar insisted that the \"vast majority of the EPP prime ministers don't believe we should give up the presidency of the commission quite so easily, without a fight\". A journalist rests during the late-night negotiating session in Brussels (Virginia Mayo/AP) After negotiations started early on Sunday, summit host and EU Council president Donald Tusk had more than 30 bilateral meetings in his attempt to find a breakthrough. The appointments must take into account political affiliation, geography--balancing east and west, north and south--population size and gender. The leaders of EU institutions are supposed to impartially represent the interests of all member nations globally and in Brussels. Some leaders discussed the roster of upcoming vacancies, which also include the EU's top diplomat, the president of the European Parliament and the chief of the European Central Bank (ECB), on the sidelines of the Group of 20 summit in Japan that concluded on Saturday. Mr Tusk wants nominations to be wrapped up soon, seeking to prevent further erosion of public confidence in the EU amid Brexit uncertainty and intra-bloc divisions over managing migration. European Council president Donald Tusk, left, with Renew Europe party member Guy Verhofstadt (Virginia Mayo/AP) There was hope at the previous summit on June 20-21 that more time would clarify who should replace Mr Juncker. German Chancellor Angela Merkel backs Mr <mark>Weber</mark>, the German conservative whose centre-right EPP is the largest political group in the European Parliament but lost seats in the EU elections in May. French President Emmanuel Macron has suggested Mr <mark>Weber</mark> lacks the political and government experience for such a high-profile role. Mr <mark>Weber</mark> could still be considered for the head of the European Parliament, which is the EU's only elected institution. Mrs Merkel said there was still a good possibility for Mr <mark>Weber</mark> and Mr Timmermans, the top centre-left candidate from the S & D group, to be among the winners of the top positions. German Chancellor Angela Merkel arrives for the EU summit (Olivier Matthys/AP) Other leaders from the same political family disagreed. The EPP and the S & D are the two biggest political groups in the EU, but both lost seats in May's polls, where far-right and populist parties, pro-business liberals and the Greens made gains. EU leaders want to fill the positions soon because the European Parliament is set to pick a new president next Wednesday. Under EU rules, member countries choose who will run the commission, replacing Mr Juncker. The parliament must endorse that choice. But the assembly has insisted that only the lead candidates from parties that ran in last month's elections should be eligible for the post. \"The lead candidates is not the only criteria,\" said Mr <mark>Conte</mark>. The commission proposes and enforces EU laws on policies ranging from the massive single market to agriculture spending, and from competition issues to immigration. European Commission president Jean-Claude Juncker (Francois Lenoir/AP) The job responsibilities are huge: Mr Tusk and Mr Juncker negotiate with the likes of US President Donald Trump and Chinese leader Xi Jinping, while the head of the ECB can set monetary policy for the 19 nations that use the shared euro currency. The outgoing group of EU officials was lopsidedly Italian, with Antonio Tajani holding the parliament top post, Mario Draghi head of the ECB and Federica Mogherini the EU foreign policy chief. Top candidates include current prime ministers Stefan Lofven of Sweden and Andrej Plenkovic of Croatia. Others mentioned include Brexit negotiator Michel Barnier of France, Greens leader Ska Keller of Germany, Lithuanian President Dalia Grybauskaite and Margrethe Vestager, the EU's competition chief since 2014. 0 comment", "articleID": "2019070108_00149872_W", "names": {"Giuseppe Conte": ["Q3770348", "Q46756395", "Q53844829"]}}]