[{"articleID": "2020013112_00142751_W", "names": {"Daniel Salmon": ["Q47471836", "Q9201431"]}, "date": "2020-01-31", "url": "http://www.msn.com/en-us/news/other/amazon-value-set-to-top-dollar1-trillion-and-wall-street-says-more-to-come/ar-BBZvXMv?srcref=rss", "content": "Amazon.com Inc. was on course to exceed $1 trillion in market value again after results beat expectations, with analysts applauding the popularity of the e-commerce giant's one-day shipping initiative and the performance of its cloud-computing business. © Pablo Blazquez Dominguez--Getty Images undefined The shares surged 8.7% in U.S. pre-market trading after reporting what Robert W. Baird & Co. analysts called an \"impressive quarter from top to bottom.\" Goldman Sachs analysts pointed out that it was the first time the company beat the upper end of its revenue guidance since the first quarter of 2018. The results sparked a rush on Wall Street to raise price targets for the stock, with RBC Capital Markets analysts giving it a new Street-high target of $2,700, implying 44% upside from Thursday's close. In surpassing the $1 trillion mark--something it also did briefly back in 2018--Amazon will be joining Apple Inc., Microsoft Corp. and Google-parent Alphabet Inc. on an exclusive list of U.S. tech giants to have reached that valuation. © Bloomberg Amazon on course to reach $1 trillion market cap after results Here's a roundup of what analysts had to say. Morgan Stanley, Brian Nowak (Overweight, price target raised to $2,400 from $2,200) Results and guidance showcase how one-day delivery is driving faster-than-expected share gains, while an even more bullish point is that one-day is also driving faster Fulfillment by Amazon (FBA) adoption. FBA is another incremental revenue stream to fuel profits and ability to invest to attack new markets such as grocery, logistics and healthcare. Meanwhile, investments in the Amazon Web Services (AWS) salesforce are driving better enterprise customer adoption, \"particularly bullish as AWS continues to attack the $500 billion-plus addressable market for public cloud.\" BMO, <mark>Daniel Salmon</mark> (Outperform, price target raised to $2,450 from $2,150) One-day shipping costs were lower than expected while volume acceleration remained robust and downside margin risk is now considerably lower. AWS revenue beat BMO's estimate, and BMO said that unit can continue to grow meaningfully despite competition as the overall market expands. Investors should also feel confident that the investment phase has peaked. Baird, Colin Sebastian (Outperform, price target raised to $2,275 from $2,080) Amid investor concern around infrastructure investments, AWS competition and a shorter holiday shopping window, the results showcased the benefits of Amazon's increasingly diversified business model and one-day roll-out. Broader adoption of fulfillment service, stable AWS trends, and ad revenue growth were key highlights, although a softer margin outlook likely reflects ongoing logistics investments. Goldman Sachs, Heath Terry (Buy, price target raised to $2,600 from $2,200) Notes AWS operating margins saw first quarter-on-quarter expansion since the third quarter of 2018. With concern about deceleration in AWS business allayed, at least for the moment, revenue growth driven by investments in fulfillment and infrastructure is likely to spur significant share-price outperformance. RBC Capital Markets, Mark Mahaney Outperform, price target raised to $2,700 from $2,500 One-day delivery is proving out, Prime memberships are growing rapidly and international retail is poised to accelerate thanks to multi-year investments. Raises 2020 operating income estimate 4% amid fundamentals that were \"reasonably solid,\" though notes that organic revenue growth decelerated amid tough comparables .--With assistance from Lisa Pham and William Canny. Read More"}, {"articleID": "2012092116_00094927_W", "names": {"Richard Parry": ["Q16224589", "Q21466849", "Q2406622", "Q43381191"]}, "date": "2012-09-21", "url": "http://thametoday.co.uk/news/national/uk-soldier-dies-in-afghanistan-1-4291960", "content": "a soldier from the royal electrical and mechanical engineers has died in afghanistan, the ministry of defence said. the serviceman's death at camp bastion in helmand province is not thought to be the result of hostile action, although an investigation into the circumstances is continuing. the member of 104 force support battalion was attached to 4 close support battalion, royal electrical and mechanical engineers (reme). his next of kin have been informed. lieutenant colonel <mark>richard parry</mark>, spokesman for joint force support (afghanistan), said: \"it is with deep sadness that i must report the death of a soldier from 4 close support battalion, reme, at camp bastion, helmand province.\" the condolences of all personnel serving with joint force support (afghanistan) are with the soldier's family and friends at this extremely difficult time. \"the death brings the total number of members of uk forces to have died since operations in afghanistan began in october 2001 to 431. drug bust update (5pm): three more men charged and five arrested in town's biggest ever drug bust temperature: 3 c to 16 c wind speed: 9 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by clicking here. if you remain dissatisfied with the response provided then you can contact the pcc by clicking here. thame gazette provides news, events and sport features from the thame area. for the best up to date information relating to thame and the surrounding areas visit us at thame gazette regularly or bookmark this page. can i opt out of receiving cookies? cookies are small data files which are sent to your browser (internet explorer, firefox, chrome etc) from a website you visit. they are stored on your electronic device. this is a type of cookie which is collected by adobe flash media player (it is also called a local shared object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. however, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. the types of cookies we, our ad network and technology partners use are listed below: a tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. to opt out of this type of targeting you can visit the\" your online choices' website by clicking here. google ads? our sites contain advertising from google; these use cookies to ensure you get adverts relevant to you. you can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"your online choices' website by clicking here. webtrends / google analytics? this is used to help us identify unique visitors to our websites. this data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. dart for publishers? this comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. this information is not used by us for any other type of audience recording or monitoring. comscore? comscore monitor and externally verify our site traffic data for use within the advertising industry. any data collected is anonymous statistical data and cannot be traced back to an individual. local targeting? our classified websites (photos, motors, jobs and property today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. these cookies store no personally identifiable information. grapeshot? we use grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. grapeshot stores the categories of story you have been exposed to. their privacy policy and opt out option can be accessed here. subscriptions online? our partner for newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. add this? add this provides the social networking widget found in many of our pages. this widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend. temperature: 6 c to 15 c wind speed: 10 mph temperature: 10 c to 13 c wind speed: 20 mph temperature: 8 c to 14 c wind speed: 21 mph temperature: 9 c to 15 c wind speed: 17 mph"}, {"articleID": "2011102713_00047301_W", "names": {"Michael Lohan": ["Q4267518", "Q54566123"], "Walter Heinrich": ["Q14947282", "Q54556191"]}, "date": "2011-10-27", "url": "http://entertainment.msn.com/news/article.aspx?news=678465&affid=100055", "content": "lindsay lohan's father arrested again in tampa oct. 27, 2011, 8:02 am est tampa, fla. (ap)--the estranged father of actress lindsay lohan was back in police custody thursday, hours after being released from a tampa jail on domestic violence charges. tampa police responded to a 911 call from <mark>michael lohan</mark>'s on-and-off girlfriend early thursday. kate major told police <mark>lohan</mark>, 51, made a harassing phone call to her shortly after being released from jail wednesday afternoon. <mark>lohan</mark> called again while police were at major's condo. major, 28, put the call on speaker so police could listen. after hearing what <mark>lohan</mark> said, the police department notified the hillsborough county state attorney's office of a violation of judge <mark>walter heinrich</mark>'s pre-trial release orders that he stay away from major and an arrest order was authorized. police went to the tahitian inn in tampa, where <mark>lohan</mark> was reportedly staying. according to a news release from police, <mark>lohan</mark> spotted the officers and jumped off a third-floor balcony in an attempt to escape. <mark>lohan</mark> was arrested after a short pursuit on foot. he was taken into police custody and taken to the hillsborough county jail. there, deputies suspected he may have broken his foot when he jumped off the balcony, so he was taken to tampa general hospital for evaluation. authorities said he will be returned to the jail once he's been cleared by doctors. <mark>lohan</mark> was arrested tuesday on domestic violence charges involving major, a former reporter for the star tabloid. police say he grabbed her arms and pushed her down multiple times during a daylong argument. when <mark>lohan</mark> was released from jail wednesday, he said he \"didn't do anything\" and the charges were major's way of making money. the st. petersburg times (reported that <mark>lohan</mark> claimed major set him up to be overheard by police thursday. \"she needs help, she calls me, and i'm a sucker so i call her back. i'm an idiot,\" <mark>lohan</mark> said as he was being put into the back of a police cruiser. in july, a misdemeanor domestic violence charge against <mark>lohan</mark> stemming from a fight with major was dismissed in los angeles after she failed to show up for the trial. <mark>lohan</mark>'s attorney said major declined to cooperate to avoid a court spectacle. <mark>lohan</mark> has a history of arrests in new york over allegations of harassment from ex-girlfriends. meanwhile, his daughter lindsay lohan could also return to jail in california after a judge last week ruled she violated probation involving a community service assignment. a nov. 2 court date was set to decide whether lindsay lohan should be jailed. the 25-year-old actress was given probation for a 2007 drunken driving case and a misdemeanor theft case this year."}, {"articleID": "2015083014_00057202_W", "names": {"Stephen Harper": ["Q206", "Q7609425"], "David Johnston": ["Q16730377", "Q21066672", "Q28102004", "Q3018164", "Q41564", "Q43132128", "Q43394930", "Q5235710", "Q5235711", "Q5235712", "Q5235713", "Q5235714", "Q58338670"]}, "date": "2015-08-30", "url": "http://www.winnipegsun.com/2015/08/28/letters-august-30-2015", "content": "Winnipeg SunFriday, August 28, 2015 03:22 PM CDT | Updated: Sunday, August 30, 2015 08:24 AM CDT Prime Minister <mark>Stephen Harper</mark> takes part in a news conference at Rideau Hall after asking Governor General <mark>David Johnston</mark> to dissolve Parliament, beginning the longest federal election campaign in recent history on Sunday. (Blair Gable/REUTERS) Report an error Who Needs Change? After all the gains Canada has made under <mark>Stephen Harper</mark>, after being transformed into the most admired nation in the world, the fickle Canadian voters are going to treat the election like buying a new hat--\"time for a change\" , not to be better, not to be as good, but just change for change's sake. And when the daft opposition taxes and spends us into a hole, who will they blame? Not themselves! Smarten up, Canada. We are doing well--it's the world causing the trouble. <mark>Harper</mark> is watching our wallets and keeping the freebees under control. If you want change, buy a new hat! TIM DEVLIN \"Out with the old, in with the new\" doesn't always work when electing governments. RAISING TAXES Re: \"Make taxes an election issue,\" Editorial, Aug. 27. Canadians currently pay more in a variety of taxes than buying food or running their households. Thus, when we hear NDP Leader Smiling Tom Mulcair saying he will balance the federal budget by raising taxes on corporations, Canadians should be alarmed, as this would then be passed on to them. Whatever province that has experimented with socialism / NDP governments, escalating taxes on everything has resulted. Manitoba is currently discovering this. With polls today showing Canada may well end up with Prime Minister Mulcair, Canadians better ask themselves how much more in taxes they can afford when casting their votes. LARRY COMEAU We think most people would say they can't afford any more taxes. DUFFY MONEY It was party money that was used to repay the Duffy indebtedness not taxpayers' money. Party money use, for other than the party's' advancement through ads etc, might be of concern to those whom contributed to the party. Other than that, I can't see why all other Canadian citizens must be coerced into believing that Mr. <mark>Harper</mark> used taxpayers' money to repay Duffy's misuse of the actual taxpayer money. DAN DRINKALL Don't think anyone is suggesting the repayment came from taxpayer money. CBC NEEDS TO GO I find it amazing that people are mad at the Tory government for cutting the funding to the CBC. The amount of waste and overspending is unbelievable. If it was not sponsored by our government, it would have had to declare bankruptcy years ago. Come on Canada! Not everyone likes <mark>Stephen Harper</mark> (although I think he has done more for Canada than anyone else) but get off the Liberal crying towel. The CBC needs to go. DAVE MAGNUS It should be forced to operate like every other station--not through handouts. WHERE'S EUROPE? Re: \"Heroes tell of desperate battle with train terrorist,\" Aug. 24. Thankfully the three young American men on the train were there and that they were military trained, otherwise a disaster could easily have happened. Which begs the question: How many more of these jihadists are there around? Why is the European Union not doing anything about migrants entering the mainland? No one seems to know who these people are. These people should be returned from where they came from, otherwise it could be a problem a few years down the road. TONY ROSE BOLTON"}, {"articleID": "2018041503_00035500_W", "names": {"John O'Neill": ["Q16122131", "Q2628718", "Q53536543", "Q54771468", "Q6250976", "Q6250980", "Q6250982", "Q6250984", "Q6250987", "Q6250991", "Q6250993", "Q6250995", "Q6251003"], "Andrew Smith": ["Q14330096", "Q15637779", "Q16116774", "Q16193862", "Q16244589", "Q18352207", "Q19474813", "Q20713799", "Q20922198", "Q21456626", "Q21501584", "Q24005645", "Q25189558", "Q26831165", "Q28378643", "Q28835024", "Q28870725", "Q30717045", "Q334296", "Q38361975", "Q4758601", "Q4758603", "Q4758604", "Q4758605", "Q4758606", "Q4761331", "Q50326709", "Q506331", "Q507501", "Q507502", "Q58146205"]}, "date": "2018-04-15", "url": "http://sciencedaily.com/releases/2018/04/180414171614.htm", "content": "Follow all of ScienceDaily's and! latest research news top science headlines Science News Scientists find positive workplace experiences among Americans with disabilities National survey demonstrates that Americans with disabilities are striving to work and overcoming barriers Date: Kessler Foundation Summary: A multidisciplinary team of researchers have authored a new article that identifies how Americans with disabilities are striving to work and overcoming barriers to employment. Share: FULL STORY A multidisciplinary team of researchers at Kessler Foundation and the University of New Hampshire, Institute on Disability (UNH-IOD), have authored a new article that identifies how Americans with disabilities are striving to work and overcoming barriers to employment. Their findings are detailed in \"Striving to work and overcoming barriers: Employment strategies and successes of people with disabilities,\" which was published online February 26, 2018 by the Journal of Vocational Rehabilitation. The authors are <mark>John O'Neill</mark>, PhD, and Elaine Katz, MS, CCC-SLP, of Kessler Foundation, and Vidya Sundara, PhD, OTR/L, <mark>Andrew</mark> Houtenville, PhD, Kimberly G. Phillips, PhD, Tracy Keirns, PhD, and <mark>Andrew Smith</mark>, PhD, of UNH. advertisement People with disabilities experience persistent obstacles to employment, resulting in poorer labor force participation, higher unemployment rates, and lower wages earned compared to people without disabilities. Identifying the strategies and resources necessary to sustain people with disabilities in paid employment is the first step toward increasing the participation of this population in the workforce. Findings of the 2015 Kessler Foundation National Employment and Disability Survey (KFNEDS) show that people with disabilities are actively engaging in job preparation and job search activities, and successfully negotiating barriers at work. \"Approximately 69 percent of those surveyed are striving to work, which is defined as working, actively preparing for employment, searching for jobs, seeking more hours, or overcoming barriers to finding and maintaining employment\" said Elaine Katz, senior vice president of grants and communications at Kessler Foundation. \"By focusing on the successful outcomes of jobseekers and employees with disabilities, rather than the barriers, we are reframing the discourse and adding to the growing body of knowledge on best employment practices.\" A substantial percentage of employees reported experiencing--and overcoming--barriers to finding and maintaining employment, including insufficient education or training, negative attitudes of supervisors and coworkers, inaccurate assumptions on ability, pay disparity, and lack of transportation. Over 42 percent of survey respondents were currently working, with 60.7 percent of those working more than 40 hours a week. Other findings showed that approximately 50 percent of the respondents used workplace accommodations and were satisfied with their jobs, and nearly 90 percent felt accepted in their workplace. \"This review highlights the strategies people with disabilities use to search for work and navigate barriers, a topic largely overlooked in contemporary disability and employment research,\" explained <mark>John O'Neill</mark>, PhD, director of disability and employment research at Kessler Foundation. \"Our hope is that this information will aid the development of targeted policies and programs that foster long-term increases in workforce participation among Americans with disabilities.\" Further research exploring the efficacy of practices that employers use to recruit, hire, train, and retain people with disabilities in their organizations, from the unique perspective of supervisors of employees with and without disabilities, is presented in the 2017 Kessler Foundation National Employment and Disability Survey: Supervisor Perspectives. advertisement"}, {"articleID": "2017080417_00143557_W", "names": {"Ri Yong-Ho": ["Q12594422", "Q483800"]}, "date": "2017-08-04", "url": "http://www.philstar.com/headlines/2017/08/05/1725190/scs-claimants-will-suffer-if-harsh-china", "content": "Headlines Skinning Left, pagematch: 1, sectionmatch: 1 Headlines (Leaderboard Top), pagematch: 1, sectionmatch: 1 \"SCS claimants will suffer if harsh to China' By Helen Flores (The Philippine Star) | Updated August 5, 2017 - 12:00 am People from claimant-states in the South China Sea will suffer if they take a hard stance with China, Foreign Affairs Secretary Alan Peter Cayetano said yesterday, as former diplomats and experts expressed concern over Beijing's continued island-building activities in and militarization of the disputed waters. AFP/Fabrice Coffrini, File MANILA, Philippines - People from claimant-states in the South China Sea will suffer if they take a hard stance with China, Foreign Affairs Secretary Alan Peter Cayetano said yesterday, as former diplomats and experts expressed concern over Beijing's continued island-building activities in and militarization of the disputed waters.\" In the West Philippine Sea, our neighbors are also claimants. If we go harsh with everyone, our people will suffer--trade, direct foreign investments, tourism, \"Cayetano said at the\" ASEAN at 50: The Way Forward \"forum in Makati City. The Philippines under President Duterte, he pointed out, seeks to\" build more bridges of understanding \"to attain peace and stability in the region. China claims about 90 percent of the entire South China Sea but this is being contested by Taiwan and four ASEAN members--the Philippines, Vietnam, Malaysia and Brunei. The two-day forum, organized by the Carlos P. Romulo Foundation for Peace and Development, Center for Strategic and International Studies and Stratbase ADR Institute, was attended by diplomats and policy experts from ASEAN member-countries as well as non-ASEAN nations, including the US, Australia and South Korea. Former foreign affairs secretary Albert del Rosario, chairman of Stratbase ADR Institute, urged ASEAN members to\" define its own leadership \"and oppose Beijing's aggressive expansion, noting that the\" fear of economic retaliation \"was keeping the ASEAN from standing up on important issues. Headlines (Article MRec), pagematch: 1, sectionmatch: 1 Cayetano, in his speech, assured the administration's critics that the Philippine government would not give up\" a single centimeter \"of its territory in the West Philippine Sea to China despite improved relations between the two nations.\" We may have different strategies, but we have the same objective, sir, \"Cayetano told Del Rosario. In 2013, under Del Rosario's term as DFA secretary, the Philippines challenged China's maritime claim before an international arbitral tribunal, calling it\" excessive \"and\" exaggerated. \"A Hague-based arbitral court ruled in favor of the Philippines in 2016, saying China's maritime claims have no legal basis--a decision that was dismissed by China as\" a mere piece of paper. \"Del Rosario warned the Philippines against entering into financial agreements with China.\" By entering into weighty financial agreements, we may end up not only tying our own hands but also the hands of the next generation, \"he said as he called on ASEAN to take a stand against Chinese incursions. ASEAN must unite vs China Amy Searight, former US deputy assistant secretary of defense for South and Southeast Asia, also called on the ASEAN to push for its strategic vision in the development of the region.\" Neutrality is not an option because South China Sea is a key litmus test for China's rise and whether regional responses, regional norms and international law can shape China's behavior or not, \"said Searight, now senior adviser and director of the Southeast Asia Program of the Center for Strategic and International Studies. She warned that the ASEAN could end up as a passive bystander if it would choose neutrality over making a stand in the region.\" ASEAN's potential is far greater (than being a team leader and hosting events in the region). It lies at forging a strategic vision for Southeast Asia, and the vision of what kind of neighborhood in the broader Indo-Pacific that it wants to reside in, \"she added. Searight said this would require leadership and political courage and determination, but noted that ASEAN was able to show that it is up to tough challenges if it puts its collective mind to it. Top ASEAN meeting topics * NL * Alarm over North Korea's intercontinental ballistic missile tests, a germinal step to temper South China Sea disputes and unease over a disastrous siege by pro-Islamic State group militants will grab the spotlight in the ASEAN forum. At least 27 nations are deploying their foreign ministers for three days of summitry and handshake photo-ops in Manila starting today, including the main protagonists in long-tormenting conflicts led by the US, Russia, China, Japan and South and North Korea. The Philippines plays host as this year's ASEAN chairman. Chinese and ASEAN foreign ministers will endorse a two-page framework of a long-sought code of conduct in the disputed South China Sea when they meet today as the Philippines calls the development a major diplomatic progress in efforts to ease a potential flashpoint. Critics say the agreed outline of key principles is lopsidedly in China's favor and suspect that Beijing may have consented to it to divert protests as it tries to complete land reclamations and fortify its man-made islands with a missile defense system. While the framework carries hope for a diplomatic approach to the disputes, it noticeably failed to mention China's construction of new islands and an arbitration ruling last year that invalidated the historic basis of Beijing's claim to virtually the entire sea. Beijing's cozier ties with Manila under Duterte have calmed tensions and prompted China to allow Filipinos back to a disputed shoal, but arbitration proponents worry that the Chief Executive was squandering an opportunity to harness the rule of law to restrain aggressive acts in the disputed region. A draft of a joint communiqué to be issued by the ASEAN ministers welcomes the conclusion of talks on the framework, but drops any mention of regional concerns over land reclamations and militarist moves in the South China Sea, which ASEAN members had agreed to include in their previous statements. North Korea's two recent and successful ICBM tests also topped the agenda as the US and its allies quickly signaled their intention to impose additional sanctions against Pyongyang through a UN resolution. Along with South Korea and Japan, the US is also expected to lead a barrage of condemnations against Pyongyang at the ASEAN Regional Forum (ARF), an annual security conference to be held in Manila on Monday. North Korea has confirmed that its top diplomat, <mark>Ri Yong-Ho</mark>, will attend, raising the specter of a verbal showdown in the 27-nation ARF, which also includes Pyongyang's ally, China. Ahead of the meeting, a senior State Department official told reporters in Washington that the US was moving to have North Korea suspended from the forum for going against its conflict-prevention objectives. It's part of America's broader effort to isolate Pyongyang diplomatically and force it to end missile tests and abandon its nuclear weapons program. But removing North Korea from the grouping will be tough, as there is no exclusion procedure and the ARF decides by consensus .--With Janvic Mateo, Rudy Santos, AP Headlines (Article MRec), pagematch: 1, sectionmatch: 1"}, {"articleID": "2017060203_00254732_W", "names": {"Jordan Thompson": ["Q16219277", "Q18385737", "Q6277054"], "Kevin Anderson": ["Q11040742", "Q1740075", "Q18630776", "Q299956", "Q3195650", "Q42783158", "Q48769673", "Q6395723", "Q6395724", "Q6395726", "Q6395728"], "Andy Murray": ["Q10125", "Q526811"]}, "date": "2017-06-02", "url": "http://www.sbs.com.au/news/article/2017/06/02/kyrgios-still-wimbledon-dreamer", "content": "World News Radio Kyrgios still a Wimbledon dreamer Nick Kyrgios believes he remains a factor in Wimbledon reckoning despite his second-round elimination from the French Open in Paris. Source: Tweet Nick Kyrgios maintains he is a Wimbledon force despite injuries and the death of his grandfather scuppering his French Open hopes. A deflated Kyrgios is hoping a doubles run at Roland Garros with Australian Davis Cup teammate <mark>Jordan Thompson</mark> can boost his spirits ahead of next month's grasscourt showpiece at the All England Club. With a rare four aces in one flawless service game, Kyrgios displayed in his 5-7 6-4 6-1 6-2 second-round loss in Paris to <mark>Kevin Anderson</mark> that he remains very much a top-six title contender at London's SW19. Despite conceding his battered body needs rest, Kyrgios is confident four weeks is \"enough time\" to recover and prepare for tennis's most prestigious event. But he's playing a dangerous balancing act. \"At the same time I need rest, but I need the practice as well,\" Kyrgios said. \"I haven't been hitting enough tennis balls.\" For my first round, I was serving and I only played three sets and my shoulder was sore. \"So usually at grand slams I don't really feel my body at all, really. That's just a sign that my body is a bit underdone.\" I haven't really put together any good training in the last couple weeks, obviously just trying to manage some niggles and obviously I haven't really structured any good training in the last five weeks. \"So I don't think I was match-ready to play best-of-five-sets.\" A Wimbledon quarter-finalist at just 19 three years ago, Kyrgios is adamant he remains a threat - and doubles in Paris is central to his preparation. He and <mark>Thompson</mark> knocked out French second seeds Nicolas Mahut and Pierre-Hugues Herbert in round one to open up the draw beautifully for a run at the title. \"It's good just to keep playing core matches, just keep playing,\" Kyrgios said. \"I think me and Thommo can do well here as well. I'm just going to focus on that for now.\" I was going to maybe go home after this week if I didn't do so well here, but obviously winning a round and still in doubles, it's cutting the time pretty slim. \"So I don't really know what I'm going to do next week. I'm not sure.\" Kyrgios's only scheduled grasscourt event before Wimbledon is Queens. Currently ranked 19th, he needs to improve his ranking to secure a top-16 seeding to ensure he won't run into a top-eight heavyweight like defending champion <mark>Andy Murray</mark>, world No. 2 Novak Djokovic or resurgent seven-time champion Roger Federer until at least the quarter-finals. Kyrgios, however, is more concerned about rediscovering his mojo. \"I haven't put in enough work to have gone deep here. The whole team knows it,\" he said. \"The surprising thing is I was in a winning position today and I still could have won.\" It doesn't even matter how underdone I was. I still could have won. \"I've just got to practise. You know, during Indian Wells and Miami time, I was practising a lot. After my grandpa passing, I just lost a lot of motivation to do anything, really.\" Advertisement"}, {"articleID": "2011072716_00068834_W", "names": {"John King": ["Q11169832", "Q11728008", "Q12320190", "Q1232745", "Q15460643", "Q16018812", "Q16237828", "Q17859802", "Q18043577", "Q18626490", "Q19665420", "Q21461592", "Q22095928", "Q27958442", "Q30597402", "Q57312040", "Q6234532", "Q6239042", "Q6243110", "Q6243113", "Q6243117", "Q6243127", "Q6243129", "Q6243132", "Q6243134", "Q6243136", "Q6252241", "Q671520"]}, "date": "2011-07-27", "url": "http://emporiagazette.com/news/2011/jul/27/flint-hills-are-good-life-cowboy-nutritionist/", "content": "ipod friendly version \"come on in whenever the gate's open. i'll be there.\" the cattle guard rattled while crossing onto the graveled road through green pasture to the picturesque homestead where dr. phil phar sure enough answered the doorbell. \"i've lived here six years. i like western kansas, but it can't beat these flint hills,' surmised phar as he sat down on a plush leather couch in his quaint, immaculate cowboy home with attached five-stall horse barn. there's no question about the lifestyle as two saddles, boots with spurs attached, bridles, hats, horse photograph-adorned walls and a big wooden coffee table cluttered with cowboy books and leather-bound albums engraved with phar's two brands that also grace the overhead entranceway to what he calls a\" play ranch. \"it's really 135 acres of formerly just native pastureland a short distance north of council grove in morris county. today, a couple more matching tan metal storage structures, a storm shelter, buford the mechanical roping dummy and a big arena complete headquarters of phar, inc., the business for which the phd nutritionist is known throughout the country.\" my sons, matt and justin, live at olathe, and i'd always been doing cattle business around here, so i feel fortunate to have bought this place, \"said phar, who moved from his home and horse facilities on 20 acres at scott city. raised on a hereford farm in illinois, phar said,\" i always wanted a horse, and i finally convinced dad that we needed three or four to do the cattle work. \"contending his initial mounts were incomparable in ability to the pair in his barn today, phar still followed his cowboy instincts to complete undergraduate animal science education at the university of illinois.\" they had a few good <mark>king</mark> ranch and peppy-bred quarter horses, and i was fortunate to have the opportunity to work with them, \"phar said. graduate studies were at kentucky where phar completed his degrees and came to kansas state university when offered a position.\" as i was driving down the highway, got to about maple hill and saw these flint hills, i knew this was where i wanted to be, \"phar said. that was 1966, and he served as the first feedlot specialist at k-state.\" i was really on the ground flour of the feedlot industry in the state, \"phar said.\" crofoot at strong city along with winter and brookover in western kansas were the biggest feedlots around at that time, \"phar said. during his time at the university, phar had horses, roped some, helped ranchers, judged local horse shows and served as faculty advisor for the chaps (rodeo) club. obviously, feedlots were a fast-growing industry, and, by 1972, phar was in demand to assist managers in formulating nutritional needs of cattle on feed.\" i moved to scott city and started my consulting business, \"he said. feedlot operators, stocker producers and cow-calf programs in several midwest states sought phar's nutrition advice.\" i had about 20 clients with more than 200,000 cattle at one time, \"phar said.\" i had to be on the road a lot, working in colorado, kansas, montana, nevada and wyoming. \"while providing others with nutrition knowledge, phar was also in the cattle business personally and developed feedstuffs now familiar to many. a photograph in one of the albums tells a story he's pleased to share.\" i encouraged cattle feeders to put wheat straw in finishing rations, \"phar said.\" there's lots of straw from all of the wheat in kansas. \"leading quarter horse trainer billy allen had some of the top horses in the country three decades ago, and phar developed the ration now merchandized as billy allen horse feed.\" we were in a partnership, and i designed the mill still operated by that feed business, \"said phar, who dispersed his interests to allen. during his diverse cattle endeavors, phar worked with and became good friends with kenny berg.\" when kenny settled back at manhattan, and was looking after lots of grass cattle, we developed a rumensin-based mineral that other cattlemen soon wanted to feed, too, \"phar said. manhattan milling manufactured the product for phar and berg, who became partners in the bluestem mineral business.\" we still sell the mineral, and it's now made by rw milling and countryside feeds, \"phar said.\" kenny handled mineral deliveries for a long time, but now countryside distributes most of it bagged and bulk for us. \"the phar place at scott city was popular for the cowboy crowd.\" i always had cattle for roping, and several nights every week during the summer, there would be a group there for practicing, \"said phar, who competed in team roping jackpots and feedlot ropings consistently for a number of years. his sons learned to ride and rope, and still have an appreciation for the sport.\" the boys have business degrees and live in olathe, but i like the rural life, \"phar said.\" they come here, and i go there, but we're generally ready to get back to our own places. \"always with a soft spot for helping anybody with a cowboy spirit, phar said,\" i usually keep a few corrientes here, and sometimes have practice sessions. \"cooper martin and brant mahanay just got back from a national junior rodeo. they come here fairly regularly,\" he added. phar's two grandsons sometimes ride when they visit. \"the one wanted to take a horse when we went to a youth rodeo the other day, so they might become cowboys sometime,\" phar said. when ropers come by to practice, phar will often saddle one of his horses, help pen steers and maybe shake out a loop if the mood strikes. \"i don't really ride all that much nowadays, but i've got a great pair of geldings,\" he said while praising them as they appreciated evening feed. critiquing his gray 18-year-old eddie red rose-jackie bee gelding called flint, phar said, \"i've always liked big horses, and i've had some good horses. this is one of the best. he's a top head horse and can get the job done right in the pasture.\" a sorrel 12-year-old smart little lena-peppy san badger gelding, called buddy, had experience before phar got him and complements the older horse, according to their owner. in addition to the two saddles in his home, phar's working tack is kept in one of two trailers in the barnyard. \"i've always liked and had good equipment,\" said phar as he showed the saddles custom made by j.m. capriola and <mark>john king</mark>. \"my saddles have slick forks and narrow seats. that makes a big difference in how they fit, and how they ride,\" phar said. a couple of the bridles hanging in the trailer are equipped with rawhide bosals that phar braided personally. \"i like to work with leather,\" he said as showing breast collars he'd designed and cut out personally. now down to just a couple nutrition clients, phar said, \"kenny knight was one of my first customers, and he's still with me, 39 years. i'm not planning to quit, but i don't want to work all of the time either.\" there are weight-lifting barbells in his barn, but phar contended, \"i go to the health center and use the exercise equipment there. it's not so dusty. it only takes 45 minutes, and i don't feel quite as well if i have to miss.\" reading has always been important to phar. \"i read at least two books a week. i need to take some of these to the library,\" he said. a past chairman of the kansas livestock and meat industry council, phar has maintained ties to kansas state university."}, {"articleID": "2018030823_00411636_W", "names": {"Rob Watson": ["Q18720309", "Q7340641"]}, "date": "2018-03-08", "url": "http://www.bozemandailychronicle.com/news/education/bozeman-schools-to-sell-patterson-road-land-dispose-of-durston/article_362831a8-c2da-5a3d-bdca-24680347f524.html", "content": "Bozeman schools to sell Patterson Road land, dispose of Durston house RACHEL LEATHE / CHRONICLE Map shows the land at Patterson Road and South Third Avenue that the Bozeman School District plans to divide so the north 18 acres can be sold, with the image of an elementary school imposed on the south 12 acres to show scale. Save After talking about it for years, the Bozeman School District has decided to sell off more than half the land it owns on Patterson Road, while keeping the smaller portion for a possible future elementary school. The School Board voted 4-0 this week to sell about 18 acres on Patterson Road and at the same time get rid of an old house on Durston Road, behind Bozeman High School. Both the land and the house were declared to be obsolete or unsuitable for school uses. How much the 18 acres on Patterson Road might be worth won't be known until an appraisal is conducted, Superintendent <mark>Rob Watson</mark> said Tuesday. × Decades ago the school district purchased the 30 acres on Patterson Road, near South Third Avenue, <mark>Watson</mark> said. Thirty acres would be the right size for a middle school, but it's so close to Sacajawea Middle School that it's unlikely that's where a new middle school would ever be located, he said. It's too small for a high school, and too big for an elementary school. So the School Board agreed to subdivide the land, sell the north half and keep the 12 acres on the south for a possible future elementary school. Last year when school officials started talking to voters about the need to acquire land in the fast-growing northwest side of town for new elementary schools, people asked if the district could sell off land it doesn't need, <mark>Watson</mark> said. The reason for acting on the Patterson property now is that a developer has approached district officials and expressed interest in purchasing it. The reason for getting rid of the old house, hidden behind trees, at 1218 Durston Road, is that the plan to build a new football stadium on the Bozeman High campus will require moving some softball fields. \"Were going to need some space at the north end of campus,\" <mark>Watson</mark> said. The house, originally constructed in the 1930s and added onto in 1980, has also been owned by the school district for years. Officials looked into selling the house to someone who might want to move it, but now say it will likely have to be torn down because of its age and construction. The house at one time was rented out and housed Adult Education, but it hasn't been used in six or seven years, <mark>Watson</mark> said. No one objected to disposing of the Patterson land or Durston house. Last month the School Board made a more controversial decision to sell nearly one acre of surplus land, the Emerson Lawn, for $2.2 million. That sale is intended to raise enough money to buy two more suitable elementary school sites, one on Baxter Lane near the new post office and the second in the Woodland Park subdivision near Four Corners. Voters will be asked in May to approve those as school sites. Gail Schontzler can be reached at 406-582-2633 or gails @ dailychronicle.com."}, {"articleID": "2020010912_00069341_W", "names": {"Abdul Aziz": ["Q22958462", "Q23542680", "Q23542681", "Q27830812", "Q30121874", "Q30600990", "Q4665272", "Q59601323"], "Abdul Hamid": ["Q3246667", "Q4665391", "Q46996242", "Q47118441", "Q938136"]}, "date": "2020-01-09", "url": "http://thesundaily.my/local/police-promise-action-against-personnel-involved-in-removal-of-cny-decorations-AF1878714", "content": "Police promise action against personnel involved in removal of CNY decorations 09 Jan 2020 / 19:58 H. Students hang up a Chinese New Year lantern decoration at SMK Pusat Bandar Puchong 1 yesterday .--Bernama SERDANG: Stern action will be taken against any police personnel if they were found to have had a hand in a secondary school's decision to remove the Chinese New Year decorations it had put up at its premises, following an alleged threat by Parti Bumiputera Perkasa Malaysia (Putra). Serdang police chief ACP Ismadi Borhan today said investigations are being carried out to ascertain if there is truth to allegations that police personnel advised the school's officials to take down the decorations. Ismadi said police have received two reports on the matter from the public. There were claims that following Putra's demand to the school, several police personnel had advised the teachers of SMK Pusat Bandar Puchong 1 to remove the decorations. He said the case is being investigated for \"issuing a statement which is likely to incite a race or community\" under Section 505 (c) of the Penal Code and for \"initiating communication to threaten or harass\" under Section 233 of the Communications and Multimedia Act. \"We have recorded statements from members of Putra, the school's officials and also its Parents-Teachers Association. We will investigate and submit our findings to the Attorney-General Chambers for further action,\" Ismadi said. Putra vice-president and lawyer Mohd Khairul Azam <mark>Abdul Aziz</mark> was summoned for questioning over the case by Serdang police this morning. On Monday, he had issued a letter to the SMK Pusat Bandar Puchong 1 school's headmistress ordering her to remove the elaborate CNY decorations that were put up at the school claiming he had received complaints from some school pupil's parents. Referring to CNY as a \"Chinese religious celebration\" he complained that the decorations were excessive and that it made the school look like a Chinese-owned business centre and had elements of religion which caused displeasure among Muslim students. The school officials caved in to Putra's demands and removed the decorations but it was reported that it put them up again following the intervention of several politicians who slammed Putra over the matter. The issue also caught the attention of Inspector-General of Police Tan Sri <mark>Abdul Hamid</mark> Bador who defended the school's initiative to place the CNY decorations, praising the move as one that will enhance greater ties among the races. The top cop also said there were elements of threats in Putra's letter and ordered an investigation to be initiated on Khairul. Did you like this article?"}]