[{"date": "2019-07-01", "url": "http://kidderminstershuttle.co.uk/news/national/17740075.eu-leaders-pull-all-nighter-at-summit-on-key-posts/", "content": "EU leaders pull all-nighter at summit on key posts By Press Association 2019 Journalists rest during a late-night negotiating session at an EU summit in Brussels 0 comment European Union leaders have pulled an all-nighter at a summit but failed to agree on the list of candidates for the bloc's key posts, with the marathon talks entering a second day. The leaders trickled in for bilateral contacts throughout Sunday before officially convening at around 8pm. They have been locked in talks ever since amid deep divisions over how best to balance political, geographic and gender considerations among the 28 member nations. With the selection process bogged down for the second EU summit meeting in a row, the leaders are still considering Dutch socialist Frans Timmermans to replace Christian Democrat Jean-Claude Juncker as president of the EU's powerful executive arm, the European Commission. European Commission president Jean-Claude Juncker sits prior to a round table meeting at the EU summit in Brussels (Geoffroy Van Der Hasselt, Pool Photo via AP) \"Let's see,\" Italian Prime Minister <mark>Giuseppe Conte</mark> said of Mr Timmermans's chances when briefly descending from the meeting room at EU headquarters at around breakfast time. The Timmermans option has deeply divided the European People's Party (EPP) as it would surrender the key post to the rival Socialists and Democrats (S & D) bloc despite the EPP remaining the biggest group in the EU following last month's election. Bulgarian Prime Minister Boyko Borissov, an EPP stalwart, posted a video on his Facebook account of a discussion with Mr Timmermans in which Mr Borissov said the Dutchman should get the commission job while the less coveted parliament presidency should go to EPP candidate <mark>Manfred Weber</mark>. But Irish Prime Minister Leo Varadkar insisted that the \"vast majority of the EPP prime ministers don't believe we should give up the presidency of the commission quite so easily, without a fight\". A journalist rests during the late-night negotiating session in Brussels (Virginia Mayo/AP) After negotiations started early on Sunday, summit host and EU Council president Donald Tusk had more than 30 bilateral meetings in his attempt to find a breakthrough. The appointments must take into account political affiliation, geography--balancing east and west, north and south--population size and gender. The leaders of EU institutions are supposed to impartially represent the interests of all member nations globally and in Brussels. Some leaders discussed the roster of upcoming vacancies, which also include the EU's top diplomat, the president of the European Parliament and the chief of the European Central Bank (ECB), on the sidelines of the Group of 20 summit in Japan that concluded on Saturday. Mr Tusk wants nominations to be wrapped up soon, seeking to prevent further erosion of public confidence in the EU amid Brexit uncertainty and intra-bloc divisions over managing migration. European Council president Donald Tusk, left, with Renew Europe party member Guy Verhofstadt (Virginia Mayo/AP) There was hope at the previous summit on June 20-21 that more time would clarify who should replace Mr Juncker. German Chancellor Angela Merkel backs Mr <mark>Weber</mark>, the German conservative whose centre-right EPP is the largest political group in the European Parliament but lost seats in the EU elections in May. French President Emmanuel Macron has suggested Mr <mark>Weber</mark> lacks the political and government experience for such a high-profile role. Mr <mark>Weber</mark> could still be considered for the head of the European Parliament, which is the EU's only elected institution. Mrs Merkel said there was still a good possibility for Mr <mark>Weber</mark> and Mr Timmermans, the top centre-left candidate from the S & D group, to be among the winners of the top positions. German Chancellor Angela Merkel arrives for the EU summit (Olivier Matthys/AP) Other leaders from the same political family disagreed. The EPP and the S & D are the two biggest political groups in the EU, but both lost seats in May's polls, where far-right and populist parties, pro-business liberals and the Greens made gains. EU leaders want to fill the positions soon because the European Parliament is set to pick a new president next Wednesday. Under EU rules, member countries choose who will run the commission, replacing Mr Juncker. The parliament must endorse that choice. But the assembly has insisted that only the lead candidates from parties that ran in last month's elections should be eligible for the post. \"The lead candidates is not the only criteria,\" said Mr <mark>Conte</mark>. The commission proposes and enforces EU laws on policies ranging from the massive single market to agriculture spending, and from competition issues to immigration. European Commission president Jean-Claude Juncker (Francois Lenoir/AP) The job responsibilities are huge: Mr Tusk and Mr Juncker negotiate with the likes of US President Donald Trump and Chinese leader Xi Jinping, while the head of the ECB can set monetary policy for the 19 nations that use the shared euro currency. The outgoing group of EU officials was lopsidedly Italian, with Antonio Tajani holding the parliament top post, Mario Draghi head of the ECB and Federica Mogherini the EU foreign policy chief. Top candidates include current prime ministers Stefan Lofven of Sweden and Andrej Plenkovic of Croatia. Others mentioned include Brexit negotiator Michel Barnier of France, Greens leader Ska Keller of Germany, Lithuanian President Dalia Grybauskaite and Margrethe Vestager, the EU's competition chief since 2014. 0 comment", "articleID": "2019070108_00149872_W", "names": {"Manfred Weber": ["Q1427998", "Q88866"]}}, {"date": "2019-07-02", "url": "http://www.timeslive.co.za/news/world/2019-07-02-china-condemns-hong-kong-protests-as-undisguised-challenge-to-its-rule/", "content": "China condemns Hong Kong protests as \"undisguised challenge' to its rule 02 July 2019 - 16:48 By Anne Marie Roantree Anti-extradition bill protesters wearing helmets gather outside the legislative council building on the anniversary of Hong Kong's handover to China in Hong Kong, China, on July 1 2019. Image: REUTERS/Tyrone Siu China on Tuesday condemned violent protests in Hong Kong as an\" undisguised challenge \"to the formula under which the city is ruled, hours after police fired teargas to disperse hundreds of protesters who stormed and trashed the legislature. A representative of China's Hong Kong affairs office denounced the demonstrators, who are furious about proposed legislation allowing extraditions to China, and said Beijing supports holding criminals responsible, state media said. The former British colony of Hong Kong returned to China in 1997 under a\" one country, two systems \"formula that allows freedoms not enjoyed in mainland China, including freedom to protest and an independent judiciary. Monday was the 22nd anniversary of the handover. Beijing denies interfering, but for many Hong Kong residents, the extradition bill is the latest step in a relentless march towards mainland control .\" Seriously violating the law, the act tramples the rule of law in Hong Kong, undermines social order and the fundamental interests of Hong Kong, and is an undisguised challenge to the bottom line of \"one country, two systems', Xinhua news agency quoted a Hong Kong affairs office spokesperson as saying .\" We strongly condemn this act. \"2 weeks ago Debris including umbrellas, hard hats and water bottles was among the few signs left of the mayhem that had engulfed parts of the city on Monday and overnight after protesters stormed and ransacked the Legislative Council, or mini-parliament. Police cleared roads near the heart of the financial centre, paving the way for business to return to normal. However, government offices, where protesters smashed computers and spray-painted\" anti-extradition \"and slurs against the police and government on chamber walls, were closed. The government's executive council meeting was due to be held in Government House, officials said, while the legislature would remain closed for the next two weeks. Millions of people have taken to the streets in the past few weeks to protest against the now-suspended extradition bill that would allow people to be sent to mainland China to face trial in courts controlled by the Communist Party. Lawyers and rights groups say China's justice system is marked by torture, forced confessions and arbitrary detention. China has been angered by Western criticism of the bill. The bill triggered a backlash against Hong Kong leader <mark>Carrie Lam</mark>, taking in the business, diplomatic and legal communities that fear corrosion of the legal autonomy of Hong Kong and the difficulty of guaranteeing a fair trial in China. 2 weeks ago She has suspended the bill and said it would lapse next year, but protesters want it scrapped altogether and have pressed her to step down. <mark>Lam</mark>, Hong Kong's self-styled Iron Lady, has created a fresh crisis for Chinese President Xi Jinping, who is already grappling with a trade war with Washington, a faltering economy and tension in the South China Sea. Regina Ip, chair of Hong Kong's pro-China New People's Party, said the protests had brought shame on Hong Kong .\" In the long term, (this) will impact Hong Kong's business environment. I believe various negative consequences of damages in our economy and prosperity will soon emerge. \"Starry Lee, chair of the Democratic Alliance for the Betterment and Progress of Hong Kong, also condemned the violence .\" This is an insult to LegCo (Legislative Council), an insult to Hong Kong rule of law, \"she said. Chinese censors have worked hard to erase or block news of the Hong Kong protests, wary that any large public rallies could inspire protests on the mainland. Screens went black on the BBC and CNN when they showed related reports in mainland China, as has happened during previous Hong Kong protests. Foreign news channels are only available in luxury hotels and a handful of high-end apartment complexes in China. 2 weeks ago State news agency Xinhua wrote an upbeat Chinese-language report about a government-arranged concert in Hong Kong to celebrate the handover anniversary, complete with descriptions of the audience singing the national anthem and how the performers showed their\" ardent love of the motherland \". A state newspaper in China called for\" zero tolerance \"after the violence in Hong Kong .\" Out of blind arrogance and rage, protesters showed a complete disregard for law and order, \"the Global Times, published by the Communist Party's People's Daily, said in an editorial. The protests generated lively discussion on Chinese social media .\" Hong Kong shows that China cannot follow a Western political system. It's too easy to be manipulated and to bring chaos, \"wrote one user of the Twitter-like Weibo. Another wrote,\" When the children don't listen, their mothers should give them a smacked bottom. \"Britain warned China that there would be serious consequences if the Sino-British agreement on Hong Kong was not honoured. China has dismissed Britain's concerns, saying Hong Kong was none of its business. The UN human rights office in Geneva called on all sides to avoid violence .\" We ask protesters to demonstrate and express their grievances in a peaceful manner, \"spokesperson Marta Hurtado said in an e-mail .\" We urge HK authorities to immediately open a proper channel for dialogue and for the police and other members of the security forces to manage demonstrations according to international human rights norms and standards. \"Reuters", "articleID": "2019070214_00188247_W", "names": {"Carrie Lam": ["Q19217", "Q5046264"]}}, {"date": "2019-07-03", "url": "http://cumberlandnewsnow.com/opinion/columnists/editorial-the-liberals-have-problems-with-judicial-independence-329525/", "content": "EDITORIAL: The Liberals have problems with judicial independence Postmedia News, Postmedia News Updated: just now Sorry you must be at least 19 years of age to consume this content. Minister of Intergovernmental Affairs, Northern affairs and Internal Trade Dominic LeBlanc, is seen in a Dec. 7, 2018, file photo. It's not enough that politicians be clear of actual wrongdoing when it comes to misdeeds, such as corruption or improperly interfering with the justice system. They must be completely free of the perception that they have crossed these lines. This is a rule widely known, previously voiced even by Prime Minister Justin Trudeau himself. That's why we're left scratching our heads about a story concerning judicial appointments coming out of New Brunswick. As first reported by the CBC, five out of the last six judicial appointments in the province went to people close to federal Liberal cabinet minster and Trudeau friend Dominic LeBlanc. The individuals appointed include, according to the report, a \"neighbour, a LeBlanc family relation and three lawyers who helped retire debts from his unsuccessful 2008 leadership bid .\" The Liberal government has already released a statement saying all three appointments were merit-based. But Canadians will have a tough time stomaching that statement, regardless of its truth. That's because this isn't the first time the Liberals have shown they have a problem with judicial independence. A roll call of recent scandals related to the justice file is a troubling one. There's the Lavscam affair, which was never fully resolved. We wrote in past editorials in this space that the RCMP should be probing the question of whether or not individuals in the Prime Minister's Office broke obstruction of justice laws in persistently pressuring Jody Wilson-Raybould into offering a Deferred Prosecution Agreement to SNC-Lavalin even after the head of the prosecution service ruled it out. Trudeau began by describing the story as false until eventually parts of the real story got out and the PMO changed its tune to state that while Wilson-Raybould was pressured, it was all--in former top bureaucrat Michael Wernick's words--\"lawful advocacy .\" Then, there's the Vice-Admiral <mark>Mark Norman</mark> affair, where Canadians were left wondering why bureaucrats close to Trudeau even referred the case to the RCMP in the first place. Then, there's the reports that many judicial appointments were first screened through a database of Liberal donors. The Liberals clearly have problems with judicial independence. Skepticism around this latest story is highly warranted. Copyright Postmedia Network Inc., 2019 More Columnists stories", "articleID": "2019070323_00240249_W", "names": {"Mark Norman": ["Q16733470", "Q6769046", "Q6769047"]}}, {"date": "2019-07-04", "url": "https://www.stuff.co.nz/sport/football/world-game/114010566/chelsea-hires-former-midfielder-frank-lampard-as-manager.html", "content": "Chelsea hires former midfielder <mark>Frank Lampard</mark> as manager 23:02, Jul 04 2019 Facebook Twitter Whats App Reddit Email <mark>Frank Lampard</mark>, Chelsea's all-time record scorer and one of its greatest ever players, has returned to the club as its 12th manager in 16 years under Roman Abramovich's ownership. The former Chelsea midfielder left second-tier club Derby, where he came close to securing promotion to the Premier League in his first season in management. <mark>Lampard</mark>, who scored 211 goals for Chelsea from 2001-14, won every major honour at the club including three Premier League titles and the Champions League. AP <mark>Frank Lampard</mark> salutes during a lap of honour during the English Premier League soccer match between Chelsea and Swansea City at Stamford Bridge stadium in London two years ago. He now returns to Chelsea as manager. \"Everyone knows my love for this club and the history we have shared,\" <mark>Lampard</mark> said in a Chelsea statement announcing his arrival. \"However, my sole focus is on the job in hand and preparing for the season ahead. READ MORE: * Chelsea close in on <mark>Frank Lampard</mark> * All Whites to play Lithuania in rare outing * Talay brings Cameron Devlin over from Sydney\" I am here to work hard, bring further success to the club and I cannot wait to get started. \"<mark>Lampard</mark> is the first English coach to manage Chelsea on a full-time basis since Glenn Hoddle in 1996 - and the first Englishman hired by Abramovich to control the team since his takeover in 2003. MIKE HEWITT/GETTY IMAGES <mark>Frank Lampard</mark> celebrates after scoring for Chelsea during an FA Cup semifinal against Tottenham Hotspur in 2012. He replaces Maurizio Sarri, who lasted only one tumultuous year at Chelsea before returning to his homeland in Italy to coach Juventus. Sarri secured not only a third-place finish in the Premier League but also ended his reign by winning the Europa League in May. The 41-year-old <mark>Lampard</mark>, who has signed a three-year deal, will have to contend with an inability to strengthen the squad because Chelsea is subject to a transfer ban which covers the two trading periods across the upcoming season. United States winger Christian Pulisic and Croatia midfielder Mateo Kovacic have been signed up in advance but they will be the only arrivals at Stamford Bridge, meaning <mark>Lampard</mark> might have to call upon youth-team players during the early part of his tenure - something previous Chelsea managers have often been reluctant to do. If anyone knows about the highs and lows of Stamford Bridge, it is <mark>Lampard</mark>.\" <mark>Frank</mark> possesses fantastic knowledge and understanding of the club and last season he demonstrated he is one of the most talented young coaches in the game, \"said Chelsea director Marina Granovskaia .\" After 13 years with us as a player, where he became a club legend and our record goalscorer, we believe this is the perfect time for him to return and are delighted he has done so. \"In its statement, Chelsea praised <mark>Lampard</mark>'s\" dedication to improvement, versatility and reading of the game. \"The last former Chelsea player to take over as coach was Roberto di Matteo, who won the Champions League and FA Cup in 2012 with <mark>Lampard</mark> in his squad. He was fired after only eight months in charge. <mark>Lampard</mark>'s first two competitive games as Chelsea manager will be against Manchester United, on Aug. 11 in the opening weekend of the Premier League, and Liverpool, in the UEFA Super Cup on Aug. 14 in Istanbul. AP Facebook Twitter Whats App Reddit Email", "articleID": "2019070415_00077712_W", "names": {"Frank Lampard": ["Q41533", "Q461633"]}}, {"date": "2019-07-04", "url": "https://footballleagueworld.co.uk/the-baggies-should-feel-confident-west-brom-targeting-versatile-pl-player-the-verdict/", "content": "Share Tweet West Bromwich Albion are interested in signing Trevoh Chalobah on loan from Chelsea this summer, according to the Express and Star. Slaven Bilic is hoping to build a team that will challenge for promotion next season, after taking charge at the Hawthorns last month and has identified Chalobah as a potential new signing. The 19-year-old spent last season on loan at Ipswich Town in the Championship and scored two goals in 44 appearances for the Tractor Boys, although he was unable to save them from relegation. The teenager, who is capable of playing at centre-back or in defensive midfield, is likely to be sent out on loan again next season to gain more experience. Chalobah is yet to make a senior appearance for Chelsea, but has been a key player for their academy side over the past few seasons and has also represented England at youth level. So, would Chalobah be a good signing for West Brom? We discuss...Toby Wilding \"I could see this being a good signing for West Brom .\" Chalobah has experience at this level from his time at Ipswich last season, and he will be determined to prove his own ability at this level following the dismal campaign endured by the Tractor Boys. \"The 19-year-old clearly has plenty of potential--you don't get taken on by Chelsea for no reason--and West Brom could do to bring in some fresh options in midfield, particularly considering the continued uncertainty around the future of Rekeem Harper at the Hawthorns .\" Having seen the benefits of such a move to both player and club first hand last season, you feel <mark>Frank Lampard</mark> will be happy to let this deal take place, meaning it is one the Baggies should feel confident about completing. \"<mark>George Brooks</mark>\" This could be a good signing for West Brom. \"Chalobah is a talented young football and he wouldn't be at a club like Chelsea unless they thought he had the potential to become a top player .\" The player will know that he probably isn't going to get a chance in the first team at Stamford Bridge next season, so another loan move would make sense for his development. \"He's already got a decent amount of experience in the Championship, having impressed while on loan at Ipswich last season .\" I think he's capable of making an impact for a team like West Brom and he could really benefit from playing for one of the top teams in the league. \"Chalobah can play a centre-back or in defensive midfield, so he would be a very useful option for Bilic to have in his squad .\" West Brom could do with some more depth in midfield, having just released <mark>James Morrison</mark> and seen Stefan Johansen return to Fulham, so Chalobah would be a welcome addition. \"Alfie Burns\" Given the success that the likes of Aston Villa and Derby County had with players like this last season, Chalobah should be a very good addition at the Hawthorns. \"His versatility makes him a useful player, and if he can cover the midfield and defence for Bilic, he will prove to be a good option over the course of a 46-game season .\" Whilst his experience at Ipswich won't have been a pleasant one, it was still something that will have taught him a lot and that kind of character building will be vital for the youngster's career. \"Overall, you'd like to think that this is a sign of what's to come under Bilic, with younger players coming in and replacing some of that\" old guard' that was carried back into the Championship. \"Related Topics: chelsea Trevoh Chalobah West Bromwich Albion Don't Miss 3 players who could stake their first-team claim as Fulham's pre-season kicks-off in coming days <mark>George Brooks</mark>", "articleID": "2019070421_00143977_W", "names": {"Frank Lampard": ["Q41533", "Q461633"], "George Brooks": ["Q18763893", "Q23638906", "Q25189773", "Q57778980"], "James Morrison": ["Q1354200", "Q316301", "Q3786059", "Q43911102", "Q451938", "Q6140045", "Q6140049", "Q74178"]}}, {"date": "2019-07-05", "url": "https://www.pulse.ng/bi/politics/trump-blamed-his-confusing-reference-to-airports-being-seized-during-the/qfnbpel", "content": "Business Insider Politics President <mark>Donald Trump</mark> attributed his confusing and ahistorical reference to soldiers seizing airports during the Revolutionary War on a weather-induced teleprompter failure. Evan Vucci/AP Photo <mark>Donald Trump</mark> Washington, DC experienced heavy rainfall and poor visibility during <mark>Trump</mark>'s 4th of July \"Salute to America\" celebration on National Mall. <mark>Trump</mark> made the airport-related gaffe during his speech to the crowd. \"Our Army manned the air, it rammed the ramparts, it took over the airports, it did everything it had to do, and at Fort McHenry,\" <mark>Trump</mark> said. When asked about the gaffe, <mark>Trump</mark> said that the heavy rains \"knocked out\" his teleprompter in the middle of that sentence, adding, \"that's not a good feeling when you are standing in frontof millions and millions ofpeople on television .\" Visit Business Insider's homepage for more stories. President <mark>Donald Trump</mark> attributed his confusing and ahistorical reference to soldiers seizing airports during the Revolutionary War on a weather-induced teleprompter failure. Washington, DC experienced heavy rainfall and poor visibility during <mark>Trump</mark>'s 4th of July \"Salute to America\" celebration on National Mall. <mark>Trump</mark> made the airport-related gaffe during his speech to the crowd. \"Our Army manned the air, it rammed the ramparts, it took over the airports, it did everything it had to do, and at Fort McHenry, under the rockets' red glare, it had nothing but victory. And when dawn came, their star-spangled banner waved defiant,\" <mark>Trump</mark> said in the speech. When asked on Friday about the gaffe, <mark>Trump</mark> said the poor weather conditions caused his teleprompter to malfunction. \"The teleprompter went out, right in the middle of that sentence it just went out, it went kaput, and that's not a good feeling when you are standing in frontof millions and millions ofpeople on television,\" <mark>Trump</mark> said while speaking to reporters outside the White House. He added: \"The rain knocked out theteleprompter. But no, it's not that. I knew the speech very well. I was able to do it without ateleprompter. But the teleprompterdid go out. It was actually hard to look atanyway because it was rain allover it .\" Read more: The internet blew up with hilarious #RevolutionaryWarAirportStories jokes after <mark>Trump</mark>'s puzzling reference to US soldiers seizing airports Neither airplanes nor airports existed in America until the early 20th century when the Wright brothers first took flight in 1903, and the world's first airport was established in College Park, Maryland in 1909, well over a century after the revolutionaries won independence from Britian. From <mark>Trump</mark>'s comments, it was still unclear whether the airport mistake was written into the speech, or whether the speech as written mentioned seaports instead of airports and <mark>Trump</mark> simply misspoke. Regardless, <mark>Trump</mark> didn't seem to be fazed by the gaffe and viewed the event as a success even suggesting that it could bolster military recruitment. \"Despite the rain, that was just a fantastic evening...and it was really a recruitment situation,\" he said. \"A lot of people are going to be joining our Army, Navy, Air Force, Marines, and Coast Guard .\" Read more: In hour-long Fourth of July speech, <mark>Trump</mark> mistakenly claims US soldiers \"seized airports' during the Revolutionary War <mark>Trump</mark>'s\" Salute to America' Fourth of July event drew supporters and protesters, despite pouring rain Military flyovers stunned crowds at <mark>Trump</mark>'s controversial \"Salute to America' Fourth of July event NOW WATCH: Why the US border facilities are\" concentration camps,' according to historians See Also: The internet blew up with hilarious #RevolutionaryWarAirportStories jokes after <mark>Trump</mark>'s puzzling reference to US soldiers seizing airports The <mark>Trump</mark> reelection campaign's monster fundraising numbers should scare Democrats What the food is like at <mark>Trump</mark>'s White House events SEE ALSO: Many people incorrectly think that the Founding Fathers signed the Declaration of Independence on July 4 here's the real reason the US celebrates that day Author: Grace Panetta Source: Business Insider USA Tell your friends LIKE PULSE NIGERIA FOLLOW PULSE NIGERIA Eyewitness? Submit your stories now via social or: WhatsApp: +2349055172167 Email: eyewitness @ pulse.ng", "articleID": "2019070516_00133811_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-07-06", "url": "https://wwos.nine.com.au/tennis/wimbledon-nick-kyrgios-caught-pub-party-planning/840f085b-3b3a-40ae-a7cf-fc835228c91b", "content": "Did Nick Kyrgios get caught planning \"club' visit after Wimbledon doubles loss? By Melanie Dinjaski 5 hours ago F Share T Tweet Q SMS W WhatsApp B Email G J Tumblr L LinkedIn 5 hours ago Nick Kyrgios has said one of the reasons he loves basketball and Davis Cup tennis is because of the team environment, and the Aussie never looked happier after a loss than he did following his mixed doubles defeat at Wimbledon. So much so, he was seemingly caught planning his evening at a\" club \"before the post-match press conference. Kyrgios teamed up with American Desirae Krawczyk but unfortunately the pair were defeated 7-6, 6-7, 5-7 by Marcus Daniell and <mark>Jennifer Brady</mark>. Earlier this week, Kyrgios drew criticism for being snapped at a London pub the night before his second-round loss to Rafael Nadal, and it seems the Canberran had similar plans after his mixed doubles exit .\" Yeh we're probably going to start there. Then we've got a club set-up. It's going to be outrageous, \"Kyrgios said into his phone, appearing to leave a voice message .\" Oooh, where are we going? \"Krawczyk then asked. Kyrgios leaves a voice message on his phone making plans for his evening (Wimbledon) It's not known if Kyrgios was actually making evening plans or simply trying to toy with the media, but a Wimbledon staffer quickly went up to the table to remind them both that the microphones were live. With a grin on his face and Krawczyk giggling, Kyrgios then leaned closer to the microphones and said:\" I'm going out tonight. Let me know if you want to come. It's going to be a crazy good night. \"When the press conference did get underway properly, Krawczyk also joked that the Aussie was\" full of s--\"when he claimed that he was planning an\" early night \".\" I had about eight-and-a-half hours of match play in three days just from singles, so my body is actually feeling okay. I'm going to get a good rest tonight, \"Kyrgios said before his doubles partner chimed in .\" Are you? Full of s--. Full of s--. Sorry for my language, \"she said in good humour, prompting Kyrgios to burst out laughing .\" I'm going to get a good rest tonight. You know just eat up, stretch and get an early night, \"Kyrgios continued .\" I'm sure they [the media] all believe that, \"Krawczyk added. Krawczyk calls out Kyrgios'\" early night' plans Kyrgios, 24, and Krawczyk, 25, seemed to have developed a good relationship despite the tennis pairing beginning by the Aussie \"sliding into her DMs\". \"I didn't want to, you know, come off like a creep when I asked her. I just genuinely wanted to play. You know, just have a lot of fun,\" he said. \"It wasn't creepy. I was just caught off-guard,\" Krawczyk said. \"He just asked a question,\" Do you want to play mixed at Wimby?' I was like, \"Sure, why not?' Thought it would be fun .\" Kyrgios explained that he actually felt the losses a lot more in doubles than he does in the singles matches he plays. Nick Kyrgios and Desirae Krawczyk in action during the mixed doubles on day five (AAP) \"I take these losses harder actually than I do in singles. It hurts not to win. I really wanted to win. I'm always up for that team environment,\" he said. Both players were questioned about their on-court chemistry, with a British journalist pointing out they appeared to be \"nattering throughout\" the match. This caught Kyrgios out when a reporter noted he described her as \"crazy bossy\" earlier, which Krawczyk was shocked by. \"Wow? Bossy? Seriously?\" she laughed as Kyrgios cowered below the desk smirking. \"I just call plays .\" \"No, she played awesome. I thought she was really good,\" Kyrgios said. \"I had a lot of fun today. I thought it was a pretty high level .\" Kyrgios jokes with \"bossy' doubles partner When asked how she felt about playing alongside Kyrgios and the big crowd he drew to the court, Krawczyk said she'd never experienced anything like it before .\" He's a big name so everyone wants to come and watch him, \"she said. But Kyrgios was less impressed with some of the supporters he attracted .\" Drunk guys hitting on [Krawczyk] all the time, \"he said .\" They were like seagulls, like, \"Des, Des, Des, Des',\" Krawczyk added. \"It was definitely fun. I didn't have to do much on the serves. It was great. It was a lot of fun .\" tennis wimbledon Nick Kyrgios More Tennis News Previous Wimbledon draw opens up for \"sickeningly consistent' Novak Djokovic Next Caroline Wozniacki loses in Wimbledon third round amid Hawkeye controversy", "articleID": "2019070605_00142585_W", "names": {"Jennifer Brady": ["Q13562450", "Q17612134"]}}, {"date": "2019-07-07", "url": "https://riverheadnewsreview.timesreview.com/2019/07/94394/let-grow-group-films-promotional-video-roanoke-avenue-elementary-school/#comments", "content": "Roanoke Avenue Elementary School third-graders found themselves in the spotlight last Tuesday after a nonprofit asked for their feedback on a nationwide movement. The nonprofit Let Grow filmed an unscripted promotional video in the Roanoke Avenue cafeteria as six students were interviewed by fellow third-grader Maya Sadeli-Weidner. The organization trains kids to be \"flexible, creative problem-solvers\" through alternative learning programs, according to its website. The filming coincided with the academic year-long Let Grow projects completed by students in Gary Karlson and Donna Verbeck's third-grade classes. Once per week, students were encouraged to do something they never did before, principal Thomas Payton said. \"One day, instead of getting a math worksheet for homework, kids would have to go home and do something they've never done before or try something they've never tried before and get their families involved,\" he said. \"Then, kids memorialize that with pictures. There was a writing component to it the next day, reflecting on what they did .\" Posters created by each student, documenting their new experiences, were hung throughout the cafeteria. Student Bryan Garcia said his favorite new activity was baking a cake with his father. He also took out the trash, locked the front door, and helped put Halloween decorations on his house with his family. When he first heard about the project from Mr. Karlson, he was \"really excited .\" \"I thought it was going to be fun,\" he said. \"He told us maybe we would have a party at the end of the school year about this and this is it .\" Let Grow co-founder Lenore Skenazy gave background on the program to the audience before the film crew recorded the students. She also interviewed Mr. Payton on camera for the video. \"Let Grow is an easy way to make it normal again to give our kids some freedom,\" she said. Mr. Payton said Mr. Karlson brought the Let Grow projects into the classrooms around September. Mr. Karlson said he discovered the program when his colleague shared information about it on social media. \"I explored the website and quickly adapted and translated the materials with the help of our bilingual secretary,\" Mr. Karlson said in an email. \"After that, really, the kids took it from there .\" He said the group of students did not rehearse, so everything picked up on camera was all natural. Other than the interviewer, Maya, the school did not know who was going to participate until they arrived at the event after school that day. Superintendent Aurelia Henriquez attended the event with school board member <mark>Brian Connelly</mark>, assistant superintendent for curriculum and instruction Christine Tona, director of professional personnel <mark>Brian</mark> Doelger and director of pupil personnel services Eileen Manitta. Dr. Henriquez said the program advances the district's goal of tackling the \"whole-child approach .\" \"As a mother of two young children and an educational leader, it is really important that we continue to find ways to increase our children's confidence, life skills, bravery, social skills and kindness,\" she said. \"It's never going to be just about the academics .\" Mr. Payton said he plans to expand the program to the entire third grade next year, which will be unique to each classroom. Second - and fourth-grade teachers have also expressed interest in picking up the program, he said. \"We're hopeful that other teachers in Riverhead will look at this, too,\" Mr. Payton said. \"Even Mr. Karlson will tell you, he does not necessarily want this to be Riverhead's way of doing it. This was just how the children in rooms 307 and 309 did it, this is their interpretation of Let Grow .\" [email protected] Photo caption: Third-grader Maya Sadeli-Weidner (standing) asks fellow student Sari Thompson a question about the Let Grow program last Tuesday at Roanoke Avenue Elementary School. (Kate Nalepinski photo) Comments comments Let Grow, Roanoke Avenue Elementary School, Thomas Payton", "articleID": "2019070710_00013085_W", "names": {"Brian Connelly": ["Q2924876", "Q57543497"]}}]