[{"date": "2019-07-08", "url": "http://www.afr.com/lifestyle/where-s-wally-jr-chronicles-the-street-life-of-san-francisco-20190704-p5249k", "content": "Lifestyle Photography Where's Wally? JR chronicles the street life of San Francisco The French photographer likened to Cartier-Bresson and Britain's Banksy has created a digital montage like none other as a homage to the city. Detail from \"The Chronicles of San Francisco\" , a 30-metre-long animated mural that can be seen at SFMOMA until April next year. Aviva Lowy Aviva Lowy Jul 8, 2019--12.11 pm Share Who doesn't love people watching; the pleasure of whiling away time while observing others going about their business. A new exhibition at the San Francisco Museum of Modern Art encourages visitors to do just that: stop a while and stare at the passing parade. The Chronicles of San Francisco, by the digital artist known as JR, is a creation so mesmerising that it's actually difficult to turn away from it. The Paris-born photographer has been described as the Cartier-Bresson of the 21st century. His large-scale mural--over 30 metres long--is both a portrait and an homage to the city. What at first appears to be a static black and white photo montage overcrowded with people is actually animated. Look there: a person is waving, and over there, another plaits her hair. A woman is giving birth. A group of swimmers are improbably floating through an open garage. Quotidian characters nestle alongside fantastical. Is that a unicorn? And someone dressed as Frida Kahlo? It's like a Where's Wally? book for adults, as you search the pageant for activity, trying to take in the whole and its many parts. The entire panorama also scrolls slowly across the screen, taking just over an hour to complete a full cycle. You're unlikely to get bored as there is always something new just coming into view...Assembling the work was a massive undertaking. JR and his crew created a mobile photographic studio in a 16-metre trailer truck, which they took to 22 locations around the city, inviting anyone and everyone to come and take part. In all, 1206 people appear on screen, all of whom were photographed, filmed and interviewed by JR.. No ordinary truck: JR's mobile studio. Lyle Owerko There are a couple of well-known faces, such as the Governor of California, Gavin Newsom, and Golden State Warriors basketball star Draymond Green, but for the most part these are ordinary folk--shopkeepers, children, homeless people, protesters, fire fighters, dog walkers. If your curiosity is piqued by any of the participants, iPad kiosks next to the mural allow you to click on the image of any one of them and hear a little of their story. You can dawdle here for hours. OR you can download the JR: murals app on your mobile phone, hover over a printed image, and then take a listen at home. Describing himself as an urban artivist, JR came to international attention when he was nominated for an Oscar in 2018 for a film he co-directed with the Belgian-born French film director Agnès Varda, Faces Places. The film documented the couple travelling around country France, photographing locals and posting these portraits as giant images on local buildings. More recently, in celebration of the 30th birthday of the Louvre's I.M. Pei glass pyramid in April this year, JR enlisted 400 volunteers to assemble a 2000-piece paper collage that made the pyramid appear to extend into a deep excavated cavity below the ground. The ephemeral artwork, covering 17,000 sq metres around the pyramid, existed for just a day as visitors trampled the ground, tearing and dispersing the paper. JR dedicated the work to Varda whose death coincided, almost to the day, with the event. The Louvre piece was a fitting coda to another trompe l’oeil he created at the site in 2016, when he covered up the pyramid with an image of the Louvre palace sitting behind it. The effect was to make the pyramid disappear from view by blending into the older building's facade. In 2016, JR effectively made I.M. Pei's glass pyramid disappear. Alamy At the time, The Guardian described this as an audacious act, \"the equivalent of Banksy becoming resident artist at London's National Gallery\". A fair comparison as, like Banksy, JR started out as a graffiti artist, tagging buildings. He swapped to photography after finding a camera in the Paris Metro. Since then he has created a number of significant installations, addressing polemical issues such as the US-Mexican border fence, the West Bank wall separating Palestinians and Israelis, gun violence, and the heroism of women in areas of conflict. JR's 21-metre-high installation of a child, \"Kikito\" , peers over the wall that partitions Mexico from the US. Alamy After years of turning his lens on others, JR himself has become the focus of attention. Last year he was named one of Time's 100 most influential people of 2018. For his project at the San Francisco Museum of Modern Art, JR is said to have been inspired by the murals of <mark>Diego Rivera</mark>--and perhaps the appearance of the Kahlo character, <mark>Rivera</mark>'s wife, is a nod to him. The mural will be on display for a year. It will be replaced in the second half of 2020 by <mark>Rivera</mark>'s mural Pan American Unity, which dates back 90 years and was also a commission of the museum. As Neal Benezra, director of the museum since 2002, says: \"Our city has been home to a rich and expressly democratic tradition of mural commissions .\" If you go Chronicles of San Francisco shows in the Roberts Family Gallery, which opened in May 2016 as part of the newly expanded museum. Included in the renovations are two other attractions well worth experiencing during a visit. The museum's colour-saturated toilets. Aviva Lowy The first is the fine-dining restaurant In Situ, under chef Corey Lee, who also owns the San Fran restaurants Monsieur Benjamin and the Michelin-starred Benu. He's described as the museum's \"food curator\" , an apt title as In Situ is a showcase of dishes contributed by 90 chefs from around the world. At our lunch, we \"travelled\" from Paris (red onion and coconut soup) to Copenhagen (raw lobster, yuzu cream and hibiscus) and Brazil (tapioca and cheese fritters). The current menu includes a recipe from <mark>Peter Gilmore</mark> of Quay in Sydney (smoked confit pig jowl, shitake, shaved sea scallop, Jerusalem artichoke leaves). It's a convenient way to taste the creations of the superstar culinary world without needing to score elusive reservations. The second treat is a visit to the bathrooms. The Norwegian architecture firm Snøhetta, which is responsible for the renovation, has created lavatories befitting their station. They have been described as works of art unto themselves \"and making the museum's art\" sing \". In response to the many stark white exhibition walls, the toilets on each floor are bright monochrome pops of colour, all red for one, all green, blue, purple or turquoise for the others. Floor to ceiling. Last year, they were shortlisted for the America's Best Restroom contest. Who knew there was such a thing? NEED TO KNOW The Chronicles of San Francisco is on until April 27, 2020. JR will give an artist's talk on September 27. San Francisco Museum of Modern Art 151 Third Street, open daily except Wednesdays. Share Print article License article Topics Photography Art Travel Destinations Life & Leisure Latest Stories Funding Employment Hero valued at $100m after $22m investment Employment Hero has secured a $22 million cash injection to build a\" WorkLife Passport' for workers to carry a digital footprint of their employment history. 9 mins ago Funding Silicon Valley investors pile into Aussie start-up An investment tech start-up called Jacobi, founded by a trio of Brisbane entrepreneurs, will hit the UK after scoring $11 million from US investors. 9 mins ago World politics Detained writer's wife banned from leaving China The wife of an Australian writer who has been detained in China for six months has been banned from leaving the country and was questioned by authorities for several hours on Sunday. 14 mins ago World election Greece's softly spoken new PM has a nation to convince Kyriakos Mitsotakis will have to persuade a sizeable chunk of the Greek population that he is up to the task of leading the exhausted nation into better times. 18 mins ago Most Viewed In Lifestyle Generation Dry is out and proud How to make the perfect excuse The power of art to invoke change After an \"overcrowded' Everest season, two climbers seek a new route Fire ruins 45,000 barrels of\" young whisky' The young head chef who restores cars on the side Jock Zonfrillo is creating a billion-dollar industry from native foods 6 dishes that define Australia at its most inventive What fashion can teach you about economics The beer-makers at Australia's wild frontier The great pointy-end points heist <mark>Jack Nicholson</mark>'s trick can work for leaders, too What Uber's CEO asks when hiring How Carsales chief sets himself up for the day Let's face it, email has had its day Where's Wally? JR chronicles the street life of San Francisco Horse riding is \"moving meditation' for this director A modern Japanese take on a pilgrim's path Racing Ferraris keeps this director on track On the hunt with a very hungry leopard Special Reports Driving income without taking too much risk Managing conflict the next step Managing wealth after retirement Dealing with the demographic challenge Technology boosting financial literacy", "articleID": "2019070803_00041238_W", "names": {"Diego Rivera": ["Q42868163", "Q58671627"], "Jack Nicholson": ["Q39792", "Q58917121"], "Peter Gilmore": ["Q238704", "Q7174243"]}}, {"date": "2019-07-09", "url": "http://northernstar.com.au/news/gus-roasts-maroons-champ-with-prediction/3774916/", "content": "<mark>Phil Gould</mark> on Channel 9's 100% Footy. Rugby League Gus roasts Maroons champ with prediction 9th Jul 2019 10:48 AM 0 Billy Slater could only shake his head and laugh after <mark>Phil Gould</mark> executed a brutal drive by on Monday night's episode of 100% Footy on Channel 9. <mark>Gould</mark> was holding court when the focus of the panel shifted to State of Origin Game 3 on Wednesday night when his prediction for how the series will be decided turned a torch on the contentious decision to award Slater the <mark>Wally Lewis</mark> Medal as the player of the series in 2018. Slater famously received Origin's top individual award despite only featuring in two matches in a series where the Blues wrapped up victory in the first two matches. <mark>Gould</mark> couldn't help himself on Monday night as he outlined by prediction that NSW will win the series decider at ANZ Stadium by just one point, thanks to a <mark>James Maloney</mark> field goal. When asked by host <mark>James Bracey</mark> about who will receive the medal in 2019, <mark>Gould</mark> responded: \"Billy Slater\". As the former Panthers supremo tossed his prediction card away, fellow panellists Paul Gallen and Slater erupted with laughter. \"You're not safe on this table,\" Slater said as he shook his head. Gus' prediction for #Origin Man of the Series; Billy Slater .?? He wasn't expecting that one .?? #100PercentFooty | 10.20 pm on @ Channel9 pic.twitter.com/lj4oy5SLsv--NRL on Nine (@ NRLonNine) July 8, 2019 It comes as a fresh report on Tuesday outlined the changes the NRL has made to the voting on the prestigious award following the farce of 2018. The Daily Telegraph reports that judges for the award - Mal Meninga, Laurie Daley and Darren Lockyer - will now only vote for players who turned out in all three Origin matches. The voting panel will also convene at the end of Game 3 to vote separately on a player of the series - rather than rely on the votes of the individual three matches. Billy Slater could only laugh. After Wednesday night's game three, the trio will vote for the man of the match. They will then be presented with a shortlist of eligible players for the man of the series. Those players will have to have played every game with Cameron Munster and Dane Gagai expected to lead Queensland's candidates, while NSW's contenders are shaping as James Tedesco and Jake Trbojevic, Tom Trbojevic and Damien Cook. It was revealed last month Blues coach Brad Fittler was still angry about the decision to hand the 2018 gong to Slater. The Sydney Morning Herald's <mark>Andrew Webster</mark> told Macquarie Sports Radio, Fittler was seething at the decision to award Slater the top individual honour. \"I just know after seeing Freddy in the rooms after last year, he was filthy,\" <mark>Webster</mark> said. \"He was absolutely filthy that Billy Slater got it .\" Damien Cook, Boyd Cordner and James Tedesco were all thought to have been the clear favourites for the award, but the voting anomaly allowed Slater to sneak past the Blues stars. More Stories Maroons star out after bizarre backflip premium_icon Slater clause: NRL acts to avoid a silly Billy medal premium_icon Ferguson's vow if Blues win Origin decider More Stories Maroons star out after bizarre backflip premium_icon Slater clause: NRL acts to avoid a silly Billy medal premium_icon Ferguson's vow if Blues win Origin decider 0 editors picks Read More Login to follow gus <mark>gould</mark> Read More Login to follow maroons Read More Login to follow state of origin Read More Login to follow editors picks gus <mark>gould</mark> maroons state of origin", "articleID": "2019070900_00181811_W", "names": {"Andrew Webster": ["Q29033785", "Q4758866"], "James Bracey": ["Q27915120", "Q6130103"], "James Maloney": ["Q17386312", "Q25708309", "Q3161249"], "Phil Gould": ["Q7181928", "Q7181933"], "Wally Lewis": ["Q18218165", "Q3565555"]}}, {"date": "2019-07-10", "url": "https://neconnected.co.uk/news-from-british-basketball-league-raiders-offer-tyrell-johnson-professional-start/", "content": "News from British Basketball League: Raiders offer <mark>Tyrell Johnson</mark> Professional Start Posted by Dave Stopher | Jul 10, 2019 | Sports | 0 | Rookie <mark>Tyrell Johnson</mark> is Coach <mark>James</mark>' fourth signing and eighth addition for the 19/20 season, he will begin his professional career in Plymouth after graduating from Appalachian State University. Standing at 6' 8 <mark>Tyrell</mark> had an impressive senior year at App State with 9 points and 4.1 rebounds per game, finishing with a shooting percentage of 48.4% from the field. The American forward had a season high 20 points against Howard in April 2018 also picking up 8 rebounds and shooting 8 from 12 from the field in the game. Across the season his defensive effort also showed with 28 blocks,11 steals and 91 defensive rebounds in 31 games. <mark>Tyrell</mark> will join Raiders from his hometown in Atlanta, Georgia and will pull on the green jersey for the 19/20 season, ahead of the start of his professional career <mark>Tyrell</mark> said: \"I am excited about being a part of the Plymouth Raiders Team .\" After speaking with Coach <mark>Paul James</mark>, it brought even more excitement for the upcoming season. \"It is a great opportunity to showcase my talent on the basketball court at a professional level .\" I look forward to continuing to improve upon Coach <mark>James</mark> resume with another successful season. \"Since his time with Raiders, Coach <mark>James</mark> has given opportunities to a series of rookies, trusting in their talents and allowing them to perform on a big stage. With <mark>Tyrell</mark> the first rookie to join the ranks this season he said:\" I'm pleased with the signing of <mark>Tyrell Johnson</mark> for the coming season. \"He is a talented player who has great athletic ability and can score in many different ways as well as rebound the ball efficiently .\" I'm excited about seeing <mark>Tyrell</mark> play in multiple positions for us at both ends of the court. \"I think his game is very well suited to the BBL and I'm looking forward to him joining up with the rest of the team and getting down to the business of starting his pro career .\" Share:", "articleID": "2019071011_00071124_W", "names": {"Paul James": ["Q1558855", "Q3898091", "Q503399", "Q53997267", "Q5827750", "Q7151541", "Q7151542", "Q7151543", "Q7151544", "Q7151545"], "Tyrell Johnson": ["Q56556763", "Q7861487"]}}]