[{"date": "2019-07-10", "url": "http://stalbertgazette.com/national-business/high-dividend-yields-due-to-cheaper-shares-spook-investors-say-oil-and-gas-ceos-1578641", "content": "National Business High dividend yields due to cheaper shares spook investors, say oil and gas CEOs CALGARY--Mid-sized Alberta oil and gas producers say their share prices have fallen so low that investors are starting to worry their rising dividend yields are becoming unsustainable. Jul 10, 2019 3:12 PM by: Canadian Press CALGARY--Mid-sized Alberta oil and gas producers say their share prices have fallen so low that investors are starting to worry their rising dividend yields are becoming unsustainable. The irony is that his Calgary-based company has no intention of reducing its monthly payouts to shareholders, which it has hiked three times in the past three years, said CEO Grant Fagerheim of Whitecap Resources Inc. \"I think there is a disconnect (in the market),\" said Fagerheim on Wednesday after taking part in a panel discussion at the TD Securities Calgary Energy Conference. \"There is no risk that we'll be decreasing our dividend. If anything, we'll be increasing it on a go-forward basis .\" A company's dividend yield is determined by comparing its regular payouts per share with its current share price--when the price goes down, the yield goes up. Nothing else has changed for the company but Whitecap's share price has fallen along with many other oil and gas producers, said Fagerheim, a situation he blamed on worries about regulatory uncertainty and pipeline delays in Canada. Whitecap shares are off by almost 30 per cent in the past three months and its dividend yield has jumped from about six per cent to eight per cent as a result, much higher than its more typical four to six per cent. There's little reason for concern about cuts in payouts for many of the dividend-paying intermediate companies he covers, said Adam Gill, an energy analyst for Eight Capital Research. \"At US $50 (per barrel), maybe some of the dividends are a little out of the sustainability range but at a US $60 oil price like we're seeing today, a lot of these companies are safe and offering a pretty good yield,\" he said. CEO <mark>Tony Marino</mark> of Vermilion Energy Inc. says he is seeing similar investor worries as his company's share price fell by 16 per cent over the past three months, boosting its yield to almost 10 per cent from about eight per cent. He said a dividend cut is \"not something we're even entertaining .\" Enerplus Corp. could \"easily afford\" to increase its dividend but the low value of its shares--down 20 per cent in the past three months--makes buying them back and cancelling them a compelling alternative use for the company's free cash flow, said CEO Ian Dundas. The company reported buying back $35 million of its stock in the first five months of the year. It has regulatory approval to buy back an estimated $190 million worth in the 12 months ended next March.", "articleID": "2019071022_00126968_W", "names": {"Tony Marino": ["Q29013247", "Q7822875"]}}, {"date": "2019-07-11", "url": "http://www.gazette-news.co.uk/news/national/17764814.carl-sargeant-s-family-claim-politics-play-inquest/", "content": "Carl Sargeant's family claim \"politics at play' during his inquest By Press Association 2019 Carl Sargeant inquest 0 comment The family of Welsh politician Carl Sargeant has hit out at attempts to\" blacken \"his name as an inquest into his death concluded. Alyn and Deeside AM Mr <mark>Sargeant</mark>, 49, was found hanged at his home in Connah's Quay on November 7 2017, four days after he was sacked from his job as Cabinet Secretary for Communities and Children following\" bombshell \"sex claims he groped and touched women. On Thursday, senior coroner for North Wales (East and Central) John Gittins ruled his death was suicide. Carl Sargeant's son <mark>Jack</mark> and wife Bernadette (Andy Kelvin/PA) He issued a report for the prevention of future deaths to the office of the First Minister after raising concerns about the support available for ministers who lose their posts. Mr Gittins said:\" I'm concerned that not enough has been done by the Welsh Government to ensure that in the future, regardless of who is first minister, consideration is given to providing clear channels of support and help to persons who lose their positions from office and whose removals will attract significant media interest and intrusion into their private lives. \"The hearings at Ruthin County Hall have included former First Minister Carwyn Jones being accused by the family's lawyer of lying over the pastoral care provided to Mr <mark>Sargeant</mark> before his death. Several attempts were made by lawyers for the office of the First Minister to introduce evidence about the allegations against Mr <mark>Sargeant</mark>. Former first minister Carwyn Jones before an earlier hearing at Ruthin County Hall (Andy Kelvin/PA) Speaking outside court following the conclusion, Mr <mark>Sargeant</mark>'s son <mark>Jack</mark> said at times the inquest had felt like a criminal trial. He said:\" All too often politics have been at play with the sole aim of blackening a dead man's name to protect another. Where has been the humanity in that? \"I do feel dad was certainly let down by the former first minister Carwyn Jones .\" Carwyn Jones said on the stand himself he was a friend, my only statement to that is I can't see myself letting down a friend the way he let down his. \"Neil Hudgell, solicitor for the family, said:\" We have seen a puppetmaster that has used the public purse to pursue his own ends without any regard for wider mental health considerations. \"As he began delivering his conclusions, Mr Gittins told the court:\" The twists and turns of the journey, at times along the murkiest paths into the world of politics, has been a challenge. \"He referred to evidence given by Mr <mark>Jones</mark> about pastoral care, which was contradicted by Vale of Clwyd AM <mark>Ann Jones</mark>. Mr Gittins said:\" I accept he had erred in his original evidence to me and that he properly and appropriately corrected his error, albeit only once the true picture came to light by virtue of the information provided by <mark>Ann Jones</mark>. \"He said no official arrangements were put into place to provide support to Mr <mark>Sargeant</mark> after he lost his post, despite the probability Mr <mark>Jones</mark> knew he was vulnerable in relation to his mental health, having previously been diagnosed with depression. He said:\" Regardless of the reason for the loss of his position in Government, the effect of removal from office was that Mr <mark>Sargeant</mark>'s mental health deteriorated significantly. \"Solicitor Neil Hudgell (left) with Bernadette and <mark>Jack Sargeant</mark> (Eleanor Barlow/PA) Giving evidence on Tuesday, Mrs <mark>Sargeant</mark> said her husband had been\" shell-shocked \"by the allegations and said she had believed him\" 100% \"when he denied them. A spokesman for current First Minister Mark Drakeford said:\" I extend my deepest condolences to the <mark>Sargeant</mark> family. I know they continue to grieve for Carl. \"The coroner has made a regulation 28 report to the Welsh Government in relation to the prevention of future deaths and we will consider this carefully and respond in full .\" In a statement posted on Twitter, Mr <mark>Jones</mark> said: \"The nature of these proceedings has meant that there appeared to be two sides in this matter and whilst it is right that arguments are tested, the process has driven an unnatural wedge between people who remain united at the very least in their ongoing shock, trauma and grief .\" Nobody wanted this and nobody could have foreseen it. \"Suicide is a shattering experience and I hope some healing can now begin .\" 0 comment", "articleID": "2019071115_00021964_W", "names": {"Ann Jones": ["Q21996757", "Q259356", "Q4766478", "Q4766480", "Q56596836", "Q59122411"], "Jack Sargeant": ["Q47995095", "Q6115005"]}}, {"date": "2019-07-16", "url": "https://www.wokv.com/news/national-govt--politics/man-whose-family-died-boeing-737-max-crash-scrap-the-jet/rTDvgPoCF27oiU4Gkdb26O/", "content": "Man whose family died in Boeing 737 Max crash: Scrap the jet Photo Credit: AP Photo/Mulugeta Ayene FILE - In this March 11, 2019, file photo, rescuers work at the scene of an Ethiopian Airlines flight crash near Bishoftu, or Debre Zeit, south of Addis Ababa, Ethiopia. Paul Njoroge, who lost his wife and three young children in the March 10 crash of an Ethiopian Airlines' Boeing 737 Max 8 aircraft, believes Boeing should scrap the 737 Max, and he wants the company's top executives to resign and face criminal charges for not grounding the plane after a deadly accident last October. On Wednesday, July 17, Njoroge will be the first relative of any of the 346 passengers who died in those crashes to testify before Congress. (AP Photo/Mulugeta Ayene) Man whose family died in Boeing 737 Max crash: Scrap the jet By: AP Airlines Writer July 16 2019 3:18 AM Updated: July 16 2019 3:18 AM Photo Credit: AP Photo/Mulugeta Ayene Paul Njoroge says he believes Boeing should scrap the 737 Max, and he wants the company's top executives to resign and face criminal charges for not grounding the plane after a deadly accident last October. Five months after that crash, Njoroge's wife and three young children were killed when another 737 Max went down near Addis Ababa, Ethiopia, shortly after takeoff. If Boeing and the Federal Aviation Administration had done their jobs properly, Njoroge told The Associated Press, \"these planes would have been grounded in November and today I would be enjoying summer with my family, I would be playing football with my son .\" On Wednesday, Njoroge (ja-ROW-ga) is due to be the first relative of any of the 346 passengers who died in those crashes to testify before Congress. He will be accompanied by <mark>Michael</mark> Stumo, whose daughter, Samya, also died in the March 10 crash of an Ethiopian Airlines 737 Max. In testimony he submitted to the House aviation subcommittee, Njoroge says passengers' families have several demands that must be met before the Max is allowed to fly again, including a new, top-to-bottom review of the plane by regulators. In an interview, Njoroge went further, saying the plane should never fly again because of what he considers an irredeemable design flaw. Because the size and placement of the plane's engines raised the risk of an aerodynamic stall, Boeing devised flight-control software called MCAS. Preliminary reports indicate that the software pushed the nose of the plane down in both crashes, and Boeing is working on changes to make MCAS more reliable and easier to control. Boeing did not tell pilots about MCAS until after the first crash, in October off the coast of Indonesia. \"They didn't want people to know about the design flaw, and that's why they kept the existence of MCAS hidden,\" Njoroge said. \"I'd like to see (Boeing CEO) Dennis Muilenburg and the executives resign, because they caused the deaths of 346 people,\" Njoroge said. \"They should be held liable criminally for the deaths of my wife and my children and my mom-in-law and 152 others in the crash of Ethiopian Airlines flight 302 because that was preventable .\" Chicago-based Boeing said it lamented the impact that the crashes are having on families of those on board. \"These incidents and the lives lost will continue to weigh heavily on our hearts and on our minds for years to come,\" the company said in a statement. \"We are committed to working with the communities, customers and the aviation industry to help with the healing process .\" Njoroge was born in Kenya and now lives in Toronto, where he works as an investment professional. A Chicago aviation lawyer, <mark>Robert Clifford</mark>, sued Boeing on his behalf over the deaths of his wife, Carol, his son and daughters, 6-year-old Ryan, 4-year-old Kelli and 9-month-old Rubi, and his wife's mother. They were on their way to visit family in Kenya when their Nairobi-bound plane crashed shortly after takeoff on March 10. Njoroge accused Boeing of trying to shift blame to foreign pilots in Indonesia and Ethiopia to avoid grounding the Max, which he called \"utter prejudice .\" After the Oct. 29 crash involving Indonesia's Lion Air, Boeing issued a bulletin to pilots reminding them about Boeing instructions for handling a nose-down pitch of the plane. After the Ethiopian crash, Muilenburg said the pilots did not completely follow the procedures. The preliminary report indicated the Ethiopian pilots tried the procedures nearly until the end but could not save the plane, and they were flying extremely fast. Muilenburg has repeatedly apologized in public to families of the passengers. Njoroge said he has not received personal condolences. \"It would be very important if Boeing executives can meet with the family members in person and apologize to them,\" he said. \"That would help .\" Wednesday's hearing will be the House aviation panel's third on the Max, which has been grounded worldwide since March. Other witnesses will include representatives from the National Transportation Safety Board and unions representing pilots, flight attendants, airline mechanics and safety inspectors. ___ David Koenig can be reached at http: //twitter.com/airlinewriter Related Man whose family died in Boeing 737 Max crash: Scrap the jet Photo Credit: AP Photo/Teresa Crawford, File FILE - In this April 29, 2019, file photo, Paul Njoroge, who lost his wife and three young children in the March 10 crash of an Ethiopian Airlines' Boeing 737 Max 8 aircraft, speaks at a news conference in Chicago. Njoroge believes Boeing should scrap the 737 Max, and he wants the company's top executives to resign and face criminal charges for not grounding the plane after a deadly accident last October. On Wednesday, July 17, Njoroge will be the first relative of any of the 346 passengers who died in those crashes to testify before Congress. Read More The Latest News Headlines Man indicted on murder charge in death of girlfriend's toddler son, claims boy slipped from his hands A Tennessee man was indicted on first-degree murder charges after his girlfriend's 2-year-old son was taken to the hospital and later died .>> Read more news stories <mark>Alan Johnson</mark>, 41, of Memphis, was taking care of the child while his mother was at work on Oct. 10, 2018, according to officials. He told investigators he was throwing the 2-year-old up in the air and catching him, but the boy slipped on the last throw, authorities said. According to investigators, <mark>Johnson</mark> said he swung the child--identified as Dylan Meeks--to \"keep him from hitting the ground .\" He said he saw the boy's neck go back and noticed he was not responding, so he called police, authorities said. The child died two days later. The staff at Le Bonheur Children's Hospital told police that the injuries, which included a skull fracture, brain swelling, internal injuries and rib fractures, were not consistent with <mark>Johnson</mark>'s story. The medical examiner found new and healing fractures of the child's ribs and also lacerations of several organs. <mark>Johnson</mark> was later charged with murder. He was indicted Monday on charges of first-degree murder in the perpetration of aggravated child abuse and neglect. <mark>Johnson</mark> is being held without bond in the Shelby County Jail. Pennsylvania man charged with homicide in death of girlfriend's 11-month-old daughter Police have apprehended a Pennsylvania man wanted on charges related to the death of his girlfriend's infant daughter, authorities said .>> Read more trending news Pennsylvania State Police confirmed that Derrick Bass, 29, was arrested in Ohio on Monday, two days after the 11-month-old was found dead in a Pack \"n Play at an apartment complex in East Huntingdon Township, Pennsylvania. He has been charged with homicide. The baby's mother told police that Bass was supposed to be watching her daughter and his two children. He also was supposed to pick her up from work, but never showed up, she told police. When the girl's mother got home, she noticed her daughter and various electronic items were missing, according to a complaint. She called police shortly after 11 p.m. Police responded to the apartment shortly after 12:30 a.m. after the mother reported finding her daughter unresponsive in the Pack\" n Play, the complaint said. She did not see her until that time because the baby was covered in blankets, according to the complaint. Family identified the girl as 11-month-old Niomie Miller. An autopsy was conducted Sunday morning, and the preliminary cause of death was determined to be drowning, authorities said. Congresswomen targeted by Trump call tweets \"xenophobic, bigoted remarks' The four high-profile liberal Democratic congresswomen targeted by President Donald Trump this weekend on social media responded Monday afternoon in a news conference, calling Trump's tweets\" xenophobic, bigoted remarks. \">> Read more trending news Democratic Reps. Ayanna Pressley (D-Massachusetts), Rashida Tlaib (D-Michigan), Alexandria Ocasio-Cortez (D-New York) and Ilhan Omar (D-Minnesota) responded to Trump's attack that they should\" go back and help fix the totally broken and crime-infested places from which they came, \"by calling for Trump's impeachment. Trump's comments were\" a disrupted distraction, \"Pressley said. She said she wants to focus on the issues her constituents sent her to Washington to address, such as immigration reform and health care, but she said it was important to respond to the president. Calling Trump\" callous \"and\" corrupt, \"Pressley said that despite the\" occupant of the White House trying to marginalize us, we cannot, we will not be silent. \"\"I will always refer to him as the occupant as he is only occupying space .\" Omar called Trump's remarks \"a blatantly racist attack on four duly elected members\" of Congress, all women of color. \"This is the agenda of white nationalists. Whether it is happening in chat rooms, or it is happening on national TV, and now it's reached the White House garden,\" she said. She agreed with Pressley, calling for Trump's impeachment. The lawmakers took several questions at the end of their statements. Three of the lawmakers were born in the United States. Omar, who was born in Somalia and came to the U.S. when she was 12 and is now an American citizen, was asked to reply to Trump's accusation that she's a communist and supports al Qaeda. \"I will not dignify that with an answer,\" she said. Trump tweeted during the news conference, saying Democrats were \"forced to embrace them,\" apparently referencing the party's support of the lawmakers he attacked. \"The Dems were trying to distance themselves from the four\" progressives, \"but now they are forced to embrace them. That means they are endorsing Socialism, hate of Israel and the USA! Not good for the Democrats!\" Trump said. The House plans to introduce a resolution this week condemning the president's attacks. Trump doubled down this morning on his remarks about the four Congresswomen, telling reporters gathered at the White House that criticism of his comments \"doesn't concern me because many people agree with me .' He said Ocasio-Cortez, Tlaib, Omar and Pressley are\" very unhappy' and \"hate our country .'\" I'm watching them--all they do is complain,' Trump said. \"So, all I'm saying is, if they want to leave, they can leave. Pelosi: Democrats to vote on condemning Trump's\" xenophobic' attacks on minority congresswomen House Democrats plan to introduce a resolution this week condemning President Donald Trump after he attacked four high-profile liberal Democratic congresswomen of color over the weekend, saying they should \"go back' to the countries they came from, according to multiple reports .>> Read more trending news In a letter sent Monday to fellow Democrats and obtained by Politico, House Speaker Nancy Pelosi said Trump\" went beyond his own low standards using disgraceful language' in his attacks on Rep. Alexandria Ocasio-Cortez (D-NY), Rep. Rashida Tlaib (D-MI), Rep. Ilhan Omar (D-MN) and Rep. Ayanna Pressley (D-MA). She called the president's comments \"xenophobic' and said they were\" meant to divide our nation .' \"This morning, the President doubled down on his attack on our four colleagues, suggesting they apologize to him,' she wrote .\" Let me be clear, our Caucus will continue to forcefully respond to these disgusting attacks .' Pelosi said the resolution will be sponsored by Polish-born Rep. Tom Malinowski (D-NJ) and Rep. Jamie Raskin (D-MD).>> Read the latest from our Washington Insider, Jamie Dupree The president brushed off criticism Monday, telling reporters gathered at the White House that condemnation of his tweets \"doesn't concern me because many people agree with me .' He said Ocasio-Cortez, Tlaib, Omar and Pressley are\" very unhappy' and \"hate our country .'\" I'm watching them--all they do is complain,' Trump said. \"So, all I'm saying is, if they want to leave, they can leave .' Trump set off a firestorm Sunday with a series of tweets attacking the freshmen congresswomen without naming them .\" So interesting to see \"Progressive' Democrat Congresswomen, who originally came from countries whose governments are a complete and total catastrophe, the worst, most corrupt and inept anywhere in the world (if they even have a functioning government at all), now loudly an viciously telling people of the United States, the greatest and most powerful Nation on earth, how our government is to be run,' Trump wrote .\" Why don't they go back and help fix the totally broken and crime infested places from which they came .' Of the congresswomen targeted in Trump's tweets, only one, Omar, was born outside the U.S. Omar was born in Mogadishu, Somalia, according to The Washington Post. Her family fled civil war in the country when she was a child, and she became a U.S. citizen when she was a teenager, the newspaper reported. Ocasio-Cortez was born in New York, Tlaib was born in Detroit and Omar was born in Cincinnati, according to the Post. It's not the first time Trump has been accused of holding racist views. In his campaign kickoff in June 2015, Trump deemed many Mexican immigrants \"rapists .\" In 2017, he said there were good people on \"both sides\" of the clash in Charlottesville, Virginia, between white supremacists and anti-racist demonstrators that left one demonstrator dead. Repeatedly, Trump has painted arriving immigrants as an \"infestation,\" and he has been slow in condemning acts of violence committed by white supremacists. He also launched his political career with false claims that President Barack Obama was not born in the United States. The Associated Press contributed to this report. Jersey cop who overdosed on heroin in patrol car pleads guilty, loses job New Jersey police dispatchers could not get a response from Franklin Township patrol Officer Matthew Ellery early one morning in April, so they sent another officer--who happened to also be a paramedic--to his last known location. Ellery's fellow officer saved his life as he overdosed on heroin in the driver's seat of the patrol car. Ellery, 29, of Middlesex, on Friday pleaded guilty to possession of a controlled dangerous substance and driving while intoxicated, according to the Somerset County Prosecutor's Office. As part of his plea, he will apply for admission into a five-year drug court-based treatment program. Failure to complete the progra would result in three to five years in New Jersey State Prison .>> Read more trending news Ellery, who NBC News reported had been an officer since August 2016, also agreed to forfeit his position as a police officer. His driver's license will be suspended for seven months. Somerset County Prosecutor <mark>Michael Robertson</mark> said in a statement that Ellery was on duty just after 1 a.m. April 7 when dispatchers could not reach him. When his fellow officer found him, he was parked in the driveway of a business. Ellery was unresponsive in the driver's seat of the car. \"The responding officer, who is also an EMT (emergency medical technician), determined that defendant Ellery was experiencing an opiate overdose because he was cyanotic, had no carotid pulse and was not breathing,\" <mark>Robertson</mark>'s statement read. \"The officer removed defendant Ellery from the vehicle and administered two doses of naloxone to him. After receiving the two doses of naloxone and before the officer could commence CPR, defendant Ellery regained consciousness .\" Naloxone, also known by the brand name Narcan, is a drug that can rapidly reverse the effects of an overdose of opioids, such as heroin, fentanyl and pain pills like hydrocodone and oxycodone. According to the National Institute on Drug Abuse, the drug works as an opioid antagonist. It binds to the opioid receptors in a person's brain and blocks or reverses the effects of the drug causing the overdose. \"It can very quickly restore normal respiration to a person whose breathing has slowed or stopped as a result of overdosing with heroin or prescription opioid pain medications,\" the institute's website says. Naloxone, which can be injected or administered via a nasal spray, has become a tool carried by police officers, deputies and paramedics across the country as they see a drastic uptick in opioid overdoses. Some states are also training civilians, including librarians, to administer the drug and some pharmacies will sell naloxone over the counter to customers, including chronic pain patients, at risk of an accidental overdose. Watch the video at the bottom of this story to learn more about how to obtain naloxone. The online reaction to Ellery's plea, for which he will be sentenced next month, was mixed on the Facebook page of the county prosecutor's office. Some posters noted that, when naloxone was first made available in the area, comments flooded the page stating that \"junkies shouldn't be saved .\" \"Guess what?\" one man wrote. \"It's possible to be aggravated at this officer,\" cause he's out arresting people for drugs while on drugs himself, but still have sympathy for him as a human being and what he's going through. \"Others offered Ellery prayers and well wishes that he can get the treatment he needs .\" Addiction can happen to anyone, even you, because it does not discriminate, \"one woman wrote. Another woman described addiction as a monster that affects everyone in the addict's family .\" I hope he can get the help he needs. Heroin is a killer, \"the woman wrote .\" This probably saved his life. \"", "articleID": "2019071607_00082170_W", "names": {"Alan Johnson": ["Q19560876", "Q2830527", "Q332336", "Q4706980", "Q4706981", "Q4706983", "Q4706984", "Q4706985"], "Michael Robertson": ["Q11778392", "Q16222420", "Q16222421", "Q320406", "Q6833913", "Q6833915"], "Robert Clifford": ["Q21165610", "Q40133440"]}}, {"date": "2019-07-16", "url": "http://www.gamereactor.eu/?system=pc&sid=fe566ae8cf93bb2b4604c591b364a712", "content": "PC Alfonso John Romero quenches our thirst for details by explaining the mechanics that underpin Brenda Romero's long-awaited strategy game. Review Written by <mark>Sam Bishop</mark> on the 16th of July 2019 at 08 They've been signed just in time for CWL Miami, with the Championships just around the corner too. 0 Written by <mark>Sam Bishop</mark> on the 16th of July 2019 at 08 Details on the schedule and matchups have been revealed, with 64 streamers battling it out for supremacy. 0 Devotion studio had \"no intent to stage a publicity stunt\" Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 16:16 The developer has released a statement on the game, revealing that they will not be re-releasing it in the \"near term\". 0 Monster Hunter World's Iceborne DLC will deliver more difficulty Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 15:03 Capcom received feedback from fans who wanted a tougher challenge, and some changes are coming in to make sure that happens. 0 Cyberpunk 2077 won't let you fight story NPCs or children Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 14:30 You're free to hassle most people in CD Projekt Red's RPG, but there are a few exceptions in this dystopia. 0 Dota Underlords gets Proto Pass in beta Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 13:58 This is to test the battle pass system in time for Season 1, and Valve is looking for your feedback on the feature. 0 Gears 5 to feature 60Hz servers Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 13:52 A whole load of multiplayer details were revealed at the weekend, including the removal of core and competitive tunings. 0 Finishers like \"combat emotes\" in Destiny 2: Shadowkeep Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 13:24 Mark Noseworthy and <mark>Luke Smith</mark> explain these moves in a bit more detail, including the gameplay-altering affects they might have. 0 Stranger Things 3: The Game is on today's stream Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 11:31 We dive into the video game adaptation of the latest series, taking us back into the scary sci-fi adventure. 0 New PUBG video gives insight into anti-cheat measures Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 11:15 PUBG Corp. is using various methods to tackle hacking in their game, from machine learning to international partnerships. 0 Watch us battle through Just Cause 4's Los Demonios DLC Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 10:10 We unleashed an ancient evil on Solís last week, and stepped in to rid the land of the parasite pests. 0 Rebellion: Epic \"paying through the nose to build their store\" Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 09:53 <mark>Jason Kingsley</mark> spoke about striking a deal with the company for Zombie Army 4 after saying they'd need a \"bloody good deal\" to do so. 0 Nicolas99FC wins as last 32 FIFA eWorld Cup Finals players confirmed Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 09 They will all be heading to London's O2 Arena next month, where the best of the best will collide. 0 Ellivote and LullSiSH join Washington Justice Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 09 The Swedish players join a side with poor results in Stage 3 of the Overwatch League, consisting of Korean and American players. 0 Astralis parts ways with Rfrsh Entertainment Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 08 The decorated CS: GO team has gone their own way, and an alleged leaked email has emerged indicating this was on the cards for a while.", "articleID": "2019071607_00228980_W", "names": {"Jason Kingsley": ["Q24007513", "Q29033914"], "Luke Smith": ["Q13512824", "Q16233583", "Q16853339", "Q17048712", "Q20713853", "Q22097885", "Q55621442"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-07-17", "url": "http://vibe.com/2019/07/rick-ross-port-of-miami-2-release-date", "content": "R. LUM. R Shares Visuals For New Single \"How This Feels\" With his forthcoming debut album set to drop this fall, R & B artist R. LUM. R released his latest single and paired visual \"How This Feels\" on Friday (July 12). He recently inked a deal with Island Records earlier this year, and his new track \"builds on the momentum\" the entertainer has achieved since he first climbed into the music scene with his breakout single \"Show Me .\" The Florida-born singer delivers vulnerable lyrics and piercing falsettos in the songs hook when asks, \"So can we be real/About how this feels?\" As he goes back and forth from guitar chords to nocturnal R & B, R. LUM. R's latest melody lights a fire into his next chapter in the music industry. The opening scene of the visual shows the vocalist staring at a burning old-school Cadillac set on fire. The picturesque film continues into the opening verse on owning up to intimate feelings and connections that could be conflicting or dangerous if pursued. \"I don't wannalead us in the wrong direction/Force or fake a feeling cause we both need affection/End up co-dependent cause we can't deal with depression/The way we need / So can we be real? / About how this feels,\" he croons. \"With this first visual, I wanted to make sure to do something more striking and interesting than I've ever done that makes you feel the isolation that is so felt in the music,\" he said in a statement. \"I think we did it with\" How This Feels,' \"His widely successful single\" Frustrated \"reached Top 10 at Urban AC Radio in 2017. Most recently he released his project AFTERIMAGE, which reached over 100 million global artist streams .\" I really believed in what Erykah Badu used to say about music, \"Once I release it into the world, it's no longer my story .' Once the audience listens to it, it's their story. I can't wait to see how people interpret it. There's growth to be done, and you don't have to be afraid of it .\" Listen to \"How This Feels\" up top. Continue Reading The Dreamville Records roster - Lute, Omen, <mark>J. Cole</mark>, Ari Lennox, WoWGr8 of EarthGang (above), Cozz (below), JID, Bas (standing), Olu of EarthGang (kneeling) - pose for a photo from the Return of the Dreamers 3 sessions at Tree Sound Studios in Atlanta, Ga.. Jonathan Mannion / Courtesy of Interscope Records Revenge of the Dreamers III: The Top Seven Artists Who Stood Out The much-awaited Revenge of the Dreamers III compilation album was released this past Friday (July 5), and it exceeded all expectations, and then some. The first two records of the trilogy predominantly featured Dreamville acts, and their in-house producers. However, this time <mark>J. Cole</mark>'s label shed their reputation of sectioning themselves off from the rest of the industry and embraced artists and producers from outside of their circle. The melodic, often raspy, only occasionally recognizable voices of the 32 rappers and singers featured on the 18-track album, echo throughout the project. As was expected, <mark>J. Cole</mark> spit lots of great verses, but the the other emcees certainly weren't masked by his shadow. In fact, <mark>Cole</mark> gave ample room for the young bloods on ROTD3 to showcase their clever lines, their vocal range, and their artistry as a whole. While it was hard to narrow down which artists on ROTD3 were the best, there are several on the project who stood out and earbed than a couple of rounds of applause. The five have yet to achieve chart-topping status, but after their performance on ROTD3, that achievement isn't far away. 1. Buddy Buddy proclaimed himself the \"Rap Camp MVP,\" and his praise was validated by the Dreamville documentary and the record itself. The 25-year-old's valley voice can be heard on three songs off the project and he was unlike anyone else, bringing an eccentric vibe to the songs he was featured on. In fact, Buddy's one of the best parts on the album's standout song, \"1993\" and he didn't even rap on it. Hearing Buddy playfully cut off and hound Smino, Cozz, Doctur Dot (EarthGang), J.I.D and <mark>Cole</mark> himself, so they could focus on more important things such as smoking weed, brought a carefree element to ROTD3. Some may not expect such jovial vibes from the usually thoughtful Dreamville camp. Like <mark>Cole</mark> said, Buddy is \"a real life legend .\" 2. J.I. D J.I.D. is quickly becoming one of Dreamville's most recognizable acts, and it's easy to see why he was featured on five different songs on the album, more than any other artist on ROTD3 aside from <mark>Cole</mark>. He represented his hometown of Atlanta effortlessly, especially on the lead-up single \"Down Bad,\" where his voice--unique as ever--uplifts the chorus. He's hard to keep up with and he's always quick with his rhymes, but there's no reason why J.I.D should have to slow down. With a style similar to Kendrick Lamar's, J.I. D's destination to the top is inevitable, and the quicker he gets there, the better. After all, who else could have came up with the bars: \"I was just f *** ed up, I was just down, down bad/I had to tighten the f ** k up, but I'm here for the crown/Board of Education vs. Brown/I was bored of education, left the town/F ** k a résumé and f ** k a cap and gown/F ** k a background check back' round when I get the check/N *** a, that's now .\" 3. <mark>J. Cole</mark> Dreamville founder <mark>J. Cole</mark> always carries high expectations with him, and he showed out with his seven appearances - more than any other artist - on ROTD3. The project saw <mark>Cole</mark> working differently from usual, but he displayed adaptability and flourished outside of his comfort zone. On \"1993,\" fans hear a version of <mark>Cole</mark> that he often keeps hidden--a fun, wild side that keeps up with the the carefree energy of the younger rappers on the track. For those other listeners who were itching to hear old school <mark>Cole</mark> from his Born Sinner days, he brought that out on the song \"Sacrifices .\" Sure, the North Carolina native can be the butt of Twitter memes--but who else can go platinum with no features--but every time he shows up, he shows out and shows the rap industry why Dreamville is such a force. 4. EarthGang Doctur Dot and Johnny Venus are two most versatile rappers on ROTD3, and together they form one of the most formidable groups in hip hop. While their verses are crafty, it's not so much their rhymes that command a song, but rather the way they play with and control their voices. Both Doctur Dot and Johnny Venus have a talent for manipulating the tone and range of their vocal chords, and that is especially evident in \"Swivel,\" their song on the album. They bring a unique sense of quirkiness to each appearance, and when they link up with the equally unconventional Buddy or Smino, magic happens. 5. Guapdad4000 Guapdad4000 is largely known for his hilarious viral social media videos or for his songs about scamming, but he took Revenge of the Dreamers III as an opportunity to show off his musical talents at a high level. He told VIBE, \"I felt that I wasn't going to go down there and outrap the super rap rap ni ** as, even though talent-wise, I am a super rap rap ni ** a....My plan was to just be true to myself, let my tone carry .\" The Oakland artist does exactly that, turning in two of the best choruses on the album with \"Don't Hit Me Right Now\" and \"Costa Rica .\" His airy vocals and catchy, earworm hooks hold together the songs he appears on. And he also briefly bars up on \"Wells Fargo .\" Guapdad4000 is hilarious, but his skills are nothing to joke about. 6. Cozz Cozz is Dreamville's youngest member at 25 years old, joining the label in 2014 and reintroducing himself to the world on ROTD3. Although he has two projects already released under Dreamville, this is without a doubt the biggest \"stage\" he's ever been on and he took advantage of it. The Los Angeles native was bold on this album with his record featuring Top Dawg Entertainment artist, Reason, called \"LamboTruck\" and speaks to his artistry. He's a risk taker, a big one at that given the fact that the Kal Banx-produced song is him expressing a few frustrations he has with his label. Every bar Cozz let off on the track was crafty and clever, which is definitely a strength of his, and as a listener it was entertaining figuring out the underlying meaning. Cozz is not one to be slept on, and it's about time is welcomed into the new class of young rappers. 6. Ari Lennox Lately touted as the \"First Lady of Dreamville,\" Ari Lennox can always be counted on to bring heart and soul to any project she touches. Her syrupy, raspy voice was the perfect touch to ROTD3 to make it whole and her heartfelt lyrics were the cherry on top. On \"Got Me,\" which was a single released prior to the album's drop date, fans can hear the DMV songstress harmonize effortlessly with features king, Ty Dolla $ign. \"Self Love\" is a relatable ballad that strikes a chord with people every time Lennox croons, \"self love is the best drug/but your love is the worst drug .\" With her own debut album Shea Butter Baby already making big waves this year, plus her features on ROTD3, Lennox is taking the R & B world by storm, and she'll let it rain on anyone who lets her. Young Thug And Mason Ramsey Hop On Second \"Old Town Road' Remix Young Thug is one of two high-profile names to hop on Lil Nas X's\" Old Town Road. \"The Atlanta artist joins the chart-topping 20-year-old, Billy Ray Cyrus and Mason Ramsey (affectionately known as the\" Yodeling Kid \") for the song's second remix. The My T.H.U.G. Story rapper has been keeping relatively busy in 2019. In May, Thugger dropped\" The London \"featuring <mark>J. Cole</mark> and <mark>Travis Scott</mark>. It was initially teased during Miami's edition of the Rolling Loud Festival, where flyers were released teasing a\" summer anthem. \"The original remix featuring the\" Achy Breaky Heart \"musician recently earned an RIAA Diamond status, and has sat atop the Billboard Hot 100 for 14 consecutive weeks. It is one of only a handful of songs to achieve this feat, and it's getting closer to being the longest-running No. 1 song in history. Listen to the newest, nearly three-minute remix of\" Old Town Road \"above.", "articleID": "2019071702_00063069_W", "names": {"J. Cole": ["Q204018", "Q56604513", "Q6105158"]}}]