[{"date": "2019-07-17", "url": "http://vibe.com/2019/07/rick-ross-port-of-miami-2-release-date", "content": "R. LUM. R Shares Visuals For New Single \"How This Feels\" With his forthcoming debut album set to drop this fall, R & B artist R. LUM. R released his latest single and paired visual \"How This Feels\" on Friday (July 12). He recently inked a deal with Island Records earlier this year, and his new track \"builds on the momentum\" the entertainer has achieved since he first climbed into the music scene with his breakout single \"Show Me .\" The Florida-born singer delivers vulnerable lyrics and piercing falsettos in the songs hook when asks, \"So can we be real/About how this feels?\" As he goes back and forth from guitar chords to nocturnal R & B, R. LUM. R's latest melody lights a fire into his next chapter in the music industry. The opening scene of the visual shows the vocalist staring at a burning old-school Cadillac set on fire. The picturesque film continues into the opening verse on owning up to intimate feelings and connections that could be conflicting or dangerous if pursued. \"I don't wannalead us in the wrong direction/Force or fake a feeling cause we both need affection/End up co-dependent cause we can't deal with depression/The way we need / So can we be real? / About how this feels,\" he croons. \"With this first visual, I wanted to make sure to do something more striking and interesting than I've ever done that makes you feel the isolation that is so felt in the music,\" he said in a statement. \"I think we did it with\" How This Feels,' \"His widely successful single\" Frustrated \"reached Top 10 at Urban AC Radio in 2017. Most recently he released his project AFTERIMAGE, which reached over 100 million global artist streams .\" I really believed in what Erykah Badu used to say about music, \"Once I release it into the world, it's no longer my story .' Once the audience listens to it, it's their story. I can't wait to see how people interpret it. There's growth to be done, and you don't have to be afraid of it .\" Listen to \"How This Feels\" up top. Continue Reading The Dreamville Records roster - Lute, Omen, <mark>J. Cole</mark>, Ari Lennox, WoWGr8 of EarthGang (above), Cozz (below), JID, Bas (standing), Olu of EarthGang (kneeling) - pose for a photo from the Return of the Dreamers 3 sessions at Tree Sound Studios in Atlanta, Ga.. Jonathan Mannion / Courtesy of Interscope Records Revenge of the Dreamers III: The Top Seven Artists Who Stood Out The much-awaited Revenge of the Dreamers III compilation album was released this past Friday (July 5), and it exceeded all expectations, and then some. The first two records of the trilogy predominantly featured Dreamville acts, and their in-house producers. However, this time <mark>J. Cole</mark>'s label shed their reputation of sectioning themselves off from the rest of the industry and embraced artists and producers from outside of their circle. The melodic, often raspy, only occasionally recognizable voices of the 32 rappers and singers featured on the 18-track album, echo throughout the project. As was expected, <mark>J. Cole</mark> spit lots of great verses, but the the other emcees certainly weren't masked by his shadow. In fact, <mark>Cole</mark> gave ample room for the young bloods on ROTD3 to showcase their clever lines, their vocal range, and their artistry as a whole. While it was hard to narrow down which artists on ROTD3 were the best, there are several on the project who stood out and earbed than a couple of rounds of applause. The five have yet to achieve chart-topping status, but after their performance on ROTD3, that achievement isn't far away. 1. Buddy Buddy proclaimed himself the \"Rap Camp MVP,\" and his praise was validated by the Dreamville documentary and the record itself. The 25-year-old's valley voice can be heard on three songs off the project and he was unlike anyone else, bringing an eccentric vibe to the songs he was featured on. In fact, Buddy's one of the best parts on the album's standout song, \"1993\" and he didn't even rap on it. Hearing Buddy playfully cut off and hound Smino, Cozz, Doctur Dot (EarthGang), J.I.D and <mark>Cole</mark> himself, so they could focus on more important things such as smoking weed, brought a carefree element to ROTD3. Some may not expect such jovial vibes from the usually thoughtful Dreamville camp. Like <mark>Cole</mark> said, Buddy is \"a real life legend .\" 2. J.I. D J.I.D. is quickly becoming one of Dreamville's most recognizable acts, and it's easy to see why he was featured on five different songs on the album, more than any other artist on ROTD3 aside from <mark>Cole</mark>. He represented his hometown of Atlanta effortlessly, especially on the lead-up single \"Down Bad,\" where his voice--unique as ever--uplifts the chorus. He's hard to keep up with and he's always quick with his rhymes, but there's no reason why J.I.D should have to slow down. With a style similar to Kendrick Lamar's, J.I. D's destination to the top is inevitable, and the quicker he gets there, the better. After all, who else could have came up with the bars: \"I was just f *** ed up, I was just down, down bad/I had to tighten the f ** k up, but I'm here for the crown/Board of Education vs. Brown/I was bored of education, left the town/F ** k a résumé and f ** k a cap and gown/F ** k a background check back' round when I get the check/N *** a, that's now .\" 3. <mark>J. Cole</mark> Dreamville founder <mark>J. Cole</mark> always carries high expectations with him, and he showed out with his seven appearances - more than any other artist - on ROTD3. The project saw <mark>Cole</mark> working differently from usual, but he displayed adaptability and flourished outside of his comfort zone. On \"1993,\" fans hear a version of <mark>Cole</mark> that he often keeps hidden--a fun, wild side that keeps up with the the carefree energy of the younger rappers on the track. For those other listeners who were itching to hear old school <mark>Cole</mark> from his Born Sinner days, he brought that out on the song \"Sacrifices .\" Sure, the North Carolina native can be the butt of Twitter memes--but who else can go platinum with no features--but every time he shows up, he shows out and shows the rap industry why Dreamville is such a force. 4. EarthGang Doctur Dot and Johnny Venus are two most versatile rappers on ROTD3, and together they form one of the most formidable groups in hip hop. While their verses are crafty, it's not so much their rhymes that command a song, but rather the way they play with and control their voices. Both Doctur Dot and Johnny Venus have a talent for manipulating the tone and range of their vocal chords, and that is especially evident in \"Swivel,\" their song on the album. They bring a unique sense of quirkiness to each appearance, and when they link up with the equally unconventional Buddy or Smino, magic happens. 5. Guapdad4000 Guapdad4000 is largely known for his hilarious viral social media videos or for his songs about scamming, but he took Revenge of the Dreamers III as an opportunity to show off his musical talents at a high level. He told VIBE, \"I felt that I wasn't going to go down there and outrap the super rap rap ni ** as, even though talent-wise, I am a super rap rap ni ** a....My plan was to just be true to myself, let my tone carry .\" The Oakland artist does exactly that, turning in two of the best choruses on the album with \"Don't Hit Me Right Now\" and \"Costa Rica .\" His airy vocals and catchy, earworm hooks hold together the songs he appears on. And he also briefly bars up on \"Wells Fargo .\" Guapdad4000 is hilarious, but his skills are nothing to joke about. 6. Cozz Cozz is Dreamville's youngest member at 25 years old, joining the label in 2014 and reintroducing himself to the world on ROTD3. Although he has two projects already released under Dreamville, this is without a doubt the biggest \"stage\" he's ever been on and he took advantage of it. The Los Angeles native was bold on this album with his record featuring Top Dawg Entertainment artist, Reason, called \"LamboTruck\" and speaks to his artistry. He's a risk taker, a big one at that given the fact that the Kal Banx-produced song is him expressing a few frustrations he has with his label. Every bar Cozz let off on the track was crafty and clever, which is definitely a strength of his, and as a listener it was entertaining figuring out the underlying meaning. Cozz is not one to be slept on, and it's about time is welcomed into the new class of young rappers. 6. Ari Lennox Lately touted as the \"First Lady of Dreamville,\" Ari Lennox can always be counted on to bring heart and soul to any project she touches. Her syrupy, raspy voice was the perfect touch to ROTD3 to make it whole and her heartfelt lyrics were the cherry on top. On \"Got Me,\" which was a single released prior to the album's drop date, fans can hear the DMV songstress harmonize effortlessly with features king, Ty Dolla $ign. \"Self Love\" is a relatable ballad that strikes a chord with people every time Lennox croons, \"self love is the best drug/but your love is the worst drug .\" With her own debut album Shea Butter Baby already making big waves this year, plus her features on ROTD3, Lennox is taking the R & B world by storm, and she'll let it rain on anyone who lets her. Young Thug And Mason Ramsey Hop On Second \"Old Town Road' Remix Young Thug is one of two high-profile names to hop on Lil Nas X's\" Old Town Road. \"The Atlanta artist joins the chart-topping 20-year-old, Billy Ray Cyrus and Mason Ramsey (affectionately known as the\" Yodeling Kid \") for the song's second remix. The My T.H.U.G. Story rapper has been keeping relatively busy in 2019. In May, Thugger dropped\" The London \"featuring <mark>J. Cole</mark> and <mark>Travis Scott</mark>. It was initially teased during Miami's edition of the Rolling Loud Festival, where flyers were released teasing a\" summer anthem. \"The original remix featuring the\" Achy Breaky Heart \"musician recently earned an RIAA Diamond status, and has sat atop the Billboard Hot 100 for 14 consecutive weeks. It is one of only a handful of songs to achieve this feat, and it's getting closer to being the longest-running No. 1 song in history. Listen to the newest, nearly three-minute remix of\" Old Town Road \"above.", "articleID": "2019071702_00063069_W", "names": {"Travis Scott": ["Q13605596", "Q323482"]}}, {"date": "2019-07-18", "url": "http://feeds.latimes.com/~r/OpinionLa/~3/xkyDDrADNHs/senate-democrats-consider-killing-filibuster", "content": "Sen. Dick Durbin (D-Ill .), the chamber's second-ranking Democrat, told the Hill that he is \"reflecting\" on whether to end the filibuster on bills if the 2020 elections give his party control of the Senate. (Jim Lo Scalzo / EPA) By Jon Healey Deputy Editorial Page Editor July 18, 2019 12:02 PM Facebook Twitter Show more sharing options Share Close extra sharing options Facebook Twitter LinkedIn Copy Link URL Copied! Print \"Severe memory lapse\" must be one of the (many) debilitating side effects that can result from being elected to Congress. I can't think of any other way to explain why Senate Democratic leaders told the Hill that they won't rule out killing the last vestiges of the filibuster if they retake control of the chamber in 2020. Less than six years ago, Democrats led by former Senate Majority Leader <mark>Harry Reid</mark> (D-Nev .) ended the filibuster on presidential nominees for the executive branch and most federal courts. It was an act born of frustration--the Republican minority had resolutely blocked votes on all three of President Obama's nominees to the Court of Appeals for the District of Columbia Circuit. But in doing so, <mark>Reid</mark> laid the path for Republicans to eliminate the filibuster on Supreme Court nominees after they retook the Senate and President Trump nominated his first justice. That's why Neil M. Gorsuch and Brett M. Kavanaugh are on the high court, despite attracting the support of bare majorities of the Senate. And why Trump has been able to flood the courts with his nominees, a number of whom have been rated unqualified by the American Bar Assn. Notably, <mark>Reid</mark> made no move to kill the filibuster on legislation, which means that bills routinely require 60 votes to come up for debate on the floor, then 60 votes to go to a vote. His successor as majority leader, Republican Mitch McConnell of Kentucky, has similarly resisted the push from partisans to end the legislative filibuster, despite pressure from Trump just to steamroll Democrats and enact his agenda. Advertisement Now, top Senate Democrats are signaling a willingness to bar filibusters on bills too, should they reclaim the majority. According to the Hill, both Senate Minority Leader Charles E. Schumer (D-N.Y.) and Minority Whip Dick Durbin (D-Ill .) said the idea was on the table, which marks a considerable shift for Durbin. When asked why, Durbin told the newspaper that the status quo in the Senate was no longer acceptable: \"This is a different Senate. It is unproductive under the current state of affairs .\" The best arguments for killing the filibuster are that it's undemocratic and that it has been transformed from a rarely used tool to force compromises into a quotidien implement of obstruction. Both of those points are valid, yet the Senate is undemocratic and inefficient by design. Less populous states hold disproportionate power, given that the four senators from Idaho and Wyoming have as many votes as the four from California and New York. The Founders' intent was for the House to channel the passions of the electorate and for the Senate to cool them through a more deliberate process. The salutory effect of the filibuster is that it promotes legislation that has at least some bipartisan buy-in. Without that, you end up with embattled initiatives like the Affordable Care Act, which Republicans feel free to undermine because none of them voted for it. Durbin is right, though, that the gridlocked status quo in Washington cries out for change. For more than a decade, Congress has been unable to get anything done on the biggest issues of the day. The only exceptions have come when power was concentrated in one party's hands and the issue could be addressed through a budget bill not subject to the filibuster. The result: inaction on problems like our failed immigration policies, and purely partisan and often unsustainable actions on issues like healthcare and tax rates. Advertisement The fundamental problem here is that members have little interest in compromising or not enough incentive to do so. This is one of the bitter fruits of partisan gerrymandering that the Supreme Court ignored. When the only real threat to your reelection is drawing a primary challenge from someone more deeply partisan than you are, you don't have much reason to work with the other side on solutions that neither side loves but both sides can live with. Killing the filibuster won't fix that. Instead, it will simply make federal law and policy more volatile, with statutes and regulations being whipsawed by each change in control of Congress. Granted, it makes little sense to allow two filibusters on every piece of legislation, as is the case today; ideally, senators would eliminate the filibuster on the motion to begin debate on a bill while preserving the option to filibuster the motion to end it. But then, any more to restrict legislative filibusters would probably hasten the end to all of them. Lawmakers seem to be moving in only one direction on the filibuster, and it's not the right one.", "articleID": "2019071820_00107127_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}}, {"date": "2019-07-19", "url": "https://www.highsnobiety.com/p/beyonce-the-gift-stream/", "content": "Last week Beyoncé nonchalantly announced she had curated and produced an accompanying album to Disney \"s The Lion King like it's no big deal. And, well, Bey just delivered. The Lion King: The Gift is finally here and it's the sonic cinema of our dreams. The album, out today, features contributions from a dazzling cast of collaborators, including JAY-Z, Blue Ivy Carter, Childish Gambino, Kendrick Lamar, Pharrell, and others. Referred to as a\" love letter to Africa, \"the record also boasts multiple African artists, such as Wizkid, Mr Eazi, Tekno, and Burna Boy. Behind the scenes, the album is just as impressive. The Gift features production from Diplo, Syd and Sounwave--who worked on Kendrick Lamar's DAMN. DJ Khaled is listed as a producer on the track\" MOOD 4 EVA, \"a collaboration between Beyoncé, JAY-Z, and Childish Gambino .\" I wanted to put everyone on their own journey to link the storyline, \"Beyoncé said in a press release .\" Each song was written to reflect the film's storytelling that gives the listener a chance to imagine their own imagery, while listening to a new contemporary interpretation. \"The album maintains a strong link to the Jon Favreau-directed film and is interspersed with interludes carrying dialogue from the characters. <mark>James Earl Jones</mark>, who voices Mufasa, opens the album. Earlier this month, Beyoncé (who voices Nala) released the first single from the project,\" Spirit \"with an accompanying dramatic video. You can now stream the full album below. Subscribe beyonce the gift the lion king Words by Sarah Osei Read Full Article", "articleID": "2019071911_00014829_W", "names": {"James Earl Jones": ["Q203960", "Q2074528"]}}, {"date": "2019-07-22", "url": "http://money.msn.com/en-us/money/stockdetails/nas-drrx/fi-a1ranm", "content": "AdChoices Latest Stories Fears of a retirement crisis are overblown--and these numbers prove it MarketWatch This is the credit score you need to take out a mortgage CNBC Back-to-school sales tax \"holidays' lure shoppers despite slim savings The New York Times Date invented: 1942 Eastman Kodak was one of many companies that contributed to the war effort during World War II. In 1942, while testing a variety of compounds for use in a plastic rifle sight, Dr. Harry Coover a company chemist, inadvertently created cyanoacrylate, a compound later marketed as Super Glue. The material was incredibly durable but was dismissed for being too sticky. When a colleague was testing cyanoacrylate nine years later, Dr. Coover had another encounter with the material. As the colleague complained the compound ruined his equipment, Coover realized its commercial potential. Super Glue was first sold as a commercial product in 1958. The product was eventually adopted by military surgeons during the Vietnam War, who would spray it over wounds to stop bleeding instantly. ALSO READ: Countries With the Most US Military Bases\" src = \"http: //static-entertainment-neu-s-msn-com.akamaized.net/sc/9b/e151e5.gif\" title = \"7. Super glue - Wikimedia Commons\" > 15 commercial products invented by the military 24/7 Wall St. AdChoices The youngest heirs poised to inherit billions from their parents Business Insider Elizabeth Warren is coming for the private equity industry Bloomberg Is a 4% withdrawal rate still a good retirement rule of thumb? Kiplinger Jim Cramer has a game plan for Wall Street's big earnings week CNBC A leveraged loan collapses and reveals key risk in credit market Bloomberg Dream of retiring abroad? The reality is Medicare doesn't travel well The New York Times 17 simple home repairs that will save you cash Money Talks News Track your favorite stocks Create your watchlist DOW DOW ▼ 27,154.20 -68.77 -0.25% Last updated time 7/19/2019 5:08 PM EDT US Markets Open In 58 min AtmHeader NASDAQ Composite Index NASDAQ Composite Index ▼ 8,146.49 -60.75 -0.74% S & P 500 Index S & P 500 Index ▼ 2,976.61 -18.50 -0.62% FTSE 100 FTSE 100 ▲ 7,526.15 +17.45 +0.23% NYSE Composite Index Mini Value (New Methodology) NYSE Composite Index Mini Value (New Methodology) ▼ 1,311.20 -5.67 -0.43% Most Active TARONIS TECHNOLOGIES, INC.. TRNX ▼ 0.3146 -0.0054 -1.69% INTEC PHARMA LTD NTEC ▼ 2.99 -0.40 -11.80% FUELCELL ENERGY, INC.. FCEL ▲ 0.3490 +0.0445 +14.61% DURECT CORPORATION DRRX ▲ 0.7266 +0.0527 +7.82% ACROSS THE MARKET Crude Oil ▲ 56.43 +0.67 +1.20% Gold ▲ 1,427.20 +0.50 +0.04% USD/EUR ▲ 0.8916 +0.0003 +0.0337% Companies Companies Equifax to pay up to $650 million in data breach settlement Reuters Judge denies J & J's request to transfer 2,400 talc lawsuits to federal court CNBC As Instagram tests its \"like' ban, influencers will have to shift tactics to make money CNBC Amazon's updated suspension policy still has sellers worried about getting inexplicably booted CNBC Report: Equifax could pay $700M to settle with FTC over 2017 data breach USA TODAY Dollar stores are everywhere. That's a problem for the poor CNN Markets Markets US stock futures slightly higher on hopes of a smaller Fed rate cut CNBC Xinhua: Chinese companies seeking new purchases of U.S. farm products Reuters Elizabeth Warren is coming for the private equity industry Bloomberg China has built a railroad to nowhere Bloomberg Americans still think they can make money owning houses CBS News Safe deposit boxes aren't safe The New York Times Technology Technology Read this before installing extensions to your web browser USA TODAY Despite high hopes, self-driving cars are\" way in the future' The New York Times Olympic robots offer \"virtual' attendance, help out on field Associated Press How to tell if your computer has been tampered with Popular Science Artificial intelligence is changing food's flavor and aroma dynamics AFP Pixel 4 screen leak show off large forehead bezel The Verge Small Business Small Business Boy's\" ice-cold beer' marketing stunt gets a town's attention Time 12 tips to lower your small-business overhead costs Mediafeed Barbershops, Bars, and Other Businesses on Wheels You Have to See Cheapism What the IRS doesn't tell you about self-employment taxes MarketWatch Opinion: Corporate Transparency Act will harm small businesses The Wall Street Journal. 5 Boring Tasks All Entrepreneurs Must Master to be Successful Debt.com AdChoices Key Quotes Across the market Quotes across security and market types that are moving the markets today Active TARONIS TECHNOLOGIES, INC.. TRNX ▼ 0.3146 -0.0054 -1.69% INTEC PHARMA LTD NTEC ▼ 2.99 -0.40 -11.80% FUELCELL ENERGY, INC.. FCEL ▲ 0.3490 +0.0445 +14.61% Currencies USD/Euro € ▲ 0.8916 +0.0003 +0.0337% USD/Yen ¥ ▲ 107.9300 +0.2300 +0.2136% British Pound £ / USD ▼ 1.2474 -0.0026 -0.2080% Gainers Medallia Inc MDLA ▲ 37.05 +16.05 +76.43% MIDATECH PHARMA PLC MTP ▲ 1.86 +0.56 +43.08% Afya Ltd AFYA ▲ 24.09 +5.09 +26.79% Commodities Gold ▲ 1,427.20 +0.50 +0.04% Crude Oil ▲ 56.43 +0.67 +1.20% Silver ▲ 16.41 +0.21 +1.30% Losers NEURALSTEM, INC.. CUR ▼ 5.90 -2.60 -30.59% MYnd Analytics, Inc.. EMMA ▼ 6.86 -2.94 -30.00% MARKER THERAPEUTICS, INC.. MRKR ▼ 6.33 -2.37 -27.24% Bonds 1-Month T-Bill 2.12 0.00 0.00% 3-Month T-Bill 2.07 0.00 0.00% 6-Month T-Bill 2.03 0.00 0.00% 1-Year T-Bill 1.94 0.00 0.00% 2-Year T-Note 1.82 0.00 0.00% 3-Year T-Note 1.78 0.00 0.00% 5-Year T-Note 1.81 0.00 0.00% 10-Year T-Note 2.05 0.00 0.00% 30-Year T-Bond 2.58 0.00 0.00% Videos The costly impact of Berkeley's ban on natural gas in new homes Fox Business 4 of the worst things to charge on your credit card USA TODAY Prime crime: Porch pirates find new ways to steal your packages CBS Sacramento Jim Cramer breaks down Netflix earnings as shares drop CNBC Whose 2020 campaigns are raising the most money? The Washington Post FaceApp raises privacy and security concerns CBS News Trump to businessman: If you don't support me, you're going to be so poor Fox Business 5 key signs that your home is losing value GOBankingRates How to find a work from home job Money Talks News Madagascar's vanilla boom attracts villains Reuters Would having $1 million make you feel wealthy? USA TODAY Priest pays coal miners' bills after company files for bankruptcy CBS News Trump suggests federal agencies should look into Google's China ties The Wall Street Journal. A factory goes from Viet Cong to Team USA Reuters Should you invest in Berkshire Hathaway? Fox Business How to make an air conditioner for less than $10 Money Talks News Top Stocks Top Stocks As Amazon stock nears $2,000, is it still a buy? InvestorPlace Microsoft Is a Pricey Stock That's Worth Every Penny The Street Netflix's Tight-Lipped Culture Makes Surprises Hard to Avoid Bloomberg A big Tesla skeptic on Wall Street raised his estimate for second quarter earnings CNBC \"Lion King' release is a good time to examine Disney's stock Benzinga The 10 cheapest Warren Buffett stocks Kiplinger Saving & Spending Saving & Spending Why are so many unable to cover a $400 emergency? USA TODAY Pros and cons of government 457 (b) retirement plans Bankrate 11 Tips and Tricks That Will Keep You From Overspending Money Talks News How Much You Really Take Home From a $100K Salary in Every State GOBankingRates 20 Ways Casinos Keep You Spending Money GOBankingRates The real cost of owning a car Espresso Careers Careers 15 managers reveal the interview red flags that keep them from hiring someone INSIDER 10 fast-food jobs that pay for college US News & World Report--EDU Can you live on minimum wage in your state? Stacker The most and least unionized states Stacker The 50 metro areas with the highest unemployment rates Stacker 10 bachelor's degree jobs that can pay more than $100,000 US News & World Report--EDU Real Estate Real Estate 14 first-time homebuyer mistakes to avoid Bankrate Humble celebrity homes regular people can afford Cheapism The world's most and least expensive cities to live in, revealed Lovemoney 6 tiny houses with huge price tags GOBankingRates Berkeley becomes first US city to ban natural gas in new homes San Francisco Chronicle The fastest-growing place in every state 24/7 Wall St. Popular Slideshows These are the fastest-dying jobs in every state Business Insider Great small towns for early retirement Kiplinger These people live without money Espresso Iconic American companies started the year you were born Stacker AdChoices Product recalls that rocked their company's stock price Stacker These 10 retailers might not survive 2019 The Motley Fool The worst hidden costs of living in the suburbs Business Insider American towns that went from rich to poor Lovemoney Why See's Candies is Warren Buffett's favorite company Business Insider See inside <mark>Joe Montana</mark>'s Napa Valley villa listed for $29M SF Gate Roads in poor condition: 5.5% (23rd highest)> Structurally deficient bridges: 1.3% (the lowest)> State highway spending per driver: $509 (23rd highest)> Avg. travel time to work: 26.5 minutes (14th highest)\" src = \"http: //static-entertainment-neu-s-msn-com.akamaized.net/sc/9b/e151e5.gif\" title = \"42. Texas - Thomas Northcut / Getty Images\" > Which states are falling apart? 24/7 Wall St. 9 mind-blowing facts about Walmart Business Insider Jobs that no longer exist Stacker Clothing brands that are still made in America Cheapism 13 top-selling products still made in America The Motley Fool How the richest person in each state made a fortune Stacker 12 eerily accurate financial predictions from the past 25 years Bankrate From worst to best: America's top companies ranked by reputation Stacker GNI per capita: $1,078> 2017 GDP: $5.5 billion> Population: 4.7 million> Life expectancy at birth: 63.0 years Founded partly by freed U.S. slaves, Liberia's economy was all but destroyed in the 1990s and early 2000s by a civil war that left a quarter of a million dead and thousands more displaced. Limited economic development in the country has lead to a low standard of living. Less than 20% of the population has access to electricity, and about 39% are undernourished. The government, which ranks among the most corrupt in the world, spends relatively little on education as a share of GDP, and illiteracy is widespread. The West African nation is resource rich, however, and gold exports are driving growth. In 2017, gold accounted for 19% of the country's $1.0 billion in exports. ALSO READ: 14 Countries the US Government Doesn't Want You to Visit \"src =\" http: //static-entertainment-neu-s-msn-com.akamaized.net/sc/9b/e151e5.gif \"title =\" 6. Liberia - Wikimedia Commons / blk24ga \"> Poorest countries in the world 24/7 Wall St. The most famous business started the year you were born Lovemoney AdChoices", "articleID": "2019072212_00065878_W", "names": {"Joe Montana": ["Q348011", "Q6211408"]}}, {"date": "2019-07-23", "url": "https://msubobcats.com/news/2019/7/23/womens-volleyball-montana-state-volleyball-program-garners-avca-academic-honors.aspx", "content": "Story Links LEXINGTON, Ky. - The American Volleyball Coaches Association (AVCA) has announced that 1,125 teams have earned the AVCA Team Academic Award for the 2018-19 season, across all divisions. This number breaks the previous year's total of 977 to set an all-time high. The award, which was initiated in the 1992-93 academic year, honors collegiate and high school volleyball teams that displayed excellence in the classroom during the school year by maintaining at least a 3.30 cumulative team grade-point average on a 4.0 scale. Montana State put seven players on the All-Big Sky Conference Academic team, last fall. Bobcats named to the list included Serena Caspersen, Libby Christensen, Lexi Goroski, Hailey Merkes, Allyssa Rizzo, <mark>Hannah Scott</mark> and Kelsie White. As a team, MSU posted a 3.32 cumulative grade-point average. \"We have lofty goals on and off the court,\" said MSU third-year head coach <mark>Daniel Jones</mark>. \"At the start of the year we sat down with the team and clearly stated those goals, first of which was gaining a team GPA of 3.30 or better. I could not be prouder of every young woman on the team for stepping up to the challenge. Achieving this award reflects their commitment to be their best in all areas, and the toughness that it takes to control what they can whilst competing at the highest levels .\" \"We talk about building the legacy of Montana State Volleyball and leaving it better than we found it,\" <mark>Jones</mark> added. \"The 2018-19 team has taken a big step forward in that process .\" In addition to the Bobcats, other Big Sky schools earning team academic kudos included Eastern Washington, Idaho State, Northern Arizona, Portland State, Southern Utah, Northern Colorado and Weber State. Print Friendly Version Related Story Content", "articleID": "2019072321_00120892_W", "names": {"Daniel Jones": ["Q28065523", "Q39075157", "Q42763780", "Q446447", "Q5217710", "Q5217712", "Q52502267", "Q56596920", "Q56799640", "Q679289"], "Hannah Scott": ["Q33983630", "Q42314580"]}}, {"date": "2019-07-24", "url": "https://www.recordernews.com/news/local-news/159749", "content": "Legislature recognizes DPW supervisor for his carpentry skills Posted by Recorder News | Jul 23, 2019 | Featured, Local News, Top Stories | 0 | Winnie Blackwood/Recorder staffChairman of Physical Services Committee and District 5 Legislator <mark>Daniel Wilson</mark> reads a proclamation to recognize Gary Oeser, a structural maintenance supervisor for Montgomery County Department of Public Works, for his fine craftsmanship in creating an appellate bench during the committee meeting on Tuesday. State Supreme Court Judge Joseph M. Sise looks on during the issued proclamation. By WINNIE BLACKWOOD Recorder News Staff FONDA--A Montgomery County Department of Public Works employee was recognized for his fine craftsmanship in creating an appellate bench for the State of New York Supreme Court, Appellate Division, Third Judicial Department during its visit last month. Gary Oeser, DPW's structural maintenance supervisor, received a proclamation by the Montgomery County Legislature during their Physical Services Committee meeting on July 16 for his work in creating a special bench for the appellate division when they held a special session at Montgomery County Courthouse on June 6. State Supreme Court Judge Joseph M. Sise said on Tuesday that when he received word from Presiding Justice Elizabeth A. Garry of the Appellate Division of the Third Department that she would be bringing her court on the road for the first time in over 21 years and would be making a stop in Montgomery County, he immediately knew to ask Oeser to build a special bench for the occasion. \"I am glad to be a part of a proclamation regarding Gary Oeser because he follows a long line of men and women, who work for our county and care about our county, care about the presentation that we have to our citizens, specifically for me here at the courthouse,\" Sise said. A bench was created when the appellate division visited the county 21 years ago that took three DPW workers to build, but was repurposed. Sise knew the county could create another bench for the appellate division's most recent visit because of the fine craftsmanship and the skills Oeser has as a finish carpenter. \"Gary Oeser built such a quality bench that the appellate division, they came and sat on it and couldn't get over it; they couldn't get over it, how perfect it was,\" Sise said. \"His master craftsmanship, his hard work, his dedication to Montgomery County all came together to build this bench, this honey oak bench. He even picked the right wood to match the honey oak courtroom of our traditional, historic courtroom. It is so impressive. It outdid what we did 21 years ago, which was something, but also we are the only county that did that .\" Other counties that were part of the tour made makeshift courts with the five judges sitting at different levels on a trial bench, but because of Oeser's work they were all able to sit at the same level. \"The bigger picture is we in Montgomery County care so much about each other and about our county that it's evident from all that we do and Gary Oeser specifically, one man built this bench, not three, was such a fine example of what the very best of this county has to offer,\" Sise said. \"I was so proud .\" Garry is still raving about Oeser's work and the reception they received by the county, Sise said. \"I want to thank you, Gary, for that,\" Sise said. Chairman of the Physical Services Committee and District 5 Legislator <mark>Daniel Wilson</mark> presented Oeser with the proclamation after Sise's speech to recognize the finish carpenter for bringing praise and distinction to the county. \"The county of Montgomery is pleased to recognize employees, who take pride in their career and are committed to giving back to the people they represent,\" <mark>Wilson</mark> read from the proclamation. Montgomery County Executive Matthew Ossenfort also praised Oeser for his work, but added members of DPW had to step up to the plate and take over the day-to-day operations of the department that Oeser was in charge of as he worked on the bench. \"It was really a team effort all the way,\" Ossenfort said. Share:", "articleID": "2019072401_00047837_W", "names": {"Daniel Wilson": ["Q18638182", "Q267207", "Q28783194", "Q3701757", "Q41804974", "Q58150517"]}}, {"date": "2019-07-25", "url": "https://forum.bikeradar.com/viewtopic.php?t=13106279&p=20551978#p20551978", "content": "The Lanterne Rouge Thread 2019 ** Spoilers ** Quote Post by \"underlayunderlay Thu Jul 25, 2019 22:02 pm The one sporting event in British sporting culture that epitomises the\" choke' (other than the England Men's Cricket Team (1877 - present), the English men's football team (1872-1966, 1966 - present), England - well, you get the idea) is of course Devon Loch. Miles ahead in the most prestigious race of the year, with nothing to do but amble to the finish line, this noble horse took the ultimate revenge on the sadistic sod that had made him do all that jumping and inexplicably belly-flopped barely forty yards from the line. Lanterne Rouge aficionados will note that Deven Loch failed to actually finish the race and thus what was otherwise a brilliant display of snatching immortality from a winning position will be forever tainted. The reason for bringing this up is because French hope Yoyo Offredo is currently mid-air and about to crash land in the most publicly embarrassing way possible, and the French public, to continue the metaphor, are about to smash the bottle of Dubonnet firmly over the head of the nearest footman. Anyone suggesting the Queen Mum really reacted by saying \"That's racing\" are perpetuating a conspiracy around the death of Mr A Scroggins, Royal Footman, mysteriously found dead by Dubonnet overdose in the Royal Box. I will now demonstrate the Masonic numbers attached to this-Hang on, I'm literally being buzzed by military helicopters at this point and hadn't even posted it. I'm not ordinarily a tin-foil-hatter, but this is a bit spooky...Anyway, after another brilliant ride by Langeveld it looks like Offredo is about to dash French hopes and surrender the most prestigious title in cycling. The reasons for this urgent collapse in form are totally opaque, but it seems the decision of the commissaires to protect him from <mark>Tony Martin</mark> has not been enough. The slight time Offredo took back from Langeveld yesterday appears to have been a dead cat bounce, or in cycling terms \"Cofidis rider making the break on stage 20\". Offredo remains LR by just three seconds, and surely this will disappear in the next couple of stages - although we've been saying something similar at the wrong end of the race about the man my predictive text is currently calling Julie-Ann's Fillip. The drama in the competition for the LR has overshadowed a brilliant ride from fourth-vowel-abolitionist Michael Mrkv, who soloed to a huge six minute gap over everyone else on today's stage. With the TV cameras inexplicably focused on the travails of Tommy 2.0 (eg AKA Phillip), capturing this immense ride was left to our very own Chief Livestock Correspondent, ATC, who cleverly applied some sort of filter to imply progress was being made. In true LR fashion I note she filed her copy late but just about within the cutoff. Superb work. Elsewhere De Busker is surely out of it, no matter how many Ed Sheeran numbers he butchers, though Mrkv's ride means the final podium spot is very much a live question, Lar \"Sytting <mark>Bak</mark>\" <mark>Bak</mark> is showing the benefit of experience, moving smoothly up to a decent position, Rich Cheeze appears to have panicked about someone playing Beck's Odelay and finished far too quickly. He'll learn, I'm sure, but it takes him back out of the top ten White feather to ATC, whose photographic evidence suggests started up the Galibier well before the field yet got overtaken by the whole bally lot of them. Excellent stuff. Public Service Broadcasting:147 ANTHONY TURGIS 178 TOTAL DIRECT ENERGIE 06H 09' 01 \"+ 00H 34' 46\" - -148 CALEB EWAN 161 LOTTO SOUDAL 06H 09' 01 \"+ 00H 34' 46\" - -149 REIN TAARAMÄE 176 TOTAL DIRECT ENERGIE 06H 09' 06 \"+ 00H 34' 51\" - -150 MATTEO TRENTIN 107 MITCHELTON - SCOTT 06H 09' 39 \"+ 00H 35' 24\" - -151 <mark>LARS BAK</mark> YTTING 202 TEAM DIMENSION DATA 06H 10' 02 \"+ 00H 35' 47\" - -152 MARCUS BURGHARDT 13 BORA - HANSGROHE 06H 10' 51 \"+ 00H 36' 36\" - -153 ELIA VIVIANI 28 DECEUNINCK - QUICK - STEP 06H 10' 51 \"+ 00H 36' 36\" - -154 PETER SAGAN 11 BORA - HANSGROHE 06H 10' 51 \"+ 00H 36' 36\" - -155 SEBASTIAN LANGEVELD 95 EF EDUCATION FIRST 06H 10' 51 \"+ 00H 36' 36\" - - 156 MICHAEL MØRKØV 26 DECEUNINCK - QUICK - STEP 06H 16' 17 \"+ 00H 42' 02\" - - Pubic Service Broadcasting:147 149 ▲ 2 VAN MELSEN Kevin Wanty - Gobert Cycling Team 3:24:53148 150 ▲ 2 BONIFAZIO Niccolò Team Total Direct Energie 3:25:12149 144 ▼ 5 KLUGE Roger Lotto Soudal 3:25:31150 143 ▼ 7 <mark>BAK</mark> <mark>Lars</mark> Ytting Team Dimension Data 3:26:24151 153 ▲ 2 HALLER Marco Team Katusha Alpecin 3:26:33152 155 ▲ 3 MONFORT Maxime Lotto Soudal 3:30:49 153 151 ▼ 2 MØRKØV Michael Deceuninck - Quick Step 3:34:59 154 156 ▲ 2 DEBUSSCHERE Jens Team Katusha Alpecin 3:35:41155 157 ▲ 2 LANGEVELD Sebastian EF Education First 3:49:49 156 158 ▲ 2 OFFREDO Yoann Wanty - Gobert Cycling Team 3:49:52 @ canocola", "articleID": "2019072600_00104003_W", "names": {"Lars Bak": ["Q447780", "Q6491418"], "Tony Martin": ["Q16207079", "Q18394782", "Q2442726", "Q30329692", "Q3531818", "Q3531821", "Q3993273", "Q434220", "Q61049", "Q725874", "Q7822886", "Q7822887", "Q7822888", "Q7822889", "Q7822890", "Q7822891", "Q7822893"]}}, {"date": "2019-07-26", "url": "http://www.gattonstar.com.au/news/teen-fugitives-leave-police-in-dust/3790482/", "content": "The tiny and remote town of Gillam has been taken over by an army of police hunting for murder spree suspects Bryer Schmegelsky and Kam McLeod. Picture: Twitter News Teen fugitives leave police in dust by Marnie O’Neill 27th Jul 2019 5:17 AM 0 They've managed to dodge a military scale manhunt involving scores of officers, sniffer dogs, helicopters, drones, thermal imaging, armoured trucks and next-level tracking and surveillance equipment. Now fears are growing that Canadian highway murder spree suspects Bryer Schmegelsky, 18, and Kam McLeod, 19, may no longer be hiding in dense bushland surrounding the tiny and remote community of Gillam, in northern Manitoba, where authorities have been searching for two days. Bryer Schmegelsky and Kam McLeod are suspects in the murders of Lucas <mark>Fowler</mark> and Chynna Deese The pair have been charged with the murder of a 64-year-old Canadian botanist and are suspects in the double homicide of Australian policeman's son Lucas <mark>Fowler</mark>, 23 and his American girlfriend Chynna Deese, 24. An army of Royal Canadian Mounted Police (RCMP), along with reinforcements from as far afield as Alberta and Ontario, descended on the one-road town of just 1,200 people after the teens torched their last known getaway car at a nearby First Nations reserve on Monday. An Emergency Response Team, Crisis Negotiation Team, the RCMP Major Crime Unit and additional district resources have been deployed to the district, police said. They have received more than 80 tips and asked the public to stay away from the pair if spotted. It comes as heavy rain hampers the search for the suspected killers. Lucas <mark>Fowler</mark>'s father, NSW Police Inspector <mark>Stephen Fowler</mark> visited the ranch were his son had been living and working to collect his belongings. Christophe Weder told The Daily Telegraph: \"Lucas' father came today. It was very emotional and he felt some comfort in knowing that Lucas spent the last months of his life in such a special place .\" Heavily armed SWAT team officers search the boggy, sandfly and mosquito-infested bushland around the remote northern Manitoba town of Gillam. Picture: Vancouver News video grab Police are checking every single vehicle coming in and out of Gillam, which has only one road connecting it to the rest of Manitoba. Picture: Vancouver News video grab On Thursday, police said they believe the suspects are still hiding in the dense bushland, saying there had been two confirmed sightings. Locals are said to be \"freaking out\" in the normally quiet town where people don't lock their doors. But despite authorities' claims McLeod and Schmegelsky had effectively trapped themselves in the vast swathe of heavily forested, bear and insect-infested swampland that encircles Gillam, there are other ways out besides the single, 300km stretch of road that connects it to the rest of Manitoba. \"There's a CN (Canadian National Railway) line that passes through Gillam and right past where the burnt Rav4 was found,\" Canadian archaeologist Tyler Cantwell told news.com. au in a message. \"My pure speculation - but it's what I would do - is that they hopped on the back of a train and headed back West .\" Others say the Schmegelsky and McLeod could have jumped on a train to Churchill - a port on Hudson Bay known as the Polar Bear Capital of the World and, to a lesser extent, the Beluga Whale Capital of the World. The port is around 270km from Gillam and popular with tourists, who flock to the pristine harbour to join whale and bear spotting boat and air tours. If the suspects make it that far, they could easily steal a boat or another car. The ever present threat of polar bears means that locals never lock their vehicles. Authorities advise anyone under attack to jump into the nearest car and shut themselves inside. CCTV vision of Kam McLeod, 19, and Bryer Schmegelsky, 18, in Saskatchewan. Picture: Darryl Dyck/The Canadian Press via AP Only one road connects Gillam to the rest of Manitoba. However, a rail line runs right past the spot where the fugitives dumped their last known getaway car. Picture: Supplied DID THE TEENS PULL OFF ANOTHER CARJACKING? The murderous trail of destruction has played out in terrain so isolated there is often no internet or phone coverage, with some areas in northern Manitoba unable to even access 911. As a result, sightings of the pair have been 24 to 48 hours old by the time they are communicated, allowing the suspects to stay several steps ahead of authorities. There are also unconfirmed reports the teens are travelling in a car with Manitoba number plates stolen from a Gillam man and speculation they may have even been involved in a suspected abduction and carjacking in Regina, Saskatchewan on Tuesday. The carjacking took place 15 hours after the Rav4 was found ditched at Gillam - which is a 13 1/2 hour drive from Regina. \"Officers were sent to a parking lot in the 400 block of Albert Street where a person had been abducted at gunpoint just after noon,\" Regina Police said in a statement. \"A vehicle pulled into the parking lot followed by a small black car. A person got out of the black car with what appeared to be a gun and pointed it at the driver of the first car .\" The driver was forced into the black car with the suspect. Both cars then drove away. No shots were fired. A black car or smaller SUV with four doors and a roof rack was involved in this incident. \"Only one of the teens, McLeod, can reportedly drive but a scenario involving Schmegelsky forcing a motorist to drive at gunpoint with McLeod at the wheel of a second car is not beyond the realms of possibility. An appeal has been made to the public for information regarding the vehicle, its owner or occupants and CCTV footage released .\" Police believe there are at least two suspects involved in this incident, which does not appear to be a random act \"at this time' .\" A local newspaper reported the RCMP did not believe the incident was linked to McLeod and Schmegelsky's alleged murder spree but observers have pointed out the RCMP initially failed to link the teens to the two crime scenes or the crime scenes to each other. Others have speculated police are withholding information from the public to prevent tipping the suspects off. On Friday, police said they had confirmed two sightings of the teens in the area since Monday but said no reports of stolen cars were linked to them. This happened tues morning about 15 hrs after they torched the car in Gillam, enough time to get there. They were announced as suspects tuesday morning as well. The one teens mother also lives in Regina. https: //t.co/ZL0pXSPngy--Louis (@ Louis52068605) July 25, 2019 RCMP Corporal Julie Courchaine told reporters in Winnipeg on Thursday locals could expect a \"heavier police presence\" in the Gillam area while the manhunt continues. A fleet of armoured SWAT team trucks set off for Gillam on Thursday afternoon to join the search. Hundreds of officers, equipped with police dogs, drones and other high tech surveillance equipment, have been combing the hostile scrub for clues to the teens' whereabouts. The father of Schmegelsky, Alan, said the pair had been \"training in war\" in the woods and were masters of camouflage. But even as the reinforcements were being called in, there was an unconfirmed sighting of McLeod and Schmegelsky at Split Lake, some 85km north of the current search area. Petrol station worker Michelle Keeper told CBC News she believes she served the pair on Monday at about 4pm. It was not clear what vehicle they were travelling in at the time or whether the encounter happened before or after SUV was found dumped at Gillam. Ms Keeper said McLeod paid for $20 worth of fuel and Schmegelsky asked if they could consume alcohol in the First Nations community, which is dry. \"The guy who paid for the gas - he was quiet, he didn't say anything, he was just looking down,\" she told CBC. \"They seemed like, I don't know, normal. I'm just so nervous right now thinking about it .\" Ms Keeper said she didn't realise she had served the fugitives until she saw the RCMP's updated suspect photographs the following day. She said McLeod was still sporting a short beard and Schmegelsky was wearing the same camouflaged shirt seen in the police alert. The Alaska Highway in British Columbia where Aussie Lucas <mark>Fowler</mark> and girlfriend Chynna Deese were found dead next to their campervan on July 15. Picture: Supplied Lucas <mark>Fowler</mark> and Chynna Deese were very much in love. Picture: The Charlotte Observer/via Deese family The teens have been charged with one count of second degree murder in the death of University of British Columbia lecturer Leonard Dyck and are suspects in the murders of Mr <mark>Fowler</mark> and Ms Deese. The couple were found dead alongside their campervan on the Alaska Highway in British Columbia on July 15. They had been travelling through northern British Columbia en route to Alaska on what was meant to be a dream roadtrip. On July 19, the body of Mr Dyck, a botanist, was discovered almost 500km away on Highway 37 - two km from the abandoned and burning wreckage of McLeod and Schmegelsky's Dodge pick-up truck. Authorities initially failed to link the three incidents, classifying the teens as missing persons up until Tuesday, when they were officially named suspects in the three murders. The teens, who have been inseparable since primary school, have eluded capture ever since, leading police on a 3000-plus km chase across three provinces and up into the wilderness of northern Manitoba. CCTV footage of the suspected abduction/carjacking incident on Tuesday. Picture: Regina Police More Stories SWAT teams descend on tiny Canadian town in manhunt Canadian highway murder suspects named More Stories SWAT teams descend on tiny Canadian town in manhunt Canadian highway murder suspects named 0 canada Read More Login to follow editors picks Read More Login to follow manhunt Read More Login to follow murders Read More Login to follow canada editors picks manhunt murders", "articleID": "2019072620_00003928_W", "names": {"Stephen Fowler": ["Q39415168", "Q7609726"]}}]