[{"date": "2019-07-27", "url": "http://events.stuff.co.nz/2020/a-ha/christchurch?utm_medium=rss", "content": "a-ha--Hunting High And Low Powered by: a-ha--Hunting High And Low When: Thu 5 Mar' 20, 7:00 pm Where: Horncastle Arena, Jack Hinton Dve, Addington, Christchurch Restrictions: a-ha, Rick Astley, The Beths Frontier Touring and Roundhouse Entertainment are excited to announce pop icons a-ha will tour New Zealand next March. This is the band's first ever visit to the country and will also mark the return of a day on the green to New Zealand. They'll be joined by very special guest Rick Astley at both New Zealand shows. New Zealand's own guitar pop heroes The Beths will also join the lineup in Auckland Since January 2008 a day on the green has presented concerts in New Zealand by Crowded House, Joe Cocker, Simply Red, The B-52s, The Proclaimers, John Mellencamp, Sheryl Crow, Diana Krall and <mark>Tom Jones</mark>, establishing itself as a major concert brand across the country. Since launching in Australia in 2001, a day on the green has become one of Australia's most popular and premier outdoor concert events. After 470 shows and more than 3.5 million happy patrons, the a day on the green experience of good food, fine wine and great music in magnificent locations remains unrivalled. Now a day on the green is excited to present a-ha! The Norwegian trio who dominated pop charts worldwide during the ’80s, are celebrating the 35th anniversary of their hugely influential debut album Hunting High And Low and will be performing the album in full as well as other favourites from across their career. Selling more than 11 million copies worldwide, it includes the unforgettable \"Take On Me' which peaked at number seven on the New Zealand charts--remaining in the chart for 18 weeks--as well as follow-up hits\" The Sun Always Shines On TV', \"Train Of Thought' and the title track\" Hunting High And Low' Joining a-ha to make this one poptastic event not to be missed is another superstar who dominated the ’80s, Rick Astley--also making his debut in New Zealand. With a treasure trove laden with shimmering pop hits, a-ha and Rick Astley are set to thrill fans with shows in Christchurch at Horncastle Arena on Thursday March 5 and a day on the green on Saturday March 7 at Villa Maria, Auckland. a-ha have also scored global hits with the <mark>James Bond</mark> theme \"The Living Daylights' as well as\" Cry Wolf', \"I've Been Losing You\" and the 2005 Max Martin-collaboration \"Analogue', while their most recent release was an MTV Unplugged collection in 2017 featuring collaborations with Echo & The Bunnymen's <mark>Ian McCulloch</mark> and Alison Moyet. NME recently declared Hunting High And Low as\" one of the albums that have stood the test of time and still sounds great today \"Rick Astley is also enjoying a major career resurgence. The British star has sold more than 40 million albums fuelled by hits like\" Never Gonna Give You Up', \"Whenever You Need Somebody',\" Together Forever', \"When I Fall in Love',\" She Wants To Dance With Me' and \"Cry For Help'. In 2007, Rick became an internet phenomenon becoming the subject of a viral meme known as Rick-rolling, with\" Never Gonna Give You Up' garnering millions of hits on YouTube, introducing him to a whole new audience. Purveyors of high-energy guitar pop, New Zealand four-piece The Beths channel their friendship into high-energy guitar pop with a smart lyrical bite. 2018 was their breakout year, beginning with signing to Carpark Records and Dew Process, before releasing the internationally acclaimed debut album Future Me Hates Me, which was heralded as one of the stand-out music releases of that year. The band have toured relentlessly, getting audiences hooked on their ebullient sound. After selling out shows last year across Australia, New Zealand, North America, UK and Europe, the band are proving to be one of the most in-demand live acts on the planet. With a career spanning four decades, secure your spot now for a-ha's first ever New Zealand tour. Together with very special guest Rick Astley, they have created the pop soundtrack to countless lives, and this promises to be a highlight on the summer concert calendar.", "articleID": "2019072720_00063550_W", "names": {"Ian Mcculloch": ["Q19518682", "Q21455045", "Q2666679", "Q580278", "Q773923"], "James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"], "Tom Jones": ["Q16091498", "Q16730416", "Q180850", "Q23303147", "Q23683528", "Q2439753", "Q7816364", "Q7816370", "Q927200"]}}, {"date": "2019-07-27", "url": "https://www.theepochtimes.com/four-of-nine-aboard-float-plane-crash-on-remote-b-c-island-dead_3019435.html", "content": "A float plane had crashed on Addenbroke Island, about 100 kilometres off the northern end of Vancouver Island, Canada. (Google Earth) Canada Four of Nine Aboard Float Plane Crash on Remote B.C. Island Dead By The Canadian Press July 27, 2019 Updated: July 27, 2019 Share LINKEDIN PINTEREST REDDIT TUMBLR STUMBLEUPON VICTORIA, Canada--Four people have been confirmed dead with five others injured in a float plane crash on an uninhabited island off the northern end of Vancouver Island. Lt. Chelsea Dubeau with the Joint Rescue Co-ordination Centre in Victoria said they received word Friday that a Cessna 208 float plane had crashed on Addenbroke Island, about 100 kilometres off the northern end of Vancouver Island. The centre said the chartered plane that had nine people aboard crashed at about 11 a.m.. It was headed to Calvert Island, a significantly larger neighbouring island, it said. \"Unfortunately we can confirm at this time that there are four individuals that are deceased,\" Dubeau said. #BCEHS paramedics have assessed and treated the five survivors of the Addenbroke Island plane crash. Two patients in serious condition are being airlifted with critical care paramedic teams to Vancouver. Three other patients were transported to a local area hospital .--Emerg Health Services (@ BC_EHS) July 27, 2019 B.C. Emergency Health Services said two of the survivors were airlifted to hospital in Vancouver in serious condition, while three others were taken to a local hospital for treatment of unspecified injuries. Spokeswoman <mark>Shannon Miller</mark> said paramedic ground crews and two air ambulance critical care teams had been staged in Port Hardy for survivors of the crash. Critical care teams are made up of paramedics with the highest level of specialized training, with a focus on acute medical emergencies and air medical responses, she added. Seair Seaplanes, which offers daily charter flights and scenic tour flights in British Columbia, said in a statement that the \"serious accident\" involved one of its Caravan float planes. \"Our thoughts are with those involved in the crash and their loved ones and are devastated by this fatal accident. We are currently working with first responders and authorities and have immediately suspended all flights,\" the statement said. The company said it would provide updates as details become available and its focus was on working with authorities to provide whatever support is needed. Dubeau said the BC Ferries vessel Northern Sea Wolf was on scene quickly because it was nearby and a Canadian Coast Guard helicopter, Cormorant helicopter, and Buffalo fixed-wing plane were all dispatched to lend assistance. Dubeau said no one lives on Addenbroke Island, although there is a lighthouse on the island. The island is on the route the ferry takes from Port Hardy to Prince Rupert. Chris Krepski, a spokesman for the Transportation Safety Board, said the board was gathering information before deciding what its next steps would be. Share this article Show Discussion RECOMMENDED TOP VIDEOS [TSAS Special] \"How We Can Strengthen From Within\" : Mercedes Schlapp on Trump's Approach & Her Time at White House 2d By Jan Jekielek [WCS Special] Larry Elder on His New Show With The Epoch Times; Tackling Racism & Reparations 2d By Jan Jekielek [WCS Special] Why America's Reliance on Imported Uranium Poses a Risk--Rep. Paul Gosar 2d By Jan Jekielek Canada August 23, 2018 Air \"Terrible' in Metro Vancouver, Air Quality Advisory Now Longest on Record By Mimi Nguyen Ly An Air Quality Advisory first issued on Aug. 13 continues as of Aug. 23 for the Metro Vancouver and Fraser Valley regions, making it the longest air...US News June 9, 2019 Plane Crash in New York Kills Everyone on Board, Dog Survives By <mark>Jack Phillips</mark> A pilot and passenger were killed in a small plane crash along Long Island's North Fork, but the dog survived, according to news reports. Officials in the...Crime and Incidents June 24, 2019 9 Men, 2 Women Killed in Hawaii Plane Crash, Feds to Probe Plane Repairs By Isabel van Brugen The skydiving plane that crashed shortly after takeoff from the North Shore of Oahu, Hawaii, on June 21, will have its repair and inspection records reviewed by...Canada July 19, 2019 RCMP Divers Heading to Labrador Lake to Investigate Plane Crash By Margaret Wollensak, The Epoch Times RCMP are heading to a remote lake in northern Labrador to investigate a plane crash that occurred there on Monday, July 15. There were seven people on...Canada July 27, 2019 Police Issue Warning as\" Distraction Thefts' Rise Across Canada By Lily Liu Police forces from Ottawa and Vancouver are warning the public to be careful after a spike in the \"distraction theft\" tactic has been recorded in Canada. In...Canada July 26, 2019 Two Sunwing Employees Among 11 Arrested in Drug Trafficking Probe: RCMP By The Canadian Press TORONTO--Two Sunwing Airlines employees have been accused of smuggling drugs from various Caribbean countries into Canada in a drug-trafficking ring that RCMP allege operated out of Toronto's...Canada July 26, 2019 Missing Quebec Businessman and His Son Found Dead Near Crashed Helicopter By Lily Liu The Quebec police believe the two bodies that have just been found north of Mont Tremblant belong to entrepreneur <mark>Stéphane Roy</mark> and his 14-year-old son Justin, who had...Canada July 26, 2019 Review Says Government Broke No Rules in <mark>Hassan Diab</mark> Extradition Case By The Canadian Press OTTAWA--An external review of the extradition of Ottawa academic <mark>Hassan Diab</mark> has concluded that federal lawyers on the case did their jobs ethically and within the law ....Canada July 26, 2019 Supreme Court of Canada Says Military's No Juries Justice System Constitutional By The Canadian Press OTTAWA--Military members accused of serious offences under military law do not have a constitutional right to a jury trial, the Supreme Court ruled Friday. The Charter of...Canada July 25, 2019 Fake Honey Imports Into Canada Prompt CFIA Investigation By Lily Liu Fake honey--also known as adulterated honey, often mixed with cheap sweeteners such as sugar, corn syrup, rice and beet--has managed to find its way onto the shelves...Canada July 25, 2019 EDC Says Probe Clears Staff After Corruption Claim Related to Snc-Lavalin By The Canadian Press OTTAWA--Export Development Canada says an independent review has cleared its personnel of any wrongdoing after a claim that its staff turned a blind eye to bribery and corruption in a 2011...Canada July 25, 2019 Petition Calling for Fines for Amber Alert Complainers Gathers 78,000 Signatures By Lily Liu A online petition launched by a Toronto woman calling for fines for people who call 911 to complain about Amber Alerts has gathered a total of more...Trump Presidency July 27, 2019 Trump Announces He Is Considering Declaring Antifa a \"Major Organization of Terror' By Janita Kan President Donald Trump announced on July 27 that his administration may declare the far-left extremist group Antifa\" a major organization of terror. \"\"Consideration is being given to declaring ANTIFA, the...International July 27, 2019 Russian Police Arrest More Than 1,000 in Moscow Protest: Monitor By The Associated Press MOSCOW--Russian police arrested more than 600 people on July 27, including prominent activists, around a political protest in Moscow to demand that members of the opposition be...Politics July 27, 2019 Cummings Responds to Trump's Criticism of\" Rat and Rodent Infested' Baltimore By Janita Kan Rep. Elijah Cummings (D-Md .) has responded to criticism from President Donald Trump over the Maryland congressman's treatment of border patrol officials during committee hearings and the conditions of...HK Current Affairs July 27, 2019 Police Fire Tear Gas in Clash With Hong Kong Protesters Over Banned March By Reuters Police fired tear gas during clashes in a rural Hong Kong town on Saturday as several thousand activists gathered to protest. Politics July 27, 2019 Trump Calls for Probes Into Obama Book Deal, Clinton \"Nonsense' By Zachary Stieber President Donald Trump said that the records regarding former President Barack Obama's book deal should be subpoenaed, along with other records, in addition to records having to...Politics July 27, 2019 Trump Lambasts Cummings Over\" Filthy' District in Murder-Riddled Baltimore By Zachary Stieber President Donald Trump called one of the top-ranking Congressional Democrats a \"brutal bully\" early July 27 before lamenting the conditions in the representative's home district. Trump said...Politics July 27, 2019 Rand Paul Offers Money to \"Ungrateful' Omar for Trip to Somalia:\" She Can Look and Learn' By Zachary Stieber Sen. Rand Paul (R-Ky .) offered to give Rep. Ilhan Omar (D-Minn .) money for a trip to Somalia, her country of birth, saying she should go there to...NY News July 27, 2019 SBA Head: New York's Anti-Police Sentiment Causes \"Pantaleo Effect' By Miguel Moreno, The Epoch Times NEW YORK--President Donald Trump pressed the mayor of New York on July 25 to\" stand up \"for police officers who have been doused and sprayed with water ....Asia & Pacific July 27, 2019 2 Dead, 8 Swimming Athletes Hurt in South Korea Balcony Collapse By The Associated Press SEOUL, South Korea--An internal balcony at a nightclub in South Korea collapsed on Saturday, July 27, killing two people and injuring 16 including American and other athletes...Asia & Pacific July 27, 2019 8 Killed in Quake, Aftershocks in Philippines, 60 Injured: Agency By Reuters MANILA--An earthquake and aftershocks struck islands off the north of the Philippines on July 27, killing eight people and injuring 60, disaster officials said. An initial quake...Trump Presidency July 26, 2019 Supreme Court Allows Trump Administration to Use Pentagon Funds for Border Wall By <mark>Jack Phillips</mark> The Supreme Court ruled on July 26 that President Donald Trump can use $2.5 billion in Department of Defense funding to build a portion of the wall...US News July 26, 2019 Judge Dismisses Nick Sandman's Lawsuit Against The Washington Post By Petr Svab A federal judge in Kentucky dismissed a lawsuit against The Washington Post brought by Nick Sandmann, one of the students of Covington Catholic High School who were...Viewpoints July 27, 2019 Are Your Frequent UTIs From the Food You're Eating? By Martha Rosenberg It is no secret that many bacteria causing human infections are developing resistance to the antibiotics that used to kill them. The U.S. Centers for Disease Control...US News July 26, 2019 Man Dies After Weight Loss Surgery in Mexico, 7 Others Infected After Operations by the Same Doctor By Venus Upadhayaya, Epoch Times A Utah man died after undergoing a weight loss surgery in Tijuana, Mexico, according to a press release by the Utah Department of Health on July 22. The...Performing Arts July 27, 2019 Beethoven Celebrates Healing and Divinity By J.H. White It's amazing how good music can lift your mood. On May 10, the string quartet Brooklyn Rider performed live at public radio station WGBH's Fraser Performance Studio...HK Current Affairs July 26, 2019\" Hong Kong Withstand': Comic Artist Uses Brush to Support Hong Kong Protesters By Eva Fu The image has become an emblem of the Hong Kong protests. A young woman wielding a yellow umbrella shields a girl from a torrent of tear gas...Entertainment News July 27, 2019 Joy Villa Slams Bette Midler as \"Crusty Racist' Over Twitter Post About Black Trump Supporters By Janita Kan Actress Bette Midler is facing backlash for a social media post in which she suggested that black attendees of one of President Donald Trump's recent 2020 rallies...Entertainment News July 27, 2019 Bindi Irwin's Brother Robert to Walk Her Down the Aisle at Upcoming Wedding By Zachary Stieber Australian animal expert Bindi Irwin, daughter of the famed\" Crocodile Hunter \"star <mark>Steve Irwin</mark>, will be walked down the aisle at her upcoming wedding by her brother...Food & Dining July 25, 2019 The Top 9 Grilling Mistakes and How to Fix Them By The Associated Press I love to grill, and barbecue, and I have devoted my career to outdoor cooking for more than two decades. In that time, I've seen a lot...Recipes July 25, 2019 Bored of Instant Noodles? You've Never Had Them Like This Before By Sponsored Content Instant noodles make a quick and convenient meal option, ready in little more time than it takes to boil water. But you don't have to be limited...Destinations July 27, 2019 Traveling Back in Time in Switzerland By <mark>Tim Johnson</mark> Together with nearby St. Moritz, the Grand Kronenhof Pontresina is one of Switzerland's most stylish destinations. Destinations July 25, 2019 6 Under-the-Radar Destinations in Europe By Skye Sherman Lesser-known destinations in Europe offer fewer crowds and more authentic, concentrated experiences. Life July 26, 2019 Woman Needs a New Kidney. But Learning Who the Donor Is, She Refuses to Accept It By Li Yen, Epoch Times If you sow seeds of kindness, you will reap kindness. Ingeborg McIntosh, of Phoenix, Arizona, is an incredible woman who has selflessly looked after more than 120...Life July 25, 2019 Boy With Rare Disorder Almost Looks Like a\" Newborn,' but He's Already 3 Years Old By Louise Bevan Many objects fit comfortably in the palms of our hands. Apples, coins, playing cards...but not babies. At least not a newborn human baby boy of...TOP NEWS Trump Announces He Is Considering Declaring Antifa a \"Major Organization of Terror' NEW By Janita Kan Russian Police Arrest More Than 1,000 in Moscow Protest: Monitor 1hr By The Associated Press Cummings Responds to Trump's Criticism of\" Rat and Rodent Infested' Baltimore 3hr By Janita Kan Police Fire Tear Gas in Clash With Hong Kong Protesters Over Banned March 8hr By Reuters Trump Calls for Probes Into Obama Book Deal, Clinton \"Nonsense' 9hr By Zachary Stieber Trump Lambasts Cummings Over\" Filthy' District in Murder-Riddled Baltimore 9hr By Zachary Stieber Rand Paul Offers Money to \"Ungrateful' Omar for Trip to Somalia:\" She Can Look and Learn' 9hr By Zachary Stieber", "articleID": "2019072722_00100223_W", "names": {"Hassan Diab": ["Q5679624", "Q5679626"], "Jack Phillips": ["Q21622368", "Q6114605"], "Shannon Miller": ["Q257672", "Q7488916"], "Steve Irwin": ["Q18161164", "Q7612911"], "Stéphane Roy": ["Q11463771", "Q3502067", "Q659670", "Q7630056"], "Tim Johnson": ["Q21279635", "Q329070", "Q3991363", "Q57844502", "Q7803722", "Q7803724", "Q7803725", "Q7803726", "Q7803727", "Q7803728", "Q861115", "Q925052"]}}, {"date": "2019-07-29", "url": "http://www.gympietimes.com.au/news/aussie-superheroes-skittle-england/3791607/", "content": "Meg Lanning of Australia. Picture: Getty Cricket Aussie superheroes skittle England by Selina Steele in Hove 29th Jul 2019 6:10 AM premium_icon Subscriber only 0 WHAT'S better than one superhero? Two of course. Which is exactly what the Southern Stars have in Meg Lanning and Ellyse Perry. Meg Lanning of Australia dives to make her ground as <mark>Amy Jones</mark> of England takes the bails off during the 2nd Vitality Women's IT20 in Hove, England. Picture: Getty Australia was experiencing a little wobble at 3-35 until Perry joined Lanning for an unbeaten 87-run partnership to claim victory in the second Ashes T20 international. While Lanning's T20 World record of 133 not out was all muscle and force, her knock today at County Ground, Hove was calculated grit. The seven wicket win came with 2.1 overs to spare, Perry finishing on 47 not out and Lanning on 43 not out. But England had its chance with Lanning. If only stand-in keeper <mark>Amy Jones</mark> had the forethought to backhand the ball at the stumps a-la Alyssa Healy. Natalie Sciver of England is bowled out by Georgia Wareham of Australia during the T20 in Hove. Picture: Getty Instead, Lanning survived a run-out scare without having faced a ball. It would have been a diamond duck but Lanning's full body dive, Kate Cross's wide throw and <mark>Jones</mark>'s reach for the stumps were enough to save the Aussie skipper. At that stage Austalia was 1/23. At first it seemed far fetched when England coach <mark>Mark Robinson</mark> said Australia was just a side that were gifted \"God given physical attributes\". Perhaps he was right and this dominance was delivered on divine intervention. Perhaps he was wrong and it was the years of training, preparation and strong domestic competition. Georgia Wareham of Australia celebrates with her teammates. Picture: Getty Either way, Australia continued its summer of dominance with Ellyse Perry becoming the first player, male or female, to reach 1000 runs and 100 wickets in T20 internationals. \"I guess it's lovely, but I wasn't aware of it,\" Perry said. \"I actually think in T20 cricket at international level, we probably play it as much as the men, so I have played a pretty big volume of games now - over 100, so I suppose when you have played 100 games you might get close to it. Ellyse Perry became the first player to reach 1000 runs and 100 wickets in T20 internationals. Picture: Henry Browne/Getty Images\" That's probably the only reason I'm there - because I've played a lot of games. \"It has just been really nice to turn up every game and for us to perform and to find a way to win and win dominantly .\" It was really cool to be out there with Meg. I really enjoy batting with her and she's incredible when she's going. To be at the other end is quite easy really. \"Here's how the game unfolded: IN A SNAPSHOT: England won the toss and perhaps fearing another Meg Lanning masterclass, and the game being over in six overs, decide to bat. On the back of Tammy Beaumont, they bat through the 20 overs finishing 8-121. A six in the final over from Sophie Ecclestone sets Australia a run rate of 6.10. Meg Lanning strikes good form during the first game of the T20 series against England. Picture: Getty After a shaky start, Lanning and Perry to put together a chanceless partnership of 87 to guide Australia to victory. BUNNY BAIT: Australia's Ellyse Perry, opening the bowling, bewitched <mark>Amy Jones</mark> for the fourth time this series. With zero footwork, <mark>Jones</mark> spooned a catch to Georgia Wareham at cover point and England was 1/1 after the first over. THE HEROES: Lanning and Perry. Ridiculously talented, ridiculously smart, ridiculously patient. The composed pair happily waited for the bad ball, which inevitably would come, and easily ticked off the run a ball needed. Beth Mooney has been another star for Australia in the T20 series against England. Picture: Getty A six in the 15th over from Perry saw Australia needing 18 off 28 and it was all over bar a Pimm's to celebrate. SUPPORT ACTS: * Jess Jonassen's wicket in her first over, getting rid of Danni Wyatt, was due to the hot hands of Beth Mooney. Mooney running back with flight of the ball judged the catch perfectly. But ouch - this is where we don't mention her dropping Tammy Beaumont when Beaumont was on 35. But we do have to mention Mooney dropping Beaumont again on 39. Both chances were not as difficult as the one she held. Jonassen takes matters into her own hands and bowls Beaumont for 43 in the 12th over. * Warm up? What warm up! Georgia Wareham snared the dangerous Nat Sciver first ball. The England all rounder went across her stumps to glance the ball down fine leg but completely missed the ball. The leggie then backs this up by snaring England captain <mark>Heather Knight</mark>. Easy as you like, Wareham takes a gentle return catch after <mark>Knight</mark> came at her down the pitch. THE RECORD That player again - Perry. Ellyse Perry received player of the match for Australia in the recent Test against England and is setting records in the T20 arena. Picture: Getty Perry is the first player, either male or female, to complete the double of 100 wickets and 1000 STATE OF PLAY The post-mortem has already begun for England - records have fallen all series and all in favour of the Australians. England's domestic structure is being questioned while Australia's lauded. In comparison, The Southern Stars have set themselves up for a dynasty. Headlined by superstars Meg Lanning and Ellyse Perry, and with the likes of Sophie Molineux and Georgia Wareham coming through it's hard to see other nations catching them. NEXT UP: 3rd T20 International at Bristol on July 31. More green and gold dominance. Can't see where England will find any improvement. Australia to go through the series undefeated. More Stories premium_icon Wade's reluctant Ashes sacrifice rewarded premium_icon Pattinson back and ready to fire in Ashes premium_icon Outcast to Ashes: the reinvention of <mark>David Warner</mark> premium_icon Pattinson delivers a warning to England More Stories premium_icon Wade's reluctant Ashes sacrifice rewarded premium_icon Pattinson back and ready to fire in Ashes premium_icon Outcast to Ashes: the reinvention of <mark>David Warner</mark> premium_icon Pattinson delivers a warning to England Show More 0 australia Read More Login to follow cricket Read More Login to follow england Read More Login to follow sport Read More Login to follow t20 Read More Login to follow australia cricket england sport t20", "articleID": "2019072820_00048916_W", "names": {"Amy Jones": ["Q16224496", "Q43273890"]}}]