[{"date": "2019-07-29", "url": "http://www.gympietimes.com.au/news/aussie-superheroes-skittle-england/3791607/", "content": "Meg Lanning of Australia. Picture: Getty Cricket Aussie superheroes skittle England by Selina Steele in Hove 29th Jul 2019 6:10 AM premium_icon Subscriber only 0 WHAT'S better than one superhero? Two of course. Which is exactly what the Southern Stars have in Meg Lanning and Ellyse Perry. Meg Lanning of Australia dives to make her ground as <mark>Amy Jones</mark> of England takes the bails off during the 2nd Vitality Women's IT20 in Hove, England. Picture: Getty Australia was experiencing a little wobble at 3-35 until Perry joined Lanning for an unbeaten 87-run partnership to claim victory in the second Ashes T20 international. While Lanning's T20 World record of 133 not out was all muscle and force, her knock today at County Ground, Hove was calculated grit. The seven wicket win came with 2.1 overs to spare, Perry finishing on 47 not out and Lanning on 43 not out. But England had its chance with Lanning. If only stand-in keeper <mark>Amy Jones</mark> had the forethought to backhand the ball at the stumps a-la Alyssa Healy. Natalie Sciver of England is bowled out by Georgia Wareham of Australia during the T20 in Hove. Picture: Getty Instead, Lanning survived a run-out scare without having faced a ball. It would have been a diamond duck but Lanning's full body dive, Kate Cross's wide throw and <mark>Jones</mark>'s reach for the stumps were enough to save the Aussie skipper. At that stage Austalia was 1/23. At first it seemed far fetched when England coach <mark>Mark Robinson</mark> said Australia was just a side that were gifted \"God given physical attributes\". Perhaps he was right and this dominance was delivered on divine intervention. Perhaps he was wrong and it was the years of training, preparation and strong domestic competition. Georgia Wareham of Australia celebrates with her teammates. Picture: Getty Either way, Australia continued its summer of dominance with Ellyse Perry becoming the first player, male or female, to reach 1000 runs and 100 wickets in T20 internationals. \"I guess it's lovely, but I wasn't aware of it,\" Perry said. \"I actually think in T20 cricket at international level, we probably play it as much as the men, so I have played a pretty big volume of games now - over 100, so I suppose when you have played 100 games you might get close to it. Ellyse Perry became the first player to reach 1000 runs and 100 wickets in T20 internationals. Picture: Henry Browne/Getty Images\" That's probably the only reason I'm there - because I've played a lot of games. \"It has just been really nice to turn up every game and for us to perform and to find a way to win and win dominantly .\" It was really cool to be out there with Meg. I really enjoy batting with her and she's incredible when she's going. To be at the other end is quite easy really. \"Here's how the game unfolded: IN A SNAPSHOT: England won the toss and perhaps fearing another Meg Lanning masterclass, and the game being over in six overs, decide to bat. On the back of Tammy Beaumont, they bat through the 20 overs finishing 8-121. A six in the final over from Sophie Ecclestone sets Australia a run rate of 6.10. Meg Lanning strikes good form during the first game of the T20 series against England. Picture: Getty After a shaky start, Lanning and Perry to put together a chanceless partnership of 87 to guide Australia to victory. BUNNY BAIT: Australia's Ellyse Perry, opening the bowling, bewitched <mark>Amy Jones</mark> for the fourth time this series. With zero footwork, <mark>Jones</mark> spooned a catch to Georgia Wareham at cover point and England was 1/1 after the first over. THE HEROES: Lanning and Perry. Ridiculously talented, ridiculously smart, ridiculously patient. The composed pair happily waited for the bad ball, which inevitably would come, and easily ticked off the run a ball needed. Beth Mooney has been another star for Australia in the T20 series against England. Picture: Getty A six in the 15th over from Perry saw Australia needing 18 off 28 and it was all over bar a Pimm's to celebrate. SUPPORT ACTS: * Jess Jonassen's wicket in her first over, getting rid of Danni Wyatt, was due to the hot hands of Beth Mooney. Mooney running back with flight of the ball judged the catch perfectly. But ouch - this is where we don't mention her dropping Tammy Beaumont when Beaumont was on 35. But we do have to mention Mooney dropping Beaumont again on 39. Both chances were not as difficult as the one she held. Jonassen takes matters into her own hands and bowls Beaumont for 43 in the 12th over. * Warm up? What warm up! Georgia Wareham snared the dangerous Nat Sciver first ball. The England all rounder went across her stumps to glance the ball down fine leg but completely missed the ball. The leggie then backs this up by snaring England captain <mark>Heather Knight</mark>. Easy as you like, Wareham takes a gentle return catch after <mark>Knight</mark> came at her down the pitch. THE RECORD That player again - Perry. Ellyse Perry received player of the match for Australia in the recent Test against England and is setting records in the T20 arena. Picture: Getty Perry is the first player, either male or female, to complete the double of 100 wickets and 1000 STATE OF PLAY The post-mortem has already begun for England - records have fallen all series and all in favour of the Australians. England's domestic structure is being questioned while Australia's lauded. In comparison, The Southern Stars have set themselves up for a dynasty. Headlined by superstars Meg Lanning and Ellyse Perry, and with the likes of Sophie Molineux and Georgia Wareham coming through it's hard to see other nations catching them. NEXT UP: 3rd T20 International at Bristol on July 31. More green and gold dominance. Can't see where England will find any improvement. Australia to go through the series undefeated. More Stories premium_icon Wade's reluctant Ashes sacrifice rewarded premium_icon Pattinson back and ready to fire in Ashes premium_icon Outcast to Ashes: the reinvention of <mark>David Warner</mark> premium_icon Pattinson delivers a warning to England More Stories premium_icon Wade's reluctant Ashes sacrifice rewarded premium_icon Pattinson back and ready to fire in Ashes premium_icon Outcast to Ashes: the reinvention of <mark>David Warner</mark> premium_icon Pattinson delivers a warning to England Show More 0 australia Read More Login to follow cricket Read More Login to follow england Read More Login to follow sport Read More Login to follow t20 Read More Login to follow australia cricket england sport t20", "articleID": "2019072820_00048916_W", "names": {"David Warner": ["Q3018962", "Q363271", "Q57408725"], "Heather Knight": ["Q23797061", "Q39065853", "Q5693931", "Q5693932"], "Mark Robinson": ["Q10379723", "Q16193334", "Q16232884", "Q18166002", "Q21547424", "Q21553547", "Q21553558", "Q21553677", "Q28974364", "Q3294225", "Q6769469", "Q6769470", "Q6769471", "Q6769473", "Q6769474", "Q6769476", "Q6769479", "Q6769480"]}}, {"date": "2019-07-29", "url": "http://www.gamereactor.eu/userreviews/173/?sid=72de133d030514963352bb57f414c341", "content": "Written by: Paul Voulgaris 2018-10-25 Hello my name is Paul iam big fun on cartoons But: First of all i bought on Xbox one i pre ordered on digital this game because i was so excited to play with my friends but this game need to connect Internet to play offline either solo or Co op 2-4 players second they didnt make an option that you can choose to play online or offline for players who want experience on local counch most of them didnt have Internet to download and to play on Internet its waste of money. The characters has no voice only on signle player drop a balon chat that get hurt from another character no good voice on cars and why says the title racer and you put to fly or boat this game isnt good make only road and put more characters and Dlc maps and char to reveals if you make this game with updates you can sell more than you expect pleaz make update for voices fix only road race with weapons and guys make option for offline for people that they dont have Internet i put this score because i am fun on it not that i like if you fix this guy i put more score on this game. Online by Zalim Chhori on the 26th of July 2019 at 21:40 <mark>Donald Trump</mark> stood support on the South Lawn of the White number House on June 11, waving a folded AOL MAIL DESKTOP GOLD piece of paper in front of the cameras AOL MAIL DESKTOP GOLD that he said was AOL MAIL DESKTOP GOLD an agreement with Mexico AOL MAIL DESKTOP GOLD to address technical the migrant crisis support at the border. \"That's the agreement that customer everybody contact says I don't have,\" he proclaimed. \"I'm going to AOL MAIL DESKTOP GOLD let Mexico do the announcement care at the right number time EUROPE'S LARGEST VIDEO GAME MAGAZINE", "articleID": "2019072903_00070813_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-08-01", "url": "http://woai.com/content/2019-08-01-terminally-ill-patients-in-new-jersey-to-be-allowed-to-end-their-lives/", "content": "Terminally Ill Patients in New Jersey to be Allowed to End Their Lives posted by R.J. Johnson - @ rickerthewriter - Just Now Beginning today (Thursday, August 1), terminally ill adults in the state of New Jersey will be allowed to ask their doctors for prescriptions for medication to help end their lives. The law goes into effect today after New Jersey Gov. <mark>Phil Murphy</mark> signed the Medical Aid in Dying for the Terminally Ill Act that was passed by lawmakers earlier this year. The bill allows for any patient who has a diagnosis of six months of fewer to live to request life-ending medication from the doctors. The law requires the patient undergo counseling by either a psychiatrist or psychologist in order to determine whether the patient has the mental capacity to make such a decision. If approved the patient can get a prescription of a series of self-administered pills that can be taken at home. \"Allowing residents with terminal illnesses to make end-of-life choices for themselves is the right thing to do,\" said Governor <mark>Murphy</mark> when he signed the bill in April. \"By signing this bill today, we are providing terminally ill patients and their families with the humanity, dignity, and respect that they so richly deserve at the most difficult times any of us will face .\" The bill has floated around the New Jersey legislature stretching back to 2014, but this was the first time it made it to the state Senate for a vote. It narrowly passed, with many concerned about its effects. Supporters on the other hand, including several terminally ill patients cheered the law when it was passed. \"Just having this option is a godsend that will enable me to live the rest of my life, however long it is, as fully as possible knowing I won't have to suffer needlessly at the end,\" said supporter Susan Boyce, a Rumson resident who has a terminal lung disease. Several other states in the U.S. allow physician-assisted suicide including: California, Oregon, Washington, Hawaii, Montana, Colorado, Vermont and the District of Columbia. Another nineteen states are reportedly considering similar physician-assisted suicide bills. Photo: Getty Images", "articleID": "2019080117_00100716_W", "names": {"Phil Murphy": ["Q260042", "Q3378818", "Q7182210", "Q7182211"]}}, {"date": "2019-08-02", "url": "http://www.thedailystar.net/world/news/north-korea-increases-pressure-latest-missile-launches-1780696", "content": "11:30 AM, August 02, 2019 / LAST MODIFIED: 11:38 AM, August 02, 2019 NKorea increases pressure with latest missile launches People watch a TV showing a file picture of a North Korean missile for a news report on North Korea firing short-range ballistic missiles, in Seoul, South Korea, on August 2, 2019. Photo: Reuters Reuters, Seoul North Korea fired missiles for the third time in eight days on Friday, a series of launches that analysts say are designed to improve military capabilities and pressure the United States and South Korea as they seek to restart denuclearisation talks. US President Donald Trump, who has been hoping to revive the stalled talks with North Korea, played down the launches. The North has been testing missiles despite Trump's June 30 meeting with North Korean leader <mark>Kim Jong Un</mark>, where they agreed to revive the talks. South Korea's government said the latest projectiles fired by the North appeared to be new short-range ballistic missiles. The missiles flew 220 km (135 miles) and reached an altitude of 25 km (15 miles), the Joint Chiefs of Staff (JCS) in Seoul said. A US official said US intelligence had detected at least one projectile, and possibly more, that did not pose a threat to North America. US officials said initial information indicated they were similar to two other short-range missile tests by Pyongyang since last week. North Korean state media said <mark>Kim</mark> oversaw the firing of what it described as a new large-calibre, multiple-launch guided rocket system on Wednesday. He also observed the launch of a short-range ballistic missile last week. The launches appear to be intended to put pressure on South Korea and the United States to stop planned military exercises later this month and offer other concessions. <mark>Kim</mark>'s government was not only signalling negotiating demands with the tests, it was assiduously improving military capabilities, said Leif-Eric Easley, an international relations professor at Seoul's Ewha University. \"The aim is not only to increase Pyongyang's ability to coerce its neighbours, another goal is to normalise North Korea's sanctions-violating tests as if they were as legitimate as South Korea's defensive exercises,\" Easley said. Trump was asked at the White House before he set off for a campaign trip to Ohio if he thought <mark>Kim</mark> was testing him and said the launches did not violate the North Korean leader's promises to him. Trump said they were short-range missiles. \"We never made an agreement on that. I have no problem,\" he said. While Trump says he never made an agreement on short-range missiles, the 15-member United Nations Security Council unanimously demanded in 2006 that North Korea suspend all activities related to its ballistic missile programme and \"re-establish its pre-existing commitments to a moratorium on missile launching\". The <mark>UN</mark> Security Council met behind closed doors in New York on Thursday to discuss the latest missile launches. Representatives from Britain, France and Germany called on North Korea after the meeting to engage in meaningful talks with the United States and said international sanctions need to be fully enforced until Pyongyang has dismantled its nuclear and ballistic missile programmes. The Japanese Ministry of Defence said on Friday no immediate impact was seen on Japan's security after North Korea's latest launch. No ballistic missiles had reached Japan's territory or its exclusive economic zone, it said in a statement. Related Topics", "articleID": "2019080205_00089801_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}}, {"date": "2019-08-02", "url": "http://www.windsorobserver.co.uk/news/17813001.launch-lyra-mckee-book-bittersweet-family/", "content": "News Launch of Lyra McKee book \"bittersweet' for family By Press Association 2019 Nichola Corner 0 comment The sister of Lyra McKee has described seeing her book in print as\" bittersweet \". The 29-year-old journalist was shot dead by dissident republicans in April just weeks before her book, Angels With Blue Faces, was due to be published. Her murder while observing a riot in the Creggan area of Londonderry sparked outrage across the world. Irish President Michael D Higgins, former prime minister Theresa May and Taoiseach Leo Varadkar were among the mourners who attended her funeral. The book follows an investigation by Ms McKee into the murder of Ulster Unionist MP <mark>Robert Bradford</mark> in 1981, and examines speculation that he had been about to expose details of people involved with the abuse of children at the east Belfast boys' home Kincora. Lyra McKee was killed while observing a disturbance (Chiho Tang/Oranga Creative/PA) In the book, Ms McKee writes that she began her research when she was 22 years old and was inspired to write a non-fiction story that read like a novel. Her sister Nichola Corner said they were so proud to see her book in print but wished she was there to share the moment .\" We're extremely proud of her, it's obviously very bittersweet that she is not here with us to hold it because the book had meant so much to her and had circumstances been different we would have been celebrating this achievement with her. Unfortunately she isn't here to celebrate it but that doesn't meant we are not still proud of her. \"Our pride continues and we are so pleased she got it into a print version because she wanted it so much for so long for other people to read the story as well .\" Ms Corner said her sister came upon Mr <mark>Bradford</mark>'s murder while investigating another story at the Linenhall Library in Belfast. Taoiseach Leo Varadkar, ex-PM <mark>Theresa May</mark>, President Michael D Higgins and Lord Lieutenant of Belfast Fionnuala Jay-O’Boyle during the funeral service for murdered journalist Lyra McKee at St Anne's Cathedral in Belfast (PA) The library was the venue on Friday for the launch of Ms McKee's book. \"She was researching about the Kincora scandal when she had come across news reports about <mark>Robert Bradford</mark> and she initially wondered who he was, and began looking into him a little bit more,\" she said. \"The story was really born here in this library, and then her curiosity became insatiable and she wanted to know absolutely everything about him, the circumstances of his murder, and that became the springboard for her delving deeper and deeper into the story .\" She felt she needed to tell their story in order to try and clear up some rumours that had surrounded the nature of the murder. \"Lyra McKee's partner Sara Canning attended the book launch (Liam McBurney/PA) Ms McKee's book had been due to be published by Excalibur Press before her death. Excalibur Press owner Tina Calder said publishing the book had been an emotional time for her team, but said it is\" an immense honour to be able to bring Lyra's life's work into the public eye \".\" Excalibur Press will be donating our commission to our not-for-profit entity The Merlin Project where we hope to run a series of events, workshops and potentially courses for young reporters wanting to learn some of the practical aspects of the industry, \"she said .\" Taking inspiration from Lyra and her talent, we hope to teach young journalists the art of research as well as interview techniques and more. \"Angels With Blue Faces published by Excalibur Press is available now, priced £ 9.99, from excaliburpress. co. uk/lyra-mckee. 0 comment", "articleID": "2019080216_00061003_W", "names": {"Robert Bradford": ["Q19596744", "Q7342296"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2019-08-02", "url": "http://www.entertainmentdaily.co.uk/daytime-tv/this-morning/this-morning-slammed-for-glamourising-shoplifting-by-interviewing-career-criminal-kim-parry/", "content": "Share Share Share This Morning viewers have slammed the ITV show for featuring an allegedly \"inappropriate\" and \"pointless\" interview with a career criminal. On Friday (August 2), Kim Farry joined hosts <mark>Ben Shephard</mark> and Rochelle Humes in the studio to talk about her profitable life as a shoplifter. She claims to have stolen goods worth £ 2million (Credit: ITV) Read more: Harry Judd's wife Izzy admits to guilt over finding motherhood hard after fertility issues and miscarriage And it wasn't the first time she had appeared on the show. Kim, who now says she has turned over a new leaf, claims her illegal lifestyle allowed her to wear designer clothes, drive expensive cars and go on endless holidays. Her 45-year shoplifting habit once saw her \"earn' up to £ 20,000 pounds a month - two million pounds in total! She told <mark>Ben</mark> and Rochelle:\" In the end, because I was so good at it, it was just a business. Like you've got a job, I've got a job. \"Kim now wants to help others escape crime (Credit: ITV) Read more: Mum of brain-damaged Tafida Raqeeb pleads with doctors to let her live She also admitted she became so successful at stealing that she began to employ other people to go back to stores with de-tagged stolen goods and get money back for them. However, after serving five prison sentences, Kim has now decided to leave it all behind for the sake of her daughter Paris who\" wanted a normal life \". What's with this interview? Feels like it's glamorising shoplifting? Completely inappropriate! She has now written a book about her crimes, with part of the fee going to charity she says, which she discussed with the This Morning hosts. But fans weren't happy about her appearance on the show at all, and accused them of\" glamorising \"criminality. What's with this interview? Feels like its glamourising shoplifting? Getting a step by step on how to do it too. Completely inappropriate. #ThisMorning--Sian Humphreys (@ Sian_humphreys) August 2, 2019 Why put this woman on again. Giving a vile thief airtime. Even Schofe told her things should be bolted down to stop her robbing. Get a job you rat #ThisMorning pic.twitter.com/aoKJrEh2ay--LFCFan (@ LFCSIXTIMES123) August 2, 2019 This woman giving top advice on how to steal?? #ThisMorning--stacey ♡ (@ SLG__x) August 2, 2019 Y on earth would #thismorning pay someone 2 sit of that sofa telling the country she's a thief and criminal. Beggars belief .--2012 (@ Bufferb2012) August 2, 2019 Morales of an alley cat, disgusting. #thismorning should b ashamed .--2012 (@ Bufferb2012) August 2, 2019 Why have the brought this absolute scum bag on #thismorning trying to justify theft??--<mark>Alex Smith</mark> (@ DiscourseIsDead) August 2, 2019 Well done this morning. With your shoplifting guest on your program today you have told the nation how to conceal items and shop lift #ThisMorning--Claire Roberts (@ clairejoroberts) August 2, 2019 What is the point of this interview? Bloody thief #thismorning--jonah (@ jonahmoffster) August 2, 2019 So @ thismorning is promoting a thief who now is writing a book. What are the chances of the profits going back to the companies that she stole from? People have probably lost jobs and businesses because of this woman. Shoplifting is not a victimless crime!--Doug Flo (@ DougFlo) August 2, 2019 @ thismorning don't promote thief's. Regardless of how much they regret it a criminal is a criminal #ThisMorning--Mr IMPACT Blog (@ MrImpact_blog) August 2, 2019 One fumed:\" What's with this interview? Feels like it's glamorising shoplifting? Getting a step-by-step on how to do it too. Completely inappropriate. #ThisMorning. \"Another agreed, recalling when she was on the show before, typing:\" Why put this woman on again? Giving a vile thief airtime? Even Schofe told her things should be bolted down to stop her robbing. Get a job you rat #ThisMorning. \"A third blasted:\" Why on earth would T his Morning pay someone to sit on that sofa telling the country she's a thief and criminal? Beggars belief. Morals of an alley cat, disgusting. This Morning should be ashamed. \"Sorry Kim, the viewers just weren't that into you! (Credit: ITV.com)\" Why have they brought this absolute scumbag on T his Morning trying to justify theft? \"asked another, while one more tweeted:\" So This Morning is promoting a thief who now is writing a book. \"What are the chances of the profits going back to the companies that she stole from? People have probably lost jobs and businesses because of this woman. Shoplifting is not a victimless crime!\" Do you think it was wrong to give Kim Farry airtime? Leave us a comment on our Facebook page @ EntertainmentDailyFix and let us know what you think! Share Share Share Trending Articles Gareth Gates shares beautiful photo with \"lookalike' daughter Love Island host Caroline Flack goes official with new man Lewis Burton Emmerdale star James Hooton shows off climbing skills on holiday Holly Willoughby horrified as husband Dan suffers hilarious mishap on holiday with Phillip Schofield The Chase's Bradley Walsh warns <mark>Jenny Ryan</mark> to\" settle down' after harsh comment about contestant Abbey Clancy shares beautiful family pic with husband Peter and all four kids More This Morning Harry Judd's wife Izzy admits to guilt over finding motherhood hard after fertility issues and miscarriage Sophie Brady shows off size 20 body in a bikini and insists she's healthy Mum of brain-damaged Tafida Raqeeb pleads with doctors to let her live Strictly star Susannah Constantine reveals lifelong anxiety left her praying she'd be hit by a lorry This Morning caller swears live on air after technical glitch nearly robbed her of prize This Morning guest insists grandparents should get consent before kissing grandkids This Morning viewers gobsmacked as woman \"MARRIES' her dog live on show Jessie J shuts down <mark>Ben Shephard</mark> on This Morning when he asks about famous boyfriend This Morning viewers divided over\" animal lover' mum who hunts and kills animals to feed family This Morning opens with technical blunder as blue title card appears on viewers' screens This Morning slammed for \"glamorising shoplifting' by interviewing career criminal AGAIN Latest News Carol Vorderman reveals secret to her incredible figure at 58 The Chase star <mark>Jenny Ryan</mark> clashes with fan who describes chasers as\" rude and snarky' EastEnders' Jessica Plummer shares adorable photo of daughter Noa Lily on her third birthday Billie Faiers mocked by fans for having yet another holiday Coronation Street's Dolly-Rose Campbell looks a world away from chavvy Gemma as she shares holiday pics Love Island host Caroline Flack goes official with new man Lewis Burton Hollyoaks' <mark>Stephanie Davis</mark> unveils new long blonde hair Love Island's Iain Stirling predicts winter version of show will be bigger hit <mark>Katie Price</mark> \"faces row with ex Peter Andre as she refuses to take drug test' Holly Willoughby horrified as husband Dan suffers hilarious mishap on holiday with Phillip Schofield", "articleID": "2019080218_00063817_W", "names": {"Alex Smith": ["Q12720234", "Q16658140", "Q20011588", "Q2833039", "Q4717806", "Q4717807", "Q4717808", "Q4717809", "Q4717810", "Q4717811", "Q4717812", "Q4717814", "Q4717815", "Q4717818", "Q4717819", "Q57417658", "Q717897"], "Ben Shephard": ["Q4886455", "Q4886456"]}}]