[{"date": "2019-08-02", "url": "http://www.entertainmentdaily.co.uk/daytime-tv/this-morning/this-morning-slammed-for-glamourising-shoplifting-by-interviewing-career-criminal-kim-parry/", "content": "Share Share Share This Morning viewers have slammed the ITV show for featuring an allegedly \"inappropriate\" and \"pointless\" interview with a career criminal. On Friday (August 2), Kim Farry joined hosts <mark>Ben Shephard</mark> and Rochelle Humes in the studio to talk about her profitable life as a shoplifter. She claims to have stolen goods worth £ 2million (Credit: ITV) Read more: Harry Judd's wife Izzy admits to guilt over finding motherhood hard after fertility issues and miscarriage And it wasn't the first time she had appeared on the show. Kim, who now says she has turned over a new leaf, claims her illegal lifestyle allowed her to wear designer clothes, drive expensive cars and go on endless holidays. Her 45-year shoplifting habit once saw her \"earn' up to £ 20,000 pounds a month - two million pounds in total! She told <mark>Ben</mark> and Rochelle:\" In the end, because I was so good at it, it was just a business. Like you've got a job, I've got a job. \"Kim now wants to help others escape crime (Credit: ITV) Read more: Mum of brain-damaged Tafida Raqeeb pleads with doctors to let her live She also admitted she became so successful at stealing that she began to employ other people to go back to stores with de-tagged stolen goods and get money back for them. However, after serving five prison sentences, Kim has now decided to leave it all behind for the sake of her daughter Paris who\" wanted a normal life \". What's with this interview? Feels like it's glamorising shoplifting? Completely inappropriate! She has now written a book about her crimes, with part of the fee going to charity she says, which she discussed with the This Morning hosts. But fans weren't happy about her appearance on the show at all, and accused them of\" glamorising \"criminality. What's with this interview? Feels like its glamourising shoplifting? Getting a step by step on how to do it too. Completely inappropriate. #ThisMorning--Sian Humphreys (@ Sian_humphreys) August 2, 2019 Why put this woman on again. Giving a vile thief airtime. Even Schofe told her things should be bolted down to stop her robbing. Get a job you rat #ThisMorning pic.twitter.com/aoKJrEh2ay--LFCFan (@ LFCSIXTIMES123) August 2, 2019 This woman giving top advice on how to steal?? #ThisMorning--stacey ♡ (@ SLG__x) August 2, 2019 Y on earth would #thismorning pay someone 2 sit of that sofa telling the country she's a thief and criminal. Beggars belief .--2012 (@ Bufferb2012) August 2, 2019 Morales of an alley cat, disgusting. #thismorning should b ashamed .--2012 (@ Bufferb2012) August 2, 2019 Why have the brought this absolute scum bag on #thismorning trying to justify theft??--<mark>Alex Smith</mark> (@ DiscourseIsDead) August 2, 2019 Well done this morning. With your shoplifting guest on your program today you have told the nation how to conceal items and shop lift #ThisMorning--Claire Roberts (@ clairejoroberts) August 2, 2019 What is the point of this interview? Bloody thief #thismorning--jonah (@ jonahmoffster) August 2, 2019 So @ thismorning is promoting a thief who now is writing a book. What are the chances of the profits going back to the companies that she stole from? People have probably lost jobs and businesses because of this woman. Shoplifting is not a victimless crime!--Doug Flo (@ DougFlo) August 2, 2019 @ thismorning don't promote thief's. Regardless of how much they regret it a criminal is a criminal #ThisMorning--Mr IMPACT Blog (@ MrImpact_blog) August 2, 2019 One fumed:\" What's with this interview? Feels like it's glamorising shoplifting? Getting a step-by-step on how to do it too. Completely inappropriate. #ThisMorning. \"Another agreed, recalling when she was on the show before, typing:\" Why put this woman on again? Giving a vile thief airtime? Even Schofe told her things should be bolted down to stop her robbing. Get a job you rat #ThisMorning. \"A third blasted:\" Why on earth would T his Morning pay someone to sit on that sofa telling the country she's a thief and criminal? Beggars belief. Morals of an alley cat, disgusting. This Morning should be ashamed. \"Sorry Kim, the viewers just weren't that into you! (Credit: ITV.com)\" Why have they brought this absolute scumbag on T his Morning trying to justify theft? \"asked another, while one more tweeted:\" So This Morning is promoting a thief who now is writing a book. \"What are the chances of the profits going back to the companies that she stole from? People have probably lost jobs and businesses because of this woman. Shoplifting is not a victimless crime!\" Do you think it was wrong to give Kim Farry airtime? Leave us a comment on our Facebook page @ EntertainmentDailyFix and let us know what you think! Share Share Share Trending Articles Gareth Gates shares beautiful photo with \"lookalike' daughter Love Island host Caroline Flack goes official with new man Lewis Burton Emmerdale star James Hooton shows off climbing skills on holiday Holly Willoughby horrified as husband Dan suffers hilarious mishap on holiday with Phillip Schofield The Chase's Bradley Walsh warns <mark>Jenny Ryan</mark> to\" settle down' after harsh comment about contestant Abbey Clancy shares beautiful family pic with husband Peter and all four kids More This Morning Harry Judd's wife Izzy admits to guilt over finding motherhood hard after fertility issues and miscarriage Sophie Brady shows off size 20 body in a bikini and insists she's healthy Mum of brain-damaged Tafida Raqeeb pleads with doctors to let her live Strictly star Susannah Constantine reveals lifelong anxiety left her praying she'd be hit by a lorry This Morning caller swears live on air after technical glitch nearly robbed her of prize This Morning guest insists grandparents should get consent before kissing grandkids This Morning viewers gobsmacked as woman \"MARRIES' her dog live on show Jessie J shuts down <mark>Ben Shephard</mark> on This Morning when he asks about famous boyfriend This Morning viewers divided over\" animal lover' mum who hunts and kills animals to feed family This Morning opens with technical blunder as blue title card appears on viewers' screens This Morning slammed for \"glamorising shoplifting' by interviewing career criminal AGAIN Latest News Carol Vorderman reveals secret to her incredible figure at 58 The Chase star <mark>Jenny Ryan</mark> clashes with fan who describes chasers as\" rude and snarky' EastEnders' Jessica Plummer shares adorable photo of daughter Noa Lily on her third birthday Billie Faiers mocked by fans for having yet another holiday Coronation Street's Dolly-Rose Campbell looks a world away from chavvy Gemma as she shares holiday pics Love Island host Caroline Flack goes official with new man Lewis Burton Hollyoaks' <mark>Stephanie Davis</mark> unveils new long blonde hair Love Island's Iain Stirling predicts winter version of show will be bigger hit <mark>Katie Price</mark> \"faces row with ex Peter Andre as she refuses to take drug test' Holly Willoughby horrified as husband Dan suffers hilarious mishap on holiday with Phillip Schofield", "articleID": "2019080218_00063817_W", "names": {"Jenny Ryan": ["Q16832087", "Q21066498"], "Katie Price": ["Q21466514", "Q237602"], "Stephanie Davis": ["Q6134141", "Q7608260"]}}, {"date": "2019-08-01", "url": "http://commondreams.org/news/2019/08/01/33-house-democrats-demand-resignation-us-border-patrol-chief-over-secret-facebook", "content": "Common Dreams 33 House Democrats Demand Resignation of U.S. Border Patrol Chief Over Secret Facebook Group The lawmakers wrote in a new letter that Carla Provost \"was a willing participant\" in the group, where agency staff shared \"atrocious commentary that stokes racist and xenophobic tropes .\" by 0 Comments U.S. Border Patrol Chief Carla Provost testified before the Judiciary Committee hearing on the subject \"The MS-13 Problem: Investigating Gang Membership, its Nexus to Illegal Immigration, and Federal Efforts to End the Threat\" at the Dirksen Senate Office Building on June 21, 2017. (Photo: Donna Burton/CBP/cc) In a letter Thursday to Acting Homeland Security Secretary <mark>Kevin McAleenan</mark>, 33 House Democrats demanded that U.S. Border Patrol Chief Carla Provost resign over her participation in a secret Facebook group in which members of the federal agency shared racist, sexist, and violent comments about migrants and members of Congress. Early last month, ProPublica reported on a Facebook group called \"I'm 10-15,\" which references the Border Patrol code for \"aliens in custody .\" Created in August of 2016, the group had nearly 10,000 members who were currently or formerly employed by the Department of Homeland Security. Just days after the initial report, The Intercept's Ryan Devereaux revealed that Provost was a member of the group. The nearly three dozen lawmakers, including Democratic Reps. Ayanna Pressley (Mass.) and Susan Wild (Penn.), charged in their letter (pdf) to <mark>McAleenan</mark> that Provost \"has lost the public's confidence that she can faithfully execute the responsibilities of her position without bias or prejudice .\" They wrote in part: Ms. Provost was a willing participant in a secret Facebook group used by employees of her agency to share [contemptible] and atrocious commentary that stokes racist and xenophobic tropes that have no place in private, much less in public service. The Facebook group, originally known as \"I'm 10-15,\" generated content that joked about migrant deaths and throwing burritos at Members of Congress, and even went so far as to make sexually violent and threatening statements about female members of Congress who came to the border to inspect the conditions at detention centers. We worry this content impugns the character of the U.S. Border Patrol as a whole. While Provost initially publicly expressed surprise about the group, promised that employees who participated would be held accountable, and said the DHS Inspector General's Office would be investigating the matter, the letter pointed out that \"conspicuously absent from her statement was an admission that she had been a member of the Facebook group for months .\" \"It is Ms. Provost's responsibility to discipline employees who fall under her agency's auspices, not participate in conduct unbecoming of her office,\" the lawmakers declared, calling on <mark>McAleenan</mark> \"to follow Ms. Provost's own promise of accountability, by immediately seeking her resignation .\" In a tweet announcing the letter, Pressley called Provost's participation in the group \"deeply disturbing and absolutely unacceptable .\" She wrote that if <mark>McAleenan</mark> \"has one ounce of dignity left, he'll demand her resignation immediately .\" The @ CBP Chief's participation in a group filled with racist & misogynistic attacks on Members of Congress & migrant families in her care is deeply disturbing & absolutely unacceptable. If @ DHSMcAleenan has one ounce of dignity left, he'll demand her resignation immediately. pic.twitter.com/PHrYythp4p--Congresswoman Ayanna Pressley (@ RepPressley) August 1, 2019 The lawmakers, in the letter, also highlighted the humanitarian crisis at the U.S. Southern border--from the forcible separation of children from their parents to the inhumane conditions in which migrants have been detained. According to the letter Thursday, \"the callousness displayed in the Facebook group is matched only by the callous treatment of children detainees under Ms. Provost's watch .\" SCROLL TO CONTINUE WITH CONTENT Get our best delivered to your inbox. \"The conditions at these detention centers--which include limited access to basic hygienic needs like showers, toothpaste, and clean clothes--are not just failures of sufficient funding, they are failures of leadership,\" the letter continued. \"These Facebook posts suggest that the culprit is not just lack of resources but a level of malice that has no place in the policing of our borders .\" In addition to Pressley and Wild, the letter was also signed by Democratic Reps. <mark>Karen Bass</mark> (Calif.), <mark>Steve Cohen</mark> (Tenn.), Madeleine Dean (Penn.), Rosa DeLauro (Conn.), Nanette Diaz Barragan (Calif.), Madeleine Dean (Penn.), Adriano Espaillat (N.Y.), <mark>Dwight Evans</mark> (Penn.), <mark>Ruben Gallego</mark> (Ariz.), Sylvia Garcia (Texas), Raul Grijalva (Ariz.), Deb Haaland (N.M.), Pramila Jayapal (Wash.), Barbara Lee (Calif.), Andy Levin (Mich.), Alan Lowenthal (Calif.), Ben Ray Lujan (N.M.), Tom Malinowski (N.J.), <mark>Jim McGovern</mark> (Mass.), Gregory Meeks (N.Y.), Frank Pallone (N.J.), <mark>Donald Payne</mark> Jr. (N.J.), Mark Pocan (Wis.), <mark>Bobby Rush</mark> (Ill.), Jan Schakowsky (Ill.), Darren Soto (Fla.), Rashida Tlaib (Mich.), <mark>Juan Vargas</mark> (Calif.), Marc Veasey (Texas), Nydia Velazquez (N.Y.), and Bonnie Watson Coleman (N.J.). Read the full letter below: Dear Acting Secretary <mark>McAleenan</mark>: We, the undersigned Members of Congress, request that you immediately request the resignation of Carla Provost, Chief of the U.S. Border Patrol, who has lost the public's confidence that she can faithfully execute the responsibilities of her position without bias or prejudice. Ms. Provost was a willing participant in a secret Facebook group used by employees of her agency to share contemptable and atrocious commentary that stokes racist and xenophobic tropes that have no place in private, much less in public service. The Facebook group, originally known as \"I'm 10-15,\" generated content that joked about migrant deaths and throwing burritos at Members of Congress, and even went so far as to make sexually violent and threatening statements about female members of Congress who came to the border to inspect the conditions at detention centers. We worry this content impugns the character of the U.S. Border Patrol as a whole. Earlier this month, Ms. Provost expressed surprise about the Facebook group at issue and publicly stated, \"[t] hese posts are completely inappropriate and contrary to the honor and integrity I see--and expect--from our agents day in and day out .\" She also promised that \"[a] ny employees found to have violated our standards of conduct will be held accountable .\" At that same time, she stated that she had alerted the DHS Inspector General's Office and an investigation would be launched. Conspicuously absent from her statement was an admission that she had been a member of the Facebook group for months--as evidenced by her comments on a particular post questioning her ascent to Chief--or an explanation as to why she hadn't already alerted DHS of the Facebook group. As Chief of U.S. Border Patrol it is Ms. Provost's responsibility to discipline employees who fall under her agency's auspices, not participate in conduct unbecoming of her office. It appears that to date CBP employees have only received cease and desist letters or been placed on administrative duties pending investigation--and only after the Facebook group came to light through news reports. For the avoidance of any doubt, the callousness displayed in the Facebook group is matched only by the callous treatment of children detainees under Ms. Provost's watch. The conditions at these detention centers--which include limited access to basic hygienic needs like showers, toothpaste, and clean clothes--are not just failures of sufficient funding, they are failures of leadership. These Facebook posts suggest that the culprit is not just lack of resources but a level of malice that has no place in the policing of our borders. As Members of Congress, we are committed to ensuring that those who occupy top positions in federal government are held to the highest standards. This is especially true of the Chief of U.S. Border Patrol, at a time when conditions at our southern border have reached a crisis point. As such, we urge you to follow Ms. Provost's own promise of accountability, by immediately seeking her resignation. Our work is licensed under a Creative Commons Attribution-Share Alike 3.0 License. Feel free to republish and share widely. This is the world we live in. This is the world we cover. Because of people like you, another world is possible. There are many battles to be won, but we will battle them together--all of us. Common Dreams is not your normal news site. We don't survive on clicks. We don't want advertising dollars. We want the world to be a better place. But we can't do it alone. It doesn't work that way. We need you. If you can help today--because every gift of every size matters--please do. Without Your Support We Won't Exist. Please select a donation method: Share This Article", "articleID": "2019080222_00025646_W", "names": {"Bobby Rush": ["Q888599", "Q888655"], "Donald Payne": ["Q39075328", "Q5294987"], "Dwight Evans": ["Q5318148", "Q5318152"], "Jim Mcgovern": ["Q1337459", "Q57913018", "Q584351", "Q6196820"], "Juan Vargas": ["Q20899722", "Q3791701"], "Karen Bass": ["Q23662231", "Q23830953", "Q461739"], "Kevin Mcaleenan": ["Q21467160", "Q30122656"]}}]