[{"date": "2019-08-01", "url": "http://commondreams.org/news/2019/08/01/33-house-democrats-demand-resignation-us-border-patrol-chief-over-secret-facebook", "content": "Common Dreams 33 House Democrats Demand Resignation of U.S. Border Patrol Chief Over Secret Facebook Group The lawmakers wrote in a new letter that Carla Provost \"was a willing participant\" in the group, where agency staff shared \"atrocious commentary that stokes racist and xenophobic tropes .\" by 0 Comments U.S. Border Patrol Chief Carla Provost testified before the Judiciary Committee hearing on the subject \"The MS-13 Problem: Investigating Gang Membership, its Nexus to Illegal Immigration, and Federal Efforts to End the Threat\" at the Dirksen Senate Office Building on June 21, 2017. (Photo: Donna Burton/CBP/cc) In a letter Thursday to Acting Homeland Security Secretary <mark>Kevin McAleenan</mark>, 33 House Democrats demanded that U.S. Border Patrol Chief Carla Provost resign over her participation in a secret Facebook group in which members of the federal agency shared racist, sexist, and violent comments about migrants and members of Congress. Early last month, ProPublica reported on a Facebook group called \"I'm 10-15,\" which references the Border Patrol code for \"aliens in custody .\" Created in August of 2016, the group had nearly 10,000 members who were currently or formerly employed by the Department of Homeland Security. Just days after the initial report, The Intercept's Ryan Devereaux revealed that Provost was a member of the group. The nearly three dozen lawmakers, including Democratic Reps. Ayanna Pressley (Mass.) and Susan Wild (Penn.), charged in their letter (pdf) to <mark>McAleenan</mark> that Provost \"has lost the public's confidence that she can faithfully execute the responsibilities of her position without bias or prejudice .\" They wrote in part: Ms. Provost was a willing participant in a secret Facebook group used by employees of her agency to share [contemptible] and atrocious commentary that stokes racist and xenophobic tropes that have no place in private, much less in public service. The Facebook group, originally known as \"I'm 10-15,\" generated content that joked about migrant deaths and throwing burritos at Members of Congress, and even went so far as to make sexually violent and threatening statements about female members of Congress who came to the border to inspect the conditions at detention centers. We worry this content impugns the character of the U.S. Border Patrol as a whole. While Provost initially publicly expressed surprise about the group, promised that employees who participated would be held accountable, and said the DHS Inspector General's Office would be investigating the matter, the letter pointed out that \"conspicuously absent from her statement was an admission that she had been a member of the Facebook group for months .\" \"It is Ms. Provost's responsibility to discipline employees who fall under her agency's auspices, not participate in conduct unbecoming of her office,\" the lawmakers declared, calling on <mark>McAleenan</mark> \"to follow Ms. Provost's own promise of accountability, by immediately seeking her resignation .\" In a tweet announcing the letter, Pressley called Provost's participation in the group \"deeply disturbing and absolutely unacceptable .\" She wrote that if <mark>McAleenan</mark> \"has one ounce of dignity left, he'll demand her resignation immediately .\" The @ CBP Chief's participation in a group filled with racist & misogynistic attacks on Members of Congress & migrant families in her care is deeply disturbing & absolutely unacceptable. If @ DHSMcAleenan has one ounce of dignity left, he'll demand her resignation immediately. pic.twitter.com/PHrYythp4p--Congresswoman Ayanna Pressley (@ RepPressley) August 1, 2019 The lawmakers, in the letter, also highlighted the humanitarian crisis at the U.S. Southern border--from the forcible separation of children from their parents to the inhumane conditions in which migrants have been detained. According to the letter Thursday, \"the callousness displayed in the Facebook group is matched only by the callous treatment of children detainees under Ms. Provost's watch .\" SCROLL TO CONTINUE WITH CONTENT Get our best delivered to your inbox. \"The conditions at these detention centers--which include limited access to basic hygienic needs like showers, toothpaste, and clean clothes--are not just failures of sufficient funding, they are failures of leadership,\" the letter continued. \"These Facebook posts suggest that the culprit is not just lack of resources but a level of malice that has no place in the policing of our borders .\" In addition to Pressley and Wild, the letter was also signed by Democratic Reps. <mark>Karen Bass</mark> (Calif.), <mark>Steve Cohen</mark> (Tenn.), Madeleine Dean (Penn.), Rosa DeLauro (Conn.), Nanette Diaz Barragan (Calif.), Madeleine Dean (Penn.), Adriano Espaillat (N.Y.), <mark>Dwight Evans</mark> (Penn.), <mark>Ruben Gallego</mark> (Ariz.), Sylvia Garcia (Texas), Raul Grijalva (Ariz.), Deb Haaland (N.M.), Pramila Jayapal (Wash.), Barbara Lee (Calif.), Andy Levin (Mich.), Alan Lowenthal (Calif.), Ben Ray Lujan (N.M.), Tom Malinowski (N.J.), <mark>Jim McGovern</mark> (Mass.), Gregory Meeks (N.Y.), Frank Pallone (N.J.), <mark>Donald Payne</mark> Jr. (N.J.), Mark Pocan (Wis.), <mark>Bobby Rush</mark> (Ill.), Jan Schakowsky (Ill.), Darren Soto (Fla.), Rashida Tlaib (Mich.), <mark>Juan Vargas</mark> (Calif.), Marc Veasey (Texas), Nydia Velazquez (N.Y.), and Bonnie Watson Coleman (N.J.). Read the full letter below: Dear Acting Secretary <mark>McAleenan</mark>: We, the undersigned Members of Congress, request that you immediately request the resignation of Carla Provost, Chief of the U.S. Border Patrol, who has lost the public's confidence that she can faithfully execute the responsibilities of her position without bias or prejudice. Ms. Provost was a willing participant in a secret Facebook group used by employees of her agency to share contemptable and atrocious commentary that stokes racist and xenophobic tropes that have no place in private, much less in public service. The Facebook group, originally known as \"I'm 10-15,\" generated content that joked about migrant deaths and throwing burritos at Members of Congress, and even went so far as to make sexually violent and threatening statements about female members of Congress who came to the border to inspect the conditions at detention centers. We worry this content impugns the character of the U.S. Border Patrol as a whole. Earlier this month, Ms. Provost expressed surprise about the Facebook group at issue and publicly stated, \"[t] hese posts are completely inappropriate and contrary to the honor and integrity I see--and expect--from our agents day in and day out .\" She also promised that \"[a] ny employees found to have violated our standards of conduct will be held accountable .\" At that same time, she stated that she had alerted the DHS Inspector General's Office and an investigation would be launched. Conspicuously absent from her statement was an admission that she had been a member of the Facebook group for months--as evidenced by her comments on a particular post questioning her ascent to Chief--or an explanation as to why she hadn't already alerted DHS of the Facebook group. As Chief of U.S. Border Patrol it is Ms. Provost's responsibility to discipline employees who fall under her agency's auspices, not participate in conduct unbecoming of her office. It appears that to date CBP employees have only received cease and desist letters or been placed on administrative duties pending investigation--and only after the Facebook group came to light through news reports. For the avoidance of any doubt, the callousness displayed in the Facebook group is matched only by the callous treatment of children detainees under Ms. Provost's watch. The conditions at these detention centers--which include limited access to basic hygienic needs like showers, toothpaste, and clean clothes--are not just failures of sufficient funding, they are failures of leadership. These Facebook posts suggest that the culprit is not just lack of resources but a level of malice that has no place in the policing of our borders. As Members of Congress, we are committed to ensuring that those who occupy top positions in federal government are held to the highest standards. This is especially true of the Chief of U.S. Border Patrol, at a time when conditions at our southern border have reached a crisis point. As such, we urge you to follow Ms. Provost's own promise of accountability, by immediately seeking her resignation. Our work is licensed under a Creative Commons Attribution-Share Alike 3.0 License. Feel free to republish and share widely. This is the world we live in. This is the world we cover. Because of people like you, another world is possible. There are many battles to be won, but we will battle them together--all of us. Common Dreams is not your normal news site. We don't survive on clicks. We don't want advertising dollars. We want the world to be a better place. But we can't do it alone. It doesn't work that way. We need you. If you can help today--because every gift of every size matters--please do. Without Your Support We Won't Exist. Please select a donation method: Share This Article", "articleID": "2019080222_00025646_W", "names": {"Ruben Gallego": ["Q16218474", "Q516843"], "Steve Cohen": ["Q21451639", "Q22662502", "Q41787447", "Q512330", "Q7612227", "Q7612228"]}}, {"date": "2019-08-03", "url": "http://www.startribune.com/experts-stamp-out-iowa-museum-hopes-inverted-jenny-a-fake/514491352/", "content": "Experts stamp out Iowa museum hopes: \"Inverted Jenny' a fake By MARGERY A. BECK Associated Press August 2, 2019--7:10 pm Purchase: Order Reprint OMAHA, Neb.--Hopes by a small aviation museum in southwestern Iowa that a stamp in its possession was rare enough to parlay a potential fortune crashed Friday when experts told them it wasn't real, and likely not even worth the paper it was glued upon. The Iowa Aviation Museum in Greenfield, Iowa, has had what it thought was a 1918\" Inverted Jenny \"stamp on public display for some 20 years, dating back to when it was donated to the museum, glued to a board along with several other stamps. A notation from the donor attached to the board speculated then that it was worth about $73,000. Experts at the national stamp convention meeting in Omaha knew immediately the stamp wasn't authentic, said <mark>Ken Martin</mark> with the American Philatelic Society that's holding the show through Sunday .\" It wasn't the right size. It was too small, \"<mark>Martin</mark> said .\" This version was likely cut out of a postage stamp auction catalog. \"An examination under a microscope confirmed experts' initial doubt. A 100-year-old stamp would have been printed from an artist's engraving, so the image under a microscope would appear as a series of lines. A reproduction for printed material decades later would have been comprised of a series of tiny dots, which is what appeared under the scope, <mark>Martin</mark> said. The news was disappointing for those at the museum, which also serves as the home of the Iowa Aviation Hall of Fame and had hoped to auction the stamp for hundreds of thousands of dollars and build a new museum hangar .\" We really didn't know what we had, \"Larry Konz, a tour guide at the museum, said Friday .\" When we were told that we might have the real deal, I thought, \"My God, we might have something quite valuable here, and we've had it hanging on a wall all this time .\" Had it been real, it would be worth between $300,000 and $400,000 at auction, <mark>Martin</mark> said. There were only 100 of the stamps printed in 1918, with the image of a JN-4-H \"Jenny\" biplane accidentally displayed upside-down on a 24-cent stamp. Norma Nielson, of Eugene, Oregon, was at the convention Friday to see for herself if the museum was in possession of one of the few rare and unaccounted stamps. Nielson is a stamp collector who grew up in the museum's hometown of Greenfield, and had put museum officials in touch with the American Philatelic Society to check the stamp's authenticity. \"I knew it was probably a slim chance of it being genuine, given how rare that stamp is,\" she said. \"But, boy, it sure would have been exciting if it had been .\" More from Star Tribune", "articleID": "2019080304_00070501_W", "names": {"Ken Martin": ["Q11339877", "Q25190506", "Q6388085", "Q6388087"]}}, {"date": "2019-08-03", "url": "http://indianexpress.com/article/cities/ahmedabad/fake-video-case-court-in-gujarat-rejects-police-demand-for-jignesh-mevanis-custody-5876334/", "content": "Cities By Express News Service | Surat | Published: August 4, 2019 5:00:16 am Related News Fake video case: Jignesh Mevani's statement recorded Fake video case: Gujarat HC grants anticipatory bail to Jignesh Mevani Fake video case: Jignesh Mevani moves Gujarat HC for anticipatory bail The court told Jignesh Mevani to appear before Valsad police for questioning on any day between 10 am and 5 pm. (File) A Valsad district court on Saturday rejected a police plea seeking the remand of Vadgam MLA Jignesh Mevani for three days, and instead ordered him to remain present before the investigating officer of Valsad police between 10 am to 5 pm on any day for questioning in the fake video case. Advertising Valsad town police had registered a defamation case against Mevani after he uploaded on his Twitter account a video of a teacher beating a student and attributed it wrongly to RMVM school in Valsad. The independent MLA had also had tagged the prime minister's office in the tweet, seeking action. Mevani later deleted the tweet after coming to know that the video was of some other place and not of RMVM school Valsad. He had also posted a clarification regarding the tweet. Mevani had earlier been granted bail by the Gujarat High Court, which directed him to present himself to Valsad police when called. On August 2, Mevani presented himself for questioning. Police officials first arrested him and later released him as he had anticipatory bail. They later told him to appear in the Valsad district court on Saturday, as they would be seeking his remand. Advertising On Saturday afternoon, Valsad police submitted the application to the court of Judge Hina Desai, seeking three days' police remand. The police said they wanted Mevani's mobile phone for investigation. On August 2, Mevani had refused to hand in his phone, saying there was sensitive communication on it between him and political leaders and other important people. Mevani was present in court with his lawyer advocate Ayaz Shaikh and advocate <mark>Rahul Sharma</mark>. After the arguments from both prosecution and defence, the court rejected the police's plea for remand and ordered instead that Mevani be present before the investigating officer of Valsad police when called. Advocate Shaikh said, \"The judge granted our arguments that it (remanding Mevani) would be a breach of personal liberty of my client. We also explained to the court that police cannot pressure us to hand in the mobile phone, as it would be used against us as evidence. The court had agreed to our arguments and rejected the police remand application .\" ", "articleID": "2019080401_00226850_W", "names": {"Rahul Sharma": ["Q1088902", "Q12450204", "Q18217995", "Q19898335", "Q21064127", "Q57322528", "Q57432005", "Q57985964", "Q7283625", "Q7283626"]}}, {"date": "2019-08-04", "url": "https://www.thisdaylive.com/index.php/2019/08/04/solsksjaer-no-doubt-pogba-will-stay-at-united/", "content": "Latest Sport Share Facebook WhatsApp Twitter Email Google + Pinterest Linkedin ReddIt Print Tumblr Telegram StumbleUpon VK Digg LINE Viber Manchester United manager Ole Gunnar Solskjaer said yesterday he has \"no doubt\" midfielder Paul Pogba will stay at the club this summer. The France World Cup winner missed United's final pre-season game, a penalty-shootout win over AC Milan in the International Champions Cup. But Solskjaer said Pogba, who did not travel to Cardiff for the match, was not risked due to a back strain. \"I wasn't expecting him to travel,\" he said. \"I spoke to him after training and he didn't feel right. It's not an injury, it's just some pain. I wasn't going to risk anything .\" Reports claimed Pogba failed to make the trip to Cardiff in an attempt to force a move to Real Madrid. Solskjaer also confirmed the £ 80m signing of Leicester centre-back <mark>Harry Maguire</mark> is set to be announced \"very soon\". In addition to Pogba, Romelu Lukaku was also missing as United drew 2-2 at the Principality Stadium. Lukaku's absence throughout pre-season has also been attributed to injury, but the Belgium striker's future has been the subject of speculation all summer, with Inter Milan and Juventus reportedly interested. United led through Marcus Rashford, before former Liverpool midfielder Suso and Samu Castillejo put Milan in front. Jesse Lingard levelled up to take the game to spot-kicks. And Welshman <mark>Daniel James</mark> scored the winning penalty in the Principality Stadium. United start their Premier League campaign at home against Chelsea next Sunday. Victory for United against Milan means they have won all six of their pre-season matches, albeit with this one requiring a penalty shootout, which finished 5-4.", "articleID": "2019080402_00193005_W", "names": {"Daniel James": ["Q30689579", "Q5217664", "Q5217666", "Q5217667", "Q5217668", "Q55777508", "Q56596916", "Q603606"], "Harry Maguire": ["Q165772", "Q5670856"]}}, {"date": "2019-08-04", "url": "http://www.gamereactor.eu/overwatch/?sid=cc56359faa371866471db2aa49705560", "content": "OVERWATCH REVIEW. Written by Rasmus Lund-Hansen on the 26th of May 2016 at 16 \"Overwatch is, without a doubt, the best multiplayer-shooter I've ever had my hands on .\" 0 ESPORTS. Written by Ben Lyons on the 2nd of August 2019 at 07 The roster has plenty of Contenders talent, and joins the growing list of countries revealing teams. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 1st of August 2019 at 11 This is coming to the Melbourne Esports Open next month, and there will be meet and greets and signings too. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 1st of August 2019 at 10 A new report claims that the Overwatch League team is getting sold to a new owner for $40 million USD. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 1st of August 2019 at 10 This would be in order to boost viewership for the competition, and several ideas have allegedly been discussed.", "articleID": "2019080409_00185377_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-08-06", "url": "https://www.cbc.ca/news/canada/montreal/montreal-highway-deadly-collision-public-help-1.5237078?cmp=rss", "content": "Montreal Public's help sought to determine cause of Laval highway crash that left 4 dead, 12 injured Quebec provincial police are trying to determine the cause of a deadly collision on Highway 440 north of Montreal on Monday afternoon, and working with the coroner's office to identify the victims. Social Sharing Police working with the coroner's office to ID victims <mark>Colin Harris</mark> · CBC News · Posted: Aug 06, 2019 8:08 AM ET | Last Updated: August 6 Two trucks were involved in Monday's fatal collision on Highway 440 north of Montreal. (Radio-Canada) comments Quebec provincial police are seeking the public's help in trying to determine the cause of a collision on Highway 440 about 27 kilometres north of Montreal on Monday afternoon that left four people dead and 12 injured. Around 3:30 p.m. ET, a small car collided with a semi-trailer truck on the westbound section of highway in Laval near the exit to Highway 15. The two vehicles then hit a second truck, starting a pileup involving another six vehicles. Provincial police's major crimes unit in Mascouche is leading investigation, and is working with the coroner's office to identify all the victims. Police downgraded the number of injured from 15 to 12 on Tuesday. Three are in critical condition in hospital. The other nine are first responders who were treated for smoke inhalation. Police have collected statements from witnesses, but are asking anyone who saw the collision or filmed video to contact them, which can be done anonymously, at 1-800-659-4262. \"Some of the vehicles are in such a damaged state that it's not easy to find the [serial] numbers that identify them,\" said Sûreté du Québec Sgt. Daniel Thibodeau on Tuesday morning. A small car collided with a semi-trailer truck on the highway in Laval, about 27 kilometres north of Montreal. The two vehicles then hit a second truck, starting a pileup. (Submitted by Peter Christakos) Terry Blanchard, who works by the scene of the collision, heard two loud booms, and when he looked out the window, it was clear it was a deadly accident. \"All we saw were flames. One truck looked like it hit the back of another truck,\" he said. \"I've never seen anything like that before .\" He said the smoke went so high that it blocked out the sun. Driving in the area regularly, he said, the configuration of the highway where it connects with Highway 15 could have contributed to the accident. But he also said he often sees reckless drivers on the road. \"You've got people cutting in. There's just a lot going on at once .\" Mario Lévesque said he sees accidents at that stretch of highway all the time, and drivers often go from travelling at high speeds to being bumper to bumper. \"There are regularly three or four accidents per week,\" he said, though not as severe as Monday's collision. Quebec Transport Minister <mark>François Bonnardel</mark>, centre, speaks to reporters a day after the fatal collision with Finance Minister <mark>Eric Girard</mark>, left, and Laval Mayor Marc Demers, right. (Radio-Canada) Painted line to be extended \"My first thoughts go to the victims and their families,\" Quebec Transport Minister <mark>François Bonnardel</mark> said Tuesday alongside Laval Mayor Marc Demers. <mark>Bonnardel</mark> said the ministry will look at provincial police's report of the collision to see what improvements can be made, but in the meantime, the painted line separating the service lane from the highway would be extended. The new line will span a few hundred metres, to dissuade motorists from moving into the service lane \"at the last minute,\" he said. While he acknowledged the stretch of road was built decades ago when congestion was not as severe, <mark>Bonnardel</mark> said it is not any more dangerous than other interchanges in the Montreal area. \"The city will work in collaboration with the ministry to find solutions,\" Demers said. Watch footage from the collision below. Fiery wreckage is seen from a pileup involving two trucks and seven cars on westbound Highway 440 in Laval. Four people died in the collision. 1:07 Highway reopened On Monday, a large fire ignited from the collision and smoke could be seen kilometres away. One of the trucks had about 10 propane tanks inside, but the Laval fire department said Tuesday that the tanks were empty. The fire department had the blaze under control around 5 p.m. that day. Crash scene specialists spent overnight collecting physical evidence, and the busy highway was reopened to traffic around 5 a.m. Tuesday. Thibodeau said it's too early to determine the cause of the crash. \"Nothing is off the table at this point,\" he said. \"We're still gathering as much information as we can and the public's help would be much appreciated .\" With files from Jay Turnbull and Radio-Canada CBC's Journalistic Standards and Practices | About CBC News Report Typo or Error | Send Feedback Related Stories 4 dead, 12 injured in multi-vehicle accident on highway north of Montreal Car crash on Highway 440 in Laval leaves driver dead Man seriously injured as vehicle gets stuck under flatbed truck in Laval Comments To encourage thoughtful and respectful conversations, first and last names will appear with each submission to CBC/Radio-Canada's online communities (except in children and youth-oriented communities). Pseudonyms will no longer be permitted. By submitting a comment, you accept that CBC has the right to reproduce and publish that comment in whole or in part, in any manner CBC chooses. Please note that CBC does not endorse the opinions expressed in comments. Comments on this story are moderated according to our Submission Guidelines. Comments are welcome while open. We reserve the right to close comments at any time.", "articleID": "2019080616_00814689_W", "names": {"Colin Harris": ["Q5145183", "Q5145184"], "Eric Girard": ["Q39737048", "Q601036"], "François Bonnardel": ["Q3084026", "Q58880058"]}}]