[{"date": "2019-08-07", "url": "https://www.wuwm.com/post/signs-republican-movement-support-gun-bills-new-restrictions", "content": "Signs Of Republican Movement To Support Gun Bills With New Restrictions By Deirdre <mark>Walsh</mark> • 36 minutes ago Share Tweet Email Ohio Republican Rep. <mark>Mike Turner</mark> represents Dayton, the scene of one of two mass shootings over the weekend. He opposed a House bill expanding background checks but came out in favor of measures to ban assault style weapons and proposals for red flag bills. <mark>Susan Walsh</mark> / AP Democratic efforts to pressure Senate Majority Leader Mitch McConnell to call the Senate back to vote on gun legislation to expand background checks following back to back mass shootings are being ignored by the top GOP leader. But there is some movement among some Republican lawmakers, who are calling for action on some gun-control measures. Ohio GOP Rep <mark>Mike Turner</mark>, who represents Dayton, where a gunman used an assault-style weapon to kill nine people and injure at least 27, announced on Twitter on Tuesday that he now backs proposals to enact new limits and on firearms. \"I will support legislation that prevents the sale of military-style weapons to civilians, a magazine limit, and red-flag legislation,\" he said. \"The carnage these military-style weapons are able to produce when available to the wrong people is intolerable .\" He added that he also backs so-called red-flag bills that make it so that it's easier to identify people who could harm others. \"Too often after mass shootings,\" he said, \"we hear there were early warning signs that were ignored .\" <mark>Turner</mark>'s statement is stunning, considering the National Rifle Association endorsed him ahead of the 2018 midterm elections. Ohio Republican Sen. Rob Portman, who voted against a bipartisan bill to expand background checks in 2013, told Roll Call in the Capitol on Tuesday, \"I think we should look at everything .\" Portman also pointed to the need to press ahead with proposals to enact red-flag laws, noting that there were reports about the shooter in Dayton preparing lists of people he wanted to kill. <mark>Turner</mark> did not mention any change in his position on proposals to expand background-check requirements for gun purchases. He voted against the bipartisan bill that the House approved in February. Only eight House GOP members voted with the vast majority of Democrats to pass it. President Trump tweeted Monday morning that parties needed to work together for \"stronger background checks,\" but he omitted that push when he stepped in front of television cameras hours later. We cannot let those killed in El Paso, Texas, and Dayton, Ohio, die in vain. Likewise for those so seriously wounded. We can never forget them, and those many who came before them. Republicans and Democrats must come together and get strong background checks, perhaps marrying ...--Donald J. Trump (@ realDonaldTrump) August 5, 2019 Instead, the president called for red-flag laws, said it was time to reform mental-health laws (but gave few details) and said, \"Mental illness and hatred pulls the trigger, not the gun .\" The real test for any significant action on gun laws is in the GOP-controlled Senate, where McConnell has acted as a one-man blockade against the House-passed background-check bill. He is, however, open to some other proposals. McConnell hasn't spoken publicly since the shootings, but he released a statement noting that he talked with three key committee chairs about pursuing items that Trump mentioned. \"Only serious, bipartisan, bicameral efforts will enable us to continue this important work and produce further legislation that can pass the Senate, pass the House, and earn the president's signature,\" McConnell said. Sen. Lindsey Graham, R-S.C., a key Trump ally, is developing a bipartisan bill with Sen. Richard Blumenthal, D-Conn, that would give grants to states to adopt red-flag laws, so they can hire mental-health experts to work through which cases need to be reviewed. McConnell has also been in touch with the bipartisan sponsors of a compromise addressing background checks that Pennsylvania GOP Sen. Pat Toomey and West Virginia Democratic Sen. Joe Manchin crafted after the Sandy Hook massacre in 2012. That vote fell six votes short in 2013, and only two GOP senators who backed it remain in the Senate--Toomey and Maine Sen. <mark>Susan Collins</mark>. Toomey, in an interview on CNN Tuesday, said there were a lot of new senators elected since his background-check bill failed, and he hoped that legislation would get another vote. He maintained there was \"broad support\" for a red-flag bill in the Senate. \"As usual, Mitch McConnell wants an actual outcome, and there needs to be bipartisan support in both chambers,\" Toomey said, stressing that he and Manchin are still working toward that goal and communicating with the president. The challenge for Toomey and other Republicans considering backing new gun controls is the president's inconsistent position on the issue. After a mass shooting in Parkland, Fla. killed 17 students and faculty in 2018, Trump publicly endorsed some proposals opposed by the NRA only to reverse course later. As the 2020 elections near, few Republicans will want to vote for any bill unless there is a strong message from the president that he will sign it. There is some evidence lawmakers who are home talking to constituents for an extended summer break are feeling some pressure to do something. Illinois Rep <mark>Adam Kinzinger</mark>, a former Iraq war veteran who voted against the bipartisan House bill on background checks penned an essay on Medium, saying he is in favor of red-flag laws and now supports universal background checks, raising the age to purchase a firearm fro 18 to 21 and \"banning certain high capacity magazines, like the 100-round drum the Dayton shooter used this weekend .\" He added, \"We have a gun violence epidemic, and to address it, we need to change some laws and change some hearts .\" Pressed Tuesday about Republican reluctance to vote for gun-control measures, Toomey, who said he was a gun owner and supporter of Second Amendment rights said, \"Yes, you can get reelected .\" But he also admitted, \"There's a lot of heat I can assure you, as well .\" Copyright 2019 NPR. To see more, visit https: //www.npr.org. Share Tweet Email", "articleID": "2019080709_00234786_W", "names": {"Adam Kinzinger": ["Q22773917", "Q349955"], "Mike Turner": ["Q16095910", "Q16231999", "Q505722", "Q6834994", "Q6849105", "Q6849107", "Q6849108"], "Susan Collins": ["Q22279", "Q7647692"], "Susan Walsh": ["Q23139575", "Q47927124", "Q55360631", "Q7648501", "Q7648503"]}}, {"date": "2019-08-07", "url": "http://www.dudleynews.co.uk/sport/national/17821482.best-ireland-hungry-world-cup-success-six-nations-blip/", "content": "Best: Ireland hungry for World Cup success after Six Nations blip By Press Association 2019 Rory Best believes Ireland must justify their stellar 2018 at this year's World Cup 0 comment Rory Best has challenged Ireland to justify their 2018 Six Nations Grand Slam at this year's World Cup. The Ireland captain believes <mark>Joe Schmidt</mark>'s men must seize the \"reality check\" of turning last term's Grand Slam into a third-place finish this year. The 36-year-old hooker insisted Ireland are the hungriest he has seen them under head coach <mark>Schmidt</mark>, ahead of Saturday's opening World Cup warm-up match against Italy in Dublin. Rory Best will head into his fourth World Cup with Ireland in Japan in September (Brian Lawless/PA) \"When <mark>Joe</mark> first came in the big question was\" how do we perceive ourselves?', and the big answer was \"inconsistent',\" said Best. \"And what we've worked hard to do is to prepare the same whoever we play and whatever we do .\" That's how it's always been under <mark>Joe</mark> and we certainly won't go away from that now. \"It sometimes takes a reality check, and finishing third was bitterly disappointing. Jacob Stockdale scored the winning try as Ireland beat New Zealand 16-9 in November (Niall Carson/PA)\" So coming in at the start of this pre-season everyone is as hungry as I have ever seen them. \"We've had a group of players that want to prove that the 2019 Six Nations was the blip, not 2018 .\" Ireland host Italy at the Aviva Stadium on Saturday to kick-start their build-up to the World Cup in Japan. <mark>Schmidt</mark>'s side will launch their World Cup bid by taking on Scotland on September 22, with confidence still riding high among Irish fans of a best-ever tournament. Head coach <mark>Joe Schmidt</mark> will bid to guide Ireland into uncharted waters at this year's World Cup (David Davies/PA) Best and company will face Wales twice and England in completing their warm-up matches before jetting out to Japan. The long-serving Ulster hooker will be 37 by the time the tournament kicks off but admitted feeling as good as ever amid a gruelling pre-season. <mark>Schmidt</mark>'s men are once again bidding to move beyond the quarter-finals for first time, but the Irish public have high confidence their side could even lift the Webb Ellis Cup. New Zealand are seeking a hat-trick of World Cup titles on the run, with Best admitting the All Blacks are still favourites for yet another crown. Steve Hansen will steer New Zealand into another World Cup as favourites (Brian Lawless/PA) But Best also predicted the most open World Cup yet, with Grand Slam champions Wales and a burgeoning England and South Africa also in contention. Asked if the Irish public confidence adds pressure or belief, Best replied: \"It's probably a bit of extra belief. Our biggest pressure comes internally .\" New Zealand are the best team in the world and they are the favourites. But I also think this will be one of the most open World Cups. Watch. @ LukeMcGrath93 & @ Farrell_C93 on the build up to Ireland v Italy on Saturday. #IREvITA #ShoulderToShoulder #TeamOfUs https: //t.co/O9yiDBLBoi--Irish Rugby (@ IrishRugby) August 6, 2019 \"Anyone will feel they can beat anyone on their day. And it's great that Ireland can be one of those teams .\" But we also know that, look at Wales and England in the Six Nations, we can lose to those teams too. \"Best believes Ireland's maiden two victories over back-to-back world champions New Zealand, in Chicago in 2016 and Dublin in autumn 2018, have offered significant confidence boosts. We've created some new #TeamOfUs GIFs Search #TeamOfUs to find them?? @ IrishRugby pic.twitter.com/hebgkT1KhC--Vodafone Ireland (@ VodafoneIreland) August 6, 2019\" That first victory against New Zealand, in Chicago, it felt like we pushed through a ceiling, \"said Best, speaking as a FloGas ambassador .\" But it was hugely important to get the second one, to prove again that we can do it. \"We want to be a team that can prove we can beat anyone and we've not just shown it once, we've shown it twice now .\" 0 comment", "articleID": "2019080711_00188205_W", "names": {"Joe Schmidt": ["Q284169", "Q6280152"]}}, {"date": "2019-08-08", "url": "https://footballleagueworld.co.uk/arsenal-player-finalises-switch-to-london-club/", "content": "Share Tweet Arsenal defender Dominic Thompson has made a deadline day move to Championship side Brentford, as reported by the Gunners' official website. The 19-year-old has not broken through at the Emirates during his time there and makes a permanent switch to West London. The left back made the news back in November when he was selected by Unai Emery to travel for a Europa League game against FC Vorskla. He didn't get on the field and hasn't been able to capitalise on being noticed by the manager. He captained the Arsenal Under 16 side and occasionally played central midfield, but converted to a left back by the time he hit the Under 18s. He was a key part of the side that reached the FA Youth Cup final against Chelsea in 2017/18. He earned his first professional contract on the back of that run, signing the deal in June 2018. He progressed to their Under 23 setup but has now been allowed to leave the Emirates in search of first team football. <mark>Thomas Frank</mark> is delighted to have secured the deal, telling his club's official site: \"Dominic is a very talented young player and over the past two years the speed of his development has increased. He is a technically very good left back or left wing back .\" The Verdict This could be a great signing for Brentford; you only have to look at the rapid progress Marc Bola has made since leaving their academy and venturing out into senior football. Thompson won't be an immediate starter for Brentford, he'll play second fiddle to Rico Henry, but he's sure to be on the edge of the first team. He's not a traditional full back, he's the new breed that is able to get forward and help out in attack, suited to a wing back role as much as a traditional left-sided player in a flat back four. That will suit Brentford's quick build-up play and high rate of chance creation. If he gets a run in the first team he could be an understated signing that turns into a real gem. Related Topics: arsenal brentford dominic thompson Don't Miss \"He's not here to make up numbers'--Plenty of Leeds fans react to fresh Deadline Day arrival Gary Hutchinson", "articleID": "2019080809_00144406_W", "names": {"Thomas Frank": ["Q13469562", "Q1497420", "Q2744752", "Q57481970"]}}, {"date": "2019-08-08", "url": "http://www.lancashiretelegraph.co.uk/sport/national/17825490.surprise-manchester-city-switch-scott-carson/", "content": "Surprise Manchester City switch for Scott Carson By Press Association 2019 Scott Carson has completed a surprise loan switch to Manchester City (Chris Radburn/PA) 0 comment Former England goalkeeper Scott Carson has completed a surprise deadline-day switch from Derby to Manchester City on a year-long loan deal. The 33-year-old, who played 30 times in the Championship for the Rams last season before losing his place to Kelle Roos in mid-March, will act as back-up to Ederson and <mark>Claudio Bravo</mark>. Carson, formerly of Leeds, Liverpool, West Brom, Wigan and Turkish outfit Bursaspor, said on City's official website: \"It's something I didn't expect but an opportunity I simply could not turn down .\" To be part of this squad--the champions of England--is a dream come true. \"I can't wait to see Pep's work on the training field up close. What he has achieved in his management career has been amazing, and it's every player's dream to play under him .\" Hopefully, my experience will prove useful as we try and make it three Premier League titles in a row. \"Carson, who earned the last of his four England caps in 2011, has made more than 150 appearances in his four seasons at Derby, helping them into the play-offs on three occasions. Director of football Txiki Begiristain added:\" We're delighted to be able to recruit Scott into the squad for the coming season. \"We have strength in depth in the goalkeeping department, and the wealth of experience Scott will bring to the squad will be important as we once again look to compete on all fronts .\" 0 comment", "articleID": "2019080816_00336681_W", "names": {"Claudio Bravo": ["Q313161", "Q491787", "Q56239393", "Q58372288"]}}, {"date": "2019-08-09", "url": "http://www.southwalesargus.co.uk/news/national/17827009.lucky-8-belgian-wildlife-park-welcomes-baby-giant-pandas/", "content": "Lucky 8: Belgian wildlife park welcomes baby giant pandas By Press Association 2019 Baby panda 0 comment A Belgian wildlife park is proudly showing off newborn giant panda twins. Pairi Daiza said Hao Hao, a panda loaned to the park by China in 2014, has given birth to \"two little\" pink shrimps' that are in good health and that she is taking care of with extraordinary maternal love \". Hao Hao holds one of her twin babies (Pairi Daiza Zoo/AP) The twins were born on Thursday, the eighth day of the eighth month, and the park notes that the number eight is considered lucky in Chinese culture. They are the second and third pandas delivered at the park, following the birth of <mark>Tian Bao</mark> in June 2016. Staff feeding the baby giant pandas (Pairi Daiza Zoo/AP) Eric Domb, head of the park in Brugelette, said it is\" marvellous news for this extraordinary, but today still threatened, species \". 0 comment", "articleID": "2019080910_00138851_W", "names": {"Tian Bao": ["Q45679385", "Q45690542"]}}, {"date": "2019-08-11", "url": "http://www.frasercoastchronicle.com.au/news/art-imitates-life-in-mindy-kalings-latest-project/3798703/", "content": "John Early and Mindy Kaling in a scene from the movie Late Night. Supplied Movies Art imitates life in Mindy Kaling's latest project by Seanna Cronin Seanna Cronin APN Entertainment Editor A US ex-pat, Seanna has been writing about the Australian entertainment industries for the past six years and is also a documentary producer, photographer and scuba diver. Full Profile Login to follow 10th Aug 2019 12:00 PM premium_icon Subscriber only 0 Ironically, Nisha Ganatra worked with a largely white, male cast in her comedy film about diversity in the TV writer's room. The Canadian-born, California-raised director - best known for her Emmy-nominated work on the TV series Transparent and her acclaimed debut feature film Chutney Popcorn, teams up with The Office's Mindy Kaling on Late Night. The new comedy drama follows Molly Patel (Kaling), a quality control expert at a chemical plant and amateur stand-up comic who lands a writing job on a late-night talk show. She finds she is the only woman or person of colour in the writing room. RELATED: Double act hits stride with show of diversity Location overpowers drama on insular peninsula \"I always want to work with a diverse cast, but that is not the reality in the world we are portraying,\" Ganatra says. \"The whole point is the lack of diversity, so necessarily the cast is not going to be that diverse. That was a tough thing to get my mind around. But unfortunately, it's accurate. I often find I'm the only woman of colour on a set .\" Mindy Kaling wrote and stars in the movie Late Night. Supplied Ganatra and Kaling make up for that lack of diversity behind the camera. The director and writer bonded over their experiences as Indian-American women rising through the ranks of the TV industry. \"It made sense for us to collaborate,\" she says. \"We didn't have to explain anything to each other .\" I said' I get this. I'm Molly' and she said \"Me too' and then we went running forward making a film together .\" This is a deep, soulful performance in places. We talked a lot about her life before she \"made it', before she wrote her books, before she was Mindy from The Mindy Project. She was just a young woman struggling and wanting so badly to be a part of the world of comedy and not seeing any way in .\" Kaling stars opposite <mark>Emma Thompson</mark>, who plays talk show host Katherine Newbury. Not only has Katherine grown complacent, her years in the competitive industry have turned her into a tyrant of a boss who assigns her writers numbers rather than ever learning their names. <mark>Emma Thompson</mark> in a scene from Late Night. Supplied But faced with falling ratings and the risk of being replaced with a younger comedian, she takes a punt on Molly who eventually manages to break through her icy exterior. \"I can't imagine anybody but <mark>Emma</mark> playing that part,\" Ganatra says. \"<mark>Emma</mark> takes her from the brink of making you hate her to making your heart break for her, and then she makes you laugh .\" Whether it's her completely unexpected, brilliant improvs or just the look on her face, she inherently knows what's funny. <mark>Emma</mark> brings everything you could ever wish for as a director, and when you meet her you think, \"How can I be like her when I grow up?'\" Mindy Kaling and <mark>Emma Thompson</mark> in a scene from Late Night. Supplied Ganatra hopes she and Kaling will inspire the next generation to break down the remaining barriers in the TV industry. \"Mindy and I have connected on so many things, but one thing that I've been a little more vocal and extreme about is politics, and this is an amazing chance to talk about the political things and issues I care about, and to do it in a fun way,\" she says. \"Right now in America the late night hosts are the only ones saying what a lot of us are thinking .\" They don't shy away from those painful topics. That voice is so important...they're constantly reminding us of where we want to be and where we are now. \"I hope this movie inspires a generation of young women to go into comedy writing and late night shows .\" Late Night is in cinemas now. STARS: <mark>Emma Thompson</mark>, Mindy Kaling, John Lithgow, Ike Barinholtz. DIRECTOR: Nisha Ganatra RATING: M 0 editors picks Read More Login to follow late night Read More Login to follow mindy kaling Read More Login to follow movie review Read More Login to follow nisha ganatra Read More Login to follow seanna cronin Read More Login to follow editors picks late night mindy kaling movie review nisha ganatra seanna cronin", "articleID": "2019081002_00010535_W", "names": {"Emma Thompson": ["Q168724", "Q29054751", "Q53109451"]}}, {"date": "2019-08-10", "url": "http://longisland.news12.com/story/40901860/us-attorney-epstein-abuse-probe-will-continue-after-his-death", "content": "US attorney: Epstein abuse probe will continue after his death Posted: By JIM MUSTIAN, MICHAEL R. SISAK and MICHAEL BALSAMOAssociated Press NEW YORK (AP) - The FBI and U.S. Inspector General's office will investigate how Jeffrey Epstein died in an apparent suicide Saturday, while the probe into sexual abuse allegations against the well-connected financier remain steadfast, officials said. Epstein, accused of orchestrating a sex-trafficking ring and sexually abusing dozens of underage girls, had been taken off suicide watch before he killed himself in a New York jail, a person familiar with the matter said. Attorney General <mark>William Barr</mark>, in announcing the investigation, said he was \"appalled\" to learn of Epstein's death while in federal custody. \"Mr. Epstein's death raises serious questions that must be answered,\" <mark>Barr</mark> said in a statement. Epstein was found unresponsive in his cell Saturday morning at the Metropolitan Correctional Center, according to the Federal Bureau of Prisons. Fire officials received a call at 6:39 a.m. Saturday that Epstein was in cardiac arrest, and he was pronounced dead at New York Presbyterian-Lower Manhattan Hospital. Epstein, 66, had been denied bail and faced up to 45 years behind bars on federal sex trafficking and conspiracy charges unsealed last month. He had pleaded not guilty and was awaiting trial. The federal investigation into the allegations remains ongoing, said U.S. Attorney Geoffrey Berman, who noted in a statement Saturday that the indictment against Epstein includes a conspiracy charge, suggesting others could face charges in the case. Epstein had been placed on suicide watch and given daily psychiatric evaluations after an incident a little over two weeks ago in which Epstein was found with bruising on his neck, according to the person familiar with the matter who wasn't authorized to discuss it publicly. It hasn't been confirmed whether the injury was self-inflicted or the result of an assault. Epstein was taken off suicide watch at the end of July, the person said. The Bureau of Prisons confirmed that he had been housed in the jail's Special Housing Unit, a heavily secured part of the facility that separates high-profile inmates from the general population. Until recently, the same unit had been home to the Mexican drug lord Joaquin \"El Chapo\" Guzman, who is now serving a life sentence at the so-called Supermax prison in Colorado. Epstein's death raises questions about how the Bureau of Prisons ensures the welfare of such high-profile inmates. In October, Boston gangster James \"Whitey\" Bulger was killed in a federal prison in West Virginia where had just been transferred. Nebraska Sen. Ben Sasse, a Republican member of the Senate Judiciary Committee, wrote Saturday in a scathing letter to <mark>Barr</mark> that \"heads must roll\" after the incident. \"Every single person in the Justice Department - from your Main Justice headquarters staff all the way to the night-shift jailer - knew that this man was a suicide risk, and that his dark secrets couldn't be allowed to die with him,\" Sasse wrote. <mark>Cameron Lindsay</mark>, a former warden who ran three federal lockups, said the death represents \"an unfortunate and shocking failure, if proven to be a suicide .\" \"Unequivocally, he should have been on active suicide watch and therefore under direct and constant supervision,\" <mark>Lindsay</mark> said. Epstein's removal from suicide watch would have been approved by both the warden of the jail and the facility's chief psychologist, said Jack Donson, a former prison official who worked for the Bureau of Prisons for more than two decades. An attorney for Jeffrey Epstein, Marc Fernich, said in a statement that jailers at the Metropolitan Correctional Center failed to protect Epstein and to prevent the \"calamity\" of his death. Fernich also said that reporters, plaintiffs' lawyers and court officials \"should be ashamed of their behavior\" following Epstein's indictment last month. He said Epstein had \"long since paid his debt to society\" for his crimes. Epstein's arrest last month launched separate investigations into how authorities handled his case initially when similar charges were first brought against him in Florida more than a decade ago. U.S. Labor Secretary Alexander Acosta resigned last month after coming under fire for overseeing that deal when he was U.S. attorney in Miami. On Friday, more than 2,000 pages of documents were released related to a since-settled lawsuit against Epstein's ex-girlfriend by Virginia Giuffre, one of Epstein's accusers. The records contain graphic allegations against Epstein, as well as the transcript of a 2016 deposition of Epstein in which he repeatedly refused to answer questions to avoid incriminating himself. Sigrid McCawley, Giuffre's attorney, said Epstein's suicide less than 24 hours after the documents were unsealed \"is no coincidence .\" McCawley urged authorities to continue their investigation, focusing on Epstein associates who she said \"participated and facilitated Epstein's horrifying sex trafficking scheme .\" Other accusers and their lawyers reacted to the news with frustration that the financier won't have to face them in court. \"We have to live with the scars of his actions for the rest of our lives, while he will never face the consequences of the crimes he committed the pain and trauma he caused so many people,\" accuser Jennifer Araoz said in a statement. <mark>Brad Edwards</mark>, a Florida lawyer for nearly two dozen other accusers, said that \"this is not the ending anyone was looking for .\" \"The victims deserved to see Epstein held accountable, and he owed it to everyone he hurt to accept responsibility for all of the pain he caused,\" <mark>Edwards</mark> said in a statement. Epstein's arrest drew national attention, particularly focusing on a deal that allowed Epstein to plead guilty in 2008 to soliciting a minor for prostitution in Florida and avoid more serious federal charges. Federal prosecutors in New York reopened the probe after investigative reporting by The Miami Herald stirred outrage over that plea bargain. His lawyers maintained that the new charges in New York were covered by the 2008 plea deal and that Epstein hadn't had any illicit contact with underage girls since serving his 13-month sentence in Florida. Before his legal troubles, Epstein led a life of extraordinary luxury that drew powerful people into his orbit. He socialized with princes and presidents and lived on a 100-acre private Caribbean island and one of the biggest mansions in New York. ___ Sisak reported from Myrtle Beach, South Carolina, and Balsamo from Savannah, Georgia. Associated Press writers Curt Anderson, Jennifer Peltz, David Klepper and Larry Neumeister contributed to this report. (Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed .) 8/10/2019 6:50:25 PM (GMT -4:00) Breaking news and headlines in your inbox. Sign up for News 12 email alerts! Saturday, August 10 2019 5:04 PM EDT 2019-08-10 21:04:16 GMT Resident: FAA should change noisy North Fork Helicopter Route Resident: FAA should change noisy North Fork Helicopter Route Some North Fork residents are demanding the FAA change a helicopter route that they say is the root of major noise issues. Some North Fork residents are demanding the FAA change a helicopter route that they say is the root of major noise issues. Updated: Saturday, August 10 2019 7:23 PM EDT 2019-08-10 23:23:46 GMT The FBI and U.S. Inspector General's office will investigate how Jeffrey Epstein died in an apparent suicide Saturday, while the probe into sexual abuse allegations against him remain steadfast, officials said. The FBI and U.S. Inspector General's office will investigate how Jeffrey Epstein died in an apparent suicide Saturday, while the probe into sexual abuse allegations against him remain steadfast, officials said. Saturday, August 10 2019 5:08 PM EDT 2019-08-10 21:08:32 GMT LaGuardia Airport announces changes to traffic pattern amid construction LaGuardia Airport announces changes to traffic pattern amid construction The Port Authority is changing the traffic patterns entering LaGuardia Airport to accommodate the ongoing construction there. The Port Authority is changing the traffic patterns entering LaGuardia Airport to accommodate the ongoing construction there. Saturday, August 10 2019 4:54 PM EDT 2019-08-10 20:54:08 GMT A Long Beach restaurant has temporarily shut down while authorities investigate a potential salmonella outbreak. A Long Beach restaurant has temporarily shut down while authorities investigate a potential salmonella outbreak. Updated: Saturday, August 10 2019 3:14 PM EDT 2019-08-10 19:14:12 GMT Subaru logo on a 2019 Subaru Forester on display at the 2019 Pittsburgh International Auto Show in Pittsburgh Thursday, Feb. 14, 2019. . jpg Subaru logo on a 2019 Subaru Forester on display at the 2019 Pittsburgh International Auto Show in Pittsburgh Thursday, Feb. 14, 2019. . jpg The National Highway Safety Administration is investigating complaints of malfunctions with the front passenger air bag sensors in more than a half-million Subaru Foresters. The National Highway Safety Administration is investigating complaints of malfunctions with the front passenger air bag sensors in more than a half-million Subaru Foresters. Friday, August 9 2019 7:13 PM EDT 2019-08-09 23:13:34 GMT President Donald Trump attended a pair of fundraisers Friday in the Hamptons. President Donald Trump attended a pair of fundraisers Friday in the Hamptons. Updated: Friday, August 9 2019 9:53 AM EDT 2019-08-09 13:53:54 GMT This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998. This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998. This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998. This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998.", "articleID": "2019081023_00108898_W", "names": {"Brad Edwards": ["Q4953908", "Q4953910"]}}]