[{"date": "2019-08-10", "url": "http://longisland.news12.com/story/40901860/us-attorney-epstein-abuse-probe-will-continue-after-his-death", "content": "US attorney: Epstein abuse probe will continue after his death Posted: By JIM MUSTIAN, MICHAEL R. SISAK and MICHAEL BALSAMOAssociated Press NEW YORK (AP) - The FBI and U.S. Inspector General's office will investigate how Jeffrey Epstein died in an apparent suicide Saturday, while the probe into sexual abuse allegations against the well-connected financier remain steadfast, officials said. Epstein, accused of orchestrating a sex-trafficking ring and sexually abusing dozens of underage girls, had been taken off suicide watch before he killed himself in a New York jail, a person familiar with the matter said. Attorney General <mark>William Barr</mark>, in announcing the investigation, said he was \"appalled\" to learn of Epstein's death while in federal custody. \"Mr. Epstein's death raises serious questions that must be answered,\" <mark>Barr</mark> said in a statement. Epstein was found unresponsive in his cell Saturday morning at the Metropolitan Correctional Center, according to the Federal Bureau of Prisons. Fire officials received a call at 6:39 a.m. Saturday that Epstein was in cardiac arrest, and he was pronounced dead at New York Presbyterian-Lower Manhattan Hospital. Epstein, 66, had been denied bail and faced up to 45 years behind bars on federal sex trafficking and conspiracy charges unsealed last month. He had pleaded not guilty and was awaiting trial. The federal investigation into the allegations remains ongoing, said U.S. Attorney Geoffrey Berman, who noted in a statement Saturday that the indictment against Epstein includes a conspiracy charge, suggesting others could face charges in the case. Epstein had been placed on suicide watch and given daily psychiatric evaluations after an incident a little over two weeks ago in which Epstein was found with bruising on his neck, according to the person familiar with the matter who wasn't authorized to discuss it publicly. It hasn't been confirmed whether the injury was self-inflicted or the result of an assault. Epstein was taken off suicide watch at the end of July, the person said. The Bureau of Prisons confirmed that he had been housed in the jail's Special Housing Unit, a heavily secured part of the facility that separates high-profile inmates from the general population. Until recently, the same unit had been home to the Mexican drug lord Joaquin \"El Chapo\" Guzman, who is now serving a life sentence at the so-called Supermax prison in Colorado. Epstein's death raises questions about how the Bureau of Prisons ensures the welfare of such high-profile inmates. In October, Boston gangster James \"Whitey\" Bulger was killed in a federal prison in West Virginia where had just been transferred. Nebraska Sen. Ben Sasse, a Republican member of the Senate Judiciary Committee, wrote Saturday in a scathing letter to <mark>Barr</mark> that \"heads must roll\" after the incident. \"Every single person in the Justice Department - from your Main Justice headquarters staff all the way to the night-shift jailer - knew that this man was a suicide risk, and that his dark secrets couldn't be allowed to die with him,\" Sasse wrote. <mark>Cameron Lindsay</mark>, a former warden who ran three federal lockups, said the death represents \"an unfortunate and shocking failure, if proven to be a suicide .\" \"Unequivocally, he should have been on active suicide watch and therefore under direct and constant supervision,\" <mark>Lindsay</mark> said. Epstein's removal from suicide watch would have been approved by both the warden of the jail and the facility's chief psychologist, said Jack Donson, a former prison official who worked for the Bureau of Prisons for more than two decades. An attorney for Jeffrey Epstein, Marc Fernich, said in a statement that jailers at the Metropolitan Correctional Center failed to protect Epstein and to prevent the \"calamity\" of his death. Fernich also said that reporters, plaintiffs' lawyers and court officials \"should be ashamed of their behavior\" following Epstein's indictment last month. He said Epstein had \"long since paid his debt to society\" for his crimes. Epstein's arrest last month launched separate investigations into how authorities handled his case initially when similar charges were first brought against him in Florida more than a decade ago. U.S. Labor Secretary Alexander Acosta resigned last month after coming under fire for overseeing that deal when he was U.S. attorney in Miami. On Friday, more than 2,000 pages of documents were released related to a since-settled lawsuit against Epstein's ex-girlfriend by Virginia Giuffre, one of Epstein's accusers. The records contain graphic allegations against Epstein, as well as the transcript of a 2016 deposition of Epstein in which he repeatedly refused to answer questions to avoid incriminating himself. Sigrid McCawley, Giuffre's attorney, said Epstein's suicide less than 24 hours after the documents were unsealed \"is no coincidence .\" McCawley urged authorities to continue their investigation, focusing on Epstein associates who she said \"participated and facilitated Epstein's horrifying sex trafficking scheme .\" Other accusers and their lawyers reacted to the news with frustration that the financier won't have to face them in court. \"We have to live with the scars of his actions for the rest of our lives, while he will never face the consequences of the crimes he committed the pain and trauma he caused so many people,\" accuser Jennifer Araoz said in a statement. <mark>Brad Edwards</mark>, a Florida lawyer for nearly two dozen other accusers, said that \"this is not the ending anyone was looking for .\" \"The victims deserved to see Epstein held accountable, and he owed it to everyone he hurt to accept responsibility for all of the pain he caused,\" <mark>Edwards</mark> said in a statement. Epstein's arrest drew national attention, particularly focusing on a deal that allowed Epstein to plead guilty in 2008 to soliciting a minor for prostitution in Florida and avoid more serious federal charges. Federal prosecutors in New York reopened the probe after investigative reporting by The Miami Herald stirred outrage over that plea bargain. His lawyers maintained that the new charges in New York were covered by the 2008 plea deal and that Epstein hadn't had any illicit contact with underage girls since serving his 13-month sentence in Florida. Before his legal troubles, Epstein led a life of extraordinary luxury that drew powerful people into his orbit. He socialized with princes and presidents and lived on a 100-acre private Caribbean island and one of the biggest mansions in New York. ___ Sisak reported from Myrtle Beach, South Carolina, and Balsamo from Savannah, Georgia. Associated Press writers Curt Anderson, Jennifer Peltz, David Klepper and Larry Neumeister contributed to this report. (Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed .) 8/10/2019 6:50:25 PM (GMT -4:00) Breaking news and headlines in your inbox. Sign up for News 12 email alerts! Saturday, August 10 2019 5:04 PM EDT 2019-08-10 21:04:16 GMT Resident: FAA should change noisy North Fork Helicopter Route Resident: FAA should change noisy North Fork Helicopter Route Some North Fork residents are demanding the FAA change a helicopter route that they say is the root of major noise issues. Some North Fork residents are demanding the FAA change a helicopter route that they say is the root of major noise issues. Updated: Saturday, August 10 2019 7:23 PM EDT 2019-08-10 23:23:46 GMT The FBI and U.S. Inspector General's office will investigate how Jeffrey Epstein died in an apparent suicide Saturday, while the probe into sexual abuse allegations against him remain steadfast, officials said. The FBI and U.S. Inspector General's office will investigate how Jeffrey Epstein died in an apparent suicide Saturday, while the probe into sexual abuse allegations against him remain steadfast, officials said. Saturday, August 10 2019 5:08 PM EDT 2019-08-10 21:08:32 GMT LaGuardia Airport announces changes to traffic pattern amid construction LaGuardia Airport announces changes to traffic pattern amid construction The Port Authority is changing the traffic patterns entering LaGuardia Airport to accommodate the ongoing construction there. The Port Authority is changing the traffic patterns entering LaGuardia Airport to accommodate the ongoing construction there. Saturday, August 10 2019 4:54 PM EDT 2019-08-10 20:54:08 GMT A Long Beach restaurant has temporarily shut down while authorities investigate a potential salmonella outbreak. A Long Beach restaurant has temporarily shut down while authorities investigate a potential salmonella outbreak. Updated: Saturday, August 10 2019 3:14 PM EDT 2019-08-10 19:14:12 GMT Subaru logo on a 2019 Subaru Forester on display at the 2019 Pittsburgh International Auto Show in Pittsburgh Thursday, Feb. 14, 2019. . jpg Subaru logo on a 2019 Subaru Forester on display at the 2019 Pittsburgh International Auto Show in Pittsburgh Thursday, Feb. 14, 2019. . jpg The National Highway Safety Administration is investigating complaints of malfunctions with the front passenger air bag sensors in more than a half-million Subaru Foresters. The National Highway Safety Administration is investigating complaints of malfunctions with the front passenger air bag sensors in more than a half-million Subaru Foresters. Friday, August 9 2019 7:13 PM EDT 2019-08-09 23:13:34 GMT President Donald Trump attended a pair of fundraisers Friday in the Hamptons. President Donald Trump attended a pair of fundraisers Friday in the Hamptons. Updated: Friday, August 9 2019 9:53 AM EDT 2019-08-09 13:53:54 GMT This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998. This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998. This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998. This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998.", "articleID": "2019081023_00108898_W", "names": {"Cameron Lindsay": ["Q16731524", "Q5026294"], "William Barr": ["Q16683338", "Q43123958", "Q43911234", "Q8005104"]}}, {"date": "2019-08-13", "url": "http://www.examiner.com.au/story/6325673/winners-are-grinners/?cs=96", "content": "Local Sport sport, local-sport, Carrick reinsman <mark>Adrian Collins</mark> is one of the real characters of Tasmanian harness racing. So it was no surprise when he had an exaggerated look to his left as he was cruising to victory on Courageous Katee at Mowbray on Sunday night. The focus of his attention was his mate Todd Rattray who, up until <mark>Collins</mark> appeared on the scene, had been leading the race on favourite Zhukov Leis. \"Todd and I played football together this year so I just gave him a cheeky smile as I went on by,\" <mark>Collins</mark> explained. <mark>Collins</mark> had driven a copybook race on Courageous Katee, prompting racecalled Matty Robertson to say \"someone buy him a beer\" as he crossed the line. \"Like a lot of things in harness racing, I'm still waiting for that to happen,\" the driver said. Courageous Katee has now won 10 races since her Victorian owners sent her to Karoola trainer Dick Eaves in March 2017. <mark>Collins</mark> has driven her to six of those victories. \"She's a very good horse - definitely the best I've sat behind for a long time,\" he said. \"I don't get many opportunities to drive really nice horses these days so I'm grateful to Dick for sticking by me .\" I know it's a cliche but all credit to him. \"He's a genius with mares .\" Eaves was also full of praise for <mark>Collins</mark> as he explained Courageous Katee could get too keen in her races and was not easy to drive. \"He is a strong boy, <mark>Adrian</mark>, and you need to be with her,\" the trainer said. \"If somebody drives her that has a bit of trouble holding her, they tend to go before acceptances .\" <mark>Adrian</mark> seems to sit there that bit longer. \"<mark>Collins</mark> said that he would take being called a\" boy \"as a compliment .\" I might pass if I keep my hat on, \"he laughed .\" But I've actually hit 42 now. \"IN OTHER NEWS <mark>Collins</mark> is confident that connections can keep raising the bar with Courageous Katee who will be the Launceston Pacing Club's mare of the year for this season .\" She loves Mowbray and she showed on Sunday, and also when she won in the fog three starts ago, that she has an amazing turn of foot \"he said .\" She has proven now that she can do a bit of work in her races and also win driven with a sit. \"Whitemore trainer Nigel Schuuring is lamenting another poor barrier draw for Willby Rules at Sandown on Wednesday but still expects the horse to run well. Willby Rules will start from the outside gate in the Benchmark 70 Handicap (1500m) where he has 62kg before the claim for apprentice Chelsea MacFarlane .\" He also drew badly last start at Moonee Valley when he got caught wide and ran out of steam the last bit, \"Schuuring said .\" But we were happy with the run. \"Hopefully, they will string out a bit more on the bigger track and he'll be able to get in .\" Schuuring left Willby Rules at the stables of Flemington trainer Saab Hasan after his last run. \"They've done an excellent job looking after him - he looks bright and happy,\" the trainer said. \"We'll see what happens (on Wednesday) before deciding how long he stays (in Victoria).\" There haven't been any races for him over suitable distances at Devonport but there is one in a fortnight which is an option. \"Willby Rules has won eight races and they've all been on the Spreyton synthetic surface. Scott Brunton is casting his net far and wide in search of suitable races for his horses while his home track at Elwick is closed. Brunton has had winners at Sandown, Flemington and Spreyton in the past 10 days and also had a runner at Wagga. This Saturday he has horses entered for Caulfield, Spreyton, Wangaratta and Narrandera (in southern NSW). His lone Caulfield entry is last-start Sandown winner Shot Of Irish who will step up in class to tackle the $125,000 Benchmark 84 Handicap (1400m). Shot Or Irish's rivals may include promising Tasmanian-bred four-year-old Kemalpasa who has won four of his past six starts in Adelaide for Richard Jolly. Mystic Journey is odds-on with all the major corporate bookmakers for Saturday's P B Lawrence Stakes at Caulfield. Ladbrokes, Sportsbet and tab.com. au are all quoting the mare at $1.80 in their all-in markets prior to Wednesday's acceptances. Meanwhile <mark>Chris Waller</mark> has named the Metropolitan Handicap as the first spring target for Eastender. In his weekly column for the Racenet web site, <mark>Waller</mark> says: The Tasmanian horse has a cult following down there from winning some big races. (He was only) narrowly beaten in the Andrew Ramsden and can certainly stay so he is on a path to The Metropolitan. The group 1 $750,000 Metropolitan will be run over 2400m at Randwick on October 5. Eastender is at $34 in Ladbrokes' early market which has his stablemate Verry Ellleegant as $8 favourite. He also gets a mention in Melbourne Cup markets at $81 but managing owner Denise Martin has suggested the 2020 Sydney Cup may be his best chance of winning a big race on the mainland. Do you know a junior sports star who calls Northern Tasmania home? Nominate them today. https: //nnimgt-a.akamaihd.net/transform/v1/crop/frm/nq3JkD2JZTWMXDuN44nfBn/17acac93-13b2-44f2-9304-1680d4c80b57.jpg/r900_757_5098_3129_w1200_h678_fmax.jpg", "articleID": "2019081307_00155995_W", "names": {"Adrian Collins": ["Q15627018", "Q58146088"], "Chris Waller": ["Q16123033", "Q16911294"]}}, {"date": "2019-08-14", "url": "http://www.gamereactor.eu/pubg/?sid=62944fff2a3671a3b18095c90871a035", "content": "PLAYERUNKNOWN'S BATTLEGROUNDS REVIEW. Written by <mark>Mike Holmes</mark> on the 28th of December 2017 at 11 \"You've got to take the rough with the smooth, but when it clicks it not only works, it's glorious .\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 7th of August 2019 at 10:25 New features like the remade Erangel map have arrived, and we're seeing what's new this afternoon for a few hours. 0 ARTICLE. Written by <mark>Mike Holmes</mark> on the 26th of July 2019 at 14 After the launch of the new Event Pass and a big update to Erangel, we dived back into the battle royale shooter to see where it's at. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 25th of July 2019 at 16:00 It seems the lawsuit is behind the battle royale pair, as revealed by studio director Brian Corrigan. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 18th of July 2019 at 10:10 Erangel's map update takes centre-stage, although there are various other tweaks and content to see.", "articleID": "2019081406_00157868_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-08-14", "url": "https://www.midhurstandpetworth.co.uk/news/politics/cheaper-train-travel-for-sussex-teenagers-1-9032650", "content": "Cheaper train travel for Sussex teenagers New 16-17 Saver offering discounted rail travel for young people Published: 06:47 Wednesday 14 August 2019 Share this article A brand new 16-17 Saver guaranteeing half-price travel for young people will launch next week. Discounted train tickets will benefit students attending sixth-form or college and those beginning an apprenticeship or entering the world of work from September. New 16-17 Saver offering discounted rail travel for young people The new saver will mean that young people are eligible for a child rail fare until their 18th birthday. It will be available to buy for £ 30 online from Tuesday August 20 at 9am at www.16-17saver.co.uk The discount will be available on most rail travel including peak and season tickets. The Government forecasts the new 16-17 Saver will save young people and their families an average of £ 186 a year. Rail minister Chris Heaton-Harris said: \"The brand-new saver means that a generation of rail passengers can now benefit from cheaper fares, keeping money in their pocket and helping them get to school, college and work .\" We want to create a railway system that's fit for the 21st century and provides a reliable, punctual journey. \"It's tempting to say fares should never rise, but the truth is that if we stop investing in our railways then we'll never see it improved .\" <mark>David Hughes</mark>, chief executive of the Association of Colleges, added: \"This rail discount for 16 and 17-year-olds is a huge step in the right direction and will help to alleviate the financial pressures facing young people and their families across the country .\" Many from disadvantaged backgrounds find themselves making difficult choices about their future based on how much their journey to college will cost, increasing the pressures of staying in education. \"Travel costs should never be a barrier to education, today's announcement will give a much needed helping hand to thousands who rely on rail travel to access education and training .\" The 16-17 Saver can also be purchased by calling 0345 301 1656. <mark>Robert Nisbet</mark>, director, nations & regions at the Rail Delivery Group, said: \"The launch of the 16-17 Saver, in partnership with the Department for Transport, demonstrates the rail industry's commitment to providing the best value fares for all customers .\" There are 1.2 m people aged 16 or 17 years in Great Britain--working together, we want to ensure they can access affordable rail travel with the new 16-17 Saver. \"Trending How much would it cost to buy The Fox Goes Free pub in Charlton? Shocking footage as bikers in Petworth narrowly avoid a head-on crash Sussex pier and seafront shut down after\" hazardous material' causes vomiting and sore eyes Two arrested after man stabbed in West Sussex village \"Major accident' blocks road on A259 The Essentials", "articleID": "2019081408_00212944_W", "names": {"David Hughes": ["Q10557465", "Q16179032", "Q16864051", "Q26324374", "Q3017347", "Q5235214", "Q5235219", "Q5235220", "Q5235224", "Q5235226", "Q5235227", "Q5235228", "Q5235229", "Q5235231", "Q5235236", "Q53955926", "Q56596954"], "Robert Nisbet": ["Q16292939", "Q21999572", "Q7348044"]}}, {"date": "2019-08-15", "url": "https://www.firstpost.com/sports/watch-nick-kyrgios-smashes-racquets-abuses-umpire-in-second-round-defeat-against-karen-khachanov-at-cincinnati-masters-7167961.html", "content": "Watch: Nick Kyrgios smashes racquets, abuses umpire in second-round defeat against Karen Khachanov at Cincinnati Masters Sports Agence France-Presse Aug 15, 2019 11:43:31 IST Cincinnati: Nick Kyrgios stepped off court to smash two racquets and toss his shoes to spectators on Wednesday in a meltdown during a second-round ATP Cincinnati Masters loss to Russia's Karen Khachanov. Eighth-seeded Khachanov rallied for a 6-7 (3/7), 7-6 (7/4) 6-2 victory over the volatile Australian, but the final set was close to farce, with Kyrgios engaged in a running dialogue with Irish chair umpire Fergus Murphy. \"He has a really great talent but sometimes the head not in the right place,\" Khachanov said. \"It was a really difficult match for me--I had to really work it out, how to get the win .\" It's really tough (playing Kyrgios), not only for me but for everybody. You have to try and handle it, then you can have chances to win the match. Always try to stay in there. \"BANG, BANG!!???? Nick Kyrgios absolutely DESTROYED two racquets and the commentators lost it???? Watch the Cincinnati Masters live on ESPN. pic.twitter.com/q2d2dTeND3--ESPN Australia & NZ (@ ESPNAusNZ) August 15, 2019 Kyrgios, who won his sixth career ATP singles crown two weeks ago in Washington, also complained last week in Toronto in an apparent dispute as to why he could not have a white towel during a match. World number 27 Kyrgios, rarely far from controversy, was defaulted three months ago after throwing a chair as he quit a match in Rome. The latest iteration of the Kyrgios saga erupted after he lost the second set to Khachanov. Sitting in his chair at the pause, Kyrgios suddenly announced he was going on a bathroom break, with Murphy telling him there was no time. The Aussie walked anyway, carrying two racquets with him. Television showed him going through a stadium door partly made of glass and smashing his racquets before collecting them and walking back onto court. All the while, he was nagging and occasionally cursing at Murphy. Kyrgios calmly held his own at the start of the final set, producing a hold which featured three aces. But it was the ice-calm Khachanov who took advantage, breaking for 4-2 and running out to a 5-2 margin. Kyrgios, by now hardly in the match, double-faulted to hand over two match points and served up another double after saving a first match point. He refused to shake Murphy's hand on the way off court and tossed his shoes and other soft articles into the crowd and handing his broken racquets to young fans before walking off. At one point in the drama, Kyrgios stood at the back of the court, wrapping his racquet grip, which Murphy kept telling him he was not ready. Kyrgios told Khachanov to go ahead and serve, but the Russian declined until all was in place on the Kyrgios side of the net. Tournament supervisor <mark>Gerry Armstrong</mark> sat near the court, observing, but was not called upon to make any ruling during the bizarre closing stages of the evening. Khachanov will play Frenchman Lucas Pouille in Thursday's third round. Updated Date: Aug 15, 2019 11:43:31 IST", "articleID": "2019081506_00180233_W", "names": {"Gerry Armstrong": ["Q2712483", "Q5552639"]}}, {"date": "2019-08-17", "url": "http://www.thetelegraphandargus.co.uk/news/17840424.bradford-39-s-west-end-suffers-another-blow-flares-announces-closure/", "content": "News Bradford's West End suffers another blow as Flares announces closure By Felicity Macnamara @ FelicityM_TandA Reporter See photos images Skip to next photo 1 / 1 Show caption 1 / 1 0 comment THE last remaining club in Bradford's once-thriving West End is to close its doors tonight. Flares, at the top of Morley Street, has managed to weather the storm of high-profile closures in recent years, but will shut up shop after a final party this weekend. Many in Bradford will remember the glory days of the West End, when the area was packed with clubs and nighttime spots, from Che Bar, Revolution and Love Apple, to Walkabout, Livingstone's, Tokyo, Brewhaus, Bierkeller and The Sir Titus Salt Wetherspoons pub. But it's a scene which has vastly changed, leaving forlorn-looking, empty buildings as a sad reminder of what once was. Jason Courcoux, who has been general manager of the venue since 2012, has seen the West End change in the seven years he has been at the helm and says Flares is the last club standing. He said: \"It was still very vibrant, the area was busy and there was a hell of a lot of trade on Thursday, Friday, Saturday and Sunday .\" The demographics of everywhere has changed slightly. It has changed around again because there's quite a lot of new openings on the Ivegate area, with Sunbridgewells. \"It just seems it has moved areas, but this was initially all built and purposely earmarked for the late night economy, which is a shame it has all gone, because we've got the Odeon [Bradford Live] in the next two years, so it's just not going to have that kind of late night support that it should have. We've seen every venue, one by one, close .\" Jason said there were hopes of it coming back when some new venues like Brewhaus, Bierkeller and Tiki-O opened, but they too shut up shop. In an interview with the Telegraph & Argus earlier this year, Aaron Mellor, who ran the three venues as part of his Tokyo Industries chain, described trading in Bradford as \"impossible\" due to rating levels. At the time he said: \"The city is clinging onto hopes that a miracle investment of incredible proportion in the Odeon will save the city - it won't .\" Jason says a lot of work has gone into trying to make the area work, but it hasn't seemed to have taken off. \"I have been involved with some meetings with Alex Ross-Shaw, Richard Dunbar, Susan Hinchcliffe, who are all supportive of the late night trade--it's not anything they've done or the Council, it's just how the area has gone,\" he said. \"We've still remained pretty consistent, we've still got a nice Friday and Saturday crowd, so it's still ticking over. It's a shame to see it go--I hope whoever takes it on next runs it as a late-night venue .\" I'm hoping the Odeon will turn things around slightly, but whether or not anything will come back to the West End, I'm not sure. \"Since Che Bar went to Life Church and there's now talk of what was Walkabout being a church as well, it seems the use of the area is going to be completely different .\" Everyone earmarks it and says \"oh it's Bradford'--it's the country, it's nationwide .\" There's certain towns and cities that do thrive still, and there's some that have either not kept up the pace or the momentum, or the demographic has changed. \"He added:\" Let's hope the Council teams, the NEC teams, have all got enough in place to reinvigorate the area and give it that drive. We're hoping the Odeon will give it that injection it needs. \"The club will be open tonight for one last nostalgic knees-up before the music stops and the disco ball stops spinning for good. <mark>Ian Ward</mark>, chairman of Bradford BID, said:\" It's always sad to see a venue close and we hope a beneficial new use for this building can be found soon. One of the BID's key objectives is to help improve the night-time economy and we want to see more entertainment, leisure and hospitality venues opening to help bring the city to life for both residents and the visitors who help boost the local economy. \"City centres are going through a period of unprecedented change, with a whole raft of new commercial challenges, and we have to learn to adapt to fluctuating trends and be fleet of foot in responding to them .\" While some venues may have closed, the BID has been pleased to see others open in areas such as Ivegate, Sunbridgewells and North Parade, for instance, and we should embrace these periods of change as exciting opportunities to remodel the city's offer and deliver what people want to see now. \"Councillor Alex Ross-Shaw, Bradford Council's Executive Member for Regeneration, Planning and Transport, said:\" Obviously it's sad to hear that Flares has closed down and it's clear the West End area of the city centre is undergoing a number of changes at the moment. Although the old clubs are gone there are new organisations coming in such as the trampoline and soft play park, Airobounce. \"Cllr Ross Shaw said with Bradford Live there is a\" huge opportunity \"for the area to regenerate .\" We're doing a lot of work analysing what those opportunities might look like so we can work with potential end users to get the West End filled and buzzing again. \"Trevor Higgins, CEO of Bradford Breakthrough, added:\" The West End of Bradford has had many ups and downs through the years. I remember way back in the seventies it had a thriving night life scene and it has had several periods of rise and fall since then. \"Now would be a great time for the area to take off once again. The city centre night scene is on the up with North Parade and Sunbridge Wells, due to their unique offerings, attracting visitors from across the region. The revitalisation of the West End would be yet another piece in the city centre redevelopment jigsaw .\" 0 comment", "articleID": "2019081704_00015697_W", "names": {"Ian Ward": ["Q19670167", "Q45316198", "Q5983200", "Q5983207"]}}]