[{"articleID": "2014111020_00064482_W", "names": {"King Abdullah": ["Q57298", "Q57464"]}, "date": "2014-11-10", "url": "http://jordantimes.com/delicate-issue-under-scrutiny", "content": "Gov' t announces privileges for children of Jordanian women married to foreigners Amman Chamber of Commerce reveals lower exports during ten months Industry chief urges smooth operations at Aqaba Container Terminal Russians, concerned for their savings, buy dollars and hoard cash on ruble fears Drug-resistant superbug found in 1915 soldier killed by dysentery Apple iOS bug makes most devices vulnerable to attack - researchers Gov' t announces privileges for children of Jordanian women married to foreigners Italy to work with Jordan against terrorism, extremist ideologies - diplomat Higher Education Ministry mulls increasing Tawjihi score required for studying medicine abroad Film translated into sign language at 26th European Film Festival T he minister of interior has just announced that a committee formed by the Cabinet will scrutinise the moratorium on death penalty, which has frozen execution of death penalties since 2006, when the last execution was carried out. While death penalty is considered by its proponents a deterrent from crime, opponents point to flaws in the justice system - especially since the rise of the more sophisticated DNA tests that led to some exonerations. A report released on April 18, 2012, by the prestigious National Research Council of the National Academies, based on a review of more than three decades of research, concluded that studies claiming a deterrent effect on murder rates from the death penalty are fundamentally flawed. Said the report: \"The committee concludes that research to date on the effect of capital punishment on homicide is not informative about whether capital punishment decreases, increases, or has no effect on homicide rates...Consequently, claims that research demonstrates that capital punishment decreases or increases the homicide rate by a specified amount or has no effect on the homicide rate should not influence policy judgements about capital punishment.\" Not much help here in helping one make one's mind up. Whatever the case, some ugly crimes have been committed in Jordan recently, so the government is probably acting under pressure from the public now. While people want to see the phenomenon stemmed, officials need to tread a thin line between allaying citizens' fears, or anger, and upholding the country's stand and recognition worldwide as wanting to be among the increasing number of nations that abolish death penalty. Such move would be in deference to the Kingdom's obligations under existing international norms. It could also be taken in view of the fact that death penalty does not seem to actually contribute to lowering crime rates. Instead of executing people, the country has to deal with the causes of crime and try to address them. Poverty, ignorance and a justice system that by the minister's admission has loopholes can be often blamed for crimes, of all kinds. Education, awareness, reinforcing the value system of yore, good neighbourliness and good living conditions often keep crime at bay. His Majesty <mark>King Abdullah</mark> told an Italian newspaper in 2005 that, \"in coordination with the European Union, we would like to modify our Penal Code. Jordan could soon become the first country in the Middle East without capital punishment.\" This is a serious commitment that the government should take into consideration upon reviewing legislation, death penalty foremost. Syria rebels, Al Qaeda capture key southern town - monitor Syrian rebels and Al Qaeda seized the southern town of Nawa Sunday from troops loyal to President Bashar Al Assad after months of intense fighting, the Syrian Observatory for Human Rights said. Gov' t announces privileges for children of Jordanian women married to foreigners Scrapping peace deal with Israel \"impossible under circumstances' - Ensour"}, {"articleID": "2018031917_00296177_W", "names": {"Philip Smith": ["Q2086449", "Q22247718", "Q24205313", "Q25189326", "Q27793298", "Q57061005", "Q57904017", "Q7184394", "Q7184396"]}, "date": "2018-03-19", "url": "http://infotel.ca/newsitem/us-school-shootings-metal-detectors/cp2087731845", "content": "In a photo from Thursday, March 8, 2018, in Detroit, Alondra Alvarez, a student at Western International High School, goes through a metal detector and has her backpack checked as she enters the school. Experts say metal detectors and other security measures put in place decades ago to quell gang and other violence in many urban schools have made them tough targets for mass shootings by troubled students or outsiders. (AP Photo/Carlos Osorio) March 19, 2018 - 10:48 AM DETROIT - Schools around the U.S. are looking for ways to impose tougher security measures in the wake of last month's school shooting in Florida that left 17 people dead. And they don't have to look further than urban districts such as Detroit, Chicago, Los Angeles and New York that installed metal detectors and other security in the 1980s and 1990s to combat gang and drug violence. Security experts believe these measures have made urban districts less prone to mass shootings, which have mostly occurred in suburban and rural districts. National African American Gun Association president <mark>Philip Smith</mark> says security measures at urban schools are \"eons ahead\" of those in the suburbs because \"they've been dealing with violence a lot longer.\" News from © The Associated Press, 2018"}, {"articleID": "2019052118_00114925_W", "names": {"Theresa May": ["Q264766", "Q30161835"], "Philip Hammond": ["Q18388174", "Q332987"]}, "date": "2019-05-21", "url": "https://www.wandsworthguardian.co.uk/news/national/17654248.theresa-may-to-set-out-new-deal-on-brexit-in-bid-to-win-support/?ref=rss", "content": "<mark>Theresa May</mark> to set out \"new deal' on Brexit in bid to win support By Press Association 2019 <mark>Theresa May</mark> 0 comment <mark>Theresa May</mark> will set out details of her new plan to get a Brexit deal through Parliament after another difficult Cabinet meeting. The\" new deal \"is an attempt by the Prime Minister to win over critics across the Commons who have rejected her three previous attempts to get an agreement through. The Withdrawal Agreement Bill (WAB) will go to the Commons in early June, with defeat likely to hasten her departure from Number 10. (left to right) Health Secretary Matt Hancock, Education Secretary Damian Hinds and Works and Pensions Secretary Amber Rudd leave the Cabinet meeting (Isabel Infantes/PA) Mrs <mark>May</mark> told the Cabinet:\" The Withdrawal Agreement Bill is the vehicle which gets the UK out of the EU and it is vital to find a way to get it over the line. \"During the two hours spent discussing the Brexit plan, Mrs <mark>May</mark>'s spokesman acknowledged there were\" strong opinions \"around the Cabinet table but also a\" determination \"to get a deal through Parliament.\" The discussions included alternative arrangements, workers' rights, environmental protections and further assurances on protecting the integrity of the UK in the unlikely event that the backstop is required, \"the spokesman said. The talks also covered the\" whole range of topics \"related to the Withdrawal Agreement Bill, including customs arrangements and calls for a second referendum. The meeting was\" characterised by a shared determination to find a way of passing the WAB so that the UK can leave the EU with a deal \", the spokesman said. But\" Brexit is a topic which does carry strong opinions \"and\" they are very often reflected around the Cabinet table \". Downing Street said the package contained\" significant new aspects \"after MPs resoundingly defeated previous versions of the deal three times. Ministers also considered the ongoing preparation for a no-deal Brexit if an agreement has not been ratified by October 31. In a sign of the divisions within the party, Chancellor <mark>Philip Hammond</mark> will use a major speech on Tuesday night to deliver a rebuke to would-be leaders considering a no-deal Brexit. The Chancellor will claim supporters of leaving the bloc without an exit agreement are trying to\" hijack \"the result of the referendum. But Commons leader Andrea Leadsom, who has said she could stand in the contest to replace Mrs <mark>May</mark>, insisted the UK had to be prepared to walk away without a Brexit deal. (PA Graphics) Despite the collapse of cross-party talks with Labour, the WAB contains a series of commitments on workers' rights and environmental protections designed to appeal to opposition MPs. It also contains commitments to look at alternative arrangements to prevent the need for the controversial backstop aimed at keeping a soft border with Ireland, an olive branch for Tory Brexiteers and the DUP. Mrs Leadsom, one of the Cabinet's leading Brexiteers, said she would support the Bill, but warned that could change if its provisions were watered down.\" I continue to support the Prime Minister to get her Withdrawal Agreement Bill through, \"she told BBC Radio 4's Today.\" It is leaving the European Union and so long as it continues to be leaving the European Union, I continue to support it. \"What I do think is that for any negotiation to succeed, you have to be prepared to walk away.\" Justice Secretary David Gauke (Isabel Infantes/PA) But shadow foreign secretary Emily Thornberry dismissed the idea of Labour supporting it, claiming the Bill was a \"piece of political theatre\" for Mrs <mark>May</mark> to have one last shot at getting her deal through. \"It's almost like she is setting up her own political version of the last rites,\" she told Today. \"She cannot realistically expect to see this get through without fundamental changes and we are not going to see fundamental changes, from everything I hear.\" Defeat for the WAB will accelerate Mrs <mark>May</mark>'s departure from Downing Street, with the Prime Minister due to set out the timetable for the contest to replace her after the vote. In a warning to leadership contenders, the Chancellor will use a speech to the CBI's annual dinner in London on Tuesday to highlight the risk of \"right-wing populism\" . Boris Johnson (Brian Lawless/PA) He will say that if the Brexit issue is not resolved in the next few weeks, there is a \"real risk\" of a new prime minister moving towards a \"damaging\" no-deal exit policy for \"ideological\" reasons. In what is likely to be seen as a sharp dig at prominent Tory Brexiteers like ex-foreign secretary Boris Johnson, Mr Hammond will say \"all the preparation in the world\" will not avoid the consequences of no deal. 0 comment"}, {"articleID": "2018052116_00240105_W", "names": {"Elton John": ["Q16209157", "Q2808"]}, "date": "2018-05-21", "url": "https://www.mirror.co.uk/tv/tv-news/eastenders-pushed-back-coronation-street-12573725", "content": "TV EastEnders pushed back and Coronation Street airs hour-long special in major schedule changes for NHS Heroes Awards Guests including Dame Shirley Bassey and Louis Tomlinson attended the annual event brought to you by ITV and the Mirror Share Comments By Kyle O'Sullivan 17:39, 21 MAY 2018 Updated 17:44, 21 MAY 2018 TV Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get soaps updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email The soap schedule has been drastically changed tonight for a very important reason. The NHS Heroes Awards, which took place last week to praise the stars of our health service, air on ITV at 8.30 pm tonight. Paul O’Grady hosts as Prince William, the Duchess of Cornwall and showbiz favourites including <mark>Elton John</mark>, Shirley Bassey and Louis Tomlinson lead tributes to winners who go that extra mile. This means that Coronation Street will air a special hour-long episode at 7.30 pm rather than the usual double-bill. To avoid a clash, EastEnders will be shown on BBC One at the slightly later time of 8.30 pm, but it will be well worth the wait. The NHS Heroes Awards air tonight on ITV Read More NHS Heroes Awards Winners in full Best dressed Scarlett Moffatt thanks NHS Tribute to Dale Winton A kiss for Camilla Ferne's ready for love Vicky on her wedding plans Joel's disastrous proposal Shakil Kazemi and Keegan Baker will be stabbed in shocking scenes as part of a huge knife crime storyline. The schoolboys will be attacked by a disgusting gang, who take extreme measures after Keegan steals one of their bikes to get home. The dark storyline will so the devastating consequences of knife crime and the heartbreaking aftermath when Shakil tragically dies. Keegan and Shakil will be stabbed on EastEnders tonight (Image: 5710) Shakil will die from his injuries (Image: BBC) Keegan will be taken to hospital after surviving the initial attack, to be treated by fictional versions of the inspiring NHS staff that will be honoured at the NHS Heroes Awards. Stars from Coronation Street, Holby City, Casualty and Call the Midwife took part in the celebration of the awe-inspiring winners at the red carpet bash at the Hilton in London. In a message played at the event, guests heard Prince William say: \"The National Health Service is one of our country's greatest treasures and something we should all be immensely proud of. Louis Tomlinson presents Freya Lewis with the Young Fundraiser Award (Image: Daily Mirror)\" Perhaps the most wonderful thing about the NHS is its people. The skill, care and dedication they provide every day is truly inspirational. \"I would like to pay tribute to every member of NHS staff and the wonderful volunteers who do so much to support them--we owe you all a huge thank you.\" The winners were drawn from the full range of frontline NHS services across the UK, including an inspirational surgeon who saves the lives of knife and gun victims on a daily basis--and saved the first stabbing victim of the London Bridge terror attack. * Coronation Street airs tonight on ITV at 7.30 pm, while EastEnders airs on BBC One at 8.30 pm Like us on Facebook Follow us on Twitter Soaps Newsletter dailymirrortv Follow @ MirrorTV Subscribe to our Soaps newsletter Enter email Subscribe Comments Show more comments More On ITV BBC1 Coronation Street EastEnders NHS Heroes Awards"}, {"articleID": "2019091712_00109715_W", "names": {"Rohit Sharma": ["Q21622845", "Q21622847", "Q26436595", "Q26837282", "Q30122003", "Q3520045", "Q58049760"]}, "date": "2019-09-17", "url": "https://www.dnaindia.com/cricket/report-rohit-sharma-is-wonderful-in-limited-overs-no-reason-why-he-cannot-succeed-in-tests-batting-coach-vikram-rathore-2790421", "content": "Cricket <mark>Rohit Sharma</mark> is wonderful in limited-overs, no reason why he cannot succeed in Tests: Batting coach Vikram Rathore As India and South Africa get ready to lock horns in the second T20I of the three-match series, Men in Blue batting coach Vikram Rathore lauded opener <mark>Rohit Sharma</mark> and said there is no reason why the batsman cannot succeed in Test cricket. Vikram Rathore and <mark>Rohit Sharma</mark> Share ANI Updated: Sep 17, 2019, 02:51 PM IST As India and South Africa get ready to lock horns in the second T20I of the three-match series, Men in Blue batting coach Vikram Rathore lauded opener <mark>Rohit Sharma</mark> and said there is no reason why the batsman cannot succeed in Test cricket. \"I think he is too good a player to not be playing in any team. Everybody in the side echoes this opinion. He is a wonderful opening batsman in the limited-overs format, so there is no reason why he cannot be successful in Test matches. If he gets his gameplan right, he can be a great asset to the team,\" Rathore told reporters. Rathore was recently appointed as the new batting coach of the team and he succeeded Sanjay Bangar in the role. The new coach said that the interaction with the team has been good, and he will adjust to working in the setup. \"The interaction with the team has been good. I have been in this profession for a long time, I have interacted with almost all the players. Nothing too tough, it will take me some time to adjust in the setup of team India but I will manage. The batting coach also said that the team is lucky to have so many all-rounders in the squad. He even praised Manish Pandey and Shreyas Iyer, however, he asked the duo to keep working on their consistency.\" Everyone needs to take their opportunities. Everyone has played a good number of matches. The entire team is backing them and I am sure we continue to back them up, they will produce good results, \"Rathore said.\" We are fortunate to have so many all-rounders in the T20 format. Manish and Shreyas are two fine cricketers. Manish has done well in the past and Shreyas had a successful tour to West Indies. They just need to be consistent, \"he added. Rishabh Pant who has been often criticised for playing reckless shots, got the backing of the new batting coach but Rathore said that the players in the side need to understand the difference between fearless cricket and careless cricket.\" All young cricketers need to understand the difference between fearless cricket and careless cricket. The team wants everyone to play without fear. We want Rishabh to play all his shots as it makes him special. But you do not want any batsman to be careless and reckless, \"Rathore said. The first match between India and South Africa was abandoned due to rain. India's squad for three T20Is includes Virat Kohli (Captain), <mark>Rohit Sharma</mark> (vice-captain), Shikhar Dhawan, KL Rahul, Shreyas Iyer, Manish Pandey, Rishabh Pant (wicket-keeper), Hardik Pandya, Ravindra Jadeja, Krunal Pandya, Washington Sundar, Rahul Chahar, Khaleel Ahmed, Deepak Chahar, and Navdeep Saini. India takes on Proteas in the second match tomorrow at Mohali."}, {"articleID": "2017041214_00673657_W", "names": {"Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"], "Phil Roe": ["Q1665842", "Q7182346"], "Jeff Miller": ["Q30981158", "Q43459095", "Q6174508", "Q6174513", "Q6822669", "Q746834", "Q970478"]}, "date": "2017-04-12", "url": "http://sunshinestatenews.com/story/cva-runs-new-ad-urging-bill-nelson-support-marco-rubios-va-reforms", "content": "By Kevin Derby April 12, 2017 - 10:45 am A conservative veterans group is urging U.S. Sen. <mark>Bill Nelson</mark>, D-Fla ., to back a measure from U.S. Sen. Marco Rubio, R-Fla ., reforming the U.S. Department of Veterans Affairs. On Wednesday, Concerned Veterans for America (CVA) unveiled a Web video, calling on <mark>Nelson</mark> to back Rubio's \"VA Accountability First Act.\" <mark>Nelson</mark> has supported similar legislation in the past. \"How many more veterans will die waiting for care at the Department of Veterans Affairs?\" the narrator of the ad asks. \"How many more will be neglected by the people hired to serve them? How many more will suffer before the Senate acts?\" CVA Executive Director Mark Lucas weighed in on why his group was running the new ad. \"Senator <mark>Nelson</mark> has supported strong VA accountability measures in the past, and there should be nothing stopping him from doing so now,\" Lucas said. \"The VA Accountability First Act of 2017 will help Secretary Shulkin get rid of the bad VA employees who drive a toxic culture and fail to give our veterans the care they need. Veterans shouldn't have to suffer at the hands of incompetent or negligent VA employees. We urge the Senate to prioritize sending the VA Accountability First Act of 2017 to President Trump's desk.\" CVA is running similar ads across the nation, urging swing state Democrats who are expected to face competitive races next year, including <mark>Nelson</mark>, to support the legislation. Other swing state Democrats targeted include U.S. Sens. Joe Manchin of West Virginia, Claire McCaskill of Missouri and Jon Tester of Montana. Rubio teamed up with U.S. Rep. <mark>Phil Roe</mark>, R-Tenn ., the chairman of the House Veterans Affairs Committee, to bring out the <mark>bill</mark> at the start of March. This is not a new subject for Rubio who had been pushing for reforming the VA, often teaming with then U.S. Rep. <mark>Jeff Miller</mark>, R-Fla ., who chaired the House Veterans Affairs Committee, on the issue. With both Rubio and <mark>Miller</mark> leading the charge, Congress passed a reform measure in 2014 after reports emerged about veterans dying after being placed on altered waiting lists while seeking medical treatment from VA facilities, including those in the Phoenix, Arizona area. In the aftermath of these reports, few VA employees lost their jobs after the scandal broke though then-VA Secretary Eric Shinseki resigned his post under fire. According to his office, Rubio's new proposal \"would provide improved protections for whistleblowers; empower the VA secretary to reduce an employee's federal pension if they are convicted of a felony that influenced their job at VA; allow the VA secretary to recoup a bonus provided to an employee who engaged in misconduct or poor performance prior to receiving the bonus, or recoup any relocation expenses that were authorized for a VA employee only through the employee's ill-gotten means, such as fraud, waste or malfeasance.\" \"For far too long, incompetent and uncaring employees at the VA have been allowed to fail at their jobs but still keep them,\" Rubio said when he brought out the proposal last month. \"In the past, we've passed measures to institute accountability but lacked a president and VA secretary who would actually implement them and fire VA employees who are failing our veterans. Now it's time to finally provide our veterans with the quality, efficient health care they have earned and deserve, instead of protecting the big labor unions seeking to keep the status quo of incompetence and malfeasance.\" The VA Accountability First Act will give the VA secretary increased flexibility to remove, demote, or suspend VA employees who fail to take care of our veterans, \"Rubio added.\" I am pleased President Trump has made this issue a priority, and I look forward to working with Secretary Shulkin to hold VA employees at all levels accountable for their performance and ensure our veterans are no longer ignored or mistreated. \""}, {"articleID": "2014110521_00057827_W", "names": {"Kevin Francis": ["Q1740144", "Q26706887", "Q6396315", "Q6396316"]}, "date": "2014-11-05", "url": "http://theherald.com.au/story/2677524/hunt-for-two-men-raiding-hunter-drug-dealers/?cs=2452", "content": "h1 itemprop = \"name\" > Hunt for two men raiding Hunter drug dealers HUNTER: Two men are allegedly breaking into drug dealers' homes armed with knives and swords. Police have issued warrants for the arrest of Michael John Carroll, left, and <mark>Kevin Francis</mark> Sams. TWO men are allegedly breaking into drug dealers homes in Maitland armed with knives and swords and doing whatever it takes to escape with as many drugs as they can carry. Victims have told police the men have allegedly threatened to \"torch them\" and are not afraid to assault them if they do not hand over their illicit drugs. The pair have hit drug dealers in Tenambit, East Maitland and Cessnock in the past seven days. Their last-know hit was in Maize Street, Tenambit last week. Police believe they consume the drugs and then conduct another home invasion when their supply runs out. They have no idea how many other victims are out there because drug dealers are reluctant to report the matter to police. Police allege Michael John Carroll and <mark>Kevin Francis</mark> Sams are behind the home invasions and have issued warrants for their arrest. Central Hunter acting crime manager Acting Detective Inspector Mitch Dubojski said police were deploying every possible resource to track them down. He believed they were staying in the Rutherford area. \"We strongly urge anyone who sees them to notify police and make sure they do not to approach them as they could be dangerous,\" Acting Detective Inspector Dubojski said. \"At the very least we believe they are carrying knives and swords.\" Blind woman Gisele Mesnage sues Coles over online shopping website Herald Half-Time Rd5: Homecoming for Jets, but is Victory a stretch?"}, {"articleID": "2013110601_00075122_W", "names": {"Pat Buchanan": ["Q149127", "Q48700522"], "George Wallace": ["Q3101983", "Q43913855", "Q48817450", "Q5545830", "Q5545832", "Q5545834"]}, "date": "2013-11-05", "url": "http://www.freespeech.org/text/pat-buchanan-invokes-george-wallace-bash-first-hustler-obama", "content": "<mark>Pat Buchanan</mark> Invokes <mark>George Wallace</mark> to Bash \"First Hustler' Obama Conservative columnist and cable-news racist <mark>Pat Buchanan</mark> is out with a new column calling President Obama the\" first hustler \"because insurers have dropped some health plans that did not comply with the new health care reform law, meaning that some people have had to change their health insurance plans. In defending his case, <mark>Buchanan</mark> invokes none other than <mark>George Wallace</mark>, the segregationist Alabama governor perhaps most famous for physically blocking two black students from entering the University of Alabama. <mark>Wallace</mark> had his own reasons for disliking the federal government, which he said (while running for president) was composed of\" pointy-headed bureaucrats who can't park a bicycle straight \"- a sentiment that <mark>Buchanan</mark> gleefully repeats. <mark>Buchanan</mark> then goes on to declare that the Affordable Care Act will finish the work done by such travesties as\" free schooling [and] Social Security \"to bring capitalism to\" the end of the line. \"\"Nothing is lost save honor.\" So said Jim Fisk after he and Jay Gould survived yet another scrape in their corrupt and storied careers in the Gilded Age. Fisk's dismissal of honor came to mind while watching Barack Obama in Boston smugly explain how his vow - \"If you like your health care plan, you can keep it!\" - was now inoperative. All along, it had been a bait-and-switch by the first hustler ....Here was the president's signature program - what Social Security was to FDR, Medicare to LBJ - and one month into launch, it is grist for the mills of Saturday Night Live and Comedy Central. Observing the rollout, one begins to appreciate what <mark>George Wallace</mark> meant when he talked of Washington being a city of \"pointy-headed bureaucrats who can't park a bicycle straight.\" And though the Obamacare website will one day be repaired, and people may begin to sign up, the land mines in Obamacare are by no means all exploded. We will be walking right through them ....The welfare state that began with Bismarck is reaching the end of the line, just as the private sector that generates the wealth to sustain that state is now, almost everywhere, buckling under its weight. The deficits stretch to the horizon. The debts rise inexorably. Across the West, neo-socialism is out, the new austerity in. Contact Us WRITE US: P.O. Box 44099, Denver CO 80201"}, {"articleID": "2019120421_00158670_W", "names": {"Harjeet Singh": ["Q15102143", "Q21336246", "Q21898054", "Q28043301", "Q47086639"]}, "date": "2019-12-04", "url": "http://telegraphindia.com/india/india-worst-climate-victim-report/cid/1724363", "content": "India India worst climate victim: Report The report places India at fifth position in overall \"climate vulnerability' in 2018, behind Japan, the Philippines, Germany and Madagascar By Jayanta Basu in Madrid Published 5.12.19, 2:05 AM 2 mins read The Global Climate Risk Index 2020, released by the non-profit Germanwatch on the sidelines of the UN climate change meeting in Madrid, says India witnessed 2,081 deaths--the highest in the world--caused by extreme weather events in 2018, followed by Japan with 1,282. (Shutterstock) India has become the world's worst victim of extreme weather events driven by climate change, with a sharp increase in climate-linked deaths and economic damage in recent years, analysts said in a report released on Wednesday. The Global Climate Risk Index 2020, released by the non-profit Germanwatch on the sidelines of the UN climate change meeting in Madrid, says India witnessed 2,081 deaths--the highest in the world--caused by extreme weather events in 2018, followed by Japan with 1,282. In 2017, India was in second position. The report places India at fifth position in overall\" climate vulnerability \"in 2018, behind Japan, the Philippines, Germany and Madagascar. Analysts said this marked a significant fall from India's 14th position in an analysis for 2017. According to the report, India's economic losses from extreme weather events touched $37,808 million (Rs 2.7 lakh crore) in 2018, almost a threefold rise since 2017. India has been ranked third on climate-linked fatalities and economic losses over the two-decade period spanning 1999 to 2018.\" A series of extreme weather events impacted India in 2018, \"Vera Kunjel, the report's lead author, told The Telegraph. The extreme weather events included the heavy rainfall and floods in Kerala, the tropical cyclones Gaja and Titli, and a prolonged heat wave.\" All of these have collectively propelled India into the position of being the country worst hit by extreme weather, \"Kunjel said. The report said the Kerala disaster was\" the worst in a hundred years \"and that India was\" affected by extreme heat in both 2018 and 2019 \". The reportsaid that since 2004, India had experienced 11 of its 15 warmest years on record. Maik Winges, another of the report's authors, said that although the developing countries continued to bear the brunt of climate change, two developed countries--Japan and Germany--had for the first time occupied positions among the three worst-hit nations.\" This is a clear signal that the impacts of climate change are (being witnessed) everywhere, \"Winges said. <mark>Harjeet Singh</mark>, global climate lead of ActionAid, said the long-term climate effects documented in the report underlined the importance of implementing a\" loss and damage \"process under the global climate pact. UN climate negotiations have included discussions on loss and damage, which propose that the developed countries should provide support, including finance, to the developing and underdeveloped countries affected by climate change. The argument is that the less developed nations bear less responsibility for the greenhouse gas emissions that have triggered climate change. Although a mechanism was set up during the Warsaw climate summit in 2013 to work on loss-and-damage-related issues, sustained opposition from the developed countries, especially their resistance to providing funds, has put it on the backburner.\" It is expected that loss and damage will be a key issue during the negotiations in Madrid, \"Aarti Khosla of Climate Trend said. Tags"}, {"articleID": "2011100512_00037327_W", "names": {"Fernando Alonso": ["Q10514", "Q20533356", "Q42393967", "Q42394430", "Q5444582", "Q5859158"]}, "date": "2011-10-05", "url": "http://autosport.com/news/report.php/id/95054", "content": "<mark>fernando alonso</mark> says the runner-up spot in this year's championship is not a lot cause, even though he admits it will be very hard to secure the position. ferrari driver <mark>alonso</mark> dropped to third place in the standings after the singapore grand prix, but he is just one point away from mclaren's jenson button. with ferrari already fully focused on next year's car, <mark>alonso</mark> is likely to face an uphill battle to secure second place, but the spaniard, who reckons the result would be \"great', says it is not out of reach.\" even if it's true we are no longer even mathematically in the hunt for the drivers' title, there are still plenty of reasons to retain our motivation to tackle these last five races with the right attitude, \"wrote <mark>alonso</mark> on ferrari's website.\" first of all there's second place in the drivers' table. given how the season has gone so far, with vettel totally dominant, failing to get on the podium only once, being runner-up would really be a great result for me and for the team. \"there are four of us in the running, as i am up against webber and the two mclaren guys and i reckon we will have to wait until interlagos to find out who it will go to.\" clearly, if one looks at the way recent races have gone, it will definitely not be easy, as my closest rivals seem to have that little bit extra in terms of car performance, but that does not mean it's a lost cause. \"we know we have to do everything perfectly if we want to reach our goal and we will be trying right to the very end.\" the spaniard believes second position in the constructors' championship is not impossible either, even if ferrari is 85 points behind mclaren with five races to go. \"there's still second place in the constructors' championship, but this is a much harder target, because there's a significant gap to mclaren, but it's not impossible."}]