[{"date": "2019-08-19", "url": "https://www.washingtontimes.com/news/2019/aug/19/weekend-sports-in-brief/?utm_source=RSS_Feed&utm_medium=RSS", "content": "Weekend Sports in Brief Is \"gun control' a winning issue for Democrats? Question of the Day By The Associated Press - Associated Press - Monday, August 19, 2019 GOLF MEDINAH, Ill. (AP) - Staked to a six-shot lead, <mark>Justin Thomas</mark> spent more time Sunday worrying about what could go wrong than ending 12 months without winning. And right when it started to go wrong, <mark>Thomas</mark> delivered his biggest shots in the BMW Championship. In a span of three holes around the turn at Medinah, his six-shot lead shrunk to two. <mark>Thomas</mark> answered with two clutch wedge shots, two big putts and sailed to a 4-under 68 to secure a three-shot victory over Patrick Cantlay, who gave him a battle to the end with a 65 .\" Patrick played unbelievably, put a lot of heat on me, \"<mark>Thomas</mark> said .\" In the end, it could have been good for me. It kept me focused, kept my head down ....I was really nervous going into today. I remembered that it's really hard to win a golf tournament, and I'm glad that I was able to do so. \"The timing was ideal. His first victory since the World Golf Championship at Firestone last year moved him to the top of the FedEx Cup going into the Tour Championship, where he will start the tournament at 10-under par with a two-shot lead under the new scoring format as the final 30 players chase a $15 million first prize .\" I can certainly say I never slept on a Wednesday lead, \"<mark>Thomas</mark> said. Cantlay, who made four straight birdies around the turn, secured the No. 2 position and will start at 8 under. Brooks Koepka will be 7 under, a staggered start all the way down to even par for the final five players. TENNIS MASON, Ohio (AP) - Two unexpected champions embraced their first Rookwood championship trophies, concluding a week that brought more questions than clarity to the upcoming U.S. Open. Who's going to be healthy on the women's side? Will stumbles in the men's bracket at the Western & Southern Open carry over to New York? And are Madison Keys and Daniil Medvedev capable of carrying their newfound momentum into a Grand Slam event? After winning the biggest tournament title of their careers, they were already getting asked about how it might transfer to the bigger stage. Keys rallied late in both sets and beat <mark>Svetlana Kuznetsova</mark> 7-5, 7-6 (5) for her second title of the season and easily the biggest of her career. After flameouts in her last three tournaments and a tough draw for the week, she couldn't imagine the outcome. Back on the court to receive the trophy, she told the crowd:\" If you told me this is where I would be a week ago, I would have laughed in your face! \"Medvedev beat David Goffin 7-6 (3), 6-4 for his first Masters 1000 title. It was his third straight final, but the first time he had won. Medvedev lost to Rafael Nadal on Montreal a week earlier, then went on to reach his sixth final of this season, most on the ATP tour. He's won twice .\" To finally lift the trophy this week is an amazing feeling, \"Medvedev said. NFL EAST RUTHERFORD, N.J. (AP) - Le’Veon Bell will have to wait a little longer for his debut with the New York Jets. Coach Adam Gase announced that the star running back will be held out of the team's final two preseason games .\" I was about 99% sure heading into the preseason, \"Gase said after the Jets' practice at MetLife Stadium .\" It was all based off of how he practiced, conditioning and all those types of things. \"Gase and Bell spoke about the plan when training camp started, and Bell's snaps increased in practice last week. Bell has looked good in training camp after sitting out all last season in a contract dispute with Pittsburgh. Gase and the Jets don't want to take any unnecessary risks with Bell .\" We'll just get him as game ready as possible, \"Gase said .\" He's not really going to know until we get into a real game, but I feel like he's in great shape and he's been contacting about as good as anybody on the practice field. \"So, I feel confident he'll be ready to go (in) Week 1 .\" That would be the regular-season opener against Buffalo on Sept. 8. It will mark the first time Bell will play in a game since the Steelers' playoff loss to Jacksonville on Jan. 14, 2018 - a span of nearly 20 months. \"I'll see y' all in September,\" Bell wrote on Twitter about an hour after Gase's announcement. AUTO RACING LONG POND, Pa. (AP) - The black clouds that enveloped Pocono and officially brought the IndyCar race to a premature end didn't appear until the halfway point. But they've really been hanging over the track since the series returned to the mountains in 2013. A fatal crash. A promising career wrecked by paralysis. And again Sunday, a first-lap demolition derby that sent another driver to the hospital and stirred an angry mob howling for IndyCar to get the heck out of town once and for all. It may be a moot point, IndyCar and Pocono don't have a deal for a 2020 race. But for <mark>Robert Wickens</mark>, the Canadian confined to a wheelchair after last year's accident, IndyCar has no place on the 2 1/2 - mile superspeedway. \"How many times do we have to go through the same situation before we can all accept that an IndyCar should not race at Pocono,\" he tweeted. The counter argument was posed from the Australian snapping victory lane photos inside a cramped Pocono media center as rain pounded the track outside. Will Power was in the right position Sunday to claim the win when lightning struck in the area to not only win the race, he ended the potential for his first winless season since 2006 and he took the checkered flag at Pocono for the third time in four years. \"I really hope we come back, I do,\" Power said. \"It's hard for us to find good ovals that suit our cars .\" IndyCar at Pocono has turned into perhaps the scariest race day in auto racing, 500 miles of danger for drivers on the 2 1/2 - mile track and white knuckles and clasped hands for anyone watching the event. The green flag had barely been dropped when 2017 Indianapolis 500 winner Takuma Sato used an aggressive - arguably foolish - move to trigger a wreck that sent Felix Rosenqvist to the hospital. Sato tried to shoot a gap on the first lap, cut off Alexander Rossi and connected with Ryan Hunter-Reay in a crash that left cars and debris strewn across the track. Sato's car landed upside down on Hunter-Reay's Honda. \"I can't even begin to understand how after last year Takuma thinks that's acceptable,\" Rossi said. \"It's disgraceful .\" Rosenqvist hit the fence nose first and his car slammed back on the track. Rosenqvist did not suffer life-threatening injuries and was cleared. \"Definitely feel lucky escaping without any serious injuries after visiting the catch fence there,\" he tweeted. ___", "articleID": "2019081908_00193726_W", "names": {"Justin Thomas": ["Q15877245", "Q19666564", "Q22098319", "Q51084062", "Q52504008", "Q775036"], "Robert Wickens": ["Q113936", "Q39385430"], "Svetlana Kuznetsova": ["Q192064", "Q21063641", "Q3978501", "Q4245117"]}}, {"date": "2019-08-17", "url": "https://www.duluthnewstribune.com/sports/hockey/4620136-Gophers-Mavericks-womens-hockey-teams-to-meet-in-USHHF-game", "content": "Hockey Gophers, Mavericks women's hockey teams to meet in USHHF game The annual college women's hockey game to raise awareness of the United States Hockey Hall of Fame will feature Minnesota vs. Minnesota State Mankato and will be played in Prior Lake, Minn., in December. Written By: Jess Myers | Aug 19th 2019 - 4pm. Gophers women's hockey coach Brad Frost. (St. Paul Pioneer Press file photo) MINNEAPOLIS--Since they skated to 1-1 tie in Minneapolis on Nov. 14, 2009, the Minnesota Gophers women's hockey team has a winning streak of more than 40 consecutive games over in-state rival Minnesota State Mankato in the past decade. But the Mavericks will get a shot at stopping the slide in a unique setting this season. On Dec. 7, the Gophers and Mavericks will meet in the annual U.S. Hockey Hall of Fame Museum Women's Face-Off Classic, to be played at the at the Dakotah! Ice Center in Prior Lake, Minn. \"We are thrilled to once again be playing in the Hall of Fame game versus Minnesota State Mankato,\" said Gophers coach Brad Frost in a statement. \"We know the atmosphere will be great as Division I women's hockey comes to a community arena in Prior Lake .\" The game raises awareness of the U.S. Hockey Hall of Fame Museum in Eveleth, Minn., along with bringing women's Division I hockey to a local community. Last season, the event was held in Brainerd, Minn., with St. Cloud State beating Bemidji State, 3-0. In addition to the college game in Prior Lake, there will be a girls high school game between Prior Lake and Rosemount, and a girls 12UA & 12UB tournament. Game proceeds will go to the Community Action Partnership of Scott, Carver & Dakota counties plus the Greater Mankato Area United Way. The Gophers won the WCHA last season and advanced to the NCAA title game, falling to archrival Wisconsin there, and finishing with a 32-6-1 overall record. The Mavericks, in former Olympian <mark>John Harrington</mark>'s fourth season as their coach, were 9-19-7 overall. Dakotah! Ice Center is the home of Prior Lake/Savage youth hockey and is located adjacent to Mystic Lake Casino and Hotel. Additional event details will be announced in coming months. 1 / 2 <mark>John Harrington</mark>. (Courtesy of Minnesota State Mankato) Related Topics", "articleID": "2019081922_00203848_W", "names": {"John Harrington": ["Q6237901", "Q6237905", "Q6237907", "Q963654"]}}, {"date": "2019-08-20", "url": "https://www.ozy.com/provocateurs/greta-thunberg-sets-sail-for-america-amid-rising-tide-of-criticism/96175", "content": "Greta Thunberg Sets Sail for America Amid Rising Tide of Criticism Caption The teenager is an inspiration for climate movement but also a lightning rod for criticism. Source BEN STANSALL/AFP/Getty Provocateurs Provocateurs People shaking up their fields, old dogs doing new tricks, and those who like to bring the ruckus. Read more Facebook Twitter Love this? Share Email article Copy link Copy link to share with friends Copy link Why you should care Because she's becoming the face of the climate movement. OZY takes you to the nations and individuals leading the fight to save the planet. This OZY series takes you to the nations and individuals driving innovative solutions at the New Climate Change Frontiers. By Leslie Hook, Victor Mallet and Yasemin Craggs Mersinoglu The Daily Dose AUG 20 2019 When Greta Thunberg started a solo climate protest outside Sweden's parliament building last year, no one imagined it would spark a global movement that led to her being nominated for a Nobel Peace Prize. But as she sailed for the U.S. last Wednesday, having quit flying for environmental reasons, the 16-year-old has become the figurehead for European climate activism as the continent experiences a groundswell in support for Green parties. Thunberg's prominence has grown during 2019 as she has crisscrossed the continent to lobby political leaders and rally her young supporters as part of the weekly #FridaysForFuture school strikes. Yet the number and vehemence of her detractors have grown with her. Over the past 12 months, I suspect she has got a lot more airtime than the polar bear. <mark>Mike Hulme</mark>, a professor at Cambridge University The teenager--whose fame can be measured by the fact that she is almost always referred to by her first name only--has become a lightning rod for criticisms that are likely to intensify when she arrives in the more politically charged U.S. for next month's U.N. climate summit in New York. \"You can think of Greta as the new icon of climate change,\" said <mark>Mike Hulme</mark>, a professor at Cambridge University. \"Over the past 12 months, I suspect she has got a lot more airtime than the polar bear .\" The most vociferous attacks on Thunberg have come from far-right politicians and conservative writers. During a visit last month to France, when she addressed legislators, one lawmaker dismissed Thunberg as a \"prophetess in short trousers\" who would win a \"Nobel Prize for fear,\" while another called her an \"apocalyptic guru .\" Days later, an Australian columnist called her the \"deeply disturbed messiah of the global warming movement,\" prompting Thunberg to hit back. \"I am indeed\" deeply disturbed' about the fact that these hate and conspiracy campaigns are allowed to go on and on, \"the teenage activist wrote in a Twitter post .\" Where are the adults? \"And yet Thunberg's message has resonated across much of Europe, striking a chord with young people and a public that is increasingly concerned about climate breakdown and environmental issues. This summer, the U.K. and France adopted targets to cut carbon emissions to net-zero by 2050, and the Greens in Germany now have more political support than any other party. Thunberg's journey to New York on board the 60-foot carbon-fiber racing yacht Malizia II, with a small crew including skipper Boris Herrmann and Pierre Casiraghi, nephew of Prince Albert of Monaco, is expected to take two weeks .\" It will be quite an adventure, \"she said on Wednesday as she began her journey in Plymouth on England's south coast .\" I expect it will be challenging, maybe seasickness, \"she said, before adding:\" There are people in the world suffering more than that. \"Thunberg is far from a household name in the U.S., where opinion polls show growing concern about climate change but a wide gap between Republicans and Democrats on the issue. <mark>Richard Black</mark>, director at the Energy and Climate Intelligence Unit and author of Denied: The Rise and Fall of Climate Contrarianism, said the U.S.'s more polarized political discourse could result in her being targeted for criticism .\" It will be interesting to see whether there is any paid-for anti-Greta advocacy, \"he said, pointing to the funding for anti-climate action lobbying in the U.S.\" There will be one tranche that absolutely does not welcome her. \"While almost all of her critics are on the right, occasional voices from other parts of the political spectrum have also questioned her influence .\" When you consume Greta, you do not help the planet, \"Raphaël Enthoven, a liberal French philosopher, wrote on Twitter a few days ago .\" You play the game of the system that destroys it. \"<mark>Black</mark> said of such reproval:\" She is also an intellectual threat, in that there is a kind of model of the political commentariat, that is used to being taken seriously, and she does not take them seriously. \"Others have asked whether Thunberg has gained excessive prominence. No one could argue about her significant influence: German Chancellor Angela Merkel credited the student protesters as she instructed her Cabinet to examine a carbon net-zero goal .\" It is quite interesting how rapidly she has gained this iconic power--almost mesmerizing power--given how partial and limited her political antenna and skills actually are, \"said <mark>Hulme</mark>.\" She is a legitimate representative, but should not be a hegemonic one. \"Within the youth movement that she inspired--school strikes have taken place in more than 100 countries--fellow activists insist Thunberg has always eschewed a leadership role, even if her speeches, viral tweets and social media posts ensure she remains in the public eye. Last week, Thunberg was among 400 young campaigners who gathered in Switzerland for the first Europe-wide meeting of her school strike movement .\" Everyone here obviously knows [that] Greta was the founder of the movement. But she has always been very specific that she is not the leader, \"said Mai Sheehan, a 16-year-old activist from Ireland .\" All our decisions are made on a consensus basis. \"As if to back this up, Thunberg was nowhere to be seen at the press conference on the final day of the gathering. But the movement she inspired continues to grow, with major global demonstrations planned for Sept. 20 and 27 .\" What often happens with Greta, is that the media frames her role as \"Jesus' and us as\" the disciples, \"' said Leonard Ganz, 21, from Germany .\" This is really a problem. \"He continued:\" She obviously is an inspiration for the movement...[but we] do not have that hierarchy. \"Timeline: Greta's rise to prominence August 2018 Greta Thunberg, 15, begins her protest against government inaction on climate change in front of Sweden's parliament building. She continues to protest each Friday, gaining worldwide attention and launching the #FridaysForFuture school strike movement. December 2018 Addresses leaders at the U.N.'s COP24 climate summit in Poland in a speech that becomes her first viral video. The following month she gives a talk at the World Economic Forum in Davos after a 32-hour train journey. March 2019 An estimated 1 million students take part in school strike protests across 125 countries, as Thunberg is nominated for a Nobel Peace Prize. April 2019 Time magazine names her one of the 100 most influential people of 2019. July 2019 OPEC Chief Mohammed Barkindo declares Thunberg and other activists the\" greatest threat \"to the fossil fuel industry. August 2019 Prepares to sail to the U.S. on board an environmentally friendly yacht to attend the U.N. climate summit in New York and a series of protests. Clara Hernanz + By Leslie Hook, Victor Mallet and Yasemin Craggs Mersinoglu OZY partners with the U.K.'s Financial Times to bring you premium analysis and features. © The Financial Times Limited 2019. Topics: Climate Change Environment EUROPE SCIENCE Sweden United Nations Facebook Twitter Love this? Share Copied Copy link Email", "articleID": "2019082004_00029175_W", "names": {"Mike Hulme": ["Q1933216", "Q51637895"], "Richard Black": ["Q16749701", "Q30310011", "Q58127436"]}}, {"date": "2019-08-20", "url": "http://news.bbc.co.uk/news/uk-northern-ireland-49400180", "content": "Brexit: Johnson and Varadkar in hour-long call 19 August 2019 These are external links and will open in a new window Close share panel Brexit Image caption Boris Johnson and Leo Varadkar spoke by phone on Monday The prime minister and the taoiseach (Irish prime minister) have \"shared perspectives on the withdrawal agreement\" in a phone conversation. Boris Johnson and Leo Varadkar spoke for almost an hour on Monday evening, the two governments said. Mr Johnson said the agreement in its current form would not get through the House of Commons, while Mr Varadkar reiterated that it cannot be reopened. Both prime ministers condemned Monday's bomb in County Fermanagh. The phone call comes a day after a government dossier warning of the impact of a no-deal Brexit was leaked. The report said leaving the EU without a deal could lead to a hard Irish border after plans to avoid checks fail. Media playback is unsupported on your device Media caption Confused by Brexit jargon? Reality Check unpacks the basics. Mr Johnson maintained that the \"backstop would need to be removed\" , while Mr Varadkar \"emphasised the importance of the legally operable guarantee to ensure no hard border and continued free trade on the island of Ireland\". The backstop, part of the withdrawal agreement negotiated by former prime minster <mark>Theresa May</mark>, is an insurance policy to prevent a hard border returning on the island of Ireland, which if implemented, would see Northern Ireland staying aligned to some rules of the EU single market. It would also involve a temporary single customs territory, effectively keeping the whole of the UK in the EU customs union. These arrangements would apply unless and until both the EU and UK agreed they were no longer necessary. The prime ministers also spoke about the need for the power-sharing executive at Stormont to be reinstated and \"agreed to work closely to this end\". The leaders also agreed to meet face to face in Dublin in early September.", "articleID": "2019082006_00187781_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2019-08-20", "url": "http://www.gamereactor.eu/hearthstone-heroes-of-warcraft/?sid=c748f06a9aee355885e35efd0619862a", "content": "HEARTHSTONE: HEROES OF WARCRAFT REVIEW. Written by Ricardo C. Esteves on the 9th of August 2019 at 14 \"In addition to offering many alternatives to players, it's a really fun expansion in terms of cards, effects, and variety .\" 0 REVIEW. Written by Ricardo C. Esteves on the 15th of April 2019 at 15 \"Hearthstone changes for the better as new content comes in and old cards are swept from the table .\" NEWS. Written by Ricardo C. Esteves on the 18th of July 2019 at 21:09 Sir Finley returns, now with extra power and as a Paladin-only card. Plus, we asked Blizzard's Alec Dawson about the latest addition coming to Hearthstone. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 10th of May 2019 at 13:32 This will provide twists on the existing mechanics, as well as some new features over the five chapters that the heist takes place. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 11 The top 16 players from three regions will compete for supremacy, and the divisions are set to be announced next month. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 14th of March 2019 at 17:00 Join the League of E.V.I.L. in the battle against the Defenders of Dalaran, featuring new cards and mechanics to keep things fresh.", "articleID": "2019082017_00268251_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-08-21", "url": "http://telegraphindia.com/india/chidambaram-seeks-papers-from-company-demanding-rs-10-000-crore-damages/cid/1699302", "content": "India Chidambaram seeks papers from company demanding Rs 10,000 crore damages The company, 63 Moons Technologies, has alleged that it was targeted as part of a \"conspiracy\" hatched by Chidambaram and two others By PTI in Mumbai Chidambaram in New Delhi on Tuesday. Picture by <mark>Prem Singh</mark> Former Union finance minister P. Chidambaram, who is facing a summons from Bombay High Court in a suit filed by a technology company seeking Rs 10,000 crore in damages, has sought a copy of the complaint and other relevant documents from the firm. The high court on July 24 directed Chidambaram and two bureaucrats to remain present in person or through their lawyers on October 15 to respond to the claims made by the company, 63 Moons Technologies, formerly known as Financial Technologies Ltd.. On August 14, Chidambaram's lawyer Nitesh Jain sought a copy of the complaint and all documents that the company had relied upon. \"The summons was not accompanied by a copy of the plaint or any other annexures, hence the summons is in non-compliance with relevant provisions of the Code of Civil Procedure,\" the letter by Chidambaram's lawyers said. The company's lawyer, Bhavesh Thakur, on Tuesday said after receiving the letter, a copy of the suit and other relevant documents were sent to Chidambaram. 63 Moons Technologies filed the suit on June 12 against Chidambaram, ministry of skill development secretary K.P. Krishnan and former Forward Markets Commission (FMC) chairman Ramesh Abhishek. The company alleged that it was facing continuous \"targeted and malafide actions\" in the wake of an \"engineered payment default crisis\" at one of its subsidiaries, the National Spot Exchange Limited (NSEL). It claimed that the probe by multiple agencies did not find any money trail reaching NSEL, 63 Moons and its founder Jignesh Shah. However, the group was targeted as part of a \"conspiracy\" hatched by Chidambaram, Krishnan and Abhishek, the suit alleged. Tags", "articleID": "2019082107_00145751_W", "names": {"Prem Singh": ["Q28058336", "Q28419672", "Q7240178"]}}, {"date": "2019-08-22", "url": "https://jewishnews.timesofisrael.com/liveblog_entry/over-half-of-hasmonean-gcse-grades-were-9-to-7/", "content": "home page Pupil during an exam Photo credit: Chris Radburn/PA Wire 12:46 pm Over half of Hasmonean GCSE grades were 9 to 7 Hasmonean High School has been celebrating top results, where more than half of all GCSE grades were A * / A/9 -7 (53 percent this year). Over 90 percent of grades were in the A * - C/9 -4 category. Katherine Brice, head of Hasmonean Girls' school, said: \"These impressive results are the product of hard work by the girls who have maintained their commitment to Jewish Studies alongside their secular subjects .\" We are very proud of our students' achievements and are delighted that so many of them have exceeded their target grades. We are delighted to congratulate each one of them on their personal achievements, and are grateful to our dedicated and talented staff who have guided and supported them academically and pastorally. Debbie Lebrett, head of Hasmonean Boys' School and acting head of Hasmonean Girls' school, said: \"Hasmonean students have continued to find success in their secular studies whilst maintaining a focus on both Jewish Leaning and leadership opportunities .\" We are particularly proud of our students' achievements given that they have sat very challenging GCSE examinations. We are delighted to congratulate each one of them on their personal achievements, and are grateful to our dedicated and talented staff who have guided and supported them academically and pastorally. 11:40 am Beaming JCoSS pupils get top scores JCoSS pupil Emma Wilkins with her family. She was awarded all 9s Tom Mosseri received 9 grade 9s and A * From L to R, Aran Haber, Tom Mosseri, Lucy Ritter, Ben Brent, Emma Wilkins, all received at least 9 × 9 11:37 am Record-breaking results for JCoSS! JCoSS announced record-breaking results this year, with half of results at grade 7 (A) or higher. Another 18 percent of grades were at 9, compared with the 3 percent national average. Meanwhile, 32 percent of results were grades 8 or 9, and seven students achieved at least 9 grade 9s, of whom three scored 10. A third of students achieved at least 8 GCSEs at grade 7 or higher. 83.2 percent of results were graded at grade 5 and above, which is a strong pass--marking an increase since last year. 93 percent of results were at grades 9 to 4. Over 30 percent of grades in Jewish education, biology, physics, chemistry and history were at 9. Headteacher Patrick Moriarty said: \"We are delighted by the outstanding GCSE results that our students have achieved, which surpass our already strong track record .\" Their hard work and resilience, married to the expertise and care of their teachers, have enabled them to meet the increased challenges of new specifications with flair. I am exceptionally proud of students and colleagues alike. \"11:11 am JFS\" celebrates the success of all students \"92 percent of students at JFS achieved five or more standard GCSE passes including English and Maths. Of these, 80 percent were grade 5 or above, with nearly half (46 percent) of students achieving achieving 9 to 7 grades. Another 28 percent of grades were at 8 or 9 (A *). Headteacher Rachel Fink said:\" Today's outstanding results are the culmination of the collective hard work or our students and staff together with support from home. I am deeply proud of all our students who have shown such commitment to their studies as a step towards their future goals. \"In keeping with our drive to promote positive well-being we have chosen not to name individual students for praise. We have many students who have attained a clean sweep of top grades, many who have made remarkable progress in terms of their value added grades and others who have succeeded despite personal challenges that impacted on them over the past two years .\" 10:30 am Yavneh College pupils with their GCSE results Yavneh College celebrate GCSE results! 10:13 am Kantor King Solomon High School celebrates \"fantastic set of GCSE results\" Kantor King Solomon has achieved over 87 percent of students gaining English and over 75 percent achieving Maths. According to the school, Jewish Studies continues to be a strength, with 82 percent of students achieving grades 4-9 and over 35 percent achieving grades 7-9 in GCSE Religious Studies. Head Hannele Reece said: \"I am so proud and delighted for the entire school, that we have maintained our amazing success at GCSE. The staff, students, parents, Governors and the entire community have committed to the success of our school .\" These results are testament to the focus, determination, skill and tenacity of our teaching staff and our students. It has been a difficult year for many of our year 11 students and I am tremendously proud of the whole year group. \"Kantor King Solomon continues to move from strength to strength, I am so proud of all our staff and students and all their hard work .\" 10:07 am \"Another great set of GCSE results at Yavneh College\" , head says 90 percent of GCSE students at Yavneh College achieved 5 + standard passes including English and maths. 44 percent of students achieved 9 to 7 grades, while another 79 percent were awarded 9 to 5 grades, with 26 percent of grades at 8 or 9 (A *). Executive Headteacher Spencer Lewis said: \"I am delighted to announce another fantastic set of GCSE results. Yavneh College pupils have worked very hard and should be really proud of what they have achieved again this year. Together with last week's exceptional A Level results that placed Yavneh College as the best performing non selective state school in the UK at A Level, this is a testament to the hard work and dedication of the pupils and of the incredible team of staff at our school .\" In addition to these excellent GCSE results, we are extremely proud of those pupils who have taken vocational courses in Business Studies, PE and Digital Media and who have done incredibly well. \"9:37 am\" Outstanding GCSE results achieved at Immanuel! \"Nearly half (49 percent) of all grades at Immanuel College were awarded at 9, 8 or A * with 29% being the highest grade possible (9 or A * equivalent). 70 percent of all grades were awarded at 9--7 or A *--A, with 97% at 9--4 or A *--C. Gideon Futerman, Raquel Menashe and Sarah Root achieved a clean sweep of grade 9 and A * results in all their subjects. Immanuel headmaster <mark>Gary Griffin</mark> said:\" We would like to offer our congratulations to all our Year 11 students on receiving such an excellent set of results--which continue to break College records! \"We are so proud of everyone's accomplishments, which are the culmination of hard work and dedication by students and teachers alike. We look forward to welcoming students back to embark on their A Level courses in September .\" 9:36 am Welcome to GCSE Results Day 2019! Welcome to the Jewish News' live feed for GCSE results 2019! Send us your results and pictures, your thoughts and comments about the day! Email us at: Editorial @ thejngroup.com! Good luck! read more: News live blog Facebook Twitter email Print 3 shares Spotlight Communicated Content Masa Israel: A year to make a difference By Deborah Cicurel Photographer Jonny Baker: An eye for fashion! By Francine Wolfisz Cask your eyes on this! The Whisky Event returns Whisky business! The art of inspiring vulnerable children By Jewish News Reporter Are you getting the Holocaust compensation you deserve? By Deborah Cicurel Lasting Power of Attorney Aviv Appeal By Brigit Grant Study in Israel, learn in English with Bar Ilan University By Deborah Cicurel Grab a slice of the ultimate living experience with Gindi TLV WIZO UK celebrates 100 years of changing lives and building futures An invitation to inspiration--It's the Big Event 2018! By Jewish News A small school with big dreams Enjoy Southern Africa with Mmilo Tours The perfect luxury getaway By Judy Elkus All hands to the pump! Whisky business! By Richard Cawthorne Cementing relationships! By Deborah Cicurel When life begins again By Judy Elkus Giving children a brighter tomorrow By Judy Elkus comments", "articleID": "2019082211_00247636_W", "names": {"Gary Griffin": ["Q16148752", "Q17305979", "Q5525176"]}}]