[{"date": "2019-08-22", "url": "http://thelancasterandmorecambecitizen.co.uk/sport/national/17854416.blades-boss-wilder-backs-morrison-premier-league-role/", "content": "Blades boss Wilder backs Morrison for Premier League role By Press Association 2019 Ravel Morrison 0 comment Ravel Morrison is ready to make his first Premier League appearance in five years, according to Sheffield United manager Chris Wilder. The former Manchester United trainee is back in the English top flight after signing a 12-month deal with the Blades this summer, following spells in Italy, Mexico and Sweden. Morrison has yet to appear for Wilder's team in the opening two matches this season, not even making the bench, but did play in a behind-closed-doors game against his former club United this week. The 26-year-old forward, who can also play in midfield, will hope to be involved against Leicester at Bramall Lane on Saturday but if he is not then he will likely make his debut against Blackburn in the Carabao Cup on August 27. \"He's ready. He's been in both squads without playing but we played a behind-closed-doors game against Manchester United in the week and he played 90 minutes in that,\" said Wilder. \"It was a great exercise for us against about £ 200million worth of talent. When we talked about playing a behind-closed-doors against Manchester United and then all of a sudden some unbelievably talented footballers came walking over towards our boys, it was a bit like\" wow, this is a proper game!' \"It was a good exercise for our boys against world-class players and we certainly appreciate the opportunity going over to Manchester United and them putting the game on for us .\" But Rav has a big part to play, he knows that. We talk about picking the side and it's a difficult selection process for myself and picking the subs as well. There's a lot of competition to even get on the bench and we need that. \"Wilder also revealed forward Callum Robinson will be fit for the weekend after coming off injured against Crystal Palace on Sunday. However, the news was not so good regarding midfielder <mark>John Fleck</mark>.\" We've a doubt about <mark>John Fleck</mark> but Callum has trained all week, \"he said .\" Those two both had to come off with injuries but we'll give <mark>John</mark> that time to recover. \"The Blades have made a solid start to life back in the Premier League, building on their opening-day draw at Bournemouth by defeating Palace 1-0. Ahead of Leicester's visit to Bramall Lane, Wilder insists his squad are not getting ahead of themselves .\" They won't get carried away, it's as simple as that, \"he said .\" They haven't done for three years so they certainly won't after two games in a different league. \"I've always kept my feet on the ground, I've never got ahead of myself. I think it's a dangerous game to do that whether you're a player, manager or a coach .\" At the moment I'm in the Premier League but I want to stay in here for a number of years and that's got to be our attitude. That's an attitude that's driven myself on personally and I look at our players and I see a lot of similarities in their approach as well. \"The drive from the staff and the message that comes across all the time is a consistent one so that's why I can confidently say that they'll never get ahead of themselves because it's not a trait that my team has .\" 0 comment", "articleID": "2019082212_00261851_W", "names": {"John Fleck": ["Q1333606", "Q572076"]}}, {"date": "2019-08-22", "url": "http://www.gazetteandherald.co.uk/sport/national/17854456.nkoudou-leaves-spurs-besiktas/", "content": "Nkoudou leaves Spurs for Besiktas By Press Association 2019 Georges-Kevin Nkoudou has left Spurs 0 comment Georges-Kevin Nkoudou has left Tottenham to join Turkish club Besiktas for an undisclosed fee. The 24-year-old has endured a difficult time at Spurs since joining from Marseille in 2016 and his exit has been a long time coming. He played just 27 matches and never made a Premier League start for Spurs, spending time on loan with Burnley and Monaco. We have reached agreement with Turkish Super Lig side @ Besiktas for the transfer of @ gknkoudou. All the best for the future, GK!?? #THFC ⚪ ️ #COYS pic.twitter.com/nc2ndgNofO--Tottenham Hotspur (@ SpursOfficial) August 22, 2019 He posted on Twitter: \"It's now time for me to leave this great club that is Tottenham .\" Even though our story wasn't the one I hoped for when I arrived here, I still feel like I learned a lot, as a player and as a man. \"I've always tried to give my all for this team and this club, and wish all my team-mates and the staff the very best for this season and the followings .\" Also a big thanks to the fans who had my back and supported me through the times. \"Dear Spurs fans, It's now time for me to leave this great club that is Tottenham. . pic.twitter.com/RD9Zl0AWF9--GK NKoudou (@ gknkoudou) August 22, 2019 Spurs spent £ 11million bringing him to the club three years ago, but it was a move that never worked out and they have spent the past three transfer windows trying to get him off the wage bill .\" We have reached agreement with Turkish Super Lig side Besiktas for the transfer of Georges-Kevin Nkoudou, \"Spurs said in a statement .\" We wish \"GK' all the best for the future .\" His move to Besiktas is not expected to be the only exit before the end of the European transfer window. Midfielder Victor Wanyama is reportedly close to joining Belgian side Club Brugge, having fallen down the pecking order at Spurs. Victor Wanyama could be on his way out of Spurs (John Walton/PA) While boss Mauricio Pochettino will sanction those two exits, he will be holding his breath over other members of his squad before the September 2 deadline. The likes of Christian Eriksen, Toby Alderweireld, Jan Vertonghen and <mark>Danny Rose</mark> could all attract interest before the end of the window, a situation Pochettino has said could cause \"many problems\" for his squad. 0 comment", "articleID": "2019082212_00284456_W", "names": {"Danny Rose": ["Q5220782", "Q5220783", "Q5220785", "Q83498"]}}, {"date": "2019-08-22", "url": "http://feeds.inquisitr.com/~r/google/yDYq/~3/G0EdPtwp0u0/", "content": "Rebecca Cukier The latest casting for Dancing with the Stars is all anyone can talk about. Supermodel legend Christie Brinkley is officially on-board as one of the upcoming season's faces, and it looks like she's been doing a little celebrating. The 65-year-old took to Instagram on Wednesday evening to mark joining the ABC series with a set of photos that sent the platform a reminder: this blonde might be a little more advanced in years, but she's still got it. Christie's snaps came straight from a red carpet moment backed by walls with the competition series' logo. Christie was photographed looking ready to bust some moves by virtue of her raised knee and stretched-out leg, but this update seemed to be more than just a reminder that Christie will be landing on screens in mid-September. The Sports Illustrated alum was flaunting her killer legs in a skimpy mini dress with polka dot motifs--suffice to say that this mother can pull off a floaty little number like the 20-somethings. The star's legs were looking sensational in a pair of strappy and glittery silver heels, with fans appearing to see as much muscle as they did style. A sense of humor is never amiss with Christie. Those paying attention to the model's caption will have picked up on her joking age reference. View this post on Instagram Hey Everybody! I just wanted to let you know I'm hoping to bust a move and not a hip on Dancing With The Stars!???????? Premieres September 16th on @ abctv at 8:00 7 Central Hope you will join me just for kicks on this latest fun adventure! @ dancingabc #DWTS my dress @ carolineconstas #greasethejoints A post shared by Christie Brinkley (@ christiebrinkley) on Aug 21, 2019 at 6:06 pm PDT Christie's update proved a hit, racking up over 9,500 likes. The same time frame brought over 456 fans into the post's comments section. Christie has already made a bit of a statement about her upcoming appearance, although once again, the epic sense of humor came out, in addition to an admission that she's a little unsure about joining the dance world. Speaking to ET Online, Christie aired her thoughts. View this post on Instagram These photos remind me of that old expression...\"is that a cucumber in your basket or are you just glad to see me?\" ???? #organic #garden #organicgardener???? A post shared by Christie Brinkley (@ christiebrinkley) on Aug 16, 2019 at 3:27 pm PDT \"I'm so excited! I think it's going to be so fun. I literally don't know how to dance. Seriously, it's true...I really don't have the moves. So I'm really excited to learn with the pros. It's a wonderful opportunity for me .\" Loading...\"I think whoever I get has his work cut out for him. I think they need to give me a really good one because I need a lot of work...All of the dancers on the show are incredible, really amazing,\" she added. View this post on Instagram I'm busy doing my part for #nationalproseccoday???????????? @ bellissimaprosecco #zerosugarprosecco @ bellasprizz #aperitivo #organicprosecco #veganprosecco #allnaturalprosecco A post shared by Christie Brinkley (@ christiebrinkley) on Aug 13, 2019 at 6:05 pm PDT Christie's Instagram following will likely shoot up because she is joining a mega-popular franchise. Christie's following right now isn't insignificant, though. The much-loved blonde has 522,000 followers. Her account is followed by celebrities including Kate Upton, <mark>Kate Hudson</mark>, plus The Real Housewives of <mark>Beverly Hills</mark> star Lisa Rinna, among others.", "articleID": "2019082216_00256399_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "Kate Hudson": ["Q169946", "Q6375550"]}}, {"date": "2019-08-23", "url": "http://www.voiceofalexandria.com/news/national_business_news/the-latest-tech-group-calls-for-end-to-us-china/article_b2b2858b-c59c-54d4-b022-fa9845a25a85.html", "content": "Facebook Twitter SMS Email FILE - In this June 29, 2019, file photo, President Donald Trump, left, meets with Chinese President Xi Jinping during a meeting on the sidelines of the G-20 summit in Osaka, Japan. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. <mark>Susan Walsh</mark> FILE - In this July 30, 2019, file photo, a traveller pulls a trolley past a U.S. embassy car outside a hotel in Shanghai. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. Ng <mark>Han Guan</mark> Shoppers browse goods for sale at a discount retailer in a shopping mall in Beijing, Friday, Aug. 2, 2019. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. Mark Schiefelbein FILE - In this May 9, 2019, file photo a General Electric washing machine with a label advertising it was made in America is displayed in retail stores in Cranberry Township, Pa.. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. Keith Srakocic FILE _ In this Aug. 6, 2019, file photo, a woman walks by a money exchange shop decorated with different countries currency banknotes at Central, a business district in Hong Kong. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. Kin Cheung Facebook Twitter SMS Email Print Save WASHINGTON (AP)--The Latest on the escalating trade war between the U.S. and China, the world's two largest economies (all times local): 6:55 p.m.. The Consumer Technology Association, a trade group that runs the annual Consumer Electronics Show, says \"enough is enough\" when it comes to escalating tariffs in the U.S. trade war with China. The CTA said in a statement Friday that President Donald Trump's tariffs are the worst economic mistake since the 1930 Smoot-Hawley Act raised tariffs just as the world was sliding into the Great Depression. The group says it is clear that tariffs are not moving the U.S. toward a deal with China, and that it is time to end the trade war and come to an agreement. The CTA represents more than 2,200 companies in the technology industry .---- 5:05 p.m. President Donald Trump says products coming from China that were slated to be hit with a 10% tariff on Sept. 1 will now face a 15% tariff. Trump also says goods and products currently being taxed at 25% will be taxed at 30% starting Oct. 1. Trump's comments come after China said it would pursue new tariffs of 5% and 10% on $75 billion of U.S. products. The tariffs would take place in two steps, just as the U.S. said it would do earlier this month in imposing 10% tariffs on $300 billion of Chinese goods. The rising tensions between the world's two biggest economies unnerved investors already on edge Friday. The Dow Jones Industrial Average dropped 623 points Friday as companies and business groups urged the two countries to get to the negotiating table .---- 3:45 p.m. Two trade associations representing auto companies say the escalating tariff fight between the Trump administration and China is bad for the industry. Neither the Alliance of Automobile Manufacturers nor the Association of Global automakers, however, addressed President Donald Trump's tweet about finding markets other than China. But the alliance says the tariffs are bad for consumers. It says the auto industry thrives with robust and competitive trading. Association of Global Automakers CEO John Bozella says tit-for-tat tariffs without meaningful negotiations put American jobs at risk. He says when China imposed tariffs last year, U.S. vehicle exports to the country were cut in half. The alliance represents most major automakers, while the global group speaks for manufacturers such as Honda, Toyota, Hyundai, Nissan and Subaru .------2:30 p.m.. The nation's largest retail trade group says that it would be unrealistic for U.S. retailers to exit China. The National Retail Federation made its comment in response to President Donald Trump's call Friday for U.S. businesses with operations in China to look for alternatives, as trade tensions between the world's two largest economies intensified. The NRF noted that its members have long been diversifying their supply chains but finding alternatives to China would be costly and take years. \"It is unrealistic for American retailers to move out of the world's second largest economy,\" said NRF Senior Vice President of Government Relations <mark>David French</mark>. He noted that retailers' presence in China allows them to reach Chinese customers and also develop overseas markets. \"This, in turn, allows us to grow and expand opportunities for American workers, businesses and consumers,\" <mark>French</mark> said in a prepared statement .------1:55 p.m. Small business owners are baffled by President Donald Trump's suggestion that all U.S. businesses with operations in China find an alternative. Trump lashed out at Beijing Friday after it announced retaliatory tariffs on $75 billion in U.S. products. Peter Horwitz, the owner of Tiger Packaging, a paper and plastic products supplier based in Boca Raton, Florida, says there are supplies that he can get only in China, like vinyl gloves. He says we're living in a global economy and it makes bad business sense to cut out the world's second largest economy in China .----------1:35 p.m.. The U.S. Chamber of Commerce is urging the Trump administration and Beijing to return to the negotiating table with trade tensions escalating rapidly. China on Friday said that it was putting into place tariffs on $75 billion in U.S. products in retaliation for the Trump administration's latest planned tariff hikes. President Donald Trump lashed out at China and on Twitter is urging U.S. companies to consider an alternative to doing business in China. The business group said, \"We do not want to see a further deterioration of US-China relations. We urge the administration and the government of China to return to the negotiating table to complete an agreement that addresses concerns over technology transfer practices, intellectual property enforcement, market access, and the globally damaging impact of Chinese domestic subsidies .\" ----------11:46 a.m. Stocks are falling sharply on Wall Street after President Donald Trump said he would respond to China's latest tariff increase and called on U.S. companies to consider alternatives to doing business in China. Trump on Friday also ordered UPS, Federal Express and Amazon to block any deliveries from China of the powerful opiod drug fentanyl. The Dow Jones Industrial Average sank more than 300 points after the president made the announcements on Twitter. The stocks of all three companies the president mentioned also dropped as traders tried to understand what the implications for them were. Stocks had been wavering between gains and losses earlier after China said it would retaliate against the latest round of tariffs imposed by Washington with duties on $75 billion of U.S. products .----------11:30 a. m President Donald Trump says he wants U.S. companies with operations in China to begin looking for alternatives in response to retaliatory tariffs from Beijing. Trump on Friday said that he will respond in hours to an announcement Friday that China was retaliating to U.S. tariffs with a slate of its own protective measures. Trump is also ordering Fed Ex, Amazon, UPS and the U.S Postal Service to begin searching for fentanyl in all packages from China. Early on Friday, China said it would put into place tariffs on $75 billion in U.S. products in retaliation for the Trump administration's latest planned tariff hikes .----------10:10 a.m. China is putting into place tariffs on $75 billion in U.S. products in retaliation for the Trump administration's latest planned tariff hikes. China said Friday that it will also increase import duties on U.S.-made autos and auto parts. The retaliation pulled global markets into negative territory Tariffs of 10% and 5% will take effect on two batches of goods on Sept. 1 and Dec. 15. Beijing gave no details of what goods would be affected but the timing matches Trump's planned hikes. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Facebook Twitter SMS Email Print Save Tags Business General News International Trade Economy Trade Barriers Trade Policy Economic Policy Government Business And Finance Government And Politics Government Policy Stock Prices Leading Economic Indicators Synthetic Opioids Synthetic Drugs Opioids Corporate Management Personnel Corporate News New Products And Services Products And Services Retail Industry Retail And Wholesale Consumer Services Consumer Products And Services Automobile Manufacturing Consumer Product Manufacturing Skin Care Personal Care Beauty And Fashion Lifestyle Consumer Electronics Industry Conferences And Trade Shows Consumer Electronics Show Trade Agreements International Agreements International Relations Technology Locations China Greater China East Asia Asia United States North America Beijing", "articleID": "2019082323_00123120_W", "names": {"David French": ["Q1174460", "Q29517525", "Q42292067", "Q5233858"], "Han Guan": ["Q45384234", "Q45522833", "Q45642591"], "Susan Walsh": ["Q23139575", "Q47927124", "Q55360631", "Q7648501", "Q7648503"]}}, {"date": "2019-08-24", "url": "https://jambands.com/news/2019/08/24/from-the-saturday-lockn-times-everythings-right/", "content": "From the Saturday \"LOCKN' Times': Everything's Right photo by Jay Blakesberg Trey Anastasio and Derek Trucks crossed paths onstage for the first time just over 20 years ago, when Trucks joined Phish at Charlotte, N.C.'s Blockbuster Pavilion for a pair of songs during the Vermont Quartet's encore. At that point in his singular career, Trucks was just a few weeks into his tenure with the Allman Brothers Band and about to open up his bluesy Derek Trucks Band to incorporate a range of Eastern, African and fusion-inspired sounds. Anastasio had also recently launched his first tour with the combo that would blossom into his longtime solo band, focusing on a similar mix of open-ended originals, loose covers and guitar-rock improvisational vehicles. Trucks sat in with Phish for their encore on two blues-rock songs from their catalog, including former guitarist Jeff Holdsworth's\" Possum \"and Son Seals'\" Funky Bitch. \"Anastasio's three bandmates had already shared the stage with Trucks during the previous two years. As time went on, both guitarists' projects evolved, with Anastasio expanding his outfit into the orchestra-size Trey Anastasio Band and Trucks partnering with his wife, Susan Tedeschi, to form the similarly soulful and horn-abetted Tedeschi Trucks Band. The musicians have shared the stage a few times over the past two decades--mostly with the Allman Brothers Band, though Trucks guested with TAB in 2002, and Anastasio returned the favor at New York's Beacon Theatre in 2017. But it wasn't until last night that the two musicians shared the stage for a full set (for which they spent multiple days rehearsing). Trucks blended in seamlessly with the Trey Anastasio Band from the start of their second set, using his trademark slide skills to color the group's layered arrangements and take a number of well-placed solos. Their joint performance opened with two relatively new Anastasio compositions that Phish has also embraced,\" Set Your Soul Free \"and\" Everything's Right, \"and then shifted to three Phish originals Anastasio has added to TAB's canon since rebooting the group last year after a short break:\" Camel Walk, \"\"Ghost\" and \"Blaze On .\" Both \"Camel Walk\" and \"Ghost\" served as perfect vehicles for Trucks, who accented the former song's bluesy roots and added a new, spooky feeling to the latter Story of the Ghost gem. (Interestingly, Trucks has now joined Anastasio for both of Holdsworth's lasting contributions to the Phish repertoire .) As he continued to find his way around TAB's full sound, Trucks shined on the meditative \"Dark and Down\" and the Phish-adopted groove-vehicle \"Sand .\" Though she was not originally billed as part of today's lineup, Susan Tedeschi emerged as the song came to a close to sing on a tender moment from Anastasio's Ghosts of the Forest project, \"A Life Beyond the Dream,\" and another tune that hugs the Phish and TAB worlds, \"Rise Up/Come Together .\" Finally, Anastasio, Trucks and the members of TAB closed the main portion of their show with the high-energy rave-up \"Push On\" Til the Day. \"Another element Anastasio has added to his TAB shows with more frequency since touring as a solo act in recent years is an unplugged encore segment. Last night, the guitarists returned for acoustic duets with Trucks on the Ghosts of the Forest number\" Brief Time \"and a newer Phish song that has recently grown into a dependable rocker,\" More. \"Most of TAB then returned for another Phish favorite,\" 46 Days, \"and Anastasio's horns slid back onstage for the classic show-closing celebration\" First Tube. \"The day's main-stage musical offerings kicked off over 12 hours earlier with Rockin' to Lockn' winner, Washington, DC's Surprise Attack, who offered a high-energy set of their trademark\" Mountain funk. \"(Elsewhere onsite, it has already been an eventful day: <mark>Joe Russo</mark> emerged during recent recording partners Circles Around the Sun's late-night show in Garcia's Forest around 2:45 am, and about eight hours later the Doobie Decibel Duo held court on the Pianos on the Porch nook .) Soon after, the New York--based <mark>Greg Humphreys</mark> Electric Trio, whose namesake has deep ties to the improvisational world through his previous projects Dillon Fence and Hobex, provided the day's first interlocking set when they kicked off their performance while circling toward the audience on the venue's rotating stage. Lockn' has built its reputation on its unique collaborative performances and, after the trio's set, Moonalice offered the first of several special\" Lockn' moments, \"welcoming the sweet-voiced T Sisters and legendary soul singer Lester Chambers and his son Dylan at various points during their performance. The T Sisters shined on a swirl of the Grateful Dead's\" Uncle John's Band, \"\"Bird Song\" and \"Attics of My Life,\" while Lester and Dylan helped Moonalice and the singers close their set with two songs long associated with The Chamber Brothers, \"People Get Ready\" and \"Time Has Come Today .\" Unfortunately, after the ensemble's set, the concert field was cleared temporally as the second storm of the weekend passed through the area. Music resumed after a short delay, although a few acts ended up playing slightly truncated sets to help put things back on schedule. Melvin Seal & JGB and their current featured guitarist, Furthur's John Kadlecik, welcomed fans back with a set comprised mostly of classics from the Jerry Garcia Band songbook, kicking off with staples like \"Cats Under the Stars,\" \"Run for the Roses\" and an appropriate \"Mission in the Rain .\" Their set came to a close with a Garcia-Robert Hunter tune from outside the traditional JGB well, \"Eyes of the World,\" before turning over the stage to the recently reunited Edie Brickell & New Bohemians. <mark>Bob Weir</mark> and Edie Brickell photo by Dean Budnick Brickell has a long history with the Dead world, having collaborated with Garcia and opened for the Dead, but it's been a while since she has been on the jam circuit. Yet, at the end of their performance, Brickell & New Bohemians brought out <mark>Bob Weir</mark> for a choice take on \"Deep Elem Blues,\" marking his first appearance with the group. (Earlier this month, <mark>Weir</mark> sat in with Brickell's husband, <mark>Paul Simon</mark>, at San Francisco's Outside Lands and TAB percussionist Cyro Baptista has been part of his band. Though he did not perform, <mark>Simon</mark> was on hand for his wife's performance .) Form there, the rest of the evening's focus shifted to some of the leading lights of the modern jamband and roots scenes, beginning with funky Mid-Atlantic favorites Pigeons Playing Ping Pong. The quartet, who were energized by their enthusiastic crowd, ran through \"High As Five,\" \"Porcupine\" and a segue from \"Somethin’ For Ya\" into \"Julia,\" before bringing out their previously announced guest, Vulfpeck associate Cory Wong, for \"Lightning .\" Soon after, The Revivalists horn section joined the members of Pigeons Playing Ping Pong for a run from \"FU\" into Prince's \"1999,\" before returning to \"FU,\" before PPPP closed their show by themselves with \"The Liquid .\" The group also took the opportunity to announce two big December gigs: a stop at Washington, DC's The Anthem and their first area date, New Year's Eve at Asheville, N.C.'s ExploreAsheville.com Arena. Several members of the day's next entertainers, Old Crow Medicine Show, used to live in nearby Charlottesville, Va., and the musicians opened things up appropriately with \"Carry Me Back to Virginia .\" The early part of their show was filled with theatrics and sing-alongs like their signature tune \"Wagon Wheel,\" but things peaked when they brought out <mark>Weir</mark> for acoustic-guitar driven takes on \"Mexicali Blues,\" \"Cumberland Blues\" and \"Will the Circle Be Unbroken?\" Old Crow founder Ketch Secor described the surprise sit in as a \"dream\" from the stage. The main stage's penultimate act, The Revivalists, kept the evening's energy up, spicing their set with a cover of The Who's \"Eminence Front\" and their own crossover hit, \"Wish I Knew You .\" In recent years, The Revivalists have grown to embody the festival spirit with their mix of string, brass and improv-schooled energy, and frontman <mark>David Shaw</mark> took advantage of the band's surroundings, moving to the lip of the large Lockn' stage to address his audience several times. Before welcoming Trucks for his second set, Anastasio and his seven-person backing band ran through a mix of classic TAB songs during what he jokingly described as the \"shortest set ever .\" The octet kicked things off with \"Cayman Review,\" one of the standout tunes from Anastasio's 2002 solo release, and charged through rhythmic, Afro-beat influenced originals \"Mozambique\" and \"Alive Again,\" as well as \"Valentine,\" \"Night Speaks to a Woman,\" \"Simple Twist Up Dave\" and the 70 Volt Parade-era single \"Tuesday .\" After the final note of \"First Tube\" drifted into the ether, much of the crowd moved to Garcia's Forrest, where Galactic had set up shop. Meanwhile, Anastasio, Tedeschi and Trucks were preparing for the second part of their two-set, two-day collaboration.", "articleID": "2019082417_00103722_W", "names": {"Bob Weir": ["Q3938462", "Q888316"], "David Shaw": ["Q3018779", "Q42297525", "Q5239683", "Q5239685", "Q5239686", "Q5239687", "Q5239688", "Q5239690", "Q5239692"], "Greg Humphreys": ["Q22115382", "Q38338350", "Q41695902"]}}]