[{"date": "2019-08-24", "url": "https://jambands.com/news/2019/08/24/from-the-saturday-lockn-times-everythings-right/", "content": "From the Saturday \"LOCKN' Times': Everything's Right photo by Jay Blakesberg Trey Anastasio and Derek Trucks crossed paths onstage for the first time just over 20 years ago, when Trucks joined Phish at Charlotte, N.C.'s Blockbuster Pavilion for a pair of songs during the Vermont Quartet's encore. At that point in his singular career, Trucks was just a few weeks into his tenure with the Allman Brothers Band and about to open up his bluesy Derek Trucks Band to incorporate a range of Eastern, African and fusion-inspired sounds. Anastasio had also recently launched his first tour with the combo that would blossom into his longtime solo band, focusing on a similar mix of open-ended originals, loose covers and guitar-rock improvisational vehicles. Trucks sat in with Phish for their encore on two blues-rock songs from their catalog, including former guitarist Jeff Holdsworth's\" Possum \"and Son Seals'\" Funky Bitch. \"Anastasio's three bandmates had already shared the stage with Trucks during the previous two years. As time went on, both guitarists' projects evolved, with Anastasio expanding his outfit into the orchestra-size Trey Anastasio Band and Trucks partnering with his wife, Susan Tedeschi, to form the similarly soulful and horn-abetted Tedeschi Trucks Band. The musicians have shared the stage a few times over the past two decades--mostly with the Allman Brothers Band, though Trucks guested with TAB in 2002, and Anastasio returned the favor at New York's Beacon Theatre in 2017. But it wasn't until last night that the two musicians shared the stage for a full set (for which they spent multiple days rehearsing). Trucks blended in seamlessly with the Trey Anastasio Band from the start of their second set, using his trademark slide skills to color the group's layered arrangements and take a number of well-placed solos. Their joint performance opened with two relatively new Anastasio compositions that Phish has also embraced,\" Set Your Soul Free \"and\" Everything's Right, \"and then shifted to three Phish originals Anastasio has added to TAB's canon since rebooting the group last year after a short break:\" Camel Walk, \"\"Ghost\" and \"Blaze On .\" Both \"Camel Walk\" and \"Ghost\" served as perfect vehicles for Trucks, who accented the former song's bluesy roots and added a new, spooky feeling to the latter Story of the Ghost gem. (Interestingly, Trucks has now joined Anastasio for both of Holdsworth's lasting contributions to the Phish repertoire .) As he continued to find his way around TAB's full sound, Trucks shined on the meditative \"Dark and Down\" and the Phish-adopted groove-vehicle \"Sand .\" Though she was not originally billed as part of today's lineup, Susan Tedeschi emerged as the song came to a close to sing on a tender moment from Anastasio's Ghosts of the Forest project, \"A Life Beyond the Dream,\" and another tune that hugs the Phish and TAB worlds, \"Rise Up/Come Together .\" Finally, Anastasio, Trucks and the members of TAB closed the main portion of their show with the high-energy rave-up \"Push On\" Til the Day. \"Another element Anastasio has added to his TAB shows with more frequency since touring as a solo act in recent years is an unplugged encore segment. Last night, the guitarists returned for acoustic duets with Trucks on the Ghosts of the Forest number\" Brief Time \"and a newer Phish song that has recently grown into a dependable rocker,\" More. \"Most of TAB then returned for another Phish favorite,\" 46 Days, \"and Anastasio's horns slid back onstage for the classic show-closing celebration\" First Tube. \"The day's main-stage musical offerings kicked off over 12 hours earlier with Rockin' to Lockn' winner, Washington, DC's Surprise Attack, who offered a high-energy set of their trademark\" Mountain funk. \"(Elsewhere onsite, it has already been an eventful day: <mark>Joe Russo</mark> emerged during recent recording partners Circles Around the Sun's late-night show in Garcia's Forest around 2:45 am, and about eight hours later the Doobie Decibel Duo held court on the Pianos on the Porch nook .) Soon after, the New York--based <mark>Greg Humphreys</mark> Electric Trio, whose namesake has deep ties to the improvisational world through his previous projects Dillon Fence and Hobex, provided the day's first interlocking set when they kicked off their performance while circling toward the audience on the venue's rotating stage. Lockn' has built its reputation on its unique collaborative performances and, after the trio's set, Moonalice offered the first of several special\" Lockn' moments, \"welcoming the sweet-voiced T Sisters and legendary soul singer Lester Chambers and his son Dylan at various points during their performance. The T Sisters shined on a swirl of the Grateful Dead's\" Uncle John's Band, \"\"Bird Song\" and \"Attics of My Life,\" while Lester and Dylan helped Moonalice and the singers close their set with two songs long associated with The Chamber Brothers, \"People Get Ready\" and \"Time Has Come Today .\" Unfortunately, after the ensemble's set, the concert field was cleared temporally as the second storm of the weekend passed through the area. Music resumed after a short delay, although a few acts ended up playing slightly truncated sets to help put things back on schedule. Melvin Seal & JGB and their current featured guitarist, Furthur's John Kadlecik, welcomed fans back with a set comprised mostly of classics from the Jerry Garcia Band songbook, kicking off with staples like \"Cats Under the Stars,\" \"Run for the Roses\" and an appropriate \"Mission in the Rain .\" Their set came to a close with a Garcia-Robert Hunter tune from outside the traditional JGB well, \"Eyes of the World,\" before turning over the stage to the recently reunited Edie Brickell & New Bohemians. <mark>Bob Weir</mark> and Edie Brickell photo by Dean Budnick Brickell has a long history with the Dead world, having collaborated with Garcia and opened for the Dead, but it's been a while since she has been on the jam circuit. Yet, at the end of their performance, Brickell & New Bohemians brought out <mark>Bob Weir</mark> for a choice take on \"Deep Elem Blues,\" marking his first appearance with the group. (Earlier this month, <mark>Weir</mark> sat in with Brickell's husband, <mark>Paul Simon</mark>, at San Francisco's Outside Lands and TAB percussionist Cyro Baptista has been part of his band. Though he did not perform, <mark>Simon</mark> was on hand for his wife's performance .) Form there, the rest of the evening's focus shifted to some of the leading lights of the modern jamband and roots scenes, beginning with funky Mid-Atlantic favorites Pigeons Playing Ping Pong. The quartet, who were energized by their enthusiastic crowd, ran through \"High As Five,\" \"Porcupine\" and a segue from \"Somethin’ For Ya\" into \"Julia,\" before bringing out their previously announced guest, Vulfpeck associate Cory Wong, for \"Lightning .\" Soon after, The Revivalists horn section joined the members of Pigeons Playing Ping Pong for a run from \"FU\" into Prince's \"1999,\" before returning to \"FU,\" before PPPP closed their show by themselves with \"The Liquid .\" The group also took the opportunity to announce two big December gigs: a stop at Washington, DC's The Anthem and their first area date, New Year's Eve at Asheville, N.C.'s ExploreAsheville.com Arena. Several members of the day's next entertainers, Old Crow Medicine Show, used to live in nearby Charlottesville, Va., and the musicians opened things up appropriately with \"Carry Me Back to Virginia .\" The early part of their show was filled with theatrics and sing-alongs like their signature tune \"Wagon Wheel,\" but things peaked when they brought out <mark>Weir</mark> for acoustic-guitar driven takes on \"Mexicali Blues,\" \"Cumberland Blues\" and \"Will the Circle Be Unbroken?\" Old Crow founder Ketch Secor described the surprise sit in as a \"dream\" from the stage. The main stage's penultimate act, The Revivalists, kept the evening's energy up, spicing their set with a cover of The Who's \"Eminence Front\" and their own crossover hit, \"Wish I Knew You .\" In recent years, The Revivalists have grown to embody the festival spirit with their mix of string, brass and improv-schooled energy, and frontman <mark>David Shaw</mark> took advantage of the band's surroundings, moving to the lip of the large Lockn' stage to address his audience several times. Before welcoming Trucks for his second set, Anastasio and his seven-person backing band ran through a mix of classic TAB songs during what he jokingly described as the \"shortest set ever .\" The octet kicked things off with \"Cayman Review,\" one of the standout tunes from Anastasio's 2002 solo release, and charged through rhythmic, Afro-beat influenced originals \"Mozambique\" and \"Alive Again,\" as well as \"Valentine,\" \"Night Speaks to a Woman,\" \"Simple Twist Up Dave\" and the 70 Volt Parade-era single \"Tuesday .\" After the final note of \"First Tube\" drifted into the ether, much of the crowd moved to Garcia's Forrest, where Galactic had set up shop. Meanwhile, Anastasio, Tedeschi and Trucks were preparing for the second part of their two-set, two-day collaboration.", "articleID": "2019082417_00103722_W", "names": {"Joe Russo": ["Q1691583", "Q20675767", "Q24734137"], "Paul Simon": ["Q27908296", "Q4028", "Q7153617"]}}, {"date": "2019-08-25", "url": "http://www.gamereactor.eu/?system=ps4&sid=706662a1fc6716df908954a4dc5e0d58", "content": "PS4 Grab your thermals and a hot beverage as the World of Monster Hunter is about to get much cooler. Review Obsidian Entertainment has now reached 200 employees Written by Jonas Mäki on the 24th of August 2019 at 13:44 The team is working on The Outer Worlds, and is still expanding, searching for more job roles moving forwards. 0 Katsuki Bakugo and Majin Buu land in Jump Force next week Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 15:46 Character Pack 2 will usher in two fresh characters, and a new trailer shows off the Valley of the End stage as well. 0 Dragon Quest Builders director leaves Square Enix Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 15:11 Kazuya Niinou is moving on from the company, and says he \"wanted to try out a development cycle different from Square Enix\". 0 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 14:40 Missiles, dash velocity, and more are in the firing line, addressing plenty of complaints from the community. 0 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 14:09 We get another insight into CD Projekt Red's RPG ahead of the gameplay stream happening next week. 0 Battlefield V no longer getting 5v5 competitive mode Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 13:52 This has been scrapped in order to focus on other areas, although DICE still wants a \"competitive gaming experience\". 0 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:50 These are coming in December, although the September update is focused on getting newcomers on board. 0 Brenda Romero on board game design influencing Empire of Sin Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:14 The team even held a sort of \"pseudo-D & D session\" when coming up with the ideas for a game in 1920s Chicago. 0 Black Desert Online's PS4 launch trailer features Megan Fox Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 11:10 There are several editions of the game to choose from, and a Partner Program available for content creators as well. 0 Empire of Sin's goal is \"to put you in the shoes of a 1920s boss\" Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 10:17 Brenda Romero breaks down all of the moving parts within Empire of Sin during our interview at Gamescom this year. 0 New Nioh 2 images show us our \"half-breed\" hero Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 09:40 We're half human and half Yokai in this game, and we'll get another look at the sequel next month during the Tokyo Game Show. 0 Celeste and Inside free with Epic Games Store next week Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 09:14 The two acclaimed titles are free at the same time, following on from Fez which is available now. 0 Oninaki releases with a shiny new launch trailer Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 08:44 Tokyo RPG Factory and Square Enix's game is here for PC, PS4, and Switch, and there's also a demo too. 0 Control's soundtrack features Poets of the Fall Written by Lisa Dahlgren on the 22nd of August 2019 at 17:24 The long friendship between Finnish band Poets of the Fall and game developer Remedy Entertainment is still flourishing as the band joins the soundtrack of Control. 0 Kingdom Under Fire 2 lands in November Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 15:43 A new trailer reveals the release date and gives a look at what we can expect as we head into winter.", "articleID": "2019082518_00070016_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-08-26", "url": "http://www.gamereactor.eu/gamescom-2019/?sid=05221e7d75a1e7a2fa56b890f4803707", "content": "Metal Guts sees you platform in the body of an android Written by <mark>Sam Bishop</mark> on the 24th of August 2019 at 10:13 Toco's founder Luc Le Dauphin joined us for a chat to explain the concept at Gamescom in Cologne. 0 Zero Damage is an action game with \"a message of peace\" Written by <mark>Sam Bishop</mark> on the 24th of August 2019 at 08:41 Producer and game director Daniel Camelo spoke to us at Gamescom about the action game with a twist. 0 Age of Empires 4 gameplay will debut at X019 in November Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 13:15 The first day of the Inside Xbox show in London will lift the lid on the long-awaited strategy sequel. 0 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:50 These are coming in December, although the September update is focused on getting newcomers on board. 0 Here is our last Gamescom update of 2019 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:48 The Cologne show has wrapped up for us, and we've had a lot of fun experiences at the event. 0 Brenda Romero on board game design influencing Empire of Sin Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:14 The team even held a sort of \"pseudo-D & D session\" when coming up with the ideas for a game in 1920s Chicago. 0 Empire of Sin's goal is \"to put you in the shoes of a 1920s boss\" Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 10:17 Brenda Romero breaks down all of the moving parts within Empire of Sin during our interview at Gamescom this year. 0 Multiplayer in Cyberpunk 2077: \"If it doesn't fit, it doesn't fit\" Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 15:27 CD Projekt Red isn't committing to multiplayer in the RPG yet, and that's because it's still in \"R & D phase\". 0 We have Battletoads gameplay to share from Gamescom Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 14:36 The Battletoads are back, and we got to spend some quality time with them in Cologne this week. 0 Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 13:30 Xbox Live UK's senior EMEA category manager talked to us about Game Pass during Gamescom in Cologne. 0 Catch our own gameplay from The Witcher 3 on Switch Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 12:10 The Switcher is arriving this October, and we got to try our Geralt's new adventure in uncharted territory. 0 Star Renegades \"mashes together a lot of genres\" Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 11:44 Massive Damage lead designer Garry Seto talked to us at Gamescom about the ideas bringing Star Renegades together. 0 Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 11:15 Master cold weather in a variety of customisable vehicles and large sandbox maps packed with hazards. 0 Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 10:50 The team at Black Shamrock also shed some light on the RPG during a Gamescom developer diary. 0 This year's Grid \"is the Grid you know and love\" Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 10:17 We spoke to game director <mark>Chris Smith</mark> at Gamescom, and have some new gameplay of our own to share as well.", "articleID": "2019082601_00016363_W", "names": {"Chris Smith": ["Q11963798", "Q16235029", "Q1626495", "Q18158024", "Q18210302", "Q18631755", "Q18641613", "Q21066572", "Q22954127", "Q27861882", "Q27957276", "Q2964864", "Q30907275", "Q333264", "Q39089696", "Q41247400", "Q43137589", "Q47117548", "Q5108087", "Q5108088", "Q5108090", "Q5108094", "Q5108095", "Q5108096", "Q5108097", "Q5108098", "Q5108099", "Q5108100", "Q5108101", "Q5108102", "Q5108103", "Q5108104", "Q5108105", "Q5108106", "Q56134418", "Q56254566", "Q57684371", "Q981167"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-08-29", "url": "http://www.wibc.com/blogs/tony-katz/pence-not-enough-win-next-election-we-have-win-next-generation", "content": "Tony Katz Blog> Tony Katz> Pence: Not Enough to Win Next Election, We Have to Win The Next Generation Pence: Not Enough to Win Next Election, We Have to Win The Next Generation Pence: \"Openly advocating Socialism in the United States is something I never thought I'd live to see .\" <mark>Brian Baker</mark> Aug. 29, 2019 Share Facebook Twitter LinkedIn Copy Link (Photo Credit: WIBC) Defending the American dream and preserving our system of government for future generations is a top priority for Vice President Mike Pence heading into the 2020 election. While visiting Indianapolis this week to deliver an address at the American Legion Convention, the Vice President offered his thoughts to WIBC host Tony Katz on recent polling that revealed an increase in the number of young Americans who support Socialism. \"Ronald Reagan very famously said that freedom is never more than one generation away from extinction [and] it is the duty of every American generation to preserve freedom,\" said Pence. \"And that's why I've said many times all across the country that it's not going to be enough for us to win the next the election, we have to win the next generation .\" Pence expressed his concern with the number of Democrat representatives in Washington who are openly advocating for an economic system that has impoverished millions of people and robbed them of their liberties. \"Openly advocating Socialism in the United States is something I never thought I'd live to see,\" said Pence. \"And it gives you an idea of how incredibly far left the modern Democratic Party has gone .\" Vice President Pence added, however, that the results of the historic 2016 election demonstrate that the majority of Americans are resolute in their desire to preserve our system of government as the founders intended. \"I really believe that President Trump's message of a strong military, of a free market economy, of conservative jurist prudence on our courts, still connects with the majority of the American people,\" said Pence. \"And our challenge is to continue to carry that out, go win this election, and deliver the results that we've got happening all over this country .\" Vice President Pence also responded to an excerpt that was published in the Wall Street Journal from former Defense Secretary Jim Mattis' book, \"Call Sign Chaos,\" which criticizes the Trump administration's approach to foreign policy, and warns against the risk of alienating our allies. Pence responded that \"America First' does not mean\" America Alone,' but it does mean that America's best interests are our top priority, adding that leaders around the world respect and appreciate renewed American leadership on the world stage. \"We had eight years of a President who apologized for America,\" said Pence. \"Now we have a President who never apologizes for America .\" He continued: \"[World leaders] appreciate and respect an American President who puts the interests of our country first, but they also respect that [Trump] recognizes that they're going to put the best interests of their country first as well .\" Asked to offer assurances to American farmers who are caught in the middle of the Trump administration's contentious trade negotiations with China, the Vice President said the best thing for Hoosier farmers and manufacturers is have congress pass the USMCA - the United States Mexico Canada Agreement. \"It is going to be a huge improvement on NAFTA,\" said Pence. \"More than 70,000 U.S. manufacturing facilities have closed since Bill Clinton signed NAFTA into law in 1995, and tens of thousands of those jobs went South of the border into Mexico .\" The Vice President urged Americans to call their Democrat representatives in congress and urge them to have Nancy Pelosi bring the USMCA to the House floor for a vote. \"It will strengthen the President's hands in our negotiations with the E.U., with the U.K. after Brexit, and with China by showing that in North America, we can modernize this agreement in a way that puts American jobs and American workers first,\" said Pence. The Vice President added that once the USMCA is successfully passed, it would result in the creation of up to 175,000 new jobs in the early phases of the agreement, according to analysts. Hoosier farmers and manufacturers are poised to reap significant benefits from the USMCA being signed into law, according to Pence. \"When you look at the percentage of agricultural products and manufacturing products in Indiana that go either to Mexico or to Canada, it will be an overwhelming percentage of our exports in this state,\" said Pence. Check out Tony Katz's full, unedited interview with Vice President Mike Pence by clicking on the link below. Tony Katz Aug. 29, 2019 The Tao of Dave Chappelle (Michael Kovac/Getty Images) If you have been following the reviews of Dave Chapelle's new Netflix stand-up...Share Facebook Twitter LinkedIn Copy Close Tony Katz Aug. 28, 2019 Rep. Omar Using Campaign Funds For A Booty Call? (<mark>Alex Wong</mark> / Staff / Getty Images) An independent government watchdog claims Democratic Rep. Ilhan Omar's campaign...Share Facebook Twitter LinkedIn Copy Close Advertisement Load more Advertisement WIBC TV TRENDING ON 93.1 WIBC 1 Godfather Actor Gianni Russo Makes Outrageous Claims About Marilyn Monroe, Killing a Pedophile 5,665 Views 2 Three Snakes Found on Man's Property in Jackson County 2,747 Views 3 Brother, Sister Killed in East Side Shooting; IMPD Searching for Suspect 2,559 Views 4 Man Found Stabbed in Semi on I-70 Dies, Other Man in Semi Charged with Murder 2,411 Views 5 Man Missing for Nearly a Decade Found Behind Wall of Supermarket 1,990 Views Event Calendar Sep 22 2019 Colts Bud Light Tailgate, Colts vs. Falcons 10:00 am @ Georgia Street Upcoming Sep 29 2019 Colts Bud Light Tailgate, Colts vs. Raiders Oct 20 2019 Colts Bud Light Tailgate, Colts vs. Texans Oct 27 2019 Colts Bud Light Tailgate, Colts vs. Broncos Nov 10 2019 Colts Bud Light Tailgate, Colts vs. Dolphins View All Calendars Contests View All Win a Ticket Prize Pack to the Big Machine Vodka 400 at the Brickyard! Win a 4-pack of tickets to see Ball State vs. Indiana @ Lucas Oil Stadium [QUIZ] Enter to win Big Machine Vodka's Brickyard 400 Race Tickets", "articleID": "2019082916_00084944_W", "names": {"Alex Wong": ["Q4718004", "Q50093976"], "Brian Baker": ["Q4963025", "Q4963026", "Q4963027", "Q4963029", "Q53329", "Q911812"]}}, {"date": "2019-09-02", "url": "https://thelincolnite.co.uk/2019/09/punish-a-muslim-letter-lincoln-white-supremacist-faces-jail/", "content": "Court Joseph Verney 5:16 pm Photo: Rowaida Abdelaziz/Twitter The man from Lincoln behind the \"Punish a Muslim Day\" campaign, who sent over 300 malicious letters to public figures including the Queen, admitted a string of offences in court on Monday. As previously reported, <mark>David</mark> Parnham, 36, of St Andrews Close in Lincoln was arrested by Counter Terrorism Policing North East, supported by Lincolnshire Police in June 2018. At a court hearing at The Old Bailey on Monday, September 2, Parnham, who previously worked at the City of Lincoln Council in a junior administrative role, admitted 15 offences. This included soliciting murder, encouraging crime, bomb and noxious substance hoaxes and sending letters with intent to cause distress. The offences relate to hundreds of letters penned between June 2016 and June 2018. At Monday's hearing a psychiatrist revealed that the defendant did not regret what he had done and did not consider it \"particularly serious\". The court also heard further details about the case ahead of Parnham's sentencing on Tuesday, September 3 including: Parnham had launched waves of malicious letters targeting mosques, politicians and the Queen for more than a decade. He sent letters to mosques and Islamic centres around Britain in February 2007 Parnham sent fake position to the Queen with a letter saying \"The Clowns R Coming 4 You\". The hoax letter to the queen triggered a Chemical Biological Radiological Nuclear (CBRN) response, but Parnham claimed he did not recall writing to the Queen He sent similar notes to the then Prime Minister Theresa May and two bishops, as well as the Home Office, in October 2016. This also contained white power and made an apparent reference to reports of attacks by people dressed as clowns Parnham also sent \"Punish a Muslim Day\" hate mail urging people to earn points by attacking and killing muslims Letters full of white powder were also sent addressed to former PM <mark>David Cameron</mark> and the Tory peer Lord Ahmed of Wimbledon, as well as a number of mosques. The letter to <mark>Cameron</mark> contained the phrase \"Allah is great\". Letters to MPS and mosques included the phrase \"Paki Filth\" Seven letters were intercepted at Sheffield mail centre in July 2016. They were found to contain harmless white powered. A further 11 letters were found to have been delivered In December 2016 he sent a fan letter to Dylann Roof, a white supremacist terrorist who murdered nine people at a church in Charleston, South Carolina In March 2017 letters were sent to addresses around the University of Sheffield campus calling for the extermination of minority racial and religious groups A letter to Berkeley Street mosque in Hull contained a drawing of a sword with a swastika on it cutting someone's head off with the words \"You are going to be slaughtered very soon\". The author signed off as \"Muslim Slayer\" In March 2018 Parnham sent over 300 letters to mosques and public figures calling for attacks in the street Read more The Lincolnite welcomes your views. All comments are reactively-moderated and must obey the house rules. Please stay on topic and be respectful of other readers. Twitter LinkedIn Share by email Send", "articleID": "2019090216_00143420_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}}, {"date": "2019-09-02", "url": "https://www.thedenverchannel.com/sports/broncos/broncos-add-seven-new-players-begin-preparation-for-raiders", "content": "Broncos add seven new players, begin preparation for Raiders Raiders week arrives with Broncos making moves Posted: 5:50 PM, Sep 02, 2019 Updated: 2019-09-02 19:50:28 -04 By: Troy Renck ENGLEWOOD--The churn raised eyebrows. The Broncos remade the bottom of their roster with seven new players, or 13 percent of their 53-man squad. So it was a on surface-of-the-sun practice Monday--the 100 degrees marked the hottest September Colorado day ever--coach Vic Fangio began assimilating quarterback <mark>Brandon Allen</mark>, punt returner Diontae Spencer, linebacker Corey Nelson, tight end <mark>Andrew Beck</mark>, cornerbacks Duke Dawson and Devontae Harris and offensive lineman Corey Levin. \"It's actually easier to come in and learn in a game week than it is in training camp because things are paired down and dialed in more,\" said Fangio, whose team lacked quality depth throughout the preseason. \"We're not the only team that's had this roster gymnastics. It happens every year. (General manager) John (Elway) and his guys were keeping track of everyone around the league. We just felt that with each and every move it would make us better .\" In one week, the Broncos face the Oakland Raiders. It's hard to overstate the importance of starting well in the division. Anything less than 3-3 in the AFC West spells trouble. And the Broncos have dropped three straight games in Oakland, outscored 78-48. Time to microwave the development of the new guys because all contributors are needed and necessary. \"It's going to get poppin'. We have to go out there and execute,\" Pro Bowl running back Phillip Lindsay said. \"One, you can't make mistakes. Crowd noise, you have to stay tuned in. You have to make big plays, you have to hold onto the football and your defense has to create some turnovers .\" Eyes shifted to the quarterback drills because the position demands attention. <mark>Allen</mark>, wearing No. 2, is the new backup, someone who played against the Broncos in Los Angeles last month. He is not established, but was considered an upgrade over <mark>Kevin Hogan</mark>, who finished with four interceptions in the exhibition games. For <mark>Allen</mark>, the past 24 hours became a whirlwind as he was cut, claimed and cuddled up with a new playbook. \"A lot of the concepts are similar as far as terminology wise,\" said <mark>Allen</mark>, who called himself \"a good luck charm\" for quarterbacks because in his previous two stops in Jacksonville and Los Angeles the starters stayed healthy. \"A lot goes into getting ready, especially in the huddle. You want to be familiar with what you are saying. There will be a lot of extra preparation for me, but I am not new to that so I should be fine .\" So why <mark>Allen</mark>? Fangio explained the reasoning. \"He's a good athlete. Throws a good ball. We like the way he runs an offense,\" Fangio said. One player walks from parking lot to the top of the depth chart. The plan is for Spencer, pictured above, to handle punts on Monday. Fangio cited Spencer's experience and his quickness. Spencer was claimed off waivers from the Steelers after posting a 14.7 average with a long of 38 yards this summer. Spencer returned a staggering 191 punts for a 11.3 average in the past four seasons for Ottawa and Toronto. He handled nine straight in practice during media viewing with no issues. Spencer remains motivated by the murder of his father in Louisiana during his college career at McNeese State, adopting his dad's motto \"Can't Stop, Won't Stop .\" \"It's still pushes me. It always will,\" Spencer told me, before articulating what makes a good punt returner. \"The key is trusting yourself, trusting the guys that are out there blocking for you. And you have to be consistent. That's the biggest thing, putting the offense in good field position, and if you can score, it's a bonus .\" FOOTNOTES The Broncos rounded out their practice squad, adding lineman Jake Rodgers and former CSU star linebacker Josh Watson ....Linebacker Corey Nelson returns to Denver with a new number (56), and a plan to contribute right away. He told me he should be ready to go on special teams and the defense, if needed ....Receiver Emmanuel Sanders on what fans should expect from Joe Flacco this season. \"He's a baller. He's probably one of my favorite quarterbacks to play with all-time, him and Peyton (Manning).\" Copyright 2019 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "articleID": "2019090300_00086484_W", "names": {"Andrew Beck": ["Q4756308", "Q57374557"], "Brandon Allen": ["Q14950651", "Q24005402", "Q936391"]}}]