[{"date": "2019-09-02", "url": "https://www.thedenverchannel.com/sports/broncos/broncos-add-seven-new-players-begin-preparation-for-raiders", "content": "Broncos add seven new players, begin preparation for Raiders Raiders week arrives with Broncos making moves Posted: 5:50 PM, Sep 02, 2019 Updated: 2019-09-02 19:50:28 -04 By: Troy Renck ENGLEWOOD--The churn raised eyebrows. The Broncos remade the bottom of their roster with seven new players, or 13 percent of their 53-man squad. So it was a on surface-of-the-sun practice Monday--the 100 degrees marked the hottest September Colorado day ever--coach Vic Fangio began assimilating quarterback <mark>Brandon Allen</mark>, punt returner Diontae Spencer, linebacker Corey Nelson, tight end <mark>Andrew Beck</mark>, cornerbacks Duke Dawson and Devontae Harris and offensive lineman Corey Levin. \"It's actually easier to come in and learn in a game week than it is in training camp because things are paired down and dialed in more,\" said Fangio, whose team lacked quality depth throughout the preseason. \"We're not the only team that's had this roster gymnastics. It happens every year. (General manager) John (Elway) and his guys were keeping track of everyone around the league. We just felt that with each and every move it would make us better .\" In one week, the Broncos face the Oakland Raiders. It's hard to overstate the importance of starting well in the division. Anything less than 3-3 in the AFC West spells trouble. And the Broncos have dropped three straight games in Oakland, outscored 78-48. Time to microwave the development of the new guys because all contributors are needed and necessary. \"It's going to get poppin'. We have to go out there and execute,\" Pro Bowl running back Phillip Lindsay said. \"One, you can't make mistakes. Crowd noise, you have to stay tuned in. You have to make big plays, you have to hold onto the football and your defense has to create some turnovers .\" Eyes shifted to the quarterback drills because the position demands attention. <mark>Allen</mark>, wearing No. 2, is the new backup, someone who played against the Broncos in Los Angeles last month. He is not established, but was considered an upgrade over <mark>Kevin Hogan</mark>, who finished with four interceptions in the exhibition games. For <mark>Allen</mark>, the past 24 hours became a whirlwind as he was cut, claimed and cuddled up with a new playbook. \"A lot of the concepts are similar as far as terminology wise,\" said <mark>Allen</mark>, who called himself \"a good luck charm\" for quarterbacks because in his previous two stops in Jacksonville and Los Angeles the starters stayed healthy. \"A lot goes into getting ready, especially in the huddle. You want to be familiar with what you are saying. There will be a lot of extra preparation for me, but I am not new to that so I should be fine .\" So why <mark>Allen</mark>? Fangio explained the reasoning. \"He's a good athlete. Throws a good ball. We like the way he runs an offense,\" Fangio said. One player walks from parking lot to the top of the depth chart. The plan is for Spencer, pictured above, to handle punts on Monday. Fangio cited Spencer's experience and his quickness. Spencer was claimed off waivers from the Steelers after posting a 14.7 average with a long of 38 yards this summer. Spencer returned a staggering 191 punts for a 11.3 average in the past four seasons for Ottawa and Toronto. He handled nine straight in practice during media viewing with no issues. Spencer remains motivated by the murder of his father in Louisiana during his college career at McNeese State, adopting his dad's motto \"Can't Stop, Won't Stop .\" \"It's still pushes me. It always will,\" Spencer told me, before articulating what makes a good punt returner. \"The key is trusting yourself, trusting the guys that are out there blocking for you. And you have to be consistent. That's the biggest thing, putting the offense in good field position, and if you can score, it's a bonus .\" FOOTNOTES The Broncos rounded out their practice squad, adding lineman Jake Rodgers and former CSU star linebacker Josh Watson ....Linebacker Corey Nelson returns to Denver with a new number (56), and a plan to contribute right away. He told me he should be ready to go on special teams and the defense, if needed ....Receiver Emmanuel Sanders on what fans should expect from Joe Flacco this season. \"He's a baller. He's probably one of my favorite quarterbacks to play with all-time, him and Peyton (Manning).\" Copyright 2019 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "articleID": "2019090300_00086484_W", "names": {"Kevin Hogan": ["Q16195119", "Q19874350", "Q6083815", "Q6396509"]}}, {"date": "2019-09-03", "url": "http://www.news-mail.com.au/news/meningas-titans-christmas-shopping-list/3821606/", "content": "Mal Meninga has his sights set on signing new talent. Rugby League Meninga's Titans Christmas shopping list by <mark>Paul Weston</mark> 3rd Sep 2019 3:35 PM premium_icon Subscriber only 0 MAL Meninga says the Titans will go shopping for new players as soon as the November 1 deadline when clubs can table offers to off-contract players. Their hit list includes Bronco sensation <mark>David Fifita</mark>. The Titans head of performance and culture said the season may finish on Saturday night with the final home against the Dragons but the hard work begins on Monday morning. \"The focus of the players and coaches may not extend much further than Saturday night, but for us working behind the scenes at the club, the view is a little further afield. November 1, to be precise,\" Meninga told members. \"Much has been made of the fact that the Titans have Jai Arrow and AJ Brimson off-contract at the end of 2020 - and therefore, both players are able to be approached by rival clubs from November 1 .\" But it seems to have been forgotten there are 15 other NRL clubs with talented players able to negotiate in the first week of November. And there are some that we are very, very interested in having a chat with. \"Meninga says the Titans have 14 players - including Arrow and Brimson - coming off contract at the end of 2020 .\" Will all 14 of those players be at the Titans in 2021? Realistically, the answer is no. . But that means we will have the money and roster places available to chase players that we want to be here, \"he said. Titans Football Director Mal Meninga--season 2019 a tough one. (AAP Image/Dave Hunt) Meninga is acutely aware of the rosters of rival teams .\" Brisbane have 12 players off contract, Canberra have 15, South Sydney have 9, the Roosters have 11, and the Melbourne Storm have 21 players able to negotiate on November 1, \"he told members, in his regular club column .\" It is a buyer's market, and we are keen to go shopping. We will apply our new recruitment criteria in assessing the credentials of players we are interested in. \"Are they from the Gold Coast? Are they the right character to be Titans? Can they improve us as a club on and off the field with the standards they expect from themselves and demand from others?\" Plenty fit that criteria. Will we be talking to <mark>David Fifita</mark> about returning to the Gold Coast? Where he went to school at Palm Beach Currumbin High School. Of course we will. <mark>David Fifita</mark>, the Broncos boom forward--on the Titans shopping list. (AAP Image/Dave Hunt) \"What about his Broncos teammate Thomas Flegler, who could follow Jai Arrow's path to State of Origin by becoming a senior player at the Titans. Absolutely .\" Canberra's Charnze Nicoll-Klokstad. <mark>Josh Jackson</mark> and Dallin Watene-Zelezniak from the Dogs. \"Felise Kaufusi and Ryan Papenhuyzen at Melbourne. Kyle Feldt and <mark>Jordan McLean</mark> at the Cowboys. We would be keen to have a chat with all of them .\" Thomas Flegler--the young Bronco is on the Titans shopping list. (AAP Image/Darren England) While many Titans fans have vented their frustrations on social media, Meninga has defended the club's decision to let Arrow's manager go to the open market before November 1 saying it was \"commonsense\". \"We have made it clear that Jai is seen as a player this club can build around for the years ahead. He is undoubtedly a future leader of the Titans,\" Meninga said. \"But if, despite our best efforts, Jai's manager should decide his client's future is away from the Gold Coast, we can begin the difficult task to try to replace him .\" <mark>Jordan McLean</mark> of the Cowboys--also on the Titans shopping list. (AAP Image/Michael Chambers) Meninga in his final words to fans for season 2019 asked them to \"stick solid\" because the club was \"going in the right direction\" and better days were ahead. \"It is doubly-hard to take with people outside of the club putting the boot in to the Titans, and accusing you - our fans - of not caring about the club enough to see it survive .\" We are building something special here and we want you to be a part of it, \"he said. More Stories $3m star's reveal is a problem for Titans premium_icon Monday Buzz: Simple solution for a second Brisbane NRL team premium_icon Final round: How will the NRL top eight finish up? More Stories $3m star's reveal is a problem for Titans premium_icon Monday Buzz: Simple solution for a second Brisbane NRL team premium_icon Final round: How will the NRL top eight finish up? 0 <mark>david fifita</mark> Read More Login to follow gold coast titans Read More Login to follow mal meninga Read More Login to follow nrl Read More Login to follow rugby league Read More Login to follow <mark>david fifita</mark> gold coast titans mal meninga nrl rugby league", "articleID": "2019090305_00220905_W", "names": {"David Fifita": ["Q16232568", "Q55609104"], "Jordan Mclean": ["Q16234016", "Q1703633"], "Josh Jackson": ["Q19757619", "Q3185977", "Q39075458", "Q44749654", "Q6289014"], "Paul Weston": ["Q16189565", "Q16751402"]}}, {"date": "2019-09-05", "url": "http://www.halesowennews.co.uk/sport/national/17882311.craig-overton-confident-england-can-fight-back-fourth-test/", "content": "Craig Overton confident England can fight back in fourth Test By Press Association 2019 Craig Overton 0 comment Craig Overton is confident England can seize control of the fourth Ashes Test on Thursday. Australia ended a windswept and rain-interrupted first day at Old Trafford on 170 for three with the returning <mark>Steve Smith</mark> once again frustrating them on 60 not out. Overton made his mark in the game--his first Test appearance for 18 months--by bowling the in-form Marnus Labuscahgne for a well-made 67. A jaffa @ craigoverton12!?? Scorecard/Videos: https: //t.co/rDgrysSBQA #Ashes pic.twitter.com/Yn6HnnDNat--England Cricket (@ englandcricket) September 4, 2019 Now he hopes the hosts can up their levels to put themselves in charge on day two. The 25-year-old said: \"We're probably slightly behind but we felt the conditions weren't quite with us, with the rain and wind. We can come back tomorrow, get a couple of early ones and we'll be right back in the game .\" Removing <mark>Smith</mark> will obviously be key to England's hopes. <mark>Steve Smith</mark> again proved key for Australia (Mike Egerton/PA) The former Australia captain, who scored twin centuries in the Test at Edgbaston and 92 at Lord's but missed Headingley, took his run tally for the series to 438 in four innings. Overton said: \"<mark>Smith</mark> is obviously a world-class player, and he's back as Test number one. He's always going to be difficult but we've got our plans so we'll try to keep going to them and hope to get him out .\" <mark>Smith</mark>'s battle with Jofra Archer, who bounced him at Lord's, was one of the most eagerly-anticipated aspects of the game. However, in difficult bowling conditions, <mark>Smith</mark> dealt with the England paceman comfortably. Craig Overton is hoping for better conditions on Thursday (Mike Egerton/PA) Overton said: \"We all tended to struggle with the wind. I wouldn't look too much into it. He'll be raring to go tomorrow, firing in and bowling as quick as he can. Hopefully taking a few wickets as well .\" England came into the match on a high after their remarkable Ben Stokes-inspired win at Leeds but Australia are hoping to quell their momentum by batting on. Labuschagne, who has scored four successive half-centuries, said: \"We've talked about (England's momentum) not being an issue for us at all .\" We're just focused on the process of winning a Test match. It's about taking it a ball at a time, day at a time--and trying to make sure we're doing things right. \"I think that's what we have been doing the whole series. We haven't been getting too far ahead when we've done well, and haven't been getting too far down when we've done poorly .\" 0 comment", "articleID": "2019090503_00125053_W", "names": {"Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"]}}, {"date": "2019-09-06", "url": "https://footballleagueworld.co.uk/noel-whelan-reacts-to-recent-leeds-united-departure/", "content": "Share Tweet Former Leeds United striker <mark>Noel Whelan</mark> has expressed his surprise at midfielder Callum Nicell's departure from the club. Leeds confirmed earlier this week that Nicell had left Elland Road by mutual consent, with the 19-year-old having spent time with Premier League clubs including Leicester City earlier in the summer. Nicell, who was named the club's Academy Player of the Year in 2017, had only signed a two-year contract with Leeds last year, and <mark>Whelan</mark> appears to have been caught off guard by the termination of that deal. Speaking to Football Insider about Nicell's Leeds exit, the 44-year-old said: \"I didn't see this coming, to be honest, especially as everyone a the club seemed to think highly of him .\" He's obviously ambitious and he doesn't want to waste his time at Leeds if he isn't going to make the first team. \"That's up to him, and it shows that he backs himself to walk out on a contract. Leeds will have given him a percentage of what he would have earned over the season and he will hope to make up the remainder at a new club .\" Assessing Leeds' decision to allow Nicell to leave, <mark>Whelan</mark> appeared to suggest that manager Marcelo Bielsa will have been happy to allow the teenager to leave, as he claimed: \"That's brave, in a way. Will Leeds regret it? Obviously, they don't want their best young players to go, but you would think Marcelo Bielsa would have promoted him to the first team if he felt he was ready .\" He has backed young talent and given them lots of opportunities since he took over, so he obviously felt Nicell had some way to go. \"Nicell never made a senior appearance for Bielsa's side, although he was named on the bench twice for the Yorkshire club in the season prior to the argentine's appointment at Elland Road. The Verdict I can understand where <mark>Whelan</mark> is coming from here. Given the number of chances that have been given to young players at Leeds in recent years, you do feel the potential was there for Nicell to get his own opportunity in the first team at some point. You would imagine therefore that Nicell is confident in the quality of opportunity that he is getting elsewhere, although given the situation Leeds are in, that could backfire if something else fails to materialise for the youngster. Just how Nicell fares in the future is something that I imagine there will be more than a few at Elland Road watching with interest going forward. Like what the FLW have on offer? Sign up for more notifications! Related Topics: callum nicell Leeds United Sky Bet Championship Toby Wilding", "articleID": "2019090618_00300366_W", "names": {"Noel Whelan": ["Q16191489", "Q3877698"]}}, {"date": "2019-09-06", "url": "http://ctpost.com/entertainment/article/President-Sharpie-14419977.php", "content": "https: //www.rollingstone.com/politics/political-commentary/trump-hurricane-dorian-sharpie-map-881285/ President Sharpie Trump's lies about Alabama and Hurricane Dorian are no laughing matter Jamil Smith, provided by Published 4:04 pm EDT, Friday, September 6, 2019 Photo: Chip Somodevilla/Getty Images Photo: Chip Somodevilla/Getty Images Image 1 of / 1 Caption Close Image 1 of 1 Photo: Chip Somodevilla/Getty Images President Sharpie 1 / 1 Back to Gallery It is understandable that people laugh at this. There is an inherent hilarity in the doctored map alone, its black Sharpie-d bubble emerging from just north of Jacksonville and curving around the Florida panhandle only to ensure that some slice of Alabama would be jeopardized by this newly enhanced path of Hurricane Dorian. Watching a sitting president display this, proudly and like a school project, on top of the Resolute Desk inside the Oval Office on Wednesday was one of the more surreal moments I've experienced observing American politics--and not just as a journalist. It is difficult to consider anything quite so ridiculous, in the literal sense of the word. After the online mockery commenced, the late-night hosts got to work. It is difficult to fault them for doing their jobs, especially since so much truth is found in comedy. \"Erratic, slow, powerful and destructive. It's like looking in a mirror,\" Stephen Colbert said, imitating Trump while also noting that his Sharpie stunt was actually a federal crime. \"He really must think we're a bunch of idiots,\" <mark>Jimmy Kimmel</mark> remarked. \"I bet he thinks,\" Hey, they let me be president. Let's see what other dumb crap they'll go for. \"' Trevor Noah asked a more existential question:\" Did he draw with a Sharpie? What is life right now? \"More from Rolling Stone Trump to Get Two More Judges On Court That Oversees Crucial Civil Rights Cases Report: Trump Administration Rejects 99% of Student Debt Forgiveness Applicants Colbert Suggests Trump Broke the Law by Drawing Sharpie on Hurricane Dorian Map Noah feigned surprise that Trump could even find Alabama on a map. But as we learned with George W. Bush, mocking the president's stupidity and intellectual laziness has a different resonance when the hurricane comes. This isn't Trump trying to get away with one of his personal fictions or bits of braggadocio. It is simply not funny when anyone, let alone the president, lies about something this serious. Dorian, now a Category 1 hurricane, had already hit the U.S. Virgin Islands last week and lashed Puerto Rico a bit as it went by. On Wednesday, it made landfall Thursday on North Carolina's Outer Banks. Winds of up to 100 miles per hour hit the tourist destination before Dorian moved back out to sea. South Carolina also had to contend with two tornadoes that spun off from the hurricane. As Charleston's streets flooded, its police department felt compelled to post on Twitter,\" Remember, TURN AROUND, DON'T DROWN. \"We have yet to get any confirmation on American casualties outside of the six Florida deaths already reported. But government officials in the Bahamas--which were hit when Dorian was a Category 5 hurricane, the strongest there is--are now reporting at least 30 deaths and expect the final totals will be\" staggering. \"People have died and remain under threat, here in the United States and in allied nations that need our help and resources. Yet this cretin of a president remains fixated not merely on having media battles with his enemies in the press and wherever else while lives are at stake. It may sound old-fashioned or even quaint, but Americans have to be able to believe what the president says. Yes, just about every politician traffics in fiction. But this is a time of national crisis for many Americans, when the water is flooding in or the winds threaten to blow them to kingdom come. And they cannot trust Trump to prioritize their lives over his lie. Related Stories Trump to Get Two More Judges On Court That Oversees Crucial Civil Rights Cases Report: Trump Administration Rejects 99% of Student Debt Forgiveness Applicants Colbert Suggests Trump Broke the Law by Drawing Sharpie on Hurricane Dorian Map This time, it's unclear whether this began with a deliberate lie or Trump merely getting it wrong. Perhaps Trump saw\" all of the Bahamas \"was in jeopardy on a briefing page and his brain read\" Alabama. \"Perhaps he saw an early map predicting lighter winds barely reaching the state and genuinely, idiotically thought that meant that the state would be hit with major damage and decided saying that out loud without any investigation was a good idea. Or perhaps he just wanted to take a tragic event and make it all about himself, even if it makes him look insane in the process. It wouldn't be the first time (this year). No matter why he is continuing to lie about this, it is evident that no one is willing to stop him. I understand Republicans don't seem to give much of a damn about governance. Well, at least they oppose heavy regulations on business or want laissez-faire approaches to everything government does that doesn't relate to civil rights for anyone who is marginalized in America. However, this has become a party that doesn't care whether or not people die. Because that's what it is when they sit idly by as their president whines and wails like a colicky child for a week, not only tweeting madly but inducing his White House to lie for him about Alabama supposedly being in danger when it never was. President Donald Trump speaks about Hurricane Dorian as he speaks to reporters in the Oval Office of the White House, in Washington Trump, Washington, USA--04 Sep 2019 The federal crime he committed in doctoring the map, as confirmed by a White House official to the Washington Post Thursday night, may have been one of his more minor offenses overall. But it was clear and unmistakable. Title 18 U.S. Code 2074 states that\" Whoever knowingly issues or publishes any counterfeit weather forecast or warning of weather conditions falsely representing such forecast or warning to have been issued or published by the Weather Bureau, United States Signal Service, or other branch of the Government service, shall be fined under this title or imprisoned not more than ninety days, or both. \"Trump did that, and proudly, on national television. But the more insidious offense is what Trump is evidencing in his actions. He has shown us previously, through his various authoritarian impulses, that he believes that he does not represent the state or govern the state so much that he is the state. This Alabama mess, contrary to what Al Roker insisted Thursday, is not a distraction. It is part of the whole. We see, in Trump's relentless focus on his own misbegotten truth, an unbreakable grip on a reality that does not exist. It stems from his strange idea of manhood, the idea that a lack of vulnerability and an unwillingness to admit error equals strength--when just the opposite is true. It may not feel as though we have a president right now, what with this one golfing all weekend in Florida as Dorian was bearing down on the nation. But we need one. This union has remained tethered together and functional these past few years in spite of his impulses, not because of them. It is in times of natural disaster, when hurricanes strike, that we see his most glaring weaknesses as a leader. I realize that writing what I am about to write is futile, which is why I haven't done it in a column before. But Trump should resign over this. If he doesn't do so willingly, he should be pressured to do so or impeached immediately. Over this, yes. But he won't leave, and House Speaker Nancy Pelosi likely won't act. Even if she did, Republicans have made clear they'll shield Trump regardless. So we rely upon the plentiful primary field. That is why we need someone who tells the truth unreservedly to oppose this president. It would befit the current frontrunner, Joe Biden, to remember that as he continues to cover up for his own lies and misstatements (about his past Iraq position, most notably). Insisting that the\" details are irrelevant in terms of decision-making, \"as the former vice-president asserted recently to NPR, is a curious approach for someone preparing to run against a serial fabricator. He argues that he is the most\" electable, \"but Biden is playing a game that Trump already knows how to win. I guess he truly is a Democrat. Sign up for Rolling Stone's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram. View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019090621_00039004_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"]}}, {"date": "2019-09-09", "url": "http://www.times-series.co.uk/news/national/17889786.us-air-force-to-review-international-stays-trump-resort-bookings/", "content": "US Air Force \"to review international stays' after <mark>Trump</mark> resort bookings By Press Association 2019 <mark>Trump</mark> Turnberry 0 comment The US Air Force has reportedly ordered a review into how it chooses accommodation for international trips after it emerged that crew members had stayed at the <mark>Trump</mark> Turnberry resort. It comes as US President <mark>Donald Trump</mark> is being investigated over a potential conflict of interest involving increased US military spending at Glasgow Prestwick Airport and visits to the luxury resort at nearby Turnberry in Ayrshire. Air force chiefs have\" directed Air Mobility Command to review all guidance pertaining to selection of airports and lodging accommodations during international travel \", according to a statement published by Politico. Over the weekend it emerged that crew from a C-17 shared by the USAF and the Alaska Air National Guard stayed at <mark>Trump</mark> Turnberry when the aircraft stopped at Prestwick en route to Kuwait. I know nothing about an Air Force plane landing at an airport (which I do not own and have nothing to do with) near Turnberry Resort (which I do own) in Scotland, and filling up with fuel, with the crew staying overnight at Turnberry (they have good taste!). NOTHING TO DO WITH ME--<mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) September 9, 2019 Mr <mark>Trump</mark> tweeted on Monday afternoon that he knew\" nothing \"about the incident. He wrote:\" I know nothing about an Air Force plane landing at an airport (which I do not own and have nothing to do with) near Turnberry Resort (which I do own) in Scotland, and filling up with fuel, with the crew staying overnight at Turnberry (they have good taste!). NOTHING TO DO WITH ME. \"In the statement published by Politico, the USAF said:\" While initial reviews indicate that aircrew transiting through Scotland adhered to all guidance and procedures, we understand that US Service members lodging at higher-end accommodations, even if within government rates, might be allowable but not advisable. \"Therefore, we are reviewing all associated guidance .\" Even when USAF aircrews follow all directives and guidance, we must still be considerate of perceptions of not being good stewards of taxpayer funds that might be created through the appearance of aircrew staying at such locations (review will include active duty, Guard Reserve). \"<mark>Donald Trump</mark> playing golf at <mark>Trump</mark> Turnberry (Andrew Milligan/PA) The USAF said its aircraft, primarily C-17s, have increasingly used Prestwick as a stopover location between 2015 and 2019 due to factors such as its 24-hour operations, its large parking area and its location on the route of flights to and from Europe and the Middle East. US congress has launched a probe into whether increasing expenditure at the airport and allegations of cut-price deals at Mr <mark>Trump</mark>'s Ayrshire golf resort offered to visiting US military personnel is a violation of the American constitution. Following reports of the airport offering\" cut-price rooms for select passengers and crew \"and free rounds of golf at Turnberry for US military staff and civilian air crews, Mr <mark>Trump</mark> has been warned his financial stake in the resort raises questions about the increase in airport spending. 0 comment", "articleID": "2019090915_00127704_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-09-09", "url": "https://www.standard.co.uk/news/uk/doctors-to-teach-london-pupils-how-to-give-stabbing-victims-first-aid-a4232321.html", "content": "News' UK Doctors to teach London pupils how to give stabbing victims first aid Naomi Ackerman Monday 9 September 2019 16:00 {{#singleComment}} {{value}} comment {{/ singleComment}} {{^ singleComment}} {{value}} comments {{/ singleComment}} Click to follow The Evening Standard Experts will use simulation and practical exercises. (helenrigby.com) Enter your email address Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid You already have an account. Please log in. Register with your social account or click here to log in I would like to receive lunchtime headlines Monday - Friday plus breaking news alerts, by email Update newsletter preferences An NHS project training at-risk teenagers how to give emergency first aid to stabbing victims is launching in London schools. Doctors and nurses will show pupils how to stem bleeding, keep victims alive in the first crucial minutes after an attack, and keep themselves safe. The \"zero responder\" workshops were first run at Feltham and Pentonville young offender institutions by A & E specialists from the Royal London Hospital in Whitechapel last autumn. Since then, the two-hour sessions have also been held at youth and community centres in Hackney and Southwark. This term the Barts Health Trust specialists will launch the workshops in London schools for the first time. Read more Two killed in 15 minutes: Mum stabbed and man shot yards apart They will run them in four east London pupil referral units--education centres for children who have been removed from mainstream school--this autumn, with the aim of expanding into mainstream schools. Experts will use simulation and practical exercises to teach groups of about 15 to 20 pupils, who will be able to ask questions. Michael Carver, lead violence reduction nurse at the Royal London, said he wanted to give first aid to all pupils, adding: \"The primary outcome is they will be able to do first-responder things to stop people bleeding to death in the first five minutes; and the secondary outcome is we start talking properly about knife crime .\" The move is part of a Barts Health violence reduction initiative, running alongside a NHS programme to tackle youth violence in the capital, led by its first clinical director for violence reduction, Royal London trauma surgeon <mark>Martin Griffiths</mark>. More about: | stabbing Show {{#moreThan 3}} {{value_total}} {{/ moreThan3}} comments Reuse content Comments Log in or register to comment Hello {{nickname}} (Logout) {{^ nickname}} {{/ nickname}} {{#nickname}} {{/ nickname}} Post {{#singleComment}} {{value}} Comment {{/ singleComment}} {{^ singleComment}} {{value}} Comments {{/ singleComment}} Refresh • Subscribe • RSS {{^ comments}} There are no comments yet {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply Flag {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply Flag {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Flag {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} {{#showMore}} Read more {{/ showMore}} Notifications Enter your email to subscribe to new comments on this article. Subscribe Thanks for subscribing! {{errorMessage}} Vote Are you sure you want to submit this vote? Yes, submit this vote Cancel You must be logged in to vote. Report Comment Are you sure you want to mark this comment as inappropriate? Yes, flag this comment Cancel This comment has been flagged. This comment has been flagged. Delete Comment Are you sure you want to delete this comment? Yes, delete this comment Cancel This comment has been deleted. This comment has been deleted. Reply {{^ nickname}} {{/ nickname}} {{#nickname}} {{/ nickname}} {{^ nickname}} Post {{/ nickname}} {{#nickname}} Post {{/ nickname}} Cancel Comment posted! {{errorMessage}} Most popular {{title}} Popular videos {{title}} Sponsored features {{title}}", "articleID": "2019090915_00198372_W", "names": {"Martin Griffiths": ["Q21457259", "Q59281930"]}}]