[{"date": "2019-09-09", "url": "https://www.ntnews.com.au/news/national/almost-70-fires-burning-across-queensland-with-multiple-homes-lost/news-story/cfed8354529a72026722f730b65e033f", "content": "social-email_circle Police are allegedly speaking with a 12-year-old juvenile in relation to Queensland's bushfire crisis, it has been reported. According to, the child is currently being questioned by authorities over the fire which broke out on the Sunshine Coast yesterday afternoon. Today The breaking news comes as a bushfire emergency situation has been officially declared at the small coastal town of Peregian Beach on the Sunshine Coast, with at least 10 homes in the area already lost. Meanwhile, there are around 70 fires burning across the state, with fire now moving fast in a north-northeast direction from Emu Mountain Rd towards Peregian Beach and Peregian Breeze Estate. media_cameraHundreds of firefighters are at the scene. Picture: John McCutcheon/Sunshine Coast Daily Queensland Fire and Emergency Services have urged residents of Peregian Beach to evacuate immediately, while those from Weyba, Weyba Downs, Peregian Springs, Castaways Beach and Marcus Beach have been told to be prepared to leave the area. Hundreds of people have already fled their homes for evacuation centres, with more than 1000 homes experiencing power outages as a result of the blaze. Very dry and windy conditions are expected along the Queensland coast today, which will likely impact fire zones. Northern NSW has also been affected by fires, with blazes affecting the town of Yamba and surrounding area. More than 200 firefighters are now battling the fire at Peregian Beach, which is just metres from homes. media_cameraFire and Rescue teams fight a wild bushfire as it approaches Peregian Beach township on <mark>David Low</mark> Way. Picture: Lachie Millard Queensland Fire and Emergency Services (QFES) has advised that residents in the Peregian Beach area \"will be affected by smoke, which will reduce visibility and air quality\". People who believe they or their property could be under threat is advised to call triple-0 immediately. QFES also advises residents to listen to their local radio station or visit the Rural Fire Service (RFS) website for regular updates, as well as referring to their bushfire survival plan. Windows and doors should also be closed to minimise smoke exposure, and residents should drive with caution in <mark>low</mark> visibility conditions. Noosa Local Disaster Co-ordinator Carl Billingham told the ABC the Sunshine Coast blaze remained out of control. \"We've got about 250-300 people in our three evacuations centres, I believe we've got three fire water bombing helicopters coming in to try and douse the fire where possible and we've got over 70 tenders in attendance of the fire,\" he said. - with wires", "articleID": "2019090920_00293654_W", "names": {"David Low": ["Q43119329", "Q52084303", "Q57412314"]}}, {"date": "2019-09-10", "url": "http://www.eveningecho.ie/corksport/Cork-City-showed-enough-in-Dundalk-to-finish-disappointing-season-on-a-high-13051f0b-1a9d-463a-9a85-abaedc4136b9-ds", "content": "Cork City showed enough in Dundalk to finish disappointing season on a high Denis Hurley WHILE Friday's clash with Dundalk resulted in a third straight loss for Cork City under head coach Neale Fenn, the new boss was pleased with the level of application shown. City went down 1-0 to a disputed late goal from Georgie Kelly, but Fenn was impressed with the response following the defeat at home to Waterford last Monday. \"I was gutted for the boys, really,\" he said. \"I know that it's a tough place to come but we were disciplined. We restricted them to nothing of note in the first-half, we knew the pressure was going to come in the second half but I felt we weathered it quite well .\" It was always going to be tough, we had a lot of injuries and a lot of lads missing, but I can't complain or be disappointed with any of the players. I was disappointed with the result, obviously, but the performance of the boys was excellent. \"I was critical of the boys on Monday night and I think they'll admit that they didn't defend properly, or on Friday [against Sligo Rovers].\" Against Dundalk, when the chips were down, they really defended well, restricted Dundalk to a couple of half-chances before the goal. It was unfortunate, the boys were saying that he punched it in, he never headed it, so it's disappointing from that point of view but I can't fault the overall performance. \"Dundalk's Andy Boyle with <mark>Mark O'Sullivan</mark> of Cork City. Picture: INPHO/Morgan Treacy Ultimately, Dundalk's quality told, with City missing a number of key players which deprived Fenn of options from the bench in the second half .\" Our bench was kids, apart from <mark>Alan Bennett</mark>, \"he said .\" We've got [Kevin] O’Connor out, [Garry] Buckley out, [Gearóid] Morrissey out, [Karl] Sheppard out, [Joel] Coustrain out--that's five players you would imagine would be near the starting 11. \"Alec Byrne came in against Dundalk and was excellent, but at the time, we're just going through a little bit of a time with injuries and it's tough, especially with three games in a week .\" Without a game this weekend, it gives us a chance to get those boys back and then we'll have a bench and a squad to choose from and you've got decisions. At the moment, we're just playing the lads that are fit. \"City's next league game is at home to Finn Harps on Friday week, with this Saturday seeing <mark>Alan Bennett</mark>'s testimonial take place. Fenn is glad of the opportunity to take stock .\" I won't lie, I've had a tough couple of weeks! \"he laughed .\" I was extremely disappointed with the result on Friday, nobody wants to go up there and lose, but the performance gave me hope and gave the lads hope too that they can dig out a result. \"They didn't on Friday but, with a fully fit squad and options off the bench--and that's no disrespect to the young lads--it gives you a different dimension .\" The break's coming at a good time, it gives the injured players time to get fit. \"", "articleID": "2019091015_00023387_W", "names": {"Alan Bennett": ["Q2059152", "Q21453425", "Q21997412", "Q4706167", "Q654730"], "Mark O'Sullivan": ["Q2266912", "Q29107850", "Q6769090"]}}, {"date": "2019-09-10", "url": "https://www.gwhatchet.com/2019/09/10/justin-diamond-announces-intention-to-resign-in-first-sa-senate-meeting-of-semester/", "content": "Media Credit: Arielle Bader | Assistant Photo Editor Student Association Sen. Justin Diamond, ESIA-U, announced plans to resign from his post Monday. Newsroom Blog By Lizzie Mintz Sep 10, 2019 12:22 PM Three Student Association senators announced plans to resign from the SA Senate during the first meeting of the semester. SA Sen. Justin Diamond, ESIA-U, said during the meeting Monday that he will resign from his post \"effective immediately .\" Diamond launched a last-minute bid for SA president in the spring on a platform to abolish the organization, but he lost in a run-off election against SA President SJ Matthews and garnered enough write-in votes to win a seat representing the Elliott School of International Affairs. Diamond said his time in the SA only reinforced his belief that the organization is an ineffective body and has taken a \"toll\" on him because he has struggled to gain respect from other SA members. After notching a senate seat last spring, Diamond vowed to \"destroy the SA from within .\" \"Following the campaign, I wanted something to spring off of, have somewhere to go, have some sort of direction, maybe make some sort of change in the SA,\" Diamond said. \"But fundamentally, the institution itself can't be changed really from within by me because I don't really have allies there--it was kind of stupid to think that would even be possible .\" SA Sen. <mark>George Glass</mark>, CCAS-U and the chair of the finance committee, said SA Sen. Arman Hussain, SMHS-G, and Robert Yassky, SOB-G--who were both absent from the meeting--would resign. Diamond, Hussain and Yassky all served on the finance committee, <mark>Glass</mark> said. <mark>Glass</mark> said Yassky and Hussein told him they intended to resign because of the SA's required time commitment to the finance committee and biweekly senate meetings. \"Finance out of all of the committees in the SA is the most strenuous,\" he said. \"We meet every single week for a reason because student orgs need money .\" SA Executive Vice President Amy Martin she said would rather have senators immediately resign when they realize they cannot commit to the time or job rather than stay in the senate and do \"little to no work .\" \"I think what we're seeing is just that the senators who are here and who are present are very active and they're very engaged and they're wanting to do the work and wanting to have the discussions,\" she said. \"So if that means I lose two or three senators who have just realized that they can't give that commitment, I think that that's fair play .\" Shannon Mallard and Kate McCarthy contributed reporting.", "articleID": "2019091016_00187656_W", "names": {"George Glass": ["Q23197970", "Q56477004"]}}, {"date": "2019-09-11", "url": "https://www.yukon-news.com/sports/dylan-cozens-impresses-at-buffalo-sabres-prospects-challenge/", "content": "The Buffalo Sabres hosted its annual preseason Prospects Challenge in Buffalo, New York, from Sept. 6 to 9 with the Boston Bruins, Pittsburgh Penguins and New Jersey Devils also taking part. The event, held at the Harborcenter, was the first time the Sabres organization and fans got to see Whitehorse's Dylan Cozens compete against other NHL franchises. Cozens was left off Buffalo's initial roster for the event as he is recovering from thumb surgery following an injury at development camp earlier this summer, but ultimately played in two games and picked up three points. Cozens finished the weekend tied for second on the team in goals and tied for fourth in points. Training camp for the Sabres starts on Sept. 12 and runs until Sept. 28. General Manager Jason Botterill made it clear at the NHL Draft in June he doesn't expect any of the team's 2019 draft picks, including Cozens, to make the big club out of training camp. In the event Cozens is sent down, he'll be reporting to the WHL's Lethbridge Hurricanes where he has played his entire CHL career. Sabres defeat Devils 6-4 Buffalo jumped out to an early lead against the New Jersey Devils on Sept. 6 when Kyle Olson scored just 30 seconds into the first period. The Sabres struck twice more in the first, with goals from Victor Olofsson and Andrew Oglevie making it 3-0 after 20 minutes. Things kept rolling for the Sabres in the second as <mark>Arttu Ruotsalainen</mark> scored early to make it 4-0. Cozens then scored a power-play goal at 13:19 of the second period, assisted by Henri Jokiharju, to make it 5-0. Cozens took a pass near the top of the right faceoff circle and stepped around the Devils winger, shielding the puck with his leg, before ripping a wrist shot high past the New Jersey goaltender. Buffalo's William Borgen scored to make it 6-0, but New Jersey's first-overall pick <mark>Jack Hughes</mark> got one late on the powerplay to make it 6-1 after 40 minutes. In the third period, the Sabres prospects let off the gas, conceding three goals to New Jersey but ultimately held on for a 6-4 win. Cozens picked up three minor penalties in the game--a hooking penalty in the second and penalties for roughing and interference in the third. After the game, Cozens told the media he was glad to be on the ice and that the atmosphere from the hometown crowd lived up to expectations. \"It was good to just get my legs under me,\" said Cozens. \"I was told there was going to be lots of fans out here tonight and it was completely packed; that's awesome to see for a tournament like this .\" Buffalo beats Boston 4-3 The Buffalo Sabres and the Boston Bruins took to the ice on Sept. 7 with the Sabres again jumping out to an early lead. This time, Rasmus Asplund scored just over five minutes into the first period to give Buffalo a 1-0 lead. In the second period, Oskar Steen tied things up for Boston near the middle of the frame before Buffalo exploded for three goals in four minutes. Olofsson scored first at 12:23, followed by Matej Pekar at 13:33 and Pekar again at 16:22. In the third period, Steen scored to cut the lead to two before Samuel Asselin clawed the Bruins back to within one at 15:59. Cozens did not play in the game. Penguins win 6-4 over Sabres The Pittsburgh Penguins handed the Sabres prospects a 6-4 defeat in the final game of the Prospects Challenge on Sept. 9, although Cozens had a goal and an assist in the loss. After an opening period that included 23 shots on target but no goals, the floodgates opened in the second as the two teams combined for six goals. Pittsburgh struck first with a shorthanded goal from Sam Lefferty. Anthony Angello then added two for the Pens, making it 3-0, before Jordy Bellerive made it 4-0 with a power play goal at 9:05. Brett Murray scored a powerplay goal assisted by Jokiharju and Cozens at 18:05 before Cozens scored at the end of the period to make it 4-2 after 40 minutes. Cozens fought for position in front of the net and managed to deflect a point shot with just 1.3 seconds remaining on the clock. In the third period, Asplund scored a pair to tie it up 4-4 before Nathan Legare scored the winner for Pittsburgh at 3:57. The Penguins added an empty net goal in the final minute to make it 6-4. Contact John Hopkins-Hill at john.hopkinshill @ yukon-news.com", "articleID": "2019091122_00158375_W", "names": {"Arttu Ruotsalainen": ["Q21016846", "Q45834817"], "Jack Hughes": ["Q53952401", "Q608218", "Q6113254"]}}, {"date": "2019-09-12", "url": "http://www.prnewswire.co.uk/news-releases/lg-signature-at-london-design-festival-2019-uniting-art-and-technology-811071898.html", "content": "LG SIGNATURE at London Design Festival 2019: Uniting Art and Technology News provided by 12 Sep, 2019, 13:00 BST Share this article Ultra-Premium Brand Will Host Exclusive Event with Prominent Artists at Prestigious London Fair LONDON, Sept. 12, 2019 / PRNewswire /--LG SIGNATURE, the ultra-premium brand from LG Electronics, will for the first time be participating at London Design Festival 2019. Exploring the relationship between art and technology and their impact on contemporary design, LG SIGNATURE will be inviting prominent industry leaders to host an exclusive lecture and panel talk while showcasing the latest range of luxury products at this year's prominent event. LG SIGNATURE at London Design Festival 2019: Uniting Art and Technology Under the theme of \"Art Inspires Technology. Technology Completes Art .\" award-winning architects Massimiliano and Doriana Fuksas of \"Studio Fuksas', Antoine Preziuso, one of the world's top luxury watches experts and founder of London based collective UVA (United Visual Artists) <mark>Matt Clark</mark> will join Chung WookJun, head of Home Appliance & Air Solution Design Lab. at LG Electronics to share their insights on how the interaction between technology and art can bring masterpieces to life. <mark>Jonathan Bell</mark>, editor-at-large at Wallpaper * magazine will serve as moderator for the panel discussion which will introduce new perspectives on the ways that technology and art inspire and complete one another. The latest range of LG SIGNATURE products including the OLED TV W, French Door Refrigerator and Bottom-freezer Refrigerator, Wine Cellar, Washer & Dryer, Air Purifier and Air Conditioner will be exhibited in a set designed in collaboration with Wallpaper * .\" We're excited to be participating at this year's London Design Festival and to be able to work with such renowned individuals on this project. We hope this event will provide consumers with an eye-opening experience into the world of technology, through the lens of art, \"said Brian Na, CEO of LG Europe. Visitors to London Design Festival 2019 can experience the LG SIGNATURE exhibition at the East Wing of Somerset House from 18 to 21 September. About LG SIGNATURE LG SIGNATURE is the first ultra-premium brand across multiple product categories from global innovator LG Electronics. Catering to the most discerning consumers, LG SIGNATURE is designed to provide a state-of-the-art living experience that feels pure, sophisticated and luxurious. Combining the very best of everything LG has to offer, the distinctive LG SIGNATURE products were designed with their true essence in mind - streamlined to focus on each product's essential function while maintaining the LG SIGNATURE's modern, signature design. www.LGSIGNATURE.com.", "articleID": "2019091214_00005444_W", "names": {"Jonathan Bell": ["Q3183317", "Q54932937", "Q6272557"], "Matt Clark": ["Q1768022", "Q22277379", "Q3180807", "Q6788489", "Q6788491"]}}, {"date": "2019-09-12", "url": "https://www.thepost.on.ca/news/party-leaders-rip-into-conspicuously-absent-justin-trudeau-at-first-leaders-debate/wcm/ce9d6c51-9a03-4a8f-a3f1-ba261196f36c", "content": "More from Vanmala Subramaniam Published on: September 12, 2019 | Last Updated: September 12, 2019 11:20 PM EDT Green Party Leader <mark>Elizabeth May</mark>, Conservative Leader Andrew Scheer and NDP Leader Jagmeet Singh, along with an empty lectern where Liberal Leader Justin Trudeau would have been, at the first leaders' debate on Sept. 12, 2019 in Toronto. Frank Gunn/The Canadian Press Share Adjust Comment Print Conservative Party leader Andrew Scheer took aim at a conspicuously absent Justin Trudeau, while Green Party leader <mark>Elizabeth May</mark> and the NDP's Jagmeet Singh sparred largely at each other in an attempt to cement themselves firmly in third place in the polls, at the first leaders' debate on Thursday night in Toronto. Thursday's Maclean's / City TV debate was the first of four in the federal election campaign, and the first time Scheer and Singh are participating in a leaders debate. Trudeau has chosen to attend only a single English language debate on Oct. 7 and will participate in both French language debates. The debate began with questions on the economy, before moving on to discussions on Indigenous issues, the environment and foreign affairs, particularly Canada's current frosty relationship with China. I'm not going down the little rabbit hole \"Justin Trudeau promised that the budget would be balanced this year, but all we've seen is deficit after deficit. Right after the election he will raise your taxes,\" Scheer said, in opening remarks. \"Governments in Ottawa have always made decisions that make it easiest for the richest and hardest for the poorest,\" declared Singh, who spent most of the 90 minutes hammering home the NDP's signature talking points of reducing inequality and increasing affordability for Canadians. Moderator <mark>Paul Wells</mark> then attempted to pin Scheer down on a question on whether he would defer his plan for a balanced budget in the event of an economic recession, or push further cuts, but Scheer deflected, emphasizing his plan to balance the budget within five years. While all three leaders said they opposed Bill 21, Quebec's religious symbols ban--not unlike Trudeau's stance on the issue--none would entertain the idea of intervening in Quebec's internal politics in order to see some kind of constitutional reversal to the bill. Singh called bill 21 \"legislated discrimination\" and \"hurtful\" , while <mark>May</mark> suggested that if elected Prime Minister, she would find some way of ensuring that those affected by the bill would be able to seek employment in other provinces. Why did Trudeau skip the first leaders' debate? The SNC-Lavalin scandal likely had something to do with it Scheer spent much of the first half of the debate challenging <mark>May</mark> and Singh on their healthcare policies, particularly how they would be able to afford paying for a national pharmacare program. \"You cannot increase healthcare services when you are paying more and more money to pay the service charges on the debt and that is what all these plans will lead to,\" Scheer said. The NDP has pledged to provide nationwide pharmacare and dental care if elected, at a price tag of $43 billion, one that Scheer immediately pointed out would lead to a vast tax hike. \"That money has to come from somewhere .\" <mark>May</mark> focused most of her talking points on issues around climate change and the environment, taking specific aim at what she called the NDP's \"unclear\" climate target, despite Singh's repeated attempts to emphasize his party's position to keep to the 1.5 degree Celsius safe upper limit climate target. The NDP is the only party to have released a full campaign platform so far, which includes rolling back exemptions for heavy polluters, and a promise for $15 billion in green investments which they say would create 300,000 green jobs over the next four years. . Gary Clement/National Post \"The Green Party and NDP share a lot in common: we have a solid position on a women's right to choose, on national unity, on workers' rights, and we believe we should not be putting Mr. Scheer in the prime minister's seat, which Ms. <mark>May</mark> believes is the right choice,\" said Singh. \"Those are absurd statements. I'm not going down the little rabbit hole that Mr. Singh just created,\" <mark>May</mark> said, laughing. \"I think they all did what they needed to do, for the most part,\" said former NDP strategist and current Hill & Knowlton Strategies associate Anne McGrath. \"The big surprise for people is going to be Jagmeet Singh. He was clear, concise and very value-based .\" McGrath added that <mark>May</mark>'s advantage is that she is well known to Canadians, but she tended to go down \"a number of rabbit holes\" during the debate. \"She's very detail oriented partly because she has a lot of knowledge but she was not able to adequately explain some of the difficulties that she's been in in the last week or two, especially around abortion .\" Quotes and exchanges from the first federal leaders' debate: Singh: \"I didn't cut you off while you were talking. Now the people at the very top--\"Scheer:\" I didn't say things that aren't true. \"--<mark>May</mark>:\" I would not cut spending and services. We need to massively expand services. We need 100-per-cent universal pharmacare. Jagmeet's right--we have to bring in pharmacare. \"--Scheer:\" There are many laudable goals within this piece of legislation, many things that a Conservative government will support, that I will support as prime minister, but we cannot create a system in this country where one group of individuals, one Indigenous community, can hold hostage large projects that employ so many Indigenous Canadians. \"--<mark>May</mark> to Scheer:\" Consulting (with Indigenous Peoples) is not,' I will consult with you till you agree with what we've already decided to do .' That's not consultation and it's not--it's what Trudeau thinks is consultation, it's obviously what you think is consultation, but it has to be free, prior, informed consent. \"--Singh\" When it comes down to it, the Green party and New Democrats share a lot of common, except for the following four points: when it comes down to it, we have a solid position, unlike the Greens, on a woman's right to choose. We have a solid position when it comes down to--\"<mark>May</mark>:\" That's not true. \"Singh:\" --national unity. We have a belief that we can't leave workers behind and we strongly believe that we should not be putting Mr. Scheer in the prime minister's seat, unlike Ms. <mark>May</mark> and the Green party who believe that's the right choice. \"<mark>May</mark>:\" Excuse me. Those were absurd statements. I'm awfully sorry. \"--Scheer on his pro-Brexit stance:\" I'm always in favour of countries' being able to chart their own destiny and control their own internal affairs and it is now up to British lawmakers and the British people to determine what happens next (with Brexit). My focus is on restoring Canada's place in the world. \"--Scheer:\" I think I found some consensus. I think we can all agree that Justin Trudeau is afraid of his record and that's why he's not here tonight. He has made life more expensive--\"Singh:\" It might be the only thing we agree on, but we'll agree on that. \"<mark>May</mark>:\" We agree on that ....We can now sing' Kumbaya' and keep going. \"--The Canadian Press", "articleID": "2019091303_00090841_W", "names": {"Elizabeth May": ["Q16194189", "Q2289262", "Q42322461", "Q445620"], "Paul Wells": ["Q3372414", "Q3372415"]}}]