[{"date": "2019-09-13", "url": "https://www.news18.com/news/movies/section-375-movie-review-akshay-khanna-shines-in-the-business-of-law-and-justice-2307531.html", "content": "Section 375 Movie Review: Akshay Khanna Shines in the Business of Law and Justice 2-min read Section 375 Movie Review: Akshay Khanna Shines in the Business of Law and Justice For most part if it, Section 375 keeps you confused about the possible outcome of the case, and that's a moral victory the director can claim. Updated: September 13, 2019, 1:16 PM IST Akshaye Khanna in a still from Section 375. Loading...Cast: Akshay Khanna, Richa Chadda Director: Ajay Bahl \"We are in the business of law, not justice,\" says Akshay Khanna to Richa Chadda in one of the most poignant moments of Section 375, and nothing could have summed up director Ajay Bahl's film about a rape trial. In fact, this blurred vision of truth and justice is the hallmark of Section 375 that tries to bring out a new side of the argument. There's an alleged rape victim Anjali (Meera Chopra), an alleged rapist Rohan (<mark>Rahul Bhat</mark>), and two warring lawyers Tarun (Akshaye Khanna) and Hiral (Richa Chadda). The director never tells us what exactly happened on the date of the crime, but he reconstructs the events as per the lawyers' versions. It's a ploy to keep us blinkered, and not let us be tilted towards one party. Section 375 focusses on the courtroom drama and the outside factors influencing a judge's decision. In the process, we witness the loopholes of the law and how it could be misused, an accusation faced by laws regarding sexual harassment at many occasions. This also seems to be the film's intention. The accuser and the accused present their sides of the story and then they are reconstructed in front of the judges, who also appear to be facing dilemma regarding the real chain of events. Bahl wins the first battle here as he successfully places a doubt about the accuser's intentions in the viewer's mind. He wants to convey, in no uncertain terms, that even if the decision has been given as per the law, it may still not be right and hence justice might not have been served. Read: Batla House Movie Review Similar to BA Pass, Bahl's impressive directorial debut about the sinister lanes of Delhi's Paharganj, this one also intends to bring out the dark side of the truth. There is no right or wrong, but dubious characters with ambiguous morality. Akshaye Khanna has excelled as the defense solicitor. He hasn't put even one foot wrong, and is clearly within the zone of the intended character. The same can't be said about Richa Chadda though, who couldn't match up to her counterpart in energy and screen presence. For most part if it, Section 375 keeps you confused about the possible outcome of the case, and that's a moral victory Bahl can claim. But then he takes a stand and dilutes the whole idea of being an unbiased presenter of facts of a rape case. Section 375 is engaging and your views towards the film will depend on which side you would like to be. Rating: 3/5 Follow @ News18Movies for more Get the best of News18 delivered to your inbox - subscribe to News18 Daybreak. Follow News18. com on Twitter, Instagram, Facebook, TikTok and on YouTube, and stay in the know with what's happening in the world around you--in real time.", "articleID": "2019091307_00228609_W", "names": {"Rahul Bhat": ["Q15262059", "Q51520652"]}}, {"date": "2019-09-14", "url": "https://www.wkar.org/post/democrats-get-closer-serious-field-trump-challengers", "content": "Democrats Get Closer To Serious Field Of <mark>Trump</mark> Challengers By Ron Elving • 5 minutes ago Share Tweet Email Democratic presidential candidates former Vice President Joe Biden, South Bend, Ind., Mayor Pete Buttigieg and Sen. Bernie Sanders of Vermont participate in Thursday's debate in Houston. Win McNamee / Getty Images There was something different about the Democratic debate this week, compared to the earlier rounds this summer. Something was happening that was hard to pin down, but palpable. Not the contrast of night and day, but perhaps the difference between dusk and dawn. It's a critical difference and it comes at a crucial time. Because the <mark>Trump</mark> presidency these candidates are competing to truncate has reached what may be a critical juncture. But more of that in a moment. This week, the Democratic nomination fight once again took the form of a TV quiz show with too many contestants to fit onscreen at once. Once again, the candidates sounded a lot alike, peddling much the same wares as in June and July. And yes, three hours was too long. Yet something different happened. The debate left a clearer imprint. The effect was at least somewhat more energizing than the summer meetings, or perhaps just a bit less dispiriting. There were still 10 candidates on stage but at least they were the candidates most people wanted to see and--best of all--there was not the prospect of 10 more contestants doing it all over on the following night. That made a difference. The earlier affairs had the feel of the NFL exhibition season, this week felt more like playing for keeps. On the substantive side, the candidate's answers and thoughts seemed more fully formed and more clearly expressed. Some of this is just practice. Some of these candidates are new to the big leagues; and veterans such as former Vice President Joe Biden and Sen. Bernie Sanders are getting used to new roles. Some of the upgrade also seemed attributable to the ABC moderators, all four of whom were crisp. They had challenging questions and they probed in their follow-ups, but they did not intrude on the dynamic among the candidates. Like good referees, they pretty much let the players play--to the benefit of all. Benefiting most were the candidates who got the most airtime--Biden, Sanders and Sen. Elizabeth Warren. Much was made of it being the first time viewers had a chance to see Biden and Warren face off--with Sanders, the other candidate consistently in double digits, right there as well. It gave Democratic consumers their best chance for a taste test to date. Among the three, Warren seemed to make the most of it. She had the freshest energy on stage, and she is getting better at pressing a point. Her share of the airtime this week was nearly 17 minutes--second to Biden, but only by a few seconds. And she was showing passion on a range of outrages rather than intellectual irritation at the way things are. She also responded to questions and to the answers of her rivals with apparent spontaneity--even when she is recycling what may be a practiced response. Most observers gave Biden, the putative front-runner, middling marks. For some, he was just OK, a left-handed compliment at best. For others, he was good enough, which isn't much better. All seemed to agree he wasn't bad. It's hard to know how Biden, soon to be 77, would look to the Democratic electorate based solely on this debate performance, given how long he's been around. Even more of a factor is the defensiveness many Democrats feel about the guy they still think has the best chance of beating President <mark>Trump</mark>. But more of that in a moment. Sanders, who is already 77, came across as every bit his age and just as irascible as he was at just 73 and challenging Hillary Clinton for the last presidential nomination. He once again made a strong case for the national health care system he calls \"Medicare for All\" --a concept that now gets at least lip service from many of his rivals, as well as pushback from a few. Even though Sanders' goal is to make the famous health program available to everybody, it is for now still primarily associated with old folks. It's likely to be the Democratic Party vehicle for getting to national health care, sooner or later, so it could use---- and likely will have--more age-appropriate champions. Still, it was Biden's age that was called into question in this debate, when he had talked about who would qualify under his amendments to Obamacare. Julián Castro, at one end of the stage, objected to what sounded like Biden contradicting himself. When Biden interrupted with a denial, Castro fired back, \"Are you forgetting already what you said just 2 minutes ago?\" Without that word \"already,\" that question might have stood on its own. Instead, it seemed a shot at Biden's age and past lapses of memory. The audience reacted with a mix of groans and applause. They took it as a shot, and it played as such endlessly on broadcast highlights and in panel post mortems. Castro may have been the victim of his own need to distinguish himself from the pack, a problem shared by all but the three candidates at center stage. He was anchoring the end of the line-up because his polls and fundraising are barely meeting the criteria for inclusion. Also in endangered status was the candidate at the other far side of the stage, Minnesota Sen. Amy Klobuchar, who continues to emphasize her \"middle of the country\" roots and middle of the road positions. Her focus on the middle surely includes the early-caucus state of Iowa, her neighbor to the south, where she needs a break out showing. Just inside from the two ends onstage were two candidates who were expected to make more noise than either has to date: one was Cory Booker, the senator from New Jersey, a tall and commanding figure who got the night's best laugh and said many eloquent things on gun violence and the status of his fellow black Americans. The Booker campaign professes to be unworried, but it is hard to fathom why Booker has not broken through in the early states or the national polls. The same might be said of Beto O'Rourke, the former congressman from El Paso whose campaign has drawn new impetus from last month's massacre in that city. O'Rourke was saluted by his rivals for his strong stance, and he had a viral moment saying: \"Hell yes we're going to take your AR-15, your AK-47,\" referring to the military-style weapons used in many recent mass shootings. That promise, however, does not reflect the position of most of the other candidates, or of the Democratic caucus in the House or the Senate. Moving in toward the centerpiece trio one found Mayor Pete Buttigieg of South Bend, Ind.,, who used every chance he got to insert thoughtful answers with a fine-chiseled edge. He used his closing remarks to say how much it had meant to his life to come out as gay and marry his husband. The fact that his age, 37, may be more of a weight for his candidacy than his sexuality is one measure of how life in America has changed. In mirroring status across the stage stood <mark>Andrew Yang</mark>, a young entrepreneur making a splash with younger voters and casting a wider net with ideas for guaranteed federal income payments (in lieu of other programs) and 100 Democracy Dollars to supplant lobbyists' actual dollars. Which leaves us with Kamala Harris the one candidate who stood aside from the threesome at center-stage but was not part of the trio on either wing. The California senator tried a good-natured jab at Biden regarding his oft-repeated ties to President Obama. It worked in its way, especially with the crowd at Texas Southern University, a historically black school. But it didn't have nearly the bite of her June debate challenge to Biden for his opposition to busing for school integration in the 1970s. One thing Harris succeeded in doing was returning the debate, again and again, to the subject of <mark>Donald Trump</mark>. One after another, the candidates would acknowledge that beating <mark>Trump</mark> was everyone's ultimate goal, an existential necessity for the party and the over-arching unifying element in this contest. Sen. Kamala Harris, tech entrepreneur <mark>Andrew Yang</mark> and former Texas Rep. Beto O'Rourke participate in the third Democratic primary debate on Thursday night. Robyn Beck / AFP/Getty Images Yet, curiously, not one candidate mentioned the impeachment debate currently raging within the House of Representatives, where most Democrats now want a formal impeachment proceeding but Speaker Nancy Pelosi does not--at least yet. Neither did anyone in the debate mention the recession jitters that polls show many Americans feeling, if only because the length of the current expansion and indications it may be ending. That's important, because recessions beat incumbent presidents more often than the opposing party's nominee does. No incumbent lost between the Depression election of 1932 and 1976, when Democrat <mark>Jimmy Carter</mark> talked of an \"economic misery index\" in ousting Republican Gerald Ford. That same index was even worse when Ronald Reagan ousted <mark>Carter</mark> four years later. George H. W. Bush also lost as an incumbent in 1992, the victim of a brief recession and an independent candidate (Ross Perot) who got 19% of the popular vote. Since then, three incumbent presidents have been re-elected and none has lost, despite the efforts of well-known, well-financed and party-backed challengers (Robert Dole, <mark>John Kerry</mark> and Mitt Romney). That is largely why polls taken this week by CNN and by NPR/PBS NewsHour/Marist found a plurality of Americans expect <mark>Trump</mark> to win a second term, even though far fewer think he deserves it. <mark>Trump</mark>'s approval number is now among the lowest ever for presidents after 20 months in office. But some have come back from comparable low points, including Obama and Reagan (who came back to win 49 states). It's going to take more than good debate performances, and more than winning the nomination, for one of these Democratic contenders to defeat this incumbent. Only bad economics, or the actions of the incumbent himself, are likely to accomplish that. But to make themselves attractive as a reasonable option, the Democrats need to present coherent, clear alternatives in policy and persona. This week's debate was at least a longer step in that direction. Copyright 2019 NPR. To see more, visit https: //www.npr.org. Share Tweet Email View the discussion thread.", "articleID": "2019091411_00138438_W", "names": {"Andrew Yang": ["Q11118258", "Q28723576"], "Donald Trump": ["Q22686", "Q27947481"], "Jimmy Carter": ["Q23685", "Q6199776"], "John Kerry": ["Q22316", "Q6242998"]}}, {"date": "2019-09-15", "url": "http://iwcp.co.uk/sport/national/17903695.tyson-fury-beats-otto-wallin-unanimous-decision-despite-deep-cuts/", "content": "Tyson Fury beats Otto Wallin by unanimous decision despite deep cuts By Press Association 2019 Tyson Fury 0 comment Tyson Fury had planned to celebrate his victory over Otto Wallin with a night out on the famous Las Vegas Strip but instead spent it in hospital after coming through a bloody 12-round battle. The 31-year-old former world heavyweight champion was taken to the University Medical Center of South Nevada with a gaping gash over his right eye and another smaller one on the eyelid immediately after his unanimous points decision win. It was not the end to the night--or the fight--Fury envisaged against the relatively-unknown Wallin, making a significant step up after 20 previous unbeaten bouts. Tyson Fury arrives in the arena before fighting Otto Wallin (Isaac Brekken/AP) The Mancunian, wearing a sombrero and poncho, played to the \"home' crowd on Mexican Independence Day weekend by making his way to the ring on a wheeled platform accompanied by a mariachi band and stilt walkers waving red, white and green flags. It was virtually the best the T-Mobile Arena saw of Fury as he was hampered by blood running into his eye for nine rounds, boxing with the fear he could be stopped at any moment and with it would go his 30-fight unbeaten record as the cut was not caused by a clash of heads .\" I got caught on the eye and that changed the fight. For the majority I could not see out of the eye. Then there was a clash of heads and I got cut again, \"Fury, who finished the fight with his white shorts stained pink, said just before he was taken away to be stitched up, missing his post-fight press conference .\" I haven't seen the cut, it feels quite bad, but I'm the Gypsy Warrior. It's all heart and determination. If I can keep going, I will keep going. \"The fight was a stop-gap before an expected rematch against Deontay Wilder after the pair's controversial draw last December. Tyson Fury was badly cut in the third round (Isaac Brekken/AP) And although it did not go exactly to plan Fury is confident there will be plenty of recovery time ahead of an anticipated February meeting .\" Deontay Wilder, I want you next, bum. That's put me in good stead for the big dosser, February 22nd, \"he added. Asked about his immediate plans he said:\" Let the cut heal, have some time to relax with the family. \"Referee Tony Week called in the doctor towards the end of the sixth round and made several trips to Fury's corner to ask them to deal with the cut, their response being to smear it in huge blobs of Vaseline and hope for the best. It was a tactic which did not appear to have any sustainability as the grease immediately dropped off and Fury was forced to continually wipe away the blood. Well that was overblown--and suitably @ Tyson_Fury - esque pic.twitter.com/gNHPCq7aJ4--Carl Markham (@ carlmarkham) September 15, 2019 Fury knew he had to try to finish it quickly and landed two big right-handers in the seventh, one which rocked Wallin back onto the ropes, and more punches found their target in the next two rounds as his opponent looked to be tiring. Wallin gave it one final shot, connecting with one swinging left early in the last round, but it was not enough to prevent Fury claiming a unanimous 116-112, 117-111, 118-110 victory .\" Tyson is OK. We all know Tyson has the boxing ability and skill set but sometimes you have to be able to fight as well and Tyson was able to show he could do that, \"said Fury's trainer Ben Davison in the fighter's absence for media duties. . @ Tyson_Fury showed true grit to dig deep and win after a terrible cut to the eye. Heart of a Champion. Fair play to Otto Wallin who came to win. The Tyson Fury Roadshow rolls on! pic.twitter.com/tJXus6BLeZ--<mark>Frank Warren</mark> (@ frankwarren_tv) September 15, 2019 Wallin admits he targeted Fury's eye but could not find the decisive blow .\" I tried to stay on it and I wish I could have capitalised more, \"said the Swede, who lost his father to a heart attack in May .\" Earlier in the evening Morecambe's Isaac Lowe successfully defended his WBC international featherweight title, extending his unbeaten record, after a hard-fought points win over Ruben Garcia Hernandez. 0 comment", "articleID": "2019091508_00122158_W", "names": {"Frank Warren": ["Q1444412", "Q23657144", "Q5490233"]}}, {"date": "2019-09-16", "url": "https://pittsburgh.cbslocal.com/2019/09/16/ups-hiring-for-the-holidays-770-workers-needed-in-new-stanton/", "content": "Filed Under: Jobs, Local News, Local TV, Seasonal Jobs, UPS, Work PITTSBURGH (KDKA)--UPS is hiring for the holidays. More than 770 people are needed in the New Stanton area. They will be among the 100,000 seasonal workers UPS will be hiring across the country this holiday season. \"We expect another record peak season this year, with daily package deliveries nearly doubling compared to our average of 20 million per day,\" said <mark>Jim Barber</mark>, chief operating officer in a press release. \"In order to make that happen, once again we're recruiting more than 100,000 people for some of the country's best seasonal jobs .\" The local positions are a combination of seasonal and permanent jobs, including: • 400 package handlers", "articleID": "2019091620_00173836_W", "names": {"Jim Barber": ["Q6129350", "Q6193534"]}}, {"date": "2019-09-17", "url": "https://www.dnaindia.com/cricket/report-rohit-sharma-is-wonderful-in-limited-overs-no-reason-why-he-cannot-succeed-in-tests-batting-coach-vikram-rathore-2790421", "content": "Cricket <mark>Rohit Sharma</mark> is wonderful in limited-overs, no reason why he cannot succeed in Tests: Batting coach Vikram Rathore As India and South Africa get ready to lock horns in the second T20I of the three-match series, Men in Blue batting coach Vikram Rathore lauded opener <mark>Rohit Sharma</mark> and said there is no reason why the batsman cannot succeed in Test cricket. Vikram Rathore and <mark>Rohit Sharma</mark> Share ANI Updated: Sep 17, 2019, 02:51 PM IST As India and South Africa get ready to lock horns in the second T20I of the three-match series, Men in Blue batting coach Vikram Rathore lauded opener <mark>Rohit Sharma</mark> and said there is no reason why the batsman cannot succeed in Test cricket. \"I think he is too good a player to not be playing in any team. Everybody in the side echoes this opinion. He is a wonderful opening batsman in the limited-overs format, so there is no reason why he cannot be successful in Test matches. If he gets his gameplan right, he can be a great asset to the team,\" Rathore told reporters. Rathore was recently appointed as the new batting coach of the team and he succeeded Sanjay Bangar in the role. The new coach said that the interaction with the team has been good, and he will adjust to working in the setup. \"The interaction with the team has been good. I have been in this profession for a long time, I have interacted with almost all the players. Nothing too tough, it will take me some time to adjust in the setup of team India but I will manage. The batting coach also said that the team is lucky to have so many all-rounders in the squad. He even praised Manish Pandey and Shreyas Iyer, however, he asked the duo to keep working on their consistency .\" Everyone needs to take their opportunities. Everyone has played a good number of matches. The entire team is backing them and I am sure we continue to back them up, they will produce good results, \"Rathore said .\" We are fortunate to have so many all-rounders in the T20 format. Manish and Shreyas are two fine cricketers. Manish has done well in the past and Shreyas had a successful tour to West Indies. They just need to be consistent, \"he added. Rishabh Pant who has been often criticised for playing reckless shots, got the backing of the new batting coach but Rathore said that the players in the side need to understand the difference between fearless cricket and careless cricket .\" All young cricketers need to understand the difference between fearless cricket and careless cricket. The team wants everyone to play without fear. We want Rishabh to play all his shots as it makes him special. But you do not want any batsman to be careless and reckless, \"Rathore said. The first match between India and South Africa was abandoned due to rain. India's squad for three T20Is includes Virat Kohli (Captain), <mark>Rohit Sharma</mark> (vice-captain), Shikhar Dhawan, KL Rahul, Shreyas Iyer, Manish Pandey, Rishabh Pant (wicket-keeper), Hardik Pandya, Ravindra Jadeja, Krunal Pandya, Washington Sundar, Rahul Chahar, Khaleel Ahmed, Deepak Chahar, and Navdeep Saini. India takes on Proteas in the second match tomorrow at Mohali.", "articleID": "2019091712_00109715_W", "names": {"Rohit Sharma": ["Q21622845", "Q21622847", "Q26436595", "Q26837282", "Q30122003", "Q3520045", "Q58049760"]}}, {"date": "2019-09-20", "url": "http://heraldseries.co.uk/sport/17914626.rob-dickie-warns-oxford-united-ahead-first-return-lincoln-city/", "content": "Sport Rob Dickie warns Oxford United ahead of his first return to Lincoln City By <mark>David Pritchard</mark> @ OxfordMailOUFC Chief Sports Reporter covering Oxford United. Follow us on twitter: @ oxfordmailoufc. Call me on 01865 425458 Rob Dickie played for Lincoln City on loan before joining Oxford United in January 2018 Picture: <mark>David Fleming</mark> 0 comment ROB Dickie knows exactly what to expect when Oxford United attempt to complete a busy week on a high with victory at Lincoln City. The centre back spent half a season with the Imps on loan before signing for the U's in 2018. It gave him a good idea of the approach instilled by the management team of Danny and Nicky Cowley. And while the highly-rated pair have moved on to Huddersfield Town, caretaker boss Jamie McCombe was also part of the coaching staff during Dickie's tenure. He said: \"The Cowleys were so competitive and just wanted winners in the club .\" Although they've recently left I know they would have signed very competitive players with a winning mentality. Also read: Oxford United trio return to training today ahead of Lincoln City trip \"Jamie McCombe is taking care of them for now and he worked very closely with them .\" I'm sure he'll be using the same messages they were. I know they will be on it and it will be a very competitive team. \"They like to use their fans as the 12th man and their set pieces are definitely a threat we'll look at .\" It will be a very difficult task for us, but one we're definitely up to. \"Former U's boss Michael Appleton remains the overwhelming favourite to take over, but McCombe said yesterday he was expecting to be in charge for tomorrow's clash. Dickie has been one of United's best performers this season. But their 17th place in the Sky Bet League One table means the 23-year-old cannot take much pleasure. He said:\" I don't think I'll ever be satisfied. \"I'm happy with how it started, but I'm not happy with the results. Also read: Clean sheets give Oxford United a platform, says boss Karl Robinson\" I think we have a team that should be pushing up the other end of the table and hopefully we can start doing that on Saturday. \"We won last weekend and drew in the week, so if we win it will be a really good week and get us some momentum .\" Lincoln started their return to Sky Bet League One in fine form, but one win from their last six games has stalled progress. United would move to within a point of their hosts if they can claim a first away success of the campaign. And after a goalless draw at Bolton Wanderers on Tuesday, the visitors will be hungry to deliver. Dickie said: \"You can go into games sometimes feeling too comfortable if you're on the back of two good results .\" We take things from every game into the next one to make us stronger. \"0 comment", "articleID": "2019092005_00005976_W", "names": {"David Fleming": ["Q16104660", "Q19325352", "Q25313938", "Q5233686"], "David Pritchard": ["Q10264436", "Q245816", "Q5238723"]}}]