[{"date": "2019-09-20", "url": "http://www.northwaleschronicle.co.uk/sport/national/17915933.manchester-united-boss-solskjaer-relaxed-rashfords-lack-goals/", "content": "Manchester United boss Solskjaer relaxed over Rashford's lack of goals By Press Association 2019 Manchester United v FC Astana--UEFA Europa League--Group L--Old Trafford 0 comment Ole Gunnar Solskjaer is not concerned by Marcus Rashford's recent lack of goals due to the Manchester United forward's hunger and determination to improve. Mason Greenwood saved his team-mates' blushes on Thursday night as the teenager secured an unconvincing 1-0 win against Astana in the Red Devils' Europa League opener. Things could have been so different had United capitalised on their bright start, with Rashford guilty of missing a number of opportunities against the champions of Kazakhstan. Important win to get us up and running. Refocus now for the weekend?? ⚪ ️ pic.twitter.com/t2bDVeRbFf--Marcus Rashford (@ MarcusRashford) September 19, 2019 Solskjaer has spoken of his desire for the 21-year-old to score more scrappy goals but is not worried by the fact that the academy graduate has netted just once from open play in eight appearances for club and country this season. \"He's getting the chances,\" the United boss said of Rashford, who scored two spot-kicks this term. \"Of course he could have had three today. The keeper made a few fantastic saves .\" I don't worry about that, no. Manchester United manager Ole Gunnar Solskjaer is not concerned about Rashford's form (Martin Rickett/PA) \"We're working every single day in training with Marcus. He wants to improve, wants to be better .\" He could've finished with his left instead of his right today. It's just one of those days. I thought their keeper was excellent. \"Asked if United need more goals from Rashford and fellow forward Anthony Martial, he said:\" All the goals we've scored have come from the forwards with Marcus and Anthony, and Dan James. I'm sure they'll chip in with many, many goals. \"He is still young, he'll improve. You won't hit your peak as a striker until you're 26 or 27. 3 points is what matters. Preparation for Sunday starts now. ❤ ️???? #mufc pic.twitter.com/x2mNO0PvF5--<mark>Harry Maguire</mark> (@ HarryMaguire93) September 19, 2019\" He's still learning what finishes to make in different circumstances. \"Martial will be unable to add to his tally at West Ham this weekend as Solskjaer expects the forward to miss the trip to the capital along with Paul Pogba and Luke Shaw. United could also be without Welsh flyer James, who missed the match against Astana with a knock sustained in the victory against Leicester .\" I don't know, \"Solskjaer said .\" He's not trained the last few days. Hopefully, but not sure. \"We'll have a recovery day with everyone tomorrow and we'll see on Saturday .\" A solid performance from Axel?? Here's his post-match verdict on a tight #UEL encounter. #MUFC #MUTV pic.twitter.com/Ew1HqNM889--Manchester United (@ ManUtd) September 19, 2019 Solskjaer said the likes of Axel Tuanzebe and Fred are knocking on the door to be in the starting line-up on Sunday, as is 17-year-old Greenwood after his display against Astana. \"It's always hard to keep players who perform well out of the team,\" the 46-year-old said. \"I remember when I came in here...and if he keeps scoring goals, he'll play .\" If he keeps scoring goals when he's on the pitch he'll get more minutes in the Premier League as well and he'll get his first start soon. \"A big night for @ NemanjaMatic...First tweet ✔ ️ First time as captain ✔ ️ Let's hear from the #MUFC midfielder?? https: //t.co/rk5LYYraHc pic.twitter.com/ftAE7GPNbs--Manchester United (@ ManUtd) September 19, 2019 United will be desperately hoping this trip to West Ham goes better than the one last September, when Jose Mourinho's side were soundly beaten 3-1 at the London Stadium. Paul Pogba's brace helped Solskjaer's side win the reverse fixture 2-1 in April and the Norwegian has underlined the importance of keeping the Hammers out this time around. United's porous defence has been their undoing during their rocky patch under the Norwegian, but he is not concerned by the winless away run that stretches back to the jaw-dropping victory at Paris St Germain in March .\" Why should we as coaches be concerned? We're looking forward to things, looking for solutions, \"Solskjaer said. Presenting our youngest-ever goalscorer in European competition: Mason Greenwood?? This is what it means to him! #MUFC #UEL pic.twitter.com/WKvWKLbMkf--Manchester United (@ ManUtd) September 19, 2019\" I've never been concerned about anything, really. I don't walk around and worry about things. Not at all. \"I'm looking what we can do to improve. I've never been a worrier .\" I think we should've won at Southampton, I think we should've won the Wolverhampton one. Both should be wins. \"It's still the same size pitch, green with white lines, some fans. You've got to block out the mental part and play as you would in the park .\" 0 comment", "articleID": "2019092009_00141104_W", "names": {"Harry Maguire": ["Q165772", "Q5670856"]}}, {"date": "2019-09-20", "url": "http://www.democracynow.org/2019/9/20/headlines", "content": "Students Across the World Walk Out of Classes in Global Climate Strike Sep 20, 2019 Students across the world are walking out of class today in a global climate strike. Some of the first strikes occurred in Australia, where an estimated 300,000 people took part in rallies across the country. Participants include Gina Hale, a student in Brisbane. Gina Hale: \"In school, I am learning about the effects of climate change, and I'm learning that we need to do something. Yet I'm seeing that the people in charge and the people who are running our country aren't doing anything. To me, this is confusing. So I'm here today to step up and say,\" No more .' \"In Thailand, hundreds of young people staged a die-in at the environmental ministry, demanding government action on climate change. Here in New York, the 16-year-old Swedish climate activist Greta Thunberg, who inspired the movement, will take part in a large march this afternoon. Meanwhile, workers at Amazon, Microsoft and other large firms have also pledged to take part in today's strike. On Thursday, facing pressure from his own staff, Amazon CEO Jeff Bezos vowed to make the world's largest retailer carbon-neutral by 2040 and to purchase 100,000 electric delivery vans. Two Die in Texas as Storm Dumps 40 Inches of Rain on Houston Area Sep 20, 2019 At least two people have died in Texas after Tropical Depression Imelda dumped more than 40 inches of rain on the Houston area over three days. It's being described as one of the worst freshwater floods in U.S. history. More than 1,000 people had to be rescued on Thursday from the fast-rising waters. The storm also forced Exxon to shut down its massive oil refinery in Beaumont. In some areas, the floodwaters rose higher than during Hurricane Harvey two years ago. Red Cross: 2 Million Need Humanitarian Aid Every Week Due to Climate Crisis Sep 20, 2019 The Red Cross has shed new light on the escalating climate crisis. The Red Cross says an average of 2 million people need humanitarian aid every week due to storms, droughts and floods, and the figure is expected to double in coming decades if governments fail to cut emissions. Bird Population in U.S. & Canada Dropped by Nearly 3 Billion Since 1970 Sep 20, 2019 A shocking new study has found the United States and Canada have lost nearly 3 billion birds since 1970, a 29% population drop. Researchers blamed numerous factors, including widespread habitat loss and the use of agricultural chemicals. Peter Marra of Georgetown University co-authored the report. Peter Marra:\" Birds are the quintessential ecosystem indicators. They are the canaries in the coal mine. When something's going wrong with birds, something's going wrong with the environment. It's just not healthy. And so, in this study, because we've seen so many declines across so many different types of birds, from warblers to thrushes to even house sparrows--these non-native species in urban areas are declining--that's not a good sign. That's an indication that something is really wrong with the environment. \"Benny Gantz Declares Victory, Rejects Overture from Netanyahu Sep 20, 2019 In news from the Middle East, Israel's former army chief Benny Gantz has declared victory over Israeli Prime Minister Benjamin Netanyahu after Monday's election. With 99% of the vote counted, Gantz's Blue and White party has two more parliamentary seats than Netanyahu's Likud party. Gantz has vowed to form what he called\" a broad liberal, unity government, \"and has rejected Netanyahu's call for a power-sharing agreement. Trudeau Apologizes Again as New Blackface Photos Emerge Sep 20, 2019 Canadian Prime Minister Justin Trudeau has apologized again for wearing black and brownface on a number of occasions. Over the past 48 hours, two photos and one video emerged of him wearing racist makeup as recently as 2001. The scandal is breaking just days after Trudeau launched his re-election bid ahead of next month's election. On Thursday, Trudeau said he could not rule out more photos coming to light. Prime Minister Justin Trudeau:\" The fact is, I didn't understand how hurtful this is to people who live with discrimination every single day. I have always acknowledged that I come from a place of privilege, but I now need to acknowledge that that comes with a massive blind spot. \"Canadian New Democratic leader Jagmeet Singh responded to the growing scandal. Jagmeet Singh:\" I can tell you that I am deeply troubled by what this means to Canada, that young kids are going to see not just one or two, but multiple images of the prime minister mocking their lived reality. This is so hurtful to so many Canadians. \"Funeral Held in Afghanistan After U.S. Drone Strike Killed 30 Civilians, Mostly Farmers Sep 20, 2019 In Afghanistan, funeral services were held Thursday after a U.S. drone strike killed at least 30 civilians. Many of the dead were farmers who were resting in the fields after harvesting pine nuts. At least 40 civilians were also injured in the drone strike. Local Afghan residents questioned why the U.S. would target innocent farmers. Ezatullah:\" These people had gone to the fields to work, and their wages were very low. Don't they, the Americans, see that these people are working and gathering pine nuts? Why do they attack workers? \"Kashmiris Sue Modi in U.S. Court as <mark>Trump</mark> Prepares to Appear with Indian PM at Texas Rally Sep 20, 2019 A pair of Kashmiri citizens have filed a lawsuit in the United States against Indian Prime Minister Narendra Modi for carrying out extrajudicial killings and other crimes in occupied Kashmir. The lawsuit was filed just days before Modi is scheduled to speak at a major rally called\" Howdy, Modi! \"in Houston, Texas, where he will be joined by President <mark>Trump</mark>. In other news on India, as many as 10 mass detention centers are being built in the northeast state of Assam. This comes just weeks after India stripped nearly 2 million residents of Assam of their citizenship. Report: Whistleblower Complaint Against <mark>Trump</mark> Focused on Phone Call with Ukrainian President Sep 20, 2019 More details are coming to light about a whistleblower complaint filed against President <mark>Trump</mark> by a U.S. intelligence official. The Washington Post reports the complaint centered on a conversation <mark>Trump</mark> had with the new president of Ukraine on July 25. <mark>Trump</mark>'s interaction with him reportedly included a\" promise \"that was regarded as so troubling that it prompted the unnamed official to file a complaint. The acting director of national intelligence has refused to provide the contents of the whistleblower complaint to the House Intelligence Committee despite being subpoenaed to do so. This comes as House Democrats are investigating whether <mark>Trump</mark> had urged Ukraine to reopen a probe of a Ukrainian company with ties to Joe Biden's son, Hunter. On Thursday night, <mark>Trump</mark>'s personal attorney Rudy Giuliani acknowledged on CNN that he had asked top Ukrainian officials to investigate Joe Biden. Colt to Stop Manufacturing Sporting Rifles, Including AR-15 Sep 20, 2019 The gun maker Colt has announced it is suspending the manufacturing of sporting rifles, including the AR-15, for the consumer market. Pressure has been growing on the Connecticut-based company for years, as AR-15-style guns have been used in numerous mass shootings, including Newtown, Connecticut; Orlando, Florida; and Parkland, Florida. Meanwhile, on Capitol Hill, Senate Majority Leader Mitch McConnell has said he is awaiting guidance from the White House as to what President <mark>Trump</mark> thinks he's comfortable signing regarding new gun control. Self-Described\" Antifa Hunter \"Arrested for Threatening Black Lives Matter Activist in Charlottesville Sep 20, 2019 A prominent white supremacist from Florida has been arrested for making racist and violent threats to the co-founder of Black Lives Matter in Charlottesville, Virginia, who was considering a run for Charlottesville City Council. The threats forced the activist, Don Gathers, to drop out of the race. The white supremacist, <mark>Daniel McMahon</mark>, has a long record of threatening violence against antiracists and anti-fascists. He once dubbed himself the\" antifa hunter. \"Several of his online posts were shared by the man who attacked the Tree of Life synagogue in Pittsburgh, killing 11 Jewish worshipers. Amnesty & HRW Urge Rejection of Torture Backer to Top State Dept.. Human Rights Post Sep 20, 2019 Amnesty International, Human Rights Watch and dozens of other groups are urging the U.S. Senate to reject the nomination of Marshall Billingslea for a top State Department post overseeing U.S. human rights policy. Billingslea openly supported the use of torture and harsh interrogation methods while working in the Pentagon during George W. Bush's administration. Betsy DeVos Threatens to Cut Funding to UNC & Duke for Middle East Studies Program Sep 20, 2019 The <mark>Trump</mark> administration is threatening to cut federal funding to a Middle East studies program run jointly by Duke University and the University of North Carolina at Chapel Hill. The U.S. Education Department recently wrote to the schools claiming its classes are unfairly promoting\" the positive aspects of Islam \"but not Christianity or Judaism. Education Secretary Betsy DeVos ordered a probe into the Middle East studies department after North Carolina Republican Congressmember George Holding accused the program of having a\" severe anti-Israeli bias and anti-Semitic rhetoric. \"Academic freedom advocates have criticized the <mark>Trump</mark> administration's actions. U.S. Expels Two Cuban Diplomats; Cuban Fuel Shortage Continues Sep 20, 2019 The United States has expelled two Cuban diplomats and placed tighter restrictions on everyone working at Cuba's United Nations mission. The State Department accused the diplomats of conducting\" activities harmful to U.S. national security, \"but provided no details on what they did. Cuban Foreign Minister Bruno Rodríguez said the move was\" categorically unjustified. \"Meanwhile, a severe fuel shortage in Cuba has entered its second week. The Cuban government says the crisis is a result of U.S. sanctions against Cuba and Venezuela. Former Tunisian Dictator Zine El Abidine Ben Ali Dies Sep 20, 2019 Former Tunisian dictator Zine El Abidine Ben Ali has died at the age of 83. He ruled Tunisia for 23 years before being ousted in 2011 during the protests that sparked the Arab Spring. New York Mayor Bill de Blasio Drops Out of 2020 Race Sep 20, 2019 New York Mayor Bill de Blasio has dropped out of the 2020 presidential race. De Blasio had campaigned to fight for working families, combat climate change and take on <mark>Donald Trump</mark>, but his campaign never gained steam. The original content of this program is licensed under a Creative Commons Attribution-Noncommercial-No Derivative Works 3.0 United States License. Please attribute legal copies of this work to democracynow.org. Some of the work (s) that this program incorporates, however, may be separately licensed. For further information or additional permissions, contact us. Daily News Digest", "articleID": "2019092015_00004973_W", "names": {"Daniel Mcmahon": ["Q41706481", "Q5218123"], "Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-09-20", "url": "http://feeds.breakingnews.ie/~r/bntopstories/~3/eS5z2Bjw0js/premier-league-footballer-blackmail-trial-messages-between-defendants-revealed-952035.html", "content": "Premier League footballer blackmail trial: Messages between defendants revealed 20/09/2019 - 15:38:00 Back to Court case World Home By Press Association A former Take Me Out contestant sent a message stating that a Premier League footballer's \"days are numbered\" before allegedly blackmailing him, a court in England heard. The player, who cannot be named for legal reasons, jumped out of a hotel room wearing only his underwear after being filmed with a woman who was not his partner. He had previously met Natalie Wood, 28, on two occasions after contacting her on social media and arranged to meet her for a third time last year. Wood, along with three men, allegedly hatched a plot to blackmail the sportsman by filming \"incriminating\" footage of him in bed with her. Bristol Crown Court has heard the plan was formed after Wood revealed her liaisons with the footballer to former Take Me Out contestant Tyrone Coleman, 34. <mark>Simon Jones</mark>, prosecuting, told jurors that messages between the defendants, and Wood and the player, had been examined by police as part of the investigation. In one voice message sent before the incident, Rowe told Tyrone Coleman: \"...been plotting this for too long to be taken out of the equation\". Coleman replied: \"[The footballer's] days are numbered. It is what it is fam. The dirty **** .\" Other messages between Rowe and Coleman included advice for Wood to be flirty in messages to the footballer, to \"keep him enticed and draw him in\". Rowe suggested that Wood, of Cleethorpes, should \"play it smooth--make him want this now\". She sent the player a number of \"provocative\" messages ahead of their meeting, <mark>Simon Jones</mark>, prosecuting, said. \"The picture that is really building here is how carefully managed all of this is--it is all a sting,\" Mr <mark>Jones</mark> told the jury. In one message, Wood told Tyrone Coleman: \"Something I'm hella nervous about. What other girl would be willing to do this for you? As well as it benefits all of us I know .\" READ MORE Lenny Henry tells audience: I am Justin Trudeau Coleman sent a screenshot of messages between Wood and the player--discussing football training and the cost of their hotel room--to Rowe. The player previously told how he and Wood had exchanged \"general chit chat\" on social media before meeting at a hotel. He would transfer money to Wood, who would pay for the hotel room and check in before he arrived--sending him the room number in a message. On the final occasion, the player said Wood seemed \"nervous\" and was using her mobile phone, which was odd as they were \"only going there for one thing\". \"All of a sudden, two guys just walked into the room,\" he told jurors. \"One of the guys said something like:\" Is this what you are doing?'. It happened so quickly. It seemed so staged. \"I managed to get out of the window without without thinking how high up it was .\" The footballer took hold of a fire escape and was able to run down to a car park before fleeing into a nearby restaurant, where he took shelter until police arrived. His designer tracksuit and Rolex watch, which he had taken off in the room, were missing when officers went to it. Rowe was found to be wearing the tracksuit when he was arrested days later, awaiting a flight to Dubai. The watch was on the wrist of Ras Robinson, 37, who was charged with handling stolen goods. After leaving the hotel, the footballer received a message from Wood's phone, stating that he had been in the \"wrong place at the wrong time\" and telling him to contact a number. \"I don't really want to expose you to the media but if you don't respond within 24 hours then you leave me no choice,\" it said. When asked about the message, the footballer told jurors: \"Obviously it is blackmail .\" That's what they wanted to do--to get footage of me and take it to the papers. \"Wood, who has admitted conspiracy to blackmail, said she took part in the plot after discovering that the footballer had a partner .\" I had previously asked him if he did have a partner and he would always shrug it off and say why was I asking if he was single, \"she said .\" I wanted his girlfriend to know that he had been cheating because it is not fair, it's not right. \"She claimed the plan was for the footballer to be filmed in bed with her, then confronted by Rowe and Coleman, who would ask him for money .\" He was kissing me, he started to take his boxers down, \"Wood told the court .\" The key in the door went and Prince and Nathan came in the room. \"READ MORE Emiliano Sala's sister calls pair\" wicked' for accessing mortuary footage She said it did not go to plan as the footballer \"jumped out of the window\" before Rowe and Coleman could speak to him. Nathan Coleman, of Sussex, denies conspiracy to blackmail and two counts of thefts relating to the Rolex watch and designer tracksuit. His brother Tyrone Coleman, of Birmingham, denies conspiracy to blackmail. Prince Rowe, of Birmingham, denies conspiracy to blackmail and two counts of theft. Ras Robinson denies a charge of handling stolen goods relating to the watch. The trial will continue on Monday. - Press Association", "articleID": "2019092015_00093864_W", "names": {"Simon Jones": ["Q10548323", "Q181664", "Q325070", "Q42926431", "Q47435289", "Q54483127", "Q57263285", "Q7519069", "Q9337052"]}}, {"date": "2019-09-20", "url": "http://www.bordercountiesadvertizer.co.uk/news/national/17917528.jeremy-corbyn-rules-coalition-event-hung-parliament/", "content": "Jeremy Corbyn rules out coalition in event of hung parliament By Press Association 2019 Labour 0 comment Labour will not enter into coalition government with other opposition parties if it is unable to win an overall majority at the next general election, Jeremy Corbyn has said. On the eve of the party's annual conference in Brighton, the Labour leader said they would look to force an election once it was clear a no-deal Brexit was off the table. However in a round of ITV regional news interviews, he said if there was a hung parliament and they were unable to achieve an overall majority, Labour would seek to govern as a minority government. Labour leader Jeremy Corbyn said he would not be part of a coalition (Gareth Fuller/PA) \"We would go into government with whatever election result was. I am not doing deals. I am not doing coalitions,\" he told UTV. Mr Corbyn rejected the idea that Labour could offer the SNP a second referendum on Scottish independence in order to win its support at Westminster. At the same time however, he refused to rule out a further public vote later in the parliament if there was a demand for one in Scotland. \"It is not our priority. It is not what I want, it is not what I support,\" he told Border TV. \"But if after some years in government there is a demand, then in terms of the devolution settlement we will look at it at that time .\" Speaking on STV, he added: \"Obviously in the longer run, if a request is made...I am not going to be the one who stands in the way of that .\" His comments came after shadow chancellor <mark>John McDonnell</mark> sparked a furious row over the summer when he suggested a Labour government would not stand in the way of a referendum if there was support for one in the Scottish Parliament. The leader of Scottish Labour, <mark>Richard Leonard</mark>, said at the time the 2014 referendum had been a \"once-in-a-generation vote\" and that the Scottish people did not want to go through a second independence poll. Mr Corbyn said that he would press for a general election once it was clear that Boris Johnson could not force through a no-deal Brexit against the wishes of Parliament. \"When the Prime Minister abides by the law which Parliament has passed which requires him if he cannot get a deal to apply for an extension, I think that is the time,\" he told ITV Anglia. \"What we won't do is to fall into some trap created by Boris Johnson which would lead us into a no-deal Brexit with all the chaos that would bring .\" Mr Corbyn defended his position of seeking to negotiate a new Brexit deal with Brussels and then putting it to the public in a referendum along with the option to remain in the EU, without coming down on either side. He rejected criticism that his policy was a \"muddle\" and that he was failing to offer leadership on an issue of crucial national importance. \"I am not sitting on the fence,\" he told YTV. \"I think leadership comes from listening. I think leadership comes from asking people to look at the realities of the situation .\" It is not a muddled position. It is a position that takes the issue seriously. \"Speaking on Tyne Tees, he added:\" We need a democratic mandate from the people. What I will be campaigning for is to make sure the British people have that decision. \"0 comment", "articleID": "2019092017_00037491_W", "names": {"John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "Richard Leonard": ["Q24039896", "Q50365677", "Q7327335"]}}, {"date": "2019-09-21", "url": "https://www.news965.com/news/national/florida-police-detective-resigns-after-making-mass-shooting-threat/Kp1oz47RuJZvi5WRT1JDgN/", "content": "Florida police detective resigns after making mass shooting threat Photo Credit: Tarpon Springs Police Department A Tarpon Springs police detective resigned after making comments about a mass shooting. Florida police detective resigns after making mass shooting threat By: Bob D’Angelo, Cox Media Group National Content Desk Published: September 21 2019 3:52 AM Photo Credit: Tarpon Springs Police Department A Florida police detective said he was \"only joking\" last month when he told a fellow officer there would be an \"active shooter situation\" at police headquarters if he did not receive an assignment he wanted .>> Read more trending news The officer said the Aug. 5 comment \"made the hairs on the back of his neck stand up .\" Now, detective Steve Bergren of the Tarpon Springs Police Department is without a job as he resigned Thursday before police Chief Robert Kochen could fire him, the Tampa Bay Times reported. A Tarpon Springs detective resigned after threatening a mass shooting at police HQ. He says he was joking. But Tarpon Springs' police chief was about to fire him. https: //t.co/LUs778XURt--Tampa Bay Times (@ TB_Times) September 21, 2019 Bergren, an 11-year veteran of the police department, wrote a letter to the police chief to say he was only joking, the newspaper reported. \"In his letter he says it was in jest, but in hindsight it was ill-advised,\" Tarpon Springs Police Maj. Jeffrey Young told the Times. \"In today's society you just can't say something like that and not be held accountable for it .\" In his letter, Bergren apologized for his comment. \"During the course of this conversation, I made a statement in jest referencing an active shooter,\" Bergren wrote. \"I never imagined when the statement was made that it would be perceived...as a potential threat to our shared workplace .\" Bergren also wrote his \"attempt at humor\" was ill-advised. \"Read read\" I failed to appreciate how recent tragic events could lead to a statement referencing an active shooter being misperceived, \"he wrote, The name of the detective who heard Bergren's comment was not released by police officials. In a release, police officials said the officer did not believe Bergren was joking .\" The other detective said Bergren made this statement in a stoic manner and not giving any indication that this was a joke, \"officials told the Times. The internal investigation will be sent to the Florida Department of Law Enforcement's Standards Commission. Bergren could not be reached for comment Friday, the Times reported. His attorney with the Sun Coast Police Benevolent Association did not return a request for comment. Read More Two Lake Mary High students arrested for bringing weapons to school School leaders at Lake Mary High School in Seminole County say that two students have been arrested for reportedly brining weapons on school campus. According to a Seminole County Sheriff's Office incident report, 14 year old Curtis Leonard was called to the discipline office on Thursday for an unrelated incident. When he he opened his backpack, that's when an administrator noticed a gun and notified a deputy. Deputies say the chamber was loaded, but the gun was disassembled. Leonard now faces a felony charge of possession of a firearm of school property and was taken to the Juvenile Assessment Center. This is the second incident within the last year where a student managed to sneak a gun onto the campus. Following this incident, school leaders say another situation happened on Friday where students came forward and accused a 15 year old student of carrying a weapon on school grounds. They say 15 year old Bernard Blackmon was located with a 7 inch fishing knife and was arrested. The arrest report shows Blackmon has also been charged with possession of a weapon on school property. In response of these incidents, school leaders say that they are testing new technology as part of a pilot program which acts similar to metal detectors, but can be used in more places. They also want to remind students to report any suspicious activities by calling the SpeakOut hotline at 800-423-8477 or use their campus app .\" Take care of it': NC sheriff accused of plotting murder of deputy over tape of racist talk A North Carolina sheriff stands accused of urging the murder of a former deputy who had a recording of him using racially offensive language, authorities say. Granville County Sheriff Brindell Wilkins was indicted Monday on two counts of felony obstruction of justice, according to court records. Wilkins is accused of trying to get another man to kill former Deputy <mark>Joshua Freeman</mark>, who he believed was going to expose his racist talk .>> Read more trending news Wake County District Attorney Lorrin <mark>Freeman</mark>, who is prosecuting the case, said Wilkins' Aug. 12, 2014, phone conversation with the \"well-known' man who threatened <mark>Joshua Freeman</mark>'s life was caught on tape, according to The News & Observer in Raleigh. Lorrin <mark>Freeman</mark> and <mark>Joshua Freeman</mark> are not related. <mark>Joshua Freeman</mark> worked for the Sheriff's Office from November 2011 to August 2014 but was let go in the days leading up to Wilkins' alleged crimes, WRAL in Raleigh reported. Wilkins, who was reelected in 2018 for a third four-year term, is accused of advising the unnamed man to kill <mark>Joshua Freeman</mark>,\" whom the defendant knew to have expressed his intention to soon publicly reveal a purported audio recording of the sheriff using racially offensive language to authorities in Raleigh,' the indictment states. The court records do not detail what Wilkins is alleged to have said, or what ultimately happened to the recording of his words. The indictment against the sheriff alleges Wilkins encouraged the man to \"take care of it' and said,\" The only way you gonna stop him is kill him .' According to the indictment, Wilkins counseled the would-be gunman on how to kill <mark>Joshua Freeman</mark> in a way to avoid getting caught. He offered two tips, according to the document: Get rid of the murder weapon and keep quiet. \"You ain't got the weapon, you ain't got nothing to go on,' Wilkins allegedly told the man, the court records allege .\" The only way we find out these murder things is people talk. You can't tell nobody nothin', not a thing .' Wilkins and the individual discussed a time in which to kill <mark>Joshua Freeman</mark> and a location that would ensure it would be Wilkins' own Granville County Sheriff's Office investigators who would get the case, the indictment says. Wilkins assured the man he would not tell investigators of his prior knowledge of the crime. The indictment accuses Wilkins of failing to prevent harm to <mark>Joshua Freeman</mark> or warn him of the \"credible threat' to his life. It alleges the sheriff also failed to seize the gun the other man planned to use, despite the person showing him the weapon at one point .\" The defendant failed to properly execute his duties because of his personal animosity towards <mark>Joshua Freeman</mark>,' the indictment states. <mark>Joshua Freeman</mark> was never harmed, though the indictment offers no indication why the alleged plot failed. Wilkins went before a magistrate Monday and was released on $20,000 unsecured bond. Court records show he was ordered to have no contact with anyone named in the indictment. He was also ordered to surrender his passport, if he has one. Read the indictment against Granville County Sheriff Brindell Wilkins below. Brindell Wilkins Indictment by National Content Desk on Scribd \"No one is above the law,' Lorrin <mark>Freeman</mark> said Monday, according to WRAL .\" It is always painful when someone who has the public trust faces these types of allegations for voters who put them in that place. \"Any time you have someone who is sworn to uphold the public trust, to protect their community, to investigate and report crimes, allegedly engage in this type of conduct, it is something that needs to be brought to justice, and so we will continue to follow the evidence in this case .' Several followers of Wilkins' public Facebook page offered support in the wake of the indictment .\" You will always have our support,' one woman wrote. \"Praying for you and your family .'\" Our friendship goes back 30 years or more and you have always been a great friend to me,' another woman wrote. \"You were there for me many times. I believe in you and you have my support, always .' Lorrin <mark>Freeman</mark> said Wake County is handling the case because Mike Waters, her counterpart in Granville County, could potentially become an important witness at trial. Waters, who addressed the case in a statement on his office's Facebook page, wrote to Lorrin <mark>Freeman</mark> in November to ask her to look into the case. Watch Wake County DA Lorrin <mark>Freeman</mark> discuss the case below, courtesy of the News & Observer. WRAL reported that <mark>Joshua Freeman</mark>, who Waters represented in 2014 while in private practice, gave the future prosecutor the tape recording of Wilkins' conversation with the man who talked of killing the former deputy. It was not clear Friday how <mark>Freeman</mark> obtained the recording. Waters said he immediately turned the tape over to the FBI. The Washington Post reported that Waters met with North Carolina State Bureau of Investigation agents about the recording in January 2017, but nothing happened .\" Quite frankly, it did not get to the top of their investigative list,' Lorrin <mark>Freeman</mark> told WRAL about SBI agents. Waters gave the recording to a different SBI agent in October 2018, but still, no investigation was initiated, the Post reported. That is when Waters turned to Lorrin <mark>Freeman</mark> to initiate a probe into the sheriff. She agreed .' I have reviewed this recording,' Lorrin <mark>Freeman</mark> wrote to SBI agents, according to the Post. \"It contains a conversation between two individuals, one of whom appears to be the Granville County sheriff, about a former deputy sheriff and culminates in a discussion about committing a homicide .' In his Facebook statement, Waters expressed frustration at the amount of time it took to get an investigation going .\" At all times since (turning over the recording), I have provided assistance to investigators, and once Ms. <mark>Freeman</mark> opened a criminal investigation, have urged that this matter be given investigative priority,' Waters wrote .' I understand it is a matter of great importance to the people of Granville County, and it has been a point of frustration that the investigative process has not been more expeditious .' He wrote that any allegations of wrongdoing by law enforcement are troubling, particularly when they involve a sheriff elected by the community. \"Over the next few months, my office will continue to lend assistance to the ongoing investigation as requested, while we continue to do our daily work of protecting victims, prosecuting those who violate the law and seeing that justice is administered,' Waters said. WRAL reported Lorrin <mark>Freeman</mark> said she worked to obtain obstruction charges against Wilkins because obstruction would be easier to prove in the five-year old case than solicitation of murder or conspiracy. The Granville County Board of Commissioners met Tuesday to discuss the indictment, but County Attorney Jim Wrenn said the board has no authority to remove Wilkins, an elected official, from office as his criminal case winds its way through the court system, WRAL reported. Lorrin <mark>Freeman</mark> confirmed that fact to the News & Observer .\" Technically, he can continue to serve if he chooses, until convicted,' <mark>Freeman</mark> told the newspaper. Spectrum News' Charlotte bureau reported that Wilkins has indicated he will not step down. Wrenn said he is considering trying to get Wilkins out of office through the courts but wants to hear the recording himself before making that decision. Gerry Cohen, former special counsel to the North Carolina General Assembly, said state law has a provision allowing a judge to suspend a sheriff and allow a county commission to appoint a temporary replacement pending the outcome of a criminal case. \"The statute is there to allow removal of sheriff,' Cohen told Spectrum News .\" One of six causes is, in fact, conviction of felony. Others are some of the things in his indictment, like willful misconduct, corruption, willful neglect or refusal to perform duties of his office. Some of them match the charges in his indictment .' The News & Observer reported that the probe into Wilkins' alleged actions against <mark>Joshua Freeman</mark> has led to investigations of the Granville County Sheriff's Office's accounting practices, as well as the operations of its drug unit. <mark>Freeman</mark> was a member of the drug unit when he was with the agency. \"Part of this investigation has centered on why this sort of conversation would have occurred, what the underlying motivation would have been,' Lorrin <mark>Freeman</mark> said Tuesday, according to the newspaper .\" Additional information has come to light regarding operations and accounting practices of the Granville County narcotics interdiction team .' Those investigations remain ongoing. In response to whistleblower complaint, Biden asks <mark>Trump</mark> in statement to release call transcript President <mark>Donald Trump</mark> called reports that a U.S. intelligence official filed a whistleblower complaint against him last month' a ridiculous story' while speaking Friday to reporters in the Oval Office .>> Read more trending news According to the Washington Post, the president made an unspecified \"promise' to an unidentified foreign leader that concerned the intelligence official. The official filed a complaint Aug. 12, two anonymous former U.S. officials told the newspaper, though lawmakers said Thursday they had yet to see the complaint. The intelligence community's inspector general, <mark>Michael Atkinson</mark>, appeared before the House Intelligence Committee behind closed doors Thursday but declined, under administration orders, to reveal the substance of the complaint. Update 7:40 p.m. EDT Sept. 20: Former Vice President Joe Biden has released a statement on the whistleblower's complaint against President <mark>Trump</mark>. In it, Biden describes <mark>Trump</mark>'s alleged behavior as\" abhorrent' and calls on him to release a full transcript of the call \"so that the American people can be judged for themselves .' The entire statement reads: Update 4:40 p.m. EDT Sept 20: The Wall Street Journal reported Friday that <mark>Trump</mark> pressured Ukrainian President Volodymyr Zelensky to investigate the son of Democratic presidential hopeful Joe Biden, citing unidentified people familiar with the matter. The Journal reported <mark>Trump</mark> asked Zelensky to work with Rudy Giuliani to determine whether Biden\" worked to shield from investigation a Ukrainian gas company with ties to his son, Hunter Biden .' <mark>Trump</mark> made the request about eight times during a phone call in July, according to the Journal. <mark>Trump</mark> was asked Friday if be brought up Biden in the call with Zelenskiy, and he answered, \"It doesn't matter what I discussed .' But then he used the moment to urge the media\" to look into' Biden's background with Ukraine. <mark>Trump</mark> and Zelenskiy are to meet on the sidelines of the United Nations next week. Update 1 p.m. EDT Sept. 20: President <mark>Donald Trump</mark> told reporters Friday that the person behind the complaint filed against him was a \"partisan whistleblower' who\" shouldn't even have information,' though he added that he did not know the person's identity .' I don't even know exactly who you're talking about,' <mark>Trump</mark> said .' I don't know the identity of the whistleblower. I just hear it's a partisan person, meaning it comes out from another party .' <mark>Trump</mark> said Friday that he's spoken with several world leaders and that his conversations with them were \"always appropriate .' Details surrounding the complaint remained unclear Friday afternoon, though The Washington Post and The New York Times reported at least some of the allegations centered on Ukraine. Both newspapers cited unidentified sources. Asked if he knew if the whistleblower's complaint centered on a July 25 phone call with Ukrainian president Volodymyr Zelensky, the president responded' I really don't know' but continued to insist any phone call he made with a head of state was\" perfectly fine and respectful .' Update 9:50 p.m. EDT Sept. 19: The whistleblower complaint against <mark>Donald Trump</mark> centers around Ukraine, two anonymous sources confirmed to The Washington Post Thursday evening. The New York Times and ABC News are also citing anonymous sources, saying the complaint involves Ukraine. It's not clear exactly how Ukraine fits into the allegations. However, <mark>Trump</mark> spoke on the phone with Ukrainian President Volodymyr Zelensky two and a half weeks before the complaint was filed, the Post reported. That call was already under investigation by House Democrats, who are looking into whether <mark>Trump</mark> and his attorney, Rudy Giuliani, tried to manipulate the Ukrainian government into helping with <mark>Trump</mark>'s re-election campaign, according to The Post. Update 1:45 p.m. EDT Sept. 19: The chairman of the House Intelligence Committee suggested Thursday that lawmakers could ask a judge to compel White House officials to share with Congress a whistleblower complaint allegedly filed last month against <mark>Trump</mark>. The complaint was filed Aug. 12 and involved an undisclosed \"promise' made by the president to an unidentified foreign leader, CNN reported <mark>Atkinson</mark> declined to share details of the complaint during a closed meeting of the House Intelligence Committee on Thursday, citing a lack of authorization .\" We do know that the Department of Justice has been involved in the decision to withhold that information from Congress,' Schiff told reporters Thursday. \"We do not know--because we cannot get an answer to the question--about whether the White House is also involved in preventing this information from coming to Congress .' He said lawmakers had yet to see the complaint by Thursday afternoon .\" We do not know whether press reports are accurate or inaccurate about the contents of the complaint,' he said. Earlier Thursday, the president denied having done anything inappropriate. Update 1 p.m. EDT Sept. 19: <mark>Trump</mark> on Thursday denied any wrongdoing after reports claimed a whistleblower had come forward with a complaint about the president making an unspecified promise to a foreign leader. \"Another Fake News story out there - it never ends!' <mark>Trump</mark> wrote Thursday in a tweet .\" Virtually anytime I speak on the phone to a foreign leader, I understand that there may be many people listening from various U.S. agencies, not to mention those from the other country itself. \"Knowing all of this, is anybody dumb enough to believe that I would say something inappropriate with a foreign leader while on such a potentially\" heavily populated' call. I would only do what is right anyway, and only do good for the USA!' Original report: The promise occurred during a phone conversation with the leader, one source told the Post. Details about the alleged pledge and the leader's identity was not immediately available. Although <mark>Michael Atkinson</mark>, the intelligence community's inspector general, believed that the whistleblower complaint warranted \"urgent concern,' acting Director of National Intelligence Joseph Maguire so far has declined to provide information about the communication to the House Intelligence Committee, the Post reported. A closed hearing with <mark>Atkinson</mark> is slated for Thursday, the committee said. Maguire is expected to testify publicly Sept. 26, according to the committee's chairman, U.S. Rep. Adam Schiff, D-Calif. The Associated Press contributed to this report. Car crashes through mall in Illinois Police are responding to the Woodfield Mall after an SUV drove into a Sears and through the mall walkways. WGN is reporting that the driver is in custody. So far there have been no reports of injures. Video posted on Twitter shows a black SUV driving past a Forever 21, and people running away. Man dies after contracting EEE, officials in Massachusetts say A Massachusetts man in his 70s has died after contracting Eastern equine encephalitis, or EEE, state health officials said Friday .>> Read more trending news Authorities said the man was a resident of Freetown, a town about 50 miles south of Boston, according to WFXT .\" Our most sincere sympathy, thoughts and prayers go out to the victim, to their family and their loved ones,' town officials said in a news release. The man was identified as having the 10th confirmed human case of EEE in the state. Officials said eight other cases of EEE have been confirmed in animals, including seven horses and a goat. The man's death was the second reported in the state from EEE. At least two other EEE-related deaths have been reported in recent weeks in Rhode Island and Michigan. \"We continue to emphasize the need for people to protect themselves from mosquito bites,' Massachusetts Public Health Commissioner Monica Bharel said Friday in a news release .\" The unusually warm weather expected this weekend will increase outdoor activity among people and mosquitoes. It is absolutely essential that people take steps to avoid being bitten by a mosquito. \"Officials with the Centers for Disease Control and Prevention said several cases of EEE are reported each year, most often in states along the Gulf Coast. The mosquito-borne virus is rare, but serious, and can affect people of all ages, Massachusetts health officials said. Boston25News. com contributed to this report. 23 states sue over <mark>Trump</mark> plan to ease auto emission standards Led by California, almost two dozen states filed a federal lawsuit on Friday to stop the <mark>Trump</mark> Administration from revoking a waiver which has allowed California and other states to set tougher auto emission standards than required by the federal government .\" California won't bend to the President's reckless and politically motivated attacks on our clean car waiver, \"said California Governor Gavin Newsom, who has clashed with the President on a variety of policy fronts .\" The Administration insists on attacking the authority of California and other states to tackle air pollution and protect public health,' added California Attorney General Xavier Becerra. But under federal law, California had the right to ask for a waiver to permit tighter emission controls on new cars - and the state had been doing so for nearly 50 years. A number of others states had joined in accepting those same requirements. The <mark>Trump</mark> Administration argues there should only be a single national standard for emissions and gas mileage. The change by the feds \"will insure there is one - and only one - set of national fuel economy standards, as Congress mandated and intended,' said Transportation Secretary Elaine Chao on Thursday. The lawsuit can be seen here.", "articleID": "2019092107_00200196_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Joshua Freeman": ["Q26828374", "Q53843650", "Q6289820"], "Michael Atkinson": ["Q4072107", "Q56100159", "Q56878045", "Q6828294", "Q6828295"]}}, {"date": "2019-09-21", "url": "https://www.wkbn.com/news/national-world/trump-says-he-had-perfectly-fine-call-with-ukraine-leader/", "content": "Trump says he had \"perfectly fine' call with Ukraine leader Trump is defending himself against the intelligence official's complaint, asserting that it comes from a\" partisan whistleblower' by: By JONATHAN LEMIRE, <mark>MICHAEL</mark> BALSAMO and LISA MASCARO, Associated Press Posted: Sep 21, 2019 / 09:48 AM EDT / Updated: Sep 21, 2019 / 09:48 AM EDT WASHINGTON (AP)--President Donald Trump urged the new leader of Ukraine this summer to investigate the son of former Vice President Joe Biden, a person familiar with the matter said. Democrats condemned what they saw as a clear effort to damage a political rival, now at the center of an explosive whistleblower complaint against Trump. It was the latest revelation in an escalating controversy that has created a showdown between congressional Democrats and the Trump administration, which has refused to turn over the formal complaint by a national security official or even describe its contents. Trump is defending himself against the intelligence official's complaint, asserting that it comes from a \"partisan whistleblower,\" though the president also says he doesn't know who had made it. The complaint was based on a series of events, one of which was a July 25 call between Trump and Ukrainian President Volodymyr Zelenskiy, according to a two people familiar with the matter. The people were not authorized to discuss the issue by name and were granted anonymity. In a tweet Saturday, Trump referred to \"a perfectly fine and routine conversation I had\" with Ukraine's leader. \"Nothing was said that was in any way wrong .\" Trump, in that call, urged Zelenskiy to probe the activities of potential Democratic rival Biden's son Hunter, who worked for a Ukrainian gas company, according to one of the people, who was briefed on the call. Trump did not raise the issue of U.S. aid to Ukraine, indicating there was not an explicit quid pro quo, according to the person. In an interview with Ukrainian outlet Hromadske that was published Friday evening, Ukrainian Foreign Minister Vadym Prystaiko said his country was not interested in taking sides in U.S. politics, but that Zelenskiy had the right to keep the contents of his conversation with Trump secret. \"I know what the conversation was about and I do not think there was any pressure\" from Trump, Prystaiko was quoted as saying. \"There was a conversation, different conversation, leaders have the right to discuss any existing issues. This was a long and friendly conversation that touched on a lot of issues, sometimes requiring serious answers .\" Biden said that if the reports are true, \"then there is truly no bottom to President Trump's willingness to abuse his power and abase our country .\" He said Trump should release the transcript of his July phone conversation with Zelenskiy \"so that the American people can judge for themselves .\" The U.S. government's intelligence inspector general has described the whistleblower's Aug. 12 complaint as \"serious\" and \"urgent .\" Trump dismissed it all Friday, insisting \"it's nothing .\" He scolded reporters for asking about it and said it was \"just another political hack job .\" \"I have conversations with many leaders. It's always appropriate. Always appropriate,\" Trump said. \"At the highest level always appropriate. And anything I do, I fight for this country .\" Trump was asked whether he knew if the whistleblower's complaint centered on the July 25 call with Zelenskiy. \"I really don't know,\" Trump said. When questioned whether he had brought up Biden in the call, Trump said, \"It doesn't matter what I discussed .\" But then Trump urged the media \"to look into\" Biden's background with Ukraine. There has yet to be any evidence of any wrongdoing by Biden or his son regarding Ukraine. Trump and Zelenskiy plan to meet on the sidelines of the U.N. General Assembly this coming week. The Wall Street Journal first reported that Trump pressed Zelenskiy about Biden. The standoff with Congress raises fresh questions about the extent to which Trump's appointees are protecting the Republican president from oversight and, specifically, whether his new acting director of national intelligence, Joseph Maguire, is working with the Justice Department to shield the president. Democrats say the administration is legally required to give Congress access to the whistleblower's complaint, and Rep. Adam Schiff of California has said he will go to court in an effort to get it if necessary. The intelligence community's inspector general said the matter involves the \"most significant\" responsibilities of intelligence leadership. House Democrats also are fighting the administration for access to witnesses and documents in impeachment probes. In the whistleblower case, lawmakers are looking into whether Trump lawyer Rudy Giuliani traveled to Ukraine to pressure the government to aid Trump's reelection effort by investigating the activities of Biden's son. During an interview Thursday on CNN, Giuliani was asked whether he had asked Ukraine to look into Biden. He initially said, \"No, actually I didn't,\" but seconds later he said, \"Of course I did .\" Giuliani has spent months trying to drum up potentially damaging evidence about Biden's ties to Ukraine. He told CNN that Trump was unaware of his actions. \"I did what I did on my own,\" he said. \"I told him about it afterward. Still later, Giuliani tweeted,\" A President telling a Pres-elect of a well known corrupt country he better investigate corruption that affects US is doing his job. \"Democrats have contended that Trump, in the aftermath of special counsel Robert Mueller's Russia investigation, may have asked for foreign assistance in his upcoming reelection bid. Trump further stoked those concerns earlier this year in an interview when he suggested he would be open to receiving foreign help. The inspector general appeared before the House Intelligence Committee behind closed doors Thursday but declined, under administration orders, to reveal to members the substance of the complaint. Schiff said Trump's attack on the whistleblower was disturbing and raised concerns that it would have a chilling effect on other potential exposers of wrongdoing. He also said it was\" deeply disturbing \"that the White House appeared to know more about the complaint than its intended recipient--Congress. The information\" deserves a thorough investigation, \"Schiff said .\" Come hell or high water, that's what we're going to do. \"Among the materials, Democrats have sought is a transcript of Trump's July 25 call with Zelenskiy. The call took place one day after Mueller's faltering testimony to Congress effectively ended the threat his probe posed to the White House. A readout of the call released from the Ukrainian government said Trump believed Kyiv could complete corruptions investigations that have hampered relations between the two nations but did not get into specifics. Sen. <mark>Chris Murphy</mark> of Connecticut, who in May called for a probe of Giuliani's effort in Ukraine, said in an interview on Friday it's\" outrageous \"the president has been sending his political operative to talk to Ukraine's new president. <mark>Murphy</mark> tweeted that during his own visit it was clear to him that Ukraine officials were\" worried about the consequences of ignoring Giuliani's demands. \"The senator tweeted that he told Zelenskiy during their August visit it was\" best to ignore requests from Trump's campaign operatives. He agreed. \"Letters to Congress from the inspector general make clear that Maguire consulted with the Justice Department in deciding not to transmit the complaint to Congress in a further departure from standard procedure. It's unclear whether the White House was also involved, Schiff said. Maguire has refused to discuss details of the whistleblower complaint, but he has been subpoenaed by the House committee and is expected to testify publicly next Thursday. Maguire and the inspector general, <mark>Michael Atkinson</mark>, also are expected next week at the Senate Intelligence Committee. <mark>Atkinson</mark> wrote in letters that Schiff released that he and Maguire had hit an\" impasse \"over the acting director's decision not to share the complaint with Congress. <mark>Atkinson</mark> said he was told by the legal counsel for the intelligence director that the complaint did not actually meet the definition of an\" urgent concern. \"And he said the Justice Department said it did not fall under the director's jurisdiction because it did not involve an intelligence professional. <mark>Atkinson</mark> said he disagreed with that Justice Department view. The complaint\" not only falls under DNI's jurisdiction, \"<mark>Atkinson</mark> wrote,\" but relates to one of the most significant and important of DNI's responsibilities to the American people. \"___ Associated Press writers Deb Riechmann, Eric Tucker, Alan Fram and Mary Clare Jalonick in Washington, D.C., and Matthew Bodner in Moscow contributed to this report. Related Content", "articleID": "2019092113_00208842_W", "names": {"Chris Murphy": ["Q1077594", "Q20022484", "Q2964809", "Q5107535", "Q5107536", "Q5107538", "Q56379834"]}}]