[{"date": "2019-09-21", "url": "https://www.wkbn.com/news/national-world/trump-says-he-had-perfectly-fine-call-with-ukraine-leader/", "content": "Trump says he had \"perfectly fine' call with Ukraine leader Trump is defending himself against the intelligence official's complaint, asserting that it comes from a\" partisan whistleblower' by: By JONATHAN LEMIRE, <mark>MICHAEL</mark> BALSAMO and LISA MASCARO, Associated Press Posted: Sep 21, 2019 / 09:48 AM EDT / Updated: Sep 21, 2019 / 09:48 AM EDT WASHINGTON (AP)--President Donald Trump urged the new leader of Ukraine this summer to investigate the son of former Vice President Joe Biden, a person familiar with the matter said. Democrats condemned what they saw as a clear effort to damage a political rival, now at the center of an explosive whistleblower complaint against Trump. It was the latest revelation in an escalating controversy that has created a showdown between congressional Democrats and the Trump administration, which has refused to turn over the formal complaint by a national security official or even describe its contents. Trump is defending himself against the intelligence official's complaint, asserting that it comes from a \"partisan whistleblower,\" though the president also says he doesn't know who had made it. The complaint was based on a series of events, one of which was a July 25 call between Trump and Ukrainian President Volodymyr Zelenskiy, according to a two people familiar with the matter. The people were not authorized to discuss the issue by name and were granted anonymity. In a tweet Saturday, Trump referred to \"a perfectly fine and routine conversation I had\" with Ukraine's leader. \"Nothing was said that was in any way wrong .\" Trump, in that call, urged Zelenskiy to probe the activities of potential Democratic rival Biden's son Hunter, who worked for a Ukrainian gas company, according to one of the people, who was briefed on the call. Trump did not raise the issue of U.S. aid to Ukraine, indicating there was not an explicit quid pro quo, according to the person. In an interview with Ukrainian outlet Hromadske that was published Friday evening, Ukrainian Foreign Minister Vadym Prystaiko said his country was not interested in taking sides in U.S. politics, but that Zelenskiy had the right to keep the contents of his conversation with Trump secret. \"I know what the conversation was about and I do not think there was any pressure\" from Trump, Prystaiko was quoted as saying. \"There was a conversation, different conversation, leaders have the right to discuss any existing issues. This was a long and friendly conversation that touched on a lot of issues, sometimes requiring serious answers .\" Biden said that if the reports are true, \"then there is truly no bottom to President Trump's willingness to abuse his power and abase our country .\" He said Trump should release the transcript of his July phone conversation with Zelenskiy \"so that the American people can judge for themselves .\" The U.S. government's intelligence inspector general has described the whistleblower's Aug. 12 complaint as \"serious\" and \"urgent .\" Trump dismissed it all Friday, insisting \"it's nothing .\" He scolded reporters for asking about it and said it was \"just another political hack job .\" \"I have conversations with many leaders. It's always appropriate. Always appropriate,\" Trump said. \"At the highest level always appropriate. And anything I do, I fight for this country .\" Trump was asked whether he knew if the whistleblower's complaint centered on the July 25 call with Zelenskiy. \"I really don't know,\" Trump said. When questioned whether he had brought up Biden in the call, Trump said, \"It doesn't matter what I discussed .\" But then Trump urged the media \"to look into\" Biden's background with Ukraine. There has yet to be any evidence of any wrongdoing by Biden or his son regarding Ukraine. Trump and Zelenskiy plan to meet on the sidelines of the U.N. General Assembly this coming week. The Wall Street Journal first reported that Trump pressed Zelenskiy about Biden. The standoff with Congress raises fresh questions about the extent to which Trump's appointees are protecting the Republican president from oversight and, specifically, whether his new acting director of national intelligence, Joseph Maguire, is working with the Justice Department to shield the president. Democrats say the administration is legally required to give Congress access to the whistleblower's complaint, and Rep. Adam Schiff of California has said he will go to court in an effort to get it if necessary. The intelligence community's inspector general said the matter involves the \"most significant\" responsibilities of intelligence leadership. House Democrats also are fighting the administration for access to witnesses and documents in impeachment probes. In the whistleblower case, lawmakers are looking into whether Trump lawyer Rudy Giuliani traveled to Ukraine to pressure the government to aid Trump's reelection effort by investigating the activities of Biden's son. During an interview Thursday on CNN, Giuliani was asked whether he had asked Ukraine to look into Biden. He initially said, \"No, actually I didn't,\" but seconds later he said, \"Of course I did .\" Giuliani has spent months trying to drum up potentially damaging evidence about Biden's ties to Ukraine. He told CNN that Trump was unaware of his actions. \"I did what I did on my own,\" he said. \"I told him about it afterward. Still later, Giuliani tweeted,\" A President telling a Pres-elect of a well known corrupt country he better investigate corruption that affects US is doing his job. \"Democrats have contended that Trump, in the aftermath of special counsel Robert Mueller's Russia investigation, may have asked for foreign assistance in his upcoming reelection bid. Trump further stoked those concerns earlier this year in an interview when he suggested he would be open to receiving foreign help. The inspector general appeared before the House Intelligence Committee behind closed doors Thursday but declined, under administration orders, to reveal to members the substance of the complaint. Schiff said Trump's attack on the whistleblower was disturbing and raised concerns that it would have a chilling effect on other potential exposers of wrongdoing. He also said it was\" deeply disturbing \"that the White House appeared to know more about the complaint than its intended recipient--Congress. The information\" deserves a thorough investigation, \"Schiff said .\" Come hell or high water, that's what we're going to do. \"Among the materials, Democrats have sought is a transcript of Trump's July 25 call with Zelenskiy. The call took place one day after Mueller's faltering testimony to Congress effectively ended the threat his probe posed to the White House. A readout of the call released from the Ukrainian government said Trump believed Kyiv could complete corruptions investigations that have hampered relations between the two nations but did not get into specifics. Sen. <mark>Chris Murphy</mark> of Connecticut, who in May called for a probe of Giuliani's effort in Ukraine, said in an interview on Friday it's\" outrageous \"the president has been sending his political operative to talk to Ukraine's new president. <mark>Murphy</mark> tweeted that during his own visit it was clear to him that Ukraine officials were\" worried about the consequences of ignoring Giuliani's demands. \"The senator tweeted that he told Zelenskiy during their August visit it was\" best to ignore requests from Trump's campaign operatives. He agreed. \"Letters to Congress from the inspector general make clear that Maguire consulted with the Justice Department in deciding not to transmit the complaint to Congress in a further departure from standard procedure. It's unclear whether the White House was also involved, Schiff said. Maguire has refused to discuss details of the whistleblower complaint, but he has been subpoenaed by the House committee and is expected to testify publicly next Thursday. Maguire and the inspector general, <mark>Michael Atkinson</mark>, also are expected next week at the Senate Intelligence Committee. <mark>Atkinson</mark> wrote in letters that Schiff released that he and Maguire had hit an\" impasse \"over the acting director's decision not to share the complaint with Congress. <mark>Atkinson</mark> said he was told by the legal counsel for the intelligence director that the complaint did not actually meet the definition of an\" urgent concern. \"And he said the Justice Department said it did not fall under the director's jurisdiction because it did not involve an intelligence professional. <mark>Atkinson</mark> said he disagreed with that Justice Department view. The complaint\" not only falls under DNI's jurisdiction, \"<mark>Atkinson</mark> wrote,\" but relates to one of the most significant and important of DNI's responsibilities to the American people. \"___ Associated Press writers Deb Riechmann, Eric Tucker, Alan Fram and Mary Clare Jalonick in Washington, D.C., and Matthew Bodner in Moscow contributed to this report. Related Content", "articleID": "2019092113_00208842_W", "names": {"Michael Atkinson": ["Q4072107", "Q56100159", "Q56878045", "Q6828294", "Q6828295"]}}, {"date": "2019-09-23", "url": "http://www.tsn.ca/guerrero-jr-s-off-season-plan-includes-losing-15-to-20-pounds-1.1370291", "content": "Guerrero Jr.'s off-season plan includes losing \"15 to 20 pounds' Royals manager Yost to retire at season's end Severino sharp as Yankees beat Blue Jays Nationals lose at Marlins to tighten NL wild-card race Eovaldi, Vazquez help Red Sox beat contending Rays Indians move into tie for 2nd wild card, beat Phillies Ryu hits, pitches Dodgers to 100th win, defeat Rockies Cruz hits 400th HR as Twins top Royals Astros' Springer hits 3 HRs in first 4 innings Conforto hits three-run homer, Mets top Reds Rookie Webb, Giants beat Braves to avoid sweep Red Sox Price to have surgery on left wrist Four homers lead Tigers to win over White Sox Bryant hurt, pulled after trying to beat double play Sabathia sheds tears as family reads tributes Paxton wins 10th straight, Yanks top Jays Cards come back to beat Kimbrel, Cubs Semien reaches base 6 times, A's roll past Rangers Lowe lifts Rays into second wild card Rogers falters, Twins allow 7 in 9th in loss to Royals UFC Notebook: Rodriguez vs. Stephens ends with unintentional eyepoke Bisping: Rodriguez vs. Stephens was over before it started Holloway will defend belt against Volkanovski at UFC 245 Bronsteter: Diaz vs. Masvidal being sold on\" organic merit' White interested in talking about GSP/Khabib if Ferguson falls through Philadelphia fighter Daukaus looks to impress UFC in title fight Masvidal: Diaz is a different caliber fighter Diaz: You can fight for phony belts, or for the BMF belt Cormier wants to see Gaethje vs. McGregor next Askren to McGregor: Shut up and take a fight Poirier has something for Covington at the gym Askren: Usman and Covington are \"idiots' Gaethje makes quick work of Cerrone at Vancouver's UFC Fight Night With impressive run of first round KOs, is McGregor up next for Gaethje? Black breaks down Connelly's impressive debut, Cirkunov's rare submission Canadians Cirkunov, Connelly pick up Cinderella wins in front of hometown fans Bronsteter: In front of amazing hometown atmosphere, Connelly executed perfectly Shaw calls UFC in Vancouver\" massive success' Gaethje talks about how hard it is to put friendship aside when it's time to fight \"He was making me work for every second' Connelly on win over Pereira Liverpool five points clear after beating Chelsea United loses at West Ham in Premier League Arsenal recovers to beat Villa with 10 men Dortmund held to draw by Frankfurt TFC clinches playoff berthin draw with LAFC Late goal gives Whitecaps draw with Crew Wolves ends losing run with draw at Crystal Palace Galaxy secure victory over Impact Atlanta United FC defeats San Jose Earthquakes Ronaldo scores PK, Juventus beat Verona Inter beats Milan to keep perfect start in Serie A Man City falls just short of record with 8-0 win Spurs lose after marginal VAR call, Leicester comeback Norwich back down to earth with loss at Burnley Sheffield United earns victory at Everton Kaye feels timing is perfect to finally face Toronto FC Impact face tough task against Ibrahimovic Barca's Fati granted Spanish citizenship Report: Silva to join Inter Miami Chelsea inks Hudson-Odoi to five-year extension Wales rolls past Georgia at Rugby World Cup England coach: USA to play like '15 Donald Trumps' England earns comfortable victory over Tonga at Rugby World Cup Ireland rains on Scotland, wins at World Cup At his 5th World Cup, Parisse leads Italy to a win v Namibia All Blacks eye Canada next after getting past South Africa World Cup head injury rules tweaked after All Blacks' protest Samoa change five, Russia unchanged for first World Cup matchup New Zealand beats South Africa, extend streak in group games Australia gets rattled, responds to beat Fiji Argentina losing string hits 10 with defeat by France Host Japan opens Rugby World Cup with win over Russia Watch the 2019 Rugby World Cup on TSN Scotland at full strength for Ireland in World Cup opener Canada in tough as Rugby World Cup gets underway on TSN Italy's Parisse set for record-equaling 5th Rugby World Cup Hansen has high hope as All Blacks coaching tenure nears end Tonga's Manu beats cancer and chemotherapy to play at RWC 2019 Rugby World Cup on TSN - Broadcast Schedule Ireland aim to show Scotland who is No. 1 in World Cup opener NBA approves stiffer penalties for tampering Canada downs Mexico in AmeriCup opener Pacers: Oladipo unlikely to play opening night USA keeps top spot in FIBA rankings Report: Rockets signing veteran Sefolosha Pistons sign 17-year NBA vet Johnson Delle Donne named WNBA MVP Raptors sign guard Taylor Wizards' Thomas out 6-8 weeks after thumb surgery Tsai completes purchase of Nets, arena, hires Levy as CEO Magic exercise option on ex-No. 1 pick Fultz Raps' Gasol, Spain win FIBA World Cup Report: NBA set to vote on raising tampering fines US places 7th at World Cup, tops Poland in finale Jordan says Hornets add two partners Livingston retires after 15 NBA seasons Bryant: Easy days for USA Basketball are over Giannis leads the way, four Raptors crack SI's NBA Top 100 list USA Basketball's Colangelo says he'll remember players who pulled out of World Cup Argentina moves to World Cup final, tops France Burrow sets school record with 6 TDs as No. 4 LSU routs Vanderbilt No. 1 Clemson routs Charlotte, wins 19th straight game Tagovailoa throws 5 TDs, No. 2 Alabama rolls over Southern Miss No. 3 Georgia holds off No. 7 Notre Dame Taylor Helps No. 13 Wisconsin trounce No. 11 Michigan Nix helps No. 8 Auburn over No. 17 Texas A & M ACC takes prime placement in bottom 10 Georgia coach teaches dangers of drugs with dangerous snake The top 10 all-time college QBs States-Side 5: Hubbard runs wild on Tulsa Leach breaks down which Pac 12 mascot would win a battle royale Will Canadian Claypool continue stellar start against Bulldogs? Lawrence leads No. 1 Clemson past Syracuse Tagovailoa has career day in No. 2 Alabama's win over South Carolina Hurts has 439 scrimmage yards, No. 5 Oklahoma's routs UCLA Must See: Harris pulls out stiff-arm, hurdle for epic touchdown No. 3 Georgia romps to another win, beats Arkansas State No. 13 Penn State uses late stand to hold off Pittsburgh Dobbins, Fields help No. 6 Ohio St. knock out Indiana Book throws for 5 TDs as No. 7 Notre Dame routs New Mexico Willett wins at home for 1st time at BMW PGA Championship An keeps 36-hole lead in Mississippi An takes over lead at Mississippi Hoge keeps rolling and takes early lead in Mississippi McIlroy stumbles to 4-over 76, Wallace leads at Wentworth Taylor ready for big year on and off the course Szeryk has a season's worth of lessons on Symetra Tour Harrington picks Karlsson as 1st vice captain for Ryder Cup Pendrith earns promotion after stellar season Pettersen ends career after dramatic putt Pendrith earns second Canada Life Canadian Player of the Year honours Niemann wins by six shots at The Greenbrier Europe regains Solheim Cup, beats US Niemann takes 2-shot lead into final round at The Greenbrier Chappell shoots 11-under 59 at The Greenbrier Shelton fires 62 for Greenbrier lead McIlroy voted PGA Tour Player of the Year Tiger's future, Olympic competition headline new golf season Pendrith continues torrid pace Wozniacki, Kerber and Sevastova upset in Wuhan Open Federer, Zverev win as Europe retains Laver Cup title Osaka wins Toray Pan Pacific tournament Venus falls in opening round at Wuhan Open Federer wins doubles with Zverev, Europe leads in Laver Cup Osaka reaches quarters at Pan Pacific Open Federer to decide soon on Olympic plans Thousands of fans show up to celebrate Andreescu's US Open title Keys beats Kasatkina in 1st round of Pan Pacific Open Pliskova overcomes rain and Martic to win Zhengzhou Open Magnitude of US Open win hasn't completely sunk in for Andreescu Mississauga announces public celebration for Bianca Andreescu Pliskova wins twice in a day to reach semifinals Former top-ranked Clijsters planning return to tennis Andreescu hungry for more Grand Slam titles, No. 1 ranking Andreescu eyes Beijing Open for return Andreescu's coach didn't foresee her rise to stardom happening so quickly Bianca's US Open win attracts 3.4 M viewers on TSN and RDS Kerber loses in three sets at Zhengzhou Open Andreescu rises 10 spots to No. 5 in world rankings after US Open victory Vettel leads Ferrari 1-2 to win Singapore GP Newgarden wins 2nd IndyCar title in 3 years in finale Truex Jr. wins at Richmond, wins first two NASCAR Cup playoff races Has Hamilton met his match? Bell opens Xfinity playoffs with dominant run RLL extends Sato as IndyCar free agency heats up Keselowski wins pole for Richmond Cup race With Kubica to leave Williams at end of season, Canada's Latifi front-runner for seat IndyCar touts positive gains as season nears an end Toyota Race day rewind--Richmond Raceway Toyota NASCAR Richmond Preview Kyle Busch criticism highlights NASCAR's financial disparity Childress declines option on rookie Hemric for 2020 Truex races into 2nd round with win in opening playoff race Reddick stretches gas tank to a win in the desert TSN Racing Pod - Episode 68 with Don Sklenka NASCAR Pinty's Series--Lucas Oil 250 recap Leclerc's rise contrasts with Vettel's miserable season Toyota NASCAR Las Vegas Preview Menard retiring, Wood Brothers hire DiBenedetto 3m ago Guerrero Jr.'s off-season plan includes losing\" 15 to 20 pounds' The Rafael Devers plan is the blueprint that has been laid out on the table for the young Blue Jays star to follow, <mark>Scott Mitchell</mark> writes. Follow | Archive TORONTO--As the Toronto Blue Jays finish off playing out the string, Vladimir Guerrero Jr. is already looking forward to the off-season. But it's not because he's desperate for the downtime after playing into the month of September for the first time in his life. Rather, it's a chance to start the process of reshaping his body and, dare I use the cliché, come into spring training next February in the best shape of his life in an effort to make third base his long-term home and be better prepared for the 162-game grind. \"I think that's the key for me to have a great year next year,\" Guerrero said. \"I feel good the way I am right now, but I'm going to try to come back a lot better. Maybe try to be 15 or 20 pounds less for spring training and I will take it from there after that .\" Vladdy Jr. plans on heading back to the Dominican Republic to train with his uncle, Wilton Guerrero, just as they've always done, but he's debating showing up at the Blue Jays' facility in Dunedin for a stretch, as well, something the team has been hoping he'd consider. \"I'm going to go back to the Dominican and work out with my family,\" Guerrero said. \"We do that every off-season, and then maybe I'll go back to Tampa for a month to work out with the team .\" Listed at 250 pounds this season as a 20-year-old, Guerrero's playing weight--depending on who you talk to--has fluctuated between 255 and 270 since he made his major-league debut at the end of April. If Guerrero can even come close to replicating his dedication in the cage and apply it to his conditioning, there's no reason to think he won't arrive in Dunedin next spring feeling better prepared to take the next step in his development. You don't have to look far for a prime example of what happens when a young player changes his routines away from the field. In 2018, as a 21-year-old, Boston Red Sox third baseman Rafael Devers faced the same questions. A top 10 prospect in baseball before his arrival in 2017 as a 20-year-old, Devers struggled last season, slashing just .240 / .298 / .433 with 21 home runs, while also pacing baseball in miscues with the leather, committing 24 errors at third base. From the prospect pedigree to conditioning to questions about the glove, there are so many parallels between the two young Dominican stars. The Devers plan is the blueprint and it's been laid out on the table for Vladdy to follow. \"I know Raffy very well, but everybody's different,\" said Guerrero, who has admitted to not spending much time in the gym in the past. \"I have my own plan with my uncle and we're going to work very hard and I believe I'm going to come back strong .\" Guerrero has already been telling friends around baseball, including countryman and Red Sox third base coach Carlos Febles, to expect to see a different player next spring. \"He's a big guy and he's athletic, but something Vladdy told me last night is,\" I'm going to go this off-season and get in the best shape possible and you'll see me next year. I'm going to be a different guy, \"' Febles relayed .\" He wants to be good and he knows what he needs to do. His dad already told him. He said, \"My dad is already on top of me about it .' You'll see him. He'll be better because he's hungry .\" Devers' dedication paid off in a big way and he's put together a monster campaign. At the plate, he's been one of the best hitters in baseball this season, slashing .307 / .359 / .551 with a career-high 31 homes and a whopping 85 extra-base hits, overall. Defensively, Devers has still committed 22 errors--second-most in baseball behind Chicago White Sox shortstop <mark>Tim Anderson</mark>'s 25--but the metrics and reports have generally been a lot more favourable and he's viewed as a perfectly acceptable bat-first third baseman. \"It was about him making that commitment and understand why you have to be in better shape,\" Febles said. \"If you want to be good, you better do it, and that's exactly what he did .\" Meeting the expectations Guerrero's season has not gone as planned. But that's not to say it hasn't been a success, either. To understand why a .276 / .345 / .444 slash line as a 20-year-old is a bit of a disappointment to some, you have to understand the enormous expectations heaped upon him. He was--and still is--dubbed a generational talent. Many, math model projections included, thought he'd be an elite-level bat from the jump. At times, he's looked like just that, but the same sort of machine-like consistency that we saw during his journey through the minor leagues hasn't been there. Getting beat inside at times and swinging at pitches he normally wouldn't have led to an elevated ground-ball rate at 49 per cent. As a right-handed hitter with an elite hit tool, it's almost shocking to see he's batting just .219 / .301 / .352 with nine extra-base hits in 143 plate appearances against southpaws. Even the elite exit velocities have dwindled as the season has gone on, perhaps a sign that Guerrero is tiring physically. That's something Red Sox hitting coach Tim Hyers has noticed with Devers. \"When you're mentally and physically ready to go, we're seeing the byproduct of that,\" Hyers said. \"When you are in shape, you can come in every day and get the work in and not get worn out. I think that really helped him out .\" How long at the hot corner? With all that being said, no one is questioning the hitting prowess or the ultimate ceiling in that area. It's the definition of a middle-of-the-order bat, even if he hasn't gone all <mark>Juan Soto</mark> or Yordan Alvarez on the baseball world. But the glove is another story, a narrative that's just beginning to take shape. The plan was always to bring Guerrero up as a third baseman and hope the tough balance of trying to develop while also produce at the major-league level wasn't too much of a burden. That's easy to do in a rebuild setting, but as wins become more important in 2020 and beyond, below-average defence will become a problem and the glove will be under the microscope. Both the eye test and the metrics haven't been kind through Vladdy Jr.'s first 92 games at third base in a Blue Jays uniform. His defensive fWAR of -8.9 sits dead last in baseball among third basemen. Only Devers has made more errors than Guerrero's 17, but that's come in 500 more innings played. His Defensive Runs Saved (DRS) mark of -3 is 42nd out of 56 third baseman with at least 200 innings in the field this season. There is a base set of skills, however, and Blue Jays infield instructor <mark>Luis Rivera</mark> again pointed to the Devers comparison when talking about Guerrero's glove. \"It's a great example,\" <mark>Rivera</mark> said. \"They're both Dominican, they both play third base and they're both young and they know they have to work a little bit on their body. Devers did a great job this year coming into spring training when we watched him early in the season and now here, he looks great. Hopefully, that's the same case with Vladdy, that he goes back home and continues to work on his body and come back to spring training in great shape .\" One move to acquire a defensively viable glove to install at the hot corner could change plans in an instant, but the Blue Jays front office knows how valuable their franchise player could be at third base, compared to a move across the diamond to first. They seem committed to keeping Vladdy at third in 2020, but beyond that all bets are off. \"He's got to go home [this off-season] and get his rest. He always likes to hit a lot, but he's got to come to spring training in a better situation where he can play the whole season without any worries and feel like he can go out every day and play third base,\" <mark>Rivera</mark> said. \"He's 20 years old. His body's got to get better, but his hands are good and his reactions are good. Time will tell. The conditioning that he applies to himself during the off-season in the years to come will dictate if he's going to stay there or not .\" ", "articleID": "2019092316_00207900_W", "names": {"Juan Soto": ["Q52717515", "Q59617095", "Q852644"], "Luis Rivera": ["Q18649937", "Q3266808", "Q6701052", "Q6701053", "Q6701055"], "Scott Mitchell": ["Q7436881", "Q7436882", "Q7436884", "Q7436886", "Q8992456"], "Tim Anderson": ["Q16142481", "Q16150286", "Q20630500", "Q30121984", "Q56034798", "Q7803083", "Q7803084", "Q7803085", "Q7803086"]}}, {"date": "2019-09-25", "url": "https://www.foxnews.com/media/trump-ukraine-failed-oust-attempt-kimberley-strassel", "content": "close Video <mark>Michael Goodwin</mark>: Democrats botched impeachment push New York Post columnist <mark>Michael Goodwin</mark> said the move will result in Democrats hitting a \"dead end .\" & nbsp; Wall Street Journal columnist Kimberley Strassel offered her analysis of the Trump - Ukraine transcript on Twitter Wednesday, saying it was an \"internal attempt\" to oust the president. \"Having read DOJ's Trump-Ukraine release, here's the real story: This is another internal attempt to take out a president, on the basis of another non-smoking-gun,\" she wrote. \"As to call transcript itself: Trump's actual\" favor' is that Ukraine look backward, to what happened in the 2016 election. This is a legitimate ask, since election meddling looks to have come from both Russia and Ukraine. \"She pointed out that it was Ukrainian President Volodymyr Zelensky who first mentioned Rudy Giuliani and said he was the first to broach the subject of an investigation. REP. RATCLIFFE ON UKRAINE TRANSCRIPT: DEMS\" HAVE HARMED OUR NATIONAL SECURITY' IN THEIR DESIRE TO DESTROY TRUMP Video \"It is actually Zelensky who brings up Rudy Giuliani--saying they can't wait to\" meet him. \"And it is Zelensky who references\" that investigation, \"as he goes on to promise that\" all investigations will be done openly and candidly, \"she continued .\" Trump says \"good' and expresses worries that a\" good' prosecutor was \"shut down .' Mentions\" Biden's son' and that Biden bragged he \"stopped the prosecution .' Ends that bit with\" It sounds horrible to me .' \"She also said the Department of Justice and Attorney General Bill Barr have yet to speak with Trump, or any Ukranian officials, directly about the matter and have released a statement to address the issue .\" And, never mind, because: DOJ in statement says the President has not spoken to AG about investigating Biden and has not asked the AG to contact the Ukraine. Also, Barr has not communicated with Ukraine--\"on this or any subject,\" Strassel added. RUDY GIULIANI CLAIMS UKRAINE SCANDAL REVEALED REAL \"COLLUSION,' ACCUSES BIDEN OF\" SELLING THE PRESIDENCY' Video She ended by claiming the whistleblower who leaked the story had political bias and ulterior motivations, before criticizing Democrats for letting their impeachment fixation steer the ship of state. \"Whistleblower? Look at this nugget, referenced in the OLC opinion. The IG's review found\" some indicia of an arguable political bias on the part of the Complainant in favor of a rival political candidate, \"Strassel wrote .\" Media got all this so wrong. And Democrats look all the more partisan and radical to have moved toward impeachment. \"CLICK HERE TO GET THE FOX NEWS APP Following the release of the transcript, Democrats said Trump abused his power by asking Zelensky to look into Joe Biden and his son, while Republicans fell back on the fact that the president never mentioned money or threatened to withhold military aid. Nick Givas is a reporter with Fox News. You can find him on Twitter at @ NGivasDC. ADVERTISEMENT", "articleID": "2019092519_00059278_W", "names": {"Michael Goodwin": ["Q11778342", "Q6830683"]}}, {"date": "2019-09-25", "url": "http://www.twtd.co.uk/ipswich-town-news/5760/mahon-injury-not-serious/onthisday", "content": "<mark>Mahon</mark> Injury Not Serious Friday, 26th Sep 2003 09:17 On-loan winger <mark>Alan Mahon</mark> has had a scan which has shown his thigh injury to be a minor problem. However, the Blackburn player is unlikely to be involved for the Blues against Watford on Saturday. <mark>Mahon</mark> picked up the problem in the 2-1 loss at Notts County on Tuesday. The Irishman is relieved that it isn't too serious: \"Thankfully the scan showed there is no tear or anything but I can still feel it .\" It usually takes about 50 hours for the swelling to go down and the bruising to ease so I will see the physio and take it from there. \"I'm hoping I will be OK because I'm desperate to play. I'm really enjoying my football here and I came to play first-team games not sit around injured .\" Darren Bent is back in training today and may well be fit for the trip to Vicarage Road while Joe Royle has revealed it is a loan striker he is targeting. The Town boss was hoping to hear back from the player's club yesterday but is now expecting confirmation one way or the other today. He has a specific international player in mind but if that doesn't work out then he'll look elsewhere. Play Football, Lose Weight Ipswich places available now. Save 50% of your registration fee by clicking here, and we'll donate £ 5 to Prostate Cancer UK. Read more in our blog about how it works and how 95% of members lose weight. Photo: Action Images Please report offensive, libellous or inappropriate posts by using the links provided. Page:", "articleID": "2019092523_00042637_W", "names": {"Alan Mahon": ["Q1646551", "Q21062515"]}}, {"date": "2019-09-26", "url": "http://abs-cbnnews.com/spotlight/09/26/19/at-the-pma-a-thin-line-between-instilling-discipline-and-inflicting-abuse", "content": "Home> Spotlight At the PMA, a thin line between instilling discipline and inflicting abuse Christian V. Esguerra, ABS-CBN News Posted at Sep 26 2019 05:55 PM Share Save Facebook Twitter LinkedIn Retired AFP chief Dionisio Santiago recalls being hit by a senior cadet during his time at the PMA. \"Pagkatapos mo ng plebe years, parang superman ka,\" he says. Ramiltibayan, Wikimedia Commons MANILA--The death of a plebe allegedly tortured over a missing pair of boots has put a spotlight on the Philippines' top military school, where cadets tread a fine line between instilling discipline and committing outright physical abuse. Hazing and other forms of maltreatment are not tolerated by the Philippine Military Academy (PMA), its officials insisted, especially following the death of 20-year-old Darwin Dormitorio. But the practice takes place just the same involving plebes subject to different forms of punishment by older cadets, in a \"tradition\" supposedly intended to build character but can also be fatal in some cases. Police are investigating at least 5 cadets who allegedly electrocuted Domitorio in his private parts with a makeshift taser. The victim complained of stomach pain and later died. Taser flashlight used to electrocute PMA cadet, police says In 1981, scandal also hit the Baguio City-based academy founded in 1903, following the hazing death of <mark>Andres Ramos</mark> Jr., son of a Philippine Constabulary general. \"It's a system that only the cadet corps can correct,\" said retired armed forces chief Dionisio Santiago, who admitted also taking a beating as a freshman. Santiago pointed to an L-shaped scar behind his head, a painful remembrance of an \"accident\" in 1966. FLOOR WAX An upperclassman summoned the young Santiago, while another one instructed him to take the can of floor wax on his way out. \"Yes, sir,\" he said, sticking to what was supposed to a plebe's automatic response, but didn't know where it was. \"Yes ka nang yes, di mo pala nakita,\" the older cadet said before unleashing a right cross that dropped the freshman flat on his back. Santiago \"s head hit the concrete floor, requiring 7 and costing his attacker a year in the academy. Five others were also\" turned back \"or made to repeat the academic year, he said, for not stopping their peer under the PMA's\" honor \"system .\" Dapat you should stop them. Kung hindi, equally guilty ka, \"Santiago told ABS-CBN News .\" Nandu ’n sila nu ’n g ginulpi ako. \"SUPERMAN More than 5 decades later, Santiago, a member of PMA Class\" 70, made light of the incident and his difficult year as a plebe. Like him, his upperclassmen went on to hold important positions in the police and the military and later, the government following their retirement. \"Pagkatapos mo ng plebe years, parang superman ka. Di ka tatablan ng bala. Kaya mo lahat. Kaya mong makipagbakbakan sa mga kanto d’yan,\" he said, citing how the experience helped build his self-confidence. Sen. Ronald dela Rosa, a member of PMA Class \"86, earlier argued that cadets were being trained to become\" warriors, \"arguing that universities also had hazing. Bato on hazing: If universities have it, what more a military academy? Santiago said the PMA experience was different from fraternity hazing because it's intended to\" toughen your gut. \"Tasks given did not always involve inflicting physical harm, he said, recalling the time when he was made to copy by hand the entire front page of a broadsheet. ABUSIVE But while that exercise, squeezed within his tight academic schedule, taught him the value of\" compliance \"and time management, others did not necessarily involve any logical reason .\" May mga plebo d’yan, pagmumukha mo pa lang, malas na, \"he recalled in jest .\" Ako naman, ang malas ko,' yung kapatid ko nasa top 10. Kaya naiinggit sa kanya yung \"goat' na company-mate ko .\" Santiago rejected the idea that abusive practices victimizing first-year cadet was part of the PMA culture. But he said the academy should institute more regular physical and psychological examinations on cadets. Judging by his years in the PMA, he said a plebe's experience could turn one into a rather brutal upperclassman or one that opted never to inflict the same physical abuse on those who came after. \"Minsan kasi,' yung experience mo changes your attitude...maraming nagiging abusado,\" he said. Share Save Facebook Share on Twitter LinkedIn PMA, Philippine Military Academy, hazing, Darwin Dormitorio, <mark>Andres Ramos</mark>, Dionisio Santiago, Ronald dela Rosa Read More: PMA Philippine Military Academy hazing Darwin Dormitorio <mark>Andres Ramos</mark> Dionisio Santiago Ronald dela Rosa / news/09/26 / 19/2-officer-sugatan - sa-rambol-ng-mga-preso-sa-pasay-jail / news/09/26 / 19/39-trabahador-na - chinese-itinakbo-sa-ospital-dahil-sa-food-poisoning / overseas/09/26 / 19/embattled-hong-kong - leader-set-for-town-hall-meeting / overseas/09/26 / 19/two-children-beaten - to-death-in-india-for-defecating-in-open / overseas/09/26 / 19/heavy-rains-kill -17 - in-western-india", "articleID": "2019092610_00149750_W", "names": {"Andres Ramos": ["Q58209591", "Q58830515"]}}, {"date": "2019-09-28", "url": "http://www.thehour.com/news/education/article/Education-leaders-say-NC-city-has-shortage-of-14472815.php", "content": "https: //www.thehour.com/news/education/article/Education-leaders-say-NC-city-has-shortage-of-14472815.php Education leaders say NC city has shortage of black teachers Published 12:05 am EDT, Saturday, September 28, 2019 In this Tuesday, Sept. 3, 2019 photo, Florancie Jacques, one of three students of color in UNC Asheville's teacher licensure program, poses in Asheville, N.C. (Brian Gord/The Asheville Citizen-Times via AP) In this Tuesday, Sept. 3, 2019 photo, Florancie Jacques, one of three students of color in UNC Asheville's teacher licensure program, poses in Asheville, N.C. (Brian Gord/The Asheville Citizen-Times via AP) Photo: Brian Gord, AP Photo: Brian Gord, AP Image 1 of / 1 Caption Close Image 1 of 1 In this Tuesday, Sept. 3, 2019 photo, Florancie Jacques, one of three students of color in UNC Asheville's teacher licensure program, poses in Asheville, N.C. (Brian Gord/The Asheville Citizen-Times via AP) In this Tuesday, Sept. 3, 2019 photo, Florancie Jacques, one of three students of color in UNC Asheville's teacher licensure program, poses in Asheville, N.C. (Brian Gord/The Asheville Citizen-Times via AP) Photo: Brian Gord, AP Education leaders say NC city has shortage of black teachers 1 / 1 Back to Gallery ASHEVILLE, N.C. (AP)--Studies show students perform better when they have teachers who look like them. In Buncombe County, where fewer than 2% of public school teachers are black, education leaders acknowledge a shortage of diverse teachers presents a barrier to equitable education. Yet recruiting black teachers in the Asheville area remains a challenge, and some feel the city's culture discourages black candidates from applying. \"A lot of black people, when they leave Asheville for college, they don't come back,\" said <mark>James Carter</mark>, who graduated from Asheville High in 1991 and now serves on Asheville City Schools' Board of Education. \"It is a mountain town, a small town, and when you get to other cities you're seeing a larger black middle class and staying there .\" <mark>Carter</mark>, who is black, said he does not believe teachers' race should dictate their instruction, but he recognizes the impact that a teacher of the same race can have on a student. \"Students of color gravitate more towards teachers of color,\" he said. \"I've heard that from current students as well as from older alumni students .\" Florancie Jacques, who goes by Flo, is one of three students of color out of 40 total students in their final year at UNC Asheville's teacher licensure program. She said Asheville schools will continue to struggle in recruiting teachers of color until the city better accommodates its black population. \"Here, there is a lack of differences in culture,\" said Jacques, who moved to Asheville from Durham and is now in her third year. Asheville feels less welcoming to young black professionals because of a scarcity of black-owned restaurants, festivals and salons that specialize in traditional black hair techniques, she said. \"I am willing to stay somewhere I can be with people like me or where I can interact with people who may not look like me but who also respect and celebrate my culture,\" she said. \"Asheville does not do that .\" After graduating, Jacques plans to return to Durham to teach. WHY RACE MATTERS Last school year, of the nearly 1,600 full-time teachers in Buncombe County Schools, fewer than 100 were non-white and only 12 teachers were black. In Asheville City Schools, 4% of teachers were black, five times lower than the district's overall percentage of black students. And in the area's five public charter schools, which are making efforts to diversify their student enrollments, only two full-time black teachers were on staffs last school year, according to the Public Schools of North Carolina database. The overall percentage of black teachers in North Carolina (15.7 trails the percentage of black students in the state, and the disparity is wider in Buncombe County. School leaders say they believe this contributes to the persistent gaps in student achievement across races in area schools. On recent state performance grades, five elementary schools in Asheville City Schools earned F rankings for their academic performance of their black students, as did both middle schools in the district. A 2017 study from the IZA Institute of Labor Economics found being assigned at least one black teacher between third and fifth grades increased four-year college attendance for economically disadvantaged black students. The same study determined that a black male student having a black teacher in early grades \"significantly reduces the probability that he drops out of high school .\" From fifth grade on, <mark>Carter</mark> estimates he had two or three black male teachers and never felt that their race or gender impacted his learning. Still, he sees value in hiring more black male educators in ACS. \"Changing this could be especially helpful for young men of color within the school system,\" <mark>Carter</mark> said. Teachers being of the same race as their students generally increases cultural synchronization, a term academics use to describe the ability of teachers to relate with students, helping with classroom management and lower discipline rates. \"Our teachers don't know how to handle us,\" said DeAngelo Collins, who is black and graduated from AHS in 2018. \"So they rather just send us out of the classroom .\" To that point, in 2017-18, the short-term suspension rate for black students in ACS was nearly four times higher than the rate for white students despite the district enrolling three times more white students according to data from the NC Department of Public Instruction. \"Some black children can have a deeper understanding with black teachers and form deeper connections,\" said Jacqueswho has written on culture and langue in education. A BETTER REFLECTION Two years ago, UNC Asheville created a recruitment and retention department focused on increasing teacher diversity. Part of the teaching department's efforts include a mentoring program that pairs upperclass candidates of color with younger college students of color. \"Sometimes we can get them into the intro course, but they don't always stay,\" said Nancy Ruppert, Asheville coordinator of 6-12 English/Language Arts Licensure at UNC Asheville. UNC Chapel Hill's School of Education funded a teacher recruitment position two years ago as well, with a similar focus on attracting more diverse candidates to teach around the state. In ACS, <mark>Carter</mark> has had conversations with the human resources department about efforts to target nonwhite teaching candidates. \"That it is something they are very cognizant of,\" he said. \"It is a priority of theirs to try to find more teachers of color .\" Buncombe County Schools belongs to the WNC Diversity Engagement Coalition, with the aim of increasing diversity districtwide. Teacher salary ranges combined with the city's higher cost of living make Asheville one of the most difficult places to live as a teacher in the state. All teacher recruitment efforts must contend with this economic reality. Jacques views teachers as an underutilized resource. \"It's very, very critical for a child to see themselves wherever they are in their world,\" Jacques said. \"And if black students spend their life in school and rarely see themselves in their teachers, they will not be as inspired as they could be .\" ___ Information from: The Asheville Citizen-Times, http: //www.citizen-times.com Most Popular 1 Matt Drudge played a major role in the Clinton impeachment - now he's back for another round 2 Giuliani engaged parade of Ukrainian prosecutors 3 Alleged hospital threats prompt police standoff 4 Multi-talented Latina helps build new car for America, offers inspiration for girls considering STEM careers 5 Warrant: Topless Norwalk woman bares all to complaining family at Westport beach 6 A year after Les Moonves' ouster, CBS seeks a new programming direction 7 Troconis refuses to answer questions in lawsuit deposition View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019092804_00150292_W", "names": {"James Carter": ["Q23685", "Q27926839", "Q27981527", "Q47115114", "Q51683353", "Q55411966", "Q6131095", "Q6131101", "Q650006", "Q674159", "Q942948"]}}, {"date": "2019-09-28", "url": "https://www.middleeastmonitor.com/20190928-sisi-hints-at-using-popular-mandate-to-deter-protesters/", "content": "Sisi hints at using popular mandate to deter protesters September 28, 2019 at 11:05 am | Published in: Africa, Egypt, News Egyptian President Abdel fattah Al-Sisi chairs the closing session of the first joint European Union and Arab League summit in the Egyptian Red Sea resort of Sharm el-Sheikh, on 25 February, 2019 [MOHAMED EL-SHAHED/AFP/Getty Images] September 28, 2019 at 11:05 am The Egyptian president Abdel-Fattah Al-Sisi hinted on Friday that he is to use popular mandate to crackdown on the protesters calling for him to resign, AlKhaleejonline.com reported. When he returned to Egypt, he told some of his supporters who were waiting for him at Cairo International Airport \"when I ask the Egyptians to take to the streets in their millions like what happened on the day of popular mandate in 2013, they will do .\" He shook hands with his supporters and exclaimed \"why are you standing here? Good morning. Why did you wake up early? Today is Friday. It does not deserve,\" noting that he is not worried about the protests. This came following calls by anti-Sisi activists, including the Egyptian actor and contractor <mark>Mohammed Ali</mark>, for the Egyptians to take to the streets and oust him over many corruption claims. Pro-Sisi Egyptian media have stated that the corruption claims being made against Sisi are \"lies\" and \"no one can trust them .\" ", "articleID": "2019092810_00067180_W", "names": {"Mohammed Ali": ["Q16002506", "Q6854083"]}}]