[{"date": "2019-09-29", "url": "http://www2.kusports.com/news/2019/sep/29/mandi-duggans-two-goals-lead-ku-soccer-4-1-victory/", "content": "Mandi Duggan's two goals lead KU soccer to 4-1 victory over Baylor By Braden Shaw Carter Gaskins KU teammates Sophie Maierhofer (27), Katie McClure (12) and Ebba Costow (8) celebrate a goal during the team's 6-0 win over Loyola Chicago Sunday afternoon at Rock Chalk Park on Aug. 25, 2019. Advertisement With opportunities few and far between, Kansas sophomore forward Bri Amos took advantage of an opening down the left sideline. Amos quickly sent a cross into the box to junior forward Mandi Duggan, who sent a header into the back of the net. That 30th minute goal shifted momentum into KU's favor in the first half, which was enough for the Jayhawks to secure the 4-1 victory over Baylor Sunday. \"It was really more about the result today than it was about how we play,\" KU coach <mark>Mark Francis</mark> said. \"I'm proud of the kids today. It was more about the effort and the energy in the second half than it was about how well we played soccer today because we had to compete .\" The Jayhawks were coming off a 1-0 defeat to Texas Thursday night, dropping their Big 12 opener for the second time in three years. \"Before we came out, we huddled up and said,\" We've got to get the job done today .' And that's what we did, \"Duggan said. And prior to the goal from Duggan, KU looked sluggish and behind the pace of Baylor. The Bears dominated possession throughout the first half, sending in 10 shots before halftime. However, only one of those shots was on goal. Baylor also earned three corners early on. The two closest chances came from Baylor freshman forward Taylor Moon's shot just curling over the bar in the 17th minute and Baylor sophomore midfielder Giuliana Cunningham sending a shot just over the bar from outside the box in the 23rd minute. And even with the Baylor offense applying pressure, KU sophomore goalkeeper Sarah Peters only had to make one save in the first half, pointing to inaccuracy befalling Baylor's halftime deficit. In the first 30 minutes of the match, KU had two close chances, with any other attack resulting in a quick counter attack from Baylor. The Jayhawks had just one shot on goal in the first half--and one shot in total--resulting in the Duggan goal .\" (It was a) huge momentum shift, because I think the first 15, 20 minutes we were kind of on our toes a little bit, not playing the game we normally play, \"Duggan said of her first goal .\" Then after that goal everyone was so energized and so ready. \"Coming out of the break, KU kept that momentum and looked like a completely different, more aggressive team .\" The second half was just a different story, \"<mark>Francis</mark> said. It only took about five minutes into the second half for KU to add to its lead, as a pass combination in the box from junior midfielder Ceri Holland and senior forward Katie McClure found sophomore forward Kailey Lane for a tap-in goal. Lane's fourth goal of the season put the Jayhawks up 2-0. Baylor looked to respond in the 53rd minute, but senior forward Raegan Padgett was called offside, nullifying another goal-scoring chance for the Bears. On the other end, KU had another close chance with McClure and Lane almost connecting once again in the 62nd minute. But, Lane's shot sailed just wide of the net. The Jayhawks added to their lead later in the 81st minute off a cross from McClure sent to Duggan who scored her second goal of the match and on the season .\" Oh, Mandi was huge, \"<mark>Francis</mark> said .\" She scored two fantastic goals, but the kid was all over the place. She was pressuring, she was chasing, she was running onto balls. She was brilliant. \"Meanwhile, Baylor managed to get on the board in the 86th minute thanks to a header from freshman midfielder Michaela Gorman off a corner. The Bears finished with 15 shots, with four shots on goal. KU freshman midfielder Ebba Costow added a goal directly off a corner in the 90th minute, capping off a dominant second half for the Jayhawks .\" I was stoked, everyone was stoked, \"Duggan said .\" I think the world stopped for a second when that happened. We were all so excited and good for her, too. \"Moving forward, Duggan said the Jayhawks need to focus on attacking earlier and not sitting back to start matches .\" We've just got to realize that we have to play our game, \"Duggan said .\" We can't wait for the momentum to shift and we just have to come out right away and get the job done. \"Kansas will travel to Oklahoma State at 7 p.m. Thursday.", "articleID": "2019092921_00255318_W", "names": {"Mark Francis": ["Q16236137", "Q1900045", "Q6767658", "Q6767659"]}}, {"date": "2019-10-01", "url": "http://nst.com.my/world/2019/10/525976/sleepy-driving-medical-student-jailed-knocking-down-elderly-pedestrian", "content": "By Today Online - October 1, 2019 @ 9:20 am SINGAPORE: A 25-year-old aspiring medical student, who knocked down a 78-year-old pedestrian while driving when he was \"sleepy\" , was sentenced to five days' jail and banned from driving for 18 months yesterday. <mark>Tan Wei</mark> Ren, who is applying to medical schools for his postgraduate studies, was exhausted because he had been studying till late into the night after completing a research course the night before the accident took place, his lawyer told the court. It was not stated exactly how late <mark>Tan</mark> had been studying. His lawyer also declined to reveal <mark>Tan</mark>'s occupation when asked by reporters, although he was described as a \"hardworking academic\" in court. On July 8 last year, at about 9am, <mark>Tan</mark> was driving along Lavender Street towards Republic Avenue when he collided into Chua Boon Huat who was crossing the road more than 50m from a pedestrian crossing. <mark>Tan</mark>, however, had a clear view straight ahead and the victim was in plain sight from some distance away, Deputy Public Prosecutor (DPP) Charis Low noted, adding that he should have had ample time to see Chua. He failed to do so because he did not keep a proper lookout. DPP Low also pointed out that <mark>Tan</mark> was driving at a speed of 63km/h at the point of impact, having increased his speed from 59km/h to 63km/h in the immediate five seconds before the impact. The speed limit for the stretch of road was 60km/h. Chua suffered head and collarbone injuries as a result of the crash and had to be warded in <mark>Tan</mark> Tock Seng Hospital for 19 days. In view of the \"grievous harm\" caused, DPP Low had asked the court to impose a one-week jail sentence, arguing that <mark>Tan</mark>'s \"sleepy driving\" increased his culpability, since he posed an increased danger to other road users. If he had been alert, he would have noticed the victim crossing the road, she reiterated. While <mark>Tan</mark>'s lawyer, Pang Khin Wee, agreed that a custodial sentence is warranted, he sought to get a \"discount\" on the one-week sentence the prosecution wanted, pointing out that his client had refrained from driving since the accident and is \"unlikely to reoffend\". \"He is full of potential for rehabilitation and will do a lot of good to society as a doctor in the future,\" he told District Judge Carol <mark>Ling Feng</mark> Yeng. Pang also said that <mark>Tan</mark>--who had been driving for four to five years before the accident--took responsibility for his actions and emerged from his vehicle \"in a split second\" to get help for the victim. A passing ambulance at the site of the accident attended to Chua. <mark>Tan</mark> had written an apology letter to Chua, Pang said, noting that it took care of the victim's \"mental well-being\" as it accorded the victim \"closure\" to what had transpired. The lawyer added that the man's medical expenses were covered by <mark>Tan</mark>'s insurance firm. These proved <mark>Tan</mark>'s \"genuine remorse\" , Pang said. The lawyer questioned DPP Low's \"sleepy driving\" characterisation of <mark>Tan</mark>, adding that he knows of people who can function with two to three hours of sleep. \"(My client) is a hardworking academic,\" he stressed. In response, DPP Low said that she was referring to Pang's mitigation plea, which stated that the accident was caused by a \"momentary lapse\" , partially caused by a lack of sleep. <mark>Tan</mark> pleaded guilty to one charge of a negligent act endangering human life and causing grievous hurt to Chua. He could have been sentenced to up to two years in jail, or fined up to S $5,000, or both.", "articleID": "2019100101_00302441_W", "names": {"Ling Feng": ["Q21502945", "Q28970771"], "Tan Wei": ["Q45607787", "Q45607851", "Q45667480", "Q45668260", "Q45668345", "Q45668496", "Q45705539"]}}, {"date": "2019-10-01", "url": "https://www.agriculture.com/markets/newswire/grains-soybeans-exceed-two-month-high-on-china-buying-us-inventory-shock", "content": "* Soybeans hit highest price since July 22 * USDA put U.S. soy, corn stocks below market expectations * CBOT wheat eases after rally on Monday (Updates with U.S. trading, changes byline, previous dateline PARIS/SYDNEY) By Tom Polansek CHICAGO, Oct 1 (Reuters) - U.S. soybean futures prices rose to the highest in more than two months on Tuesday, adding to gains from the previous session when further Chinese purchases and a lower-than-expected estimate of U.S. stockpiles buoyed prices. Corn also advanced after rallying 4% on Monday when a quarterly U.S. Department of Agriculture (USDA) grain stocks report pegged corn and soy inventories below traders' expectations. Most active soybean futures on the Chicago Board Of Trade were up 0.9% at $9.14-1 / 4 a bushel by 10:25 a.m. CDT (1525 GMT). The price was the highest since July 22. Most active corn futures were up 0.6% at $3.90-1 / 2 and reached the highest since Aug. 12. \"A lot of it is follow-through from yesterday,\" said Brian Hoops, president of U.S. broker Midwest Market Solutions. Chinese firms bought up to 600,000 tonnes of U.S. soybeans on Monday as part of a tariff-free quota allotted to the importers to buy up to 2 million tonnes this week, two sources with knowledge of the deals said. Traders hope the sales lead to Chinese firms buying more U.S. soybeans over the longer term, Hoops said, after China slashed imports during the ongoing U.S.-China trade war. Short covering helped support soybean and corn prices amid uncertainty about the size of the autumn U.S. corn and soy harvests, traders said. The harvests are off to a slower than normal start, after heavy rains and historic flooding delayed planting in the spring. \"Funds have been pushed to buy back their short positions,\" consultancy Agritel said. CBOT wheat futures eased in a turnaround from a seven-week high on Monday and were down 0.9% at $4.91-1 / 2 a bushel. \"Wheat must prove export demand will offset a larger crop than last year, which won't be easy,\" Farm Futures said in a note. (Reporting by Tom Polansek in Chicago; Additional reporting by Gus Trompiz in Paris and Colin Packham in Sydney; Editing by Uttaresh V, <mark>David Evans</mark> and <mark>Richard Chang</mark>) © Copyright Thomson Reuters 2019. Click For Restrictions - http: //about.reuters.com/fulllegal.asp", "articleID": "2019100115_00430961_W", "names": {"David Evans": ["Q1174373", "Q1174375", "Q16106932", "Q17385895", "Q20732807", "Q20732808", "Q23611963", "Q23830915", "Q23988321", "Q25171969", "Q2913295", "Q29642639", "Q346480", "Q42263307", "Q43190963", "Q49757192", "Q5233451", "Q5233452", "Q5233453", "Q5233456", "Q5233457", "Q5233459", "Q5233462", "Q5233465", "Q5233468", "Q56187417", "Q56596945", "Q57727375", "Q714845"], "Richard Chang": ["Q48720120", "Q9137947"]}}, {"date": "2019-10-01", "url": "https://boston.cbslocal.com/2019/10/01/new-england-patriots-build-playground-foxboro-regional-charter-school/", "content": "Filed Under: Foxboro News, Foxboro regional charter school, New England Patriots, <mark>Steve Burton</mark> FOXBORO (CBS)--All it takes are willing hands, as hundreds of volunteers build a playground at a Foxboro school in a matter of hours, with some help from the New England Patriots. And for the first time, elementary school kids have a place to play. It's part of a project to help young people stay fit. They mixed cement, dug a mountain of mulch and did some heavy lifting all for a good cause, giving kids a safe place to play and a way to stay active, and they're doing it all in just a day. \"We started at 7 in the morning and we're here until probably 4 o’clock in the afternoon,\" said Jose Aquino, a volunteer from United Healthcare. Some Patriots players volunteered to help build a playground at a Foxboro School (WBZ-TV) The \"instant\" playground is a joint project between United Healthcare, a non-profit called Kaboom! and the New England Patriots at the Foxborough Regional Charter School. Pat Patriot chipped in, so did the cheerleaders and a handful of very burly players. But it was about 200 volunteers that really got it done. \"As part of a health care company we're helping people live healthier lives, and this is a chance to do that in a different way than we normally do,\" said Shane, one of the volunteers. \"Awesome to have a team willing to take the day off to move some mulch, lots of mulch!\" added Haya Alzaid. And now the elementary school here will have a playground. \"This is a big deal for us. We've been waiting for a couple of years to get a playground down here at our new elementary school building,\" said Christiana Benson, the school's principal. \"I think play is important for the kids, and this is a good volunteer opportunity and a good use of my time,\" said parent Rick Prescott. Some Patriots players volunteered to help build a playground at a Foxboro School (WBZ-TV) At the end of the day, the entire community was richer for the good work done here. \"It's my first time volunteering, and it's the best thing I've done all year,\" said Salome Thuo, a parent of two children at the school. This is the 10th year in a row the Patriots have joined the playground building effort which is part of United Healthcare's \"Do Good. Live Well\" campaign. <mark>Steve Burton</mark> <mark>Steve Burton</mark> is a sports anchor and reporter for WBZ-TV News on WBZ-TV and on sister station TV38. More from <mark>Steve Burton</mark>", "articleID": "2019100122_00215819_W", "names": {"Steve Burton": ["Q7612111", "Q7612112", "Q7612113", "Q7612114"]}}, {"date": "2019-10-02", "url": "http://www.espn.com/blog/nflnation/post/_/id/301223/amid-defensive-changes-luke-kuechly-remains-the-panthers-stopper", "content": "Amid defensive changes, Luke Kuechly remains the Panthers' stopper Amid defensive changes, Luke Kuechly remains the Panthers' stopper play <mark>Clark</mark>: Losing Short a big deal for Panthers (0:21) <mark>Ryan Clark</mark> weighs in on how losing Kawann Short to a season-ending injury will be detrimental to Carolina's defense. (0:21) Covered Panthers, NFL for 11 years More than 25 years experience covering NFL, college football and NASCAR Joined ESPN in 2006 print CHARLOTTE, N.C.--Gerald McCoy is a vegan these days, but when asked to describe what it's like being a teammate with Carolina Panthers linebacker Luke Kuechly, the defensive tackle hearkened back to his meat-eating days. \"Luke is like going to a famous steakhouse, hearing about Wagyu steak,\" said McCoy, who signed with Carolina in June after being released by Tampa Bay. \"It's been pampered all its life, played music, too, and wined and all this so it can be prime for you to enjoy. And then when you get to this famous steakhouse and you order the steak and bite into it, it's like,\" Wow, it is as advertised .' NFL PrimeTime on ESPN + Chris Berman and <mark>Tom Jackson</mark> recap the weekend's games with extended highlights and analysis. The show will stream live at 7:30 p.m. ET each Sunday during the 2019 season and will be available on demand each week until late Wednesday night. Watch on ESPN + \"Like Luke Kuechly. Luke Kuechly. Prime steak. As advertised .\" With 17 tackles in Week 2, the 28-year-old Kuechly surpassed Hall of Famer Brian Urlacher for the most tackles by an NFL player through his first eight seasons. He needs eight tackles on Sunday against the Jacksonville Jaguars to reach 1,000 career tackles. No player has more tackles than Kuechly since he entered the league in 2012. He truly has been a \"tackling machine,\" as he was dubbed at Boston College, where he led the nation in tackles with 191 as a senior under coach Frank Spaziani. \"He was the human eraser,\" said Spaziani, now the defensive coordinator at New Mexico State. \"He would just make plays other people couldn't make or didn't make. The defense was a whole lot better when Luke was on the field. I'm sure it's the same way today .\" Kuechly is perhaps the best player in Panthers history, a lock to one day be inducted into the team's Hall of Honor that wide receiver <mark>Steve Smith</mark>, tackle <mark>Jordan Gross</mark>, quarterback Jake Delhomme and tight end Wesley Walls will enter during halftime of Sunday's game. \"I like the way he plays. I like the style. I like the leadership. I like everything about him,\" said Jacksonville coach Doug Marrone, who is facing a Carolina team that has won two straight after an 0-2 start. \"A potential Hall of Fame type of player. He's one of those players that we can all look at and really have a great appreciation for .\" Luke Kuechly has made more tackles in his first eight seasons than any player in NFL history. He could surpass 1,000 on Sunday against the Jaguars. Daniel Dunn/Icon Sportswire The Panthers made it a priority to improve defensive speed and moved to a 3-4 base to get more pressure on quarterbacks. Kuechly has been the one constant. He doesn't get the splashy sacks that make headlines, but he's a big reason the defense ranks No. 1 against the pass and No. 4 overall. He's tied for fourth in the NFL in total tackles with 44. According to NFL Next Gen Stats, he has eight stuffs--tackles made on run plays resulting in no gain or loss--the most in the league among linebackers. His 23 stops--tackles resulting a successful play for the defense--are tied for second among linebackers and only one off the league lead held by Jordan Hicks. Kuechly's ability to effectively drop into coverage allows coach <mark>Ron Rivera</mark> to be more creative with his blitz and rush package that has produced 18 sacks, which is tied with New England for the league lead a year after the team finished 27th in sacks. \"He's one that, if you don't have someone on him, he can make every play,\" Marrone said. The tackles made by Luke Kuechly through the first four weeks of the 2019 season show that he's all over the field. NFL Next Gen Stats Perfectionist Seventeen tackles, including one for a safety, would be a career game for most players. Kuechly was more upset after his Week 2 performance he didn't come down with an interception that would have been an incredible highlight play, as he soared into the air 24 yards downfield. \"I dropped a pick,\" a despondent Kuechly said afterward. \"Got to catch that ball .\" Kuechly is a perfectionist. He spends as much or more time studying film than most coaches. But it's what you don't see in practice, when Kuechly makes a rare mistake, that shows just how important perfection is to the six-time Pro Bowl selection. \"He'll talk to himself. He'll say bad things to himself,\" defensive coordinator <mark>Eric Washington</mark> said with a smile. \"He'll go off to the sideline and he'll immediately want to review the series. He wants it to be right. He wants it to be perfect .\" By the time we get to Sunday we all see the results and benefits from that kind of mindset. \"On game day, it's almost like Kuechly is in the offensive huddle the way he anticipates. Safety Tre Boston cited as an example a play during the NFC Championship Game following the 2015 season .\" They were running a toss and Luke literally was telling us before the snap, \"Hey, toss to the right, toss to the right,'\" Boston recalled. \"And then they audibled the play and he knew what it was .\" He was supposed to be in the middle. But when they said hut, he was on the edge of the defense, pretty much catching the ball with the running back with the sweep. That preparation really gives him the confidence to make those plays. \"Luke Kuechly maintains a friendly rivalry with <mark>Thomas Davis</mark> on who gets more tackles, though <mark>Davis</mark> is now playing for the Chargers. AP Photo/Bob Leverone\" Pride' Kuechly's career has been threatened by concussions. He has spent three stints in the concussion protocol, the first one in 2015 after a violent collision at Jacksonville. Kuechly doesn't like talking about those moments. When he missed time in training camp this year after what he called being \"rolled up weird\" during a drill, he anticipated reporter's questions before they were asked. \"My head's good,\" Kuechly said. \"I wasn't in the protocol .\" Get the best of ESPN sent to your inbox The ESPN Daily delivers the biggest sports news and moments every weekday. Sign me up! Privacy Policy Read the Latest Email: Kuechly hasn't been in the protocol since 2017. That's allowed the outside focus to remain on his superb play and Kuechly's focus to remain on the field and talking about how the opponent's best player as a \"good dude\" or \"stud .\" He's not a boisterous voice in the locker room, but his leadership is more important than ever, especially with outside linebacker <mark>Thomas Davis</mark> now with the Los Angeles Chargers. For seven years, Kuechly and <mark>Davis</mark> had a friendly competition for the most tackles. That hasn't stopped because they're on different teams. \"He called me the first week and told me he beat me, so, a little resentment there,\" Kuechly said with a laugh. Panthers outside linebacker Shaq Thompson, whose star has risen since <mark>Davis</mark> departed, also is in on the competition. As it stands, Kuechly has 44 tackles, Thompson 40 and <mark>Davis</mark> 38, all among the top 10 in the league. What's the ultimate winner get? \"Pride,\" Kuechly said. \"The NFL, there's no gambling .\" Pride drives Kuechly. It's something McCoy believes is at the core of a locker room culture that didn't let the Panthers collapse after losing their first two games. It's one of the reasons he chose to sign here. \"His ultimate goal is to get off the field and get the offense back out there,\" McCoy said. \"He doesn't care who makes the plays. Whoever makes them, makes them. He just makes more than most people .\" ", "articleID": "2019100210_00125261_W", "names": {"Eric Washington": ["Q1118847", "Q48852210"], "Jordan Gross": ["Q55946456", "Q6276575"], "Ron Rivera": ["Q1991889", "Q7364319"], "Ryan Clark": ["Q16598380", "Q16979868", "Q20877034", "Q5403956", "Q7383958", "Q7383961"]}}]