[{"date": "2019-10-02", "url": "http://www.espn.com/blog/nflnation/post/_/id/301223/amid-defensive-changes-luke-kuechly-remains-the-panthers-stopper", "content": "Amid defensive changes, Luke Kuechly remains the Panthers' stopper Amid defensive changes, Luke Kuechly remains the Panthers' stopper play <mark>Clark</mark>: Losing Short a big deal for Panthers (0:21) <mark>Ryan Clark</mark> weighs in on how losing Kawann Short to a season-ending injury will be detrimental to Carolina's defense. (0:21) Covered Panthers, NFL for 11 years More than 25 years experience covering NFL, college football and NASCAR Joined ESPN in 2006 print CHARLOTTE, N.C.--Gerald McCoy is a vegan these days, but when asked to describe what it's like being a teammate with Carolina Panthers linebacker Luke Kuechly, the defensive tackle hearkened back to his meat-eating days. \"Luke is like going to a famous steakhouse, hearing about Wagyu steak,\" said McCoy, who signed with Carolina in June after being released by Tampa Bay. \"It's been pampered all its life, played music, too, and wined and all this so it can be prime for you to enjoy. And then when you get to this famous steakhouse and you order the steak and bite into it, it's like,\" Wow, it is as advertised .' NFL PrimeTime on ESPN + Chris Berman and <mark>Tom Jackson</mark> recap the weekend's games with extended highlights and analysis. The show will stream live at 7:30 p.m. ET each Sunday during the 2019 season and will be available on demand each week until late Wednesday night. Watch on ESPN + \"Like Luke Kuechly. Luke Kuechly. Prime steak. As advertised .\" With 17 tackles in Week 2, the 28-year-old Kuechly surpassed Hall of Famer Brian Urlacher for the most tackles by an NFL player through his first eight seasons. He needs eight tackles on Sunday against the Jacksonville Jaguars to reach 1,000 career tackles. No player has more tackles than Kuechly since he entered the league in 2012. He truly has been a \"tackling machine,\" as he was dubbed at Boston College, where he led the nation in tackles with 191 as a senior under coach Frank Spaziani. \"He was the human eraser,\" said Spaziani, now the defensive coordinator at New Mexico State. \"He would just make plays other people couldn't make or didn't make. The defense was a whole lot better when Luke was on the field. I'm sure it's the same way today .\" Kuechly is perhaps the best player in Panthers history, a lock to one day be inducted into the team's Hall of Honor that wide receiver <mark>Steve Smith</mark>, tackle <mark>Jordan Gross</mark>, quarterback Jake Delhomme and tight end Wesley Walls will enter during halftime of Sunday's game. \"I like the way he plays. I like the style. I like the leadership. I like everything about him,\" said Jacksonville coach Doug Marrone, who is facing a Carolina team that has won two straight after an 0-2 start. \"A potential Hall of Fame type of player. He's one of those players that we can all look at and really have a great appreciation for .\" Luke Kuechly has made more tackles in his first eight seasons than any player in NFL history. He could surpass 1,000 on Sunday against the Jaguars. Daniel Dunn/Icon Sportswire The Panthers made it a priority to improve defensive speed and moved to a 3-4 base to get more pressure on quarterbacks. Kuechly has been the one constant. He doesn't get the splashy sacks that make headlines, but he's a big reason the defense ranks No. 1 against the pass and No. 4 overall. He's tied for fourth in the NFL in total tackles with 44. According to NFL Next Gen Stats, he has eight stuffs--tackles made on run plays resulting in no gain or loss--the most in the league among linebackers. His 23 stops--tackles resulting a successful play for the defense--are tied for second among linebackers and only one off the league lead held by Jordan Hicks. Kuechly's ability to effectively drop into coverage allows coach <mark>Ron Rivera</mark> to be more creative with his blitz and rush package that has produced 18 sacks, which is tied with New England for the league lead a year after the team finished 27th in sacks. \"He's one that, if you don't have someone on him, he can make every play,\" Marrone said. The tackles made by Luke Kuechly through the first four weeks of the 2019 season show that he's all over the field. NFL Next Gen Stats Perfectionist Seventeen tackles, including one for a safety, would be a career game for most players. Kuechly was more upset after his Week 2 performance he didn't come down with an interception that would have been an incredible highlight play, as he soared into the air 24 yards downfield. \"I dropped a pick,\" a despondent Kuechly said afterward. \"Got to catch that ball .\" Kuechly is a perfectionist. He spends as much or more time studying film than most coaches. But it's what you don't see in practice, when Kuechly makes a rare mistake, that shows just how important perfection is to the six-time Pro Bowl selection. \"He'll talk to himself. He'll say bad things to himself,\" defensive coordinator <mark>Eric Washington</mark> said with a smile. \"He'll go off to the sideline and he'll immediately want to review the series. He wants it to be right. He wants it to be perfect .\" By the time we get to Sunday we all see the results and benefits from that kind of mindset. \"On game day, it's almost like Kuechly is in the offensive huddle the way he anticipates. Safety Tre Boston cited as an example a play during the NFC Championship Game following the 2015 season .\" They were running a toss and Luke literally was telling us before the snap, \"Hey, toss to the right, toss to the right,'\" Boston recalled. \"And then they audibled the play and he knew what it was .\" He was supposed to be in the middle. But when they said hut, he was on the edge of the defense, pretty much catching the ball with the running back with the sweep. That preparation really gives him the confidence to make those plays. \"Luke Kuechly maintains a friendly rivalry with <mark>Thomas Davis</mark> on who gets more tackles, though <mark>Davis</mark> is now playing for the Chargers. AP Photo/Bob Leverone\" Pride' Kuechly's career has been threatened by concussions. He has spent three stints in the concussion protocol, the first one in 2015 after a violent collision at Jacksonville. Kuechly doesn't like talking about those moments. When he missed time in training camp this year after what he called being \"rolled up weird\" during a drill, he anticipated reporter's questions before they were asked. \"My head's good,\" Kuechly said. \"I wasn't in the protocol .\" Get the best of ESPN sent to your inbox The ESPN Daily delivers the biggest sports news and moments every weekday. Sign me up! Privacy Policy Read the Latest Email: Kuechly hasn't been in the protocol since 2017. That's allowed the outside focus to remain on his superb play and Kuechly's focus to remain on the field and talking about how the opponent's best player as a \"good dude\" or \"stud .\" He's not a boisterous voice in the locker room, but his leadership is more important than ever, especially with outside linebacker <mark>Thomas Davis</mark> now with the Los Angeles Chargers. For seven years, Kuechly and <mark>Davis</mark> had a friendly competition for the most tackles. That hasn't stopped because they're on different teams. \"He called me the first week and told me he beat me, so, a little resentment there,\" Kuechly said with a laugh. Panthers outside linebacker Shaq Thompson, whose star has risen since <mark>Davis</mark> departed, also is in on the competition. As it stands, Kuechly has 44 tackles, Thompson 40 and <mark>Davis</mark> 38, all among the top 10 in the league. What's the ultimate winner get? \"Pride,\" Kuechly said. \"The NFL, there's no gambling .\" Pride drives Kuechly. It's something McCoy believes is at the core of a locker room culture that didn't let the Panthers collapse after losing their first two games. It's one of the reasons he chose to sign here. \"His ultimate goal is to get off the field and get the offense back out there,\" McCoy said. \"He doesn't care who makes the plays. Whoever makes them, makes them. He just makes more than most people .\" ", "articleID": "2019100210_00125261_W", "names": {"Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"], "Thomas Davis": ["Q17721764", "Q28972061", "Q3525031", "Q48841038", "Q7788881"], "Tom Jackson": ["Q21075060", "Q55602687", "Q660635", "Q7816304", "Q7816305"]}}, {"date": "2019-10-03", "url": "http://wicz.com/story/41133543/kamala-harris-poll-numbers-tumble-in-her-home-state-of-california", "content": "Updated: By Maeve Reston, CNN In yet another sign of trouble for Sen. Kamala Harris in the 2020 presidential race, the California Democrat has slid from an enviable front-runner position in her home state into the single digits in a new poll of likely voters in the Golden State. As the state's March 5 primary draws closer, Sen. Elizabeth Warren of Massachusetts (23%), former Vice President Joe Biden (22%) and Sen. Bernie Sanders of Vermont (21%) are now tied as the leaders in the field among likely voters who are either registered as Democrats or identify as Democratic-leaning independents in the new Public Policy Institute of California poll, which was conducted in mid - to late September after Harris' uneven performance in the last debate. Harris tumbled from 19% in July to 8% in the new poll by the institute, failing to sustain the momentum she sparked with her first debate performance in June. She lost significant ground over the summer, while her chief rivals all solidified their standing among California voters. In the July poll, Warren was at 15%, Sanders was at 12% and Biden was at 11%--all trailing Harris, who got both a fundraising and a polling bounce after she delivered a fiery performance in the first debate in Miami by questioning the former vice president's past opposition to busing for the purpose of desegregating schools. While it is often said that California tends to reflect the national state of play of the presidential race--because it is so expensive to wage an intensive campaign in this vast and diverse state--the new Public Policy Institute of California poll underscores that Harris does not seem to be drawing any advantage from the fact that she served as the state's attorney general and continues to serve constituents as the state's junior US senator. \"These numbers reflect what's going on in the national scene, but they also reflect that there is not a home state advantage (for Harris). There's not an advantage from the fact that she's run in statewide races here in 2010, 2014 and 2016,\" said Mark Baldassare, who directs the survey and is the institute's president and CEO. Harris' supporters and advisers had hoped she would be able to rack up a considerable number of delegates in California when the state holds its Super Tuesday contest, building momentum that would carry her into the spring primaries. \"Sen. Harris has to prove to (California) voters just like any other Democratic presidential candidate--\"What are you going to do for me?' and\" Where do you stand on the issues?' and \"Are you the person who is most likely to defeat <mark>Donald Trump</mark>?\" Baldassare said. \"The name identification associated with being the state's senator and somebody who's been on the ballot--it's not an advantage right now .\" The new California poll numbers come as Harris' campaign is restructuring its leadership and attempting to streamline its decision-making. After stumbling through a fog of confusion about her position on the single-payer \"Medicare for All\" proposal and amid falling poll numbers over the past three months--including in South Carolina, where a recent survey showed her at 3%--Harris is moving her Senate chief of staff, Rohini Kosoglu, and senior adviser Laphonza Butler into top leadership positions within the campaign. Harris--who has notched a series of firsts in her career, including becoming California's first female attorney general of color--has acknowledged at campaign events that she faces some unique hurdles; namely, as she likes to point out, that Americans have never elected a president who looks her. But she has vowed to soldier on. During a recent fundraiser in Los Angeles, she laughed when retelling the story of how a reporter recently overheard her telling fellow Sen. Mazie Hirono of Hawaii, \"I'm f ***** g moving to Iowa,\" which will hold its first-in-the-nation caucuses on February 3. That comment was heard far and wide, and Harris noted to laughter that the famed Des Moines T-shirt company RAYGUN is printing her remark on one of its shirts. As they strategize for the Golden State primary, Harris and all of the other Democratic candidates will have to contend with a darkening mood among California voters they see signs of weakness in the US economy and grapple with a homelessness crisis statewide. Homelessness ranked as the most important issue facing the state for the first time in the Public Policy Institute of California survey's 20-year history, according to Baldassare. That was followed by voters' concerns about jobs and the economy, as well as rising housing costs--which have contributed to increasing numbers of Californians living on the streets. Baldassare noted that homelessness moving to the top of the list of concerns was an astonishing finding. \"It's just incredible,\" Baldassare said. \"It's visible, and it's a growing issue ....It's a very tough issue. It's disturbing for people to see the suffering that's occurring--it's something that doesn't fit with their image of what should be going on in their community. And they're frustrated that the government seems incapable of getting its hands around it. It's not just a San Francisco or an LA issue anymore. It's everywhere .\" Signs of economic uncertainty are also weighing on California voters. A year ago, 53% of Californians said they expected to see good economic times over the following 12 months. Now only 41% of the state's residents said they expected good times over the next year, while 50% said they expect bad times financially. \"More people are getting nervous about the direction of the economy,\" Baldassare said. \"That's a big change. That speaks to some combination of political and economic uncertainty really surfacing--and that has impacts on what choices people make when they go to the ballot. They tend to feel more negative about incumbents and officeholders, because they feel like,\" Why aren't they doing something about this?' They're going to be looking for some message of hope or a plan for what they're going to do if things get worse. \"The Public Policy Institute of California survey was conducted via telephone from September 16 to 25 with 1,705 California adult residents. The results have a + / - 3.2 percentage point sampling margin of error for all adults, a + / -3.7 percentage point sampling margin of error for 1,344 registered voters and a + / - 4.2 percentage point sampling margin of error for 1,031 likely voters. Can't Find Something?", "articleID": "2019100304_00129233_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-10-04", "url": "https://www.forexcrunch.com/bitgo-customers-can-earn-13-per-annum-on-staking/", "content": "BitGo customers can earn 13% per annum on staking You are at: Home \"Crypto News\" BitGo customers can earn 13% per annum on staking BitGo customers can earn 13% per annum on staking Oct 4, 2019 10:07 GMT | Last Modified: At the initial stage, staking rewards for Dash and Algorand are available. More coins will be added to the platform in the future. A custodian solutions provider BitGo offered customers the opportunity to receive passive income on cryptocurrencies Dash (DASH) and Algorand (ALGO). The coin holders that store their assets with BitGo Trust will receive staking rewards on Dash and Algorand deposits. The rate of return will vary by coin, from 7 percent to up to 13 percent for Algorand. More coins to be added in the future. \"In order to be a great custodian, we need to provide our clients with the ability to use their assets in custody. Staking provides our clients with returns on their investments without ever moving their assets out of custody,\" said Ben Chan, CTO, BitGo. In addition, the company acquired a startup Hedge, involved in building staking infrastructure. BitGo is confident that the new acquisition will provide an opportunity to automate many operations and expand the functionality of the service. \"Our acquisition of Hedge builds on the blockchain and staking expertise within our engineering platform to deliver an automated, end-to-end staking service .\" Read also: A crypto custody provider BitGo supports cryptocurrency staking About ForexCrunch Forex Crunch is a site all about the foreign exchange market, which consists of news, opinions, daily and weekly forex analysis, technical analysis, tutorials, basics of the forex market, forex software posts, insights about the forex industry and whatever is related to Forex. Apple CEO <mark>Tim Cook</mark> not comfortable with private entities creating modern digital currencies Disclaimer Foreign exchange (Forex) trading carries a high level of risk and may not be suitable for all investors. The risk grows as the leverage is higher. Investment objectives, risk appetite and the trader's level of experience should be carefully weighed before entering the Forex market. There is always a possibility of losing some or all of your initial investment / deposit, so you should not invest money which you cannot afford to lose. The high risk that is involved with currency trading must be known to you. Please ask for advice from an independent financial advisor before entering this market. Any comments made on Forex Crunch or on other sites that have received permission to republish the content originating on Forex Crunch reflect the opinions of the individual authors and do not necessarily represent the opinions of any of Forex Crunch's authorized authors. Forex Crunch has not verified the accuracy or basis-in-fact of any claim or statement made by any independent author: Omissions and errors may occur. Any news, analysis, opinion, price quote or any other information contained on Forex Crunch and permitted re-published content should be taken as general market commentary. This is by no means investment advice. Forex Crunch will not accept liability for any damage, loss, including without limitation to, any profit or loss, which may either arise directly or indirectly from use of such information.", "articleID": "2019100410_00108479_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}}, {"date": "2019-10-04", "url": "http://www.thisisthewestcountry.co.uk/news/national/17947545.thousands-protest-mask-ban-hong-kong-leader-toughens-stance/", "content": "Thousands protest against mask ban after Hong Kong leader toughens stance By Press Association 2019 Hong Kong Protests 0 comment Masked protesters have streamed into central Hong Kong after the city's embattled leader invoked rarely used emergency powers to ban masks at rallies in a hardening of the government's stance after four months of demonstrations. Immediately defying the ban set to take effect on Saturday, thousands of protesters crammed streets in the central business district shouting \"Hong Kong, resist\". City chief executive <mark>Carrie Lam</mark> said at a news conference that the mask ban, imposed under a colonial-era emergency ordinance that was last used over half a decade ago, targets violent protesters and rioters and \"will be an effective deterrent to radical behaviour\". The ban applies to all public gatherings, both unauthorised and those approved by police. Masks will be permitted for \"legitimate need\" when wearers can prove they need them for work, health or religious reasons. Ms <mark>Lam</mark> stressed it does not mean the semi-autonomous Chinese territory is in a state of emergency. She said she would go to the legislature later to get legal backing for the rule. \"People are asking can Hong Kong go back to normal? Is Hong Kong still a place where we can have our sweet home?\" she said as she announced the ban. \"We must stop the violence. Now, it's all over Hong Kong .\" <mark>Carrie Lam</mark> (Vincent Thian/AP) Even as she wrapped up her announcement, protesters in masks and concealing themselves under umbrellas were gathering. The ban makes the wearing of full or partial face coverings, including face paint, at public gatherings punishable by a year in jail. A six-month jail term could be imposed on people who refuse a police officer's order to remove a face covering for identification. Ms <mark>Lam</mark> would not rule out a further toughening of measures if violence continues. She said she would not resign because \"stepping down is not something that will help the situation\" when Hong Kong is facing \"a very critical state of public danger\". \"We must save Hong Kong, the present Hong Kong and the future Hong Kong,\" she said. \"We can't just leave the situation to get worse and worse .\" Thousands of masked protesters marched in the city's business district (Vincent Yu/AP) Thousands of masked protesters marched in the city's business district before she spoke. They chanted \"I want to wear face masks\" and \"Wearing a mask is not a crime\". \"Will they arrest 100,000 people on the street? The government is trying to intimidate us but at this moment, I don't think the people will be scared,\" one protester told an online live broadcast. At the nearby Causeway Bay shopping area, a huge crowd occupied streets to protest against the mask ban, and smaller rallies were held in several other areas. The protests have lasted months (Vincent Thian/AP) Face masks have become a hallmark of protesters in Hong Kong, even at peaceful marches. As the use of police tear gas has become widespread, many young protesters have worn heavy duty gear including full gas masks and goggles. Even peaceful masked marchers cite fears they could lose jobs and be denied access to schooling, public housing and other government-funded services if identified as having taken part in demonstrations. Many also are concerned their identities could be shared with the massive state-security apparatus that helps keep the Communist Party in power across the border in mainland China, where hi-tech surveillance including facial recognition technology is ubiquitous. 0 comment", "articleID": "2019100412_00044030_W", "names": {"Carrie Lam": ["Q19217", "Q5046264"]}}, {"date": "2019-10-04", "url": "http://www.hartlepoolmail.co.uk/sport/football/middlesbrough-fc/ex-sunderland-star-jill-scott-ready-north-east-homecoming-lionesses-head-middlesbrough-643334", "content": "Sport Football Middlesbrough FC Ex-Sunderland star <mark>Jill Scott</mark> ready for North East homecoming as Lionesses head to Middlesbrough England midfielder <mark>Jill Scott</mark> is itching to welcome Brazil's Latin flair to the north east after returning to the squad following her post-World Cup recovery. By Mail Reporter Friday, 4th October 2019, 13:20 pm Updated Friday, 4th October 2019, 13:20 pm <mark>Jill Scott</mark> The 32-year-old Manchester City star has regained her place in Phil Neville's squad for the upcoming friendlies against Brazil and Portugal having been left out of the last camp. In her absence the Lionesses came away with results of a different ilk to their usual standards. First a two-goal lead slipped away in a 3-3 draw with Belgium before a 2-1 defeat at the hands of Norway--who England beat in the quarter-finals just two months prior. Neville's side will face the Brazilians at the Riverside Stadium on Saturday--just a stone's throw away from where <mark>Scott</mark> grew up in Sunderland--with almost 30,000 fans expected to show their support. Sign up to our daily newsletter The i newsletter cut through the noise Thanks, {{email}} has been added to our newsletter. If this is the first time you have subscribed to emails from JPIMedia Ltd, the publishers of Hartlepool Mail, please check your inbox to verify your email address. Sorry, there seem to be some issues. Please try again later. Submitting...The female canaries will arrive in the north east with Pia Sundhage at the helm having appointed the Swede, who has reached the last three Olympic gold medal matches, after the World Cup. But <mark>Scott</mark> expects to welcome the same Brazil that fans know and love to see. \"Over the years Brazil has just been one of those teams that you can never write off,\" she said. \"They have got some experienced players and some good young players but most importantly they have got players that can create something out of nothing .\" For someone like Marta--she just needs an instant and she can change the game. \"I am sure that whatever coach they have in charge they will try and keep a lot of the ball because that is the Brazilian philosophy .\" Being from the north east myself I can guess that it will probably be a rainy day so maybe that will suit us well but either way we are going to have to be on our game. \"There have been a lot of tickets sold so that is great for us and I know how influential the north-east supporters were during my early years as an England player .\" Their love for the game filtered down to me from a young age and it will be great to go up there and show them what we can do - plus it means more of my family can come too. \"<mark>Scott</mark> is joined in the squad by World Cup stars Alex Greenwood and Fran Kirby, who also missed out on the previous camp. Fellow midfielder Jordan Nobbs is also back in action, making her international return after almost a year away with a knee injury. Competition for places in Neville's midfield has been hotly-contested since the former Manchester United man took charge. That looks set to intensify after Nobbs' return and right-back Lucy Bronze proving she can hold her own further up the field. And <mark>Scott</mark> is confident there is a healthy level of competition running right through the current squad .\" Our midfield has always been a very difficult place to break into because of the quality of the players that we have, \"she added .\" Each player brings something uniquely different to the squad and I am delighted that we have got Jordan [Nobbs] back with us too now. \"A player like her is always going to be missed when she is not in the squad - she has got a bit of everything and can score from 30-yards too - so we will benefit greatly from that .\" But the competition up and down the squad in so fierce at the moment and all the players know how hard they are going to have to work if they want to keep playing for England. \"Tickets for England Women v Germany at Wembley Stadium on Saturday, November 9 (ko 5.30 pm), priced only £ 1 under-16s and £ 15 adults, are on sale now at www.TheFA.com/Tickets Sign up for the newsletter Keep up with the latest news and views from Hartlepool Mail Sign Up Most Popular {{index}}. {{title}} Most Popular {{index}}. {{title}}", "articleID": "2019100412_00231947_W", "names": {"Jill Scott": ["Q10896", "Q232592", "Q23661775"]}}, {"date": "2019-10-07", "url": "http://www.keyt.com/lifestyle/south-african-student-fights-animal-poaching-using-wildlife-photos/1129828096", "content": "South African student fights animal poaching using wildlife photos Photo of rhino dehorning wins awards By: Posted: Oct 07, 2019 10:45 AM PDT Updated: Oct 07, 2019 10:45 AM PDT Student Neville Kgaugelo Ngomane has won awards for his startling images of a rhino having its horn removed and he's now using photography to highlight the dangers to wildlife caused by poaching. Neville Kgaugelo Ngomane via CNN Student Neville Kgaugelo Ngomane has won awards for his startling images of a rhino having its horn removed and he's now using photography to highlight the dangers to wildlife caused by poaching. Related content Rhinoceros DNA database helps nail poachers, traffickers (CNN) - It's a shocking image: A huge rhinoceros pinned to the ground while a grimacing man shreds a power saw through its horn, white shards shooting off in a blur of high speed. The photograph, taken by 20-year-old student Neville Kgaugelo Ngomane, shows the radical lengths that are now being taken to protect vulnerable rhinos from the poachers who hunt them down for their horns. Though it seems cruel, this is now a standard practice in some parts of Africa to keep rhinos alive. Robbed of the horns that fetch high prices in illegal trade, the rhinos will be left alone. The dramatic photo won Ngomane the Young Environmental Photographer of the Year Award in the International Chartered Institute of Water and Environmental Management (CIWEM) photography competition in September. Out of more than 4,000 entries for the competition, Ngomane's titled \"Desperate Measures\" was picked by judges alongside thirteen others as winners for the competition. Ngomane, born in Mpumalanga, in eastern South Africa, said the rhino dehorning was \"not easy to watch,\" but he hopes the graphic image will contribute to the preservation of these powerful beasts. \"I wanted to use the photo to show people that they should stop poaching, to be aware of its dangers,\" he says. \"And I became so excited when I heard that I had won. To be picked among more than 4000 entries, it is a big deal .\" Poaching is a serious business in South Africa. In 2018, there were a total of 1,873 poaching incidents in different parks across the country, according to a report from South Africa's Department of Environment Affairs. As a child, Ngomane spent a lot of his time watching documentaries about wildlife conservation. He learned to use a camera in 2014 by watching tutorials online but says he could not capture wildlife because he did not have money to pay to get into the national parks where the animals roam freely. \"When I was in the ninth grade, one of my teachers brought a camera to school and he used to let me take it home for the weekend,\" he said. \"But it was hard for me to photograph wildlife because I had no money to pay to go to the reserves. So, I just settled for taking pictures of events,\" he added. Things changed for Ngomane in 2017 when he stumbled on Wild Shots Outreach, a not-for-profit organization with a focus on teaching photography. Based in Hoedspruit, north of South Africa, Wild Shots Outreach trains students and unemployed youths from disadvantaged communities to photograph wildlife and the environment. \"I saw some of their works on Facebook so I started sending messages like every three weeks,\" Ngomane said. \"I wanted the founder to come to my school to teach us how to photograph wildlife .\" <mark>Mike</mark> Kendrick, director of Wild Shots Outreach met with a school group led by Ngomane in 2018 and taught them to shoot videos and stilt photos for free. \"Sometimes I find young people within the school groups who have a real passion and talent for photography, and I am able to give them a second-hand camera,\" Kendrick told CNN. \"I was able to give him (Ngomane) a camera that works well, which is the one he used to take that photo of the rhino dehorning,\" he added. In partnership with Canon South Africa, Kendrick was also able to get experts from Canon to give Ngomane's group advanced training on how to take complex shots. Ngomane says meeting Kendrick allowed him to visit the parks and wildlife reserves he missed out on as a child. According to him, he has now taken hundreds of animal photos. \"At first I didn't want to share my photos but <mark>Mr. Mike</mark> encouraged me to. That's how I registered for the competition and won too,\" he said. Ngomane has also learned how to edit videos. He plans to shoot documentaries on the need for wildlife conservation. \"I want to get outside, be in the busy anywhere in Africa. I want to keep on taking pictures and making videos that show environmental awareness,\" he said. The-CNN-Wire", "articleID": "2019100717_00408405_W", "names": {"Mr. Mike": ["Q16214090", "Q1951427"]}}, {"date": "2019-10-09", "url": "https://investingnews.com/daily/tech-investing/emerging-tech-investing/artificial-intelligence-investing/oss-receives-us1-1-million-order-for-ai-computing-systems/", "content": "The global satellite company will be utilizing OSS's deep learning systems for processing satellite signals in Europe, North America and Asia. One Stop Systems (NASDAQ: OSS), a high performance computing company announced that it has received a contract from a satellite company totalling US $1.1 million. Through the deployment of its AI on the Fly platform, the satellite company will integrate its advanced systems for satellite signal processing. As quoted in the press release: These additional systems will be deployed within satellite ground stations located in the U.S., Europe and Asia Pacific. The systems support the regeneration and processing of satellite signals using AI deep learning models. \"This follow-on order demonstrates the Volta-16's strong fit for this AI on the Fly application, and reflects the industry trend toward deploying an extremely high level of computing power in the field,\" said <mark>Steve Cooper</mark>, president and CEO of OSS. \"We are excited to play a leading role in this fundamental transition in how AI capabilities are deployed world-wide .\" OSS plans to ship these systems in the fourth quarter of 2019. Click here to read the full press release. Find stocks in Artificial Intelligence Artificial Intelligence is used in technology across the globe. Should you invest in the market? Click here to get your free report on A.I. investing!", "articleID": "2019100916_00265733_W", "names": {"Steve Cooper": ["Q18588205", "Q18640334", "Q24183505"]}}, {"date": "2019-10-10", "url": "http://www.burytimes.co.uk/news/national/17960231.british-airways-offset-carbon-emissions-uk-flights/", "content": "British Airways to offset carbon emissions from UK flights By Press Association 2019 British Airways aircraft 0 comment British Airways says it will become the first UK airline to offset carbon emissions on all its domestic flights. From January 2020, the carrier will invest in carbon reduction projects around the world to offset emissions from its flights within the UK. The airline operates up to 75 flights a day between London and 10 other UK cities, generating around 400,000 tonnes of CO2 each year. The projects being supported include those involving renewable energy, rainforest protection and reforestation. British Airways's parent company IAG has also committed to achieving net zero carbon emissions by 2050. The group claimed it can achieve this target through environmental initiatives such as investing more than 400 million dollars (£ 327 million) in the development of sustainable aviation fuels over the next 20 years. British Airways chief executive <mark>Alex Cruz</mark> said: \"British Airways is determined to play its part in reducing aviation's CO2 emissions .\" To solve such a multi-faceted issue requires a multi-faceted response and this initiative further demonstrates our commitment to a sustainable future. \"It also follows our announcement to partner with renewable fuels company, Velocys, to build a facility which converts household and commercial waste into renewable sustainable jet fuel to power our fleet .\" The airline is inviting passengers on non-domestic flights to \"reduce their impact on the environment\" through carbon offsetting. It offers a tool which calculates emissions, resulting in a flight from London to Madrid in economy costing £ 1 to offset, while London to Los Angeles in business comes with a £ 24 fee. 0 comment", "articleID": "2019101012_00044775_W", "names": {"Alex Cruz": ["Q19560299", "Q21196486", "Q27064245", "Q4717262", "Q9286389"]}}]