[{"articleID": "2017073019_00479611_W", "names": {"Cameron Stewart": ["Q1921734", "Q5026387"], "Barry Allen": ["Q5210005", "Q808998"], "Chris Miller": ["Q13638984", "Q25184124", "Q283700", "Q5107465", "Q5107466", "Q58011841"]}, "date": "2017-07-30", "url": "http://heroichollywood.com/justice-league-vfx-artists-mustache/", "content": "Last week, the internet was ablaze with some great jokes regarding Henry Cavill's role in the reshoots for Justice League. Because he is currently shooting Mission: Impossible 6, Cavill grew an impressive mustache that would totally hide his identity as Clark Kent even more than his classic spectacles that somehow guard him from people recognizing that he actually is Superman. Because Justice League reshoots are underway, Cavill's schedule is quite hectic. However, Paramount Pictures is not allowing the actor to shave off his mustache despite his need to play Superman in Justice League. So instead of him shaving it off and having to wear a fake mustache for the rest of his work on Mission: Impossible 6, VFX artists on Justice League have to digitally remove his mustache for the footage used in the reshoots. Also read: \"Mission: Impossible' Director: Why\" Justice League' Star Henry Cavill Couldn't Shave Business Insider recently spoke with some VFX artists at The Mill regarding the process of digitally removing facial hair off of actors. As it turns out, that process is quite common depending on actors' involvement with other projects. Dave Fleet, head of 3D for The Mill discussed the process that may be utilized for Cavill's situation: \"Smoothing out tiny vellus hairs on the skin requires a totally different approach to removing a large volume of hair, like a beard or mustache. If we were to remove a beard we would have to digitally re-build the actor's face behind the hair mass. We would need to build a 3D model of the face and then shade the surface of the skin to look realistic. We would then need to track the 3D model to the movement of his head and potentially re-animate his mouth. The amount of lip animation would depend on how much of the original beard occluded his lips. We would need to paint out the parts of the beard that extend beyond his shaven face.\" Fleet also explained how long it will take to remove the mustache in post-production: \"One week just to make the 3D elements; then another three weeks to track, animate, and render the shaven face; and another two weeks to composite it all together.\" VFX artists are some of the most hard-working people in the industry. For one, putting together some of Hollywood's most exciting set-pieces is something to be lauded for. Also, their work on the effects one doesn't see immediately also deserves some praise. So yes, the removal of the Super-Stache is just as impressive as seeing the Justice League unite to fend off the Parademons. Talk about artistry. Justice League opens in theaters on November 17, 2017. Source: Business Insider; <mark>Cameron Stewart</mark> (Image Header) 5 Things We Want To See In \"Flashpoint' Previous 1 of 6 Next With DC revealing that the upcoming Flash movie will be titled Flashpoint, fans are wracking their brains trying to figure out what will happen. While the story is famous for rebooting the DC universe before the New 52 initiative, the series is chop full of awesome moments. The book is full of awesome alternate versions of characters and emotional moments that ground the universe-changing story in a deeply personal core narrative. For those who don't know, Flashpoint follows what happens after <mark>Barry Allen</mark> travels back in time to save his mother on the night of her murder. When he returns to the present, he finds that everything he's ever known is different and he's even lost his powers. It might not be the perfect story to introduce people to the larger Flash universe, but I trust Geoff Johns. Hopefully now that the plot seems to be a bit more set, a director or directors (I'm looking at you Phil Lord and <mark>Chris Miller</mark>) will step onto the project soon and help mold it into something awesome. If Warner Bros. chooses to introduce an alternate version of the DC Extended Universe to the bigscreen, there's no one I'd rather explore it with than Flash. <mark>Barry Allen</mark> is the heart and soul of the DCU, so it's only fitting to watch him try and inject some light into a dark version of his home. Hit Next to learn about the five things we want to see in Flashpoint. Previous 1 of 6 Next VIEW IN GALLERY"}, {"articleID": "2014111319_00059119_W", "names": {"Jim Bell": ["Q557294", "Q6193618"]}, "date": "2014-11-13", "url": "http://www.istockanalyst.com/article/viewarticle/articleid/7078338", "content": "i On The Market - Daily Newsletter Every trading day, be ready to attack the market instead of reacting to the market. You will know where the key technical resistance and support levels are and what the market is likely to do next. iStock will arm you with a target list of stocks to buy and sell - right now - based on our exclusive, proprietary trading models. <mark>Bell</mark> Investment Advisors Announces Event: Making a Good Life Happen (R)--The Lunch <mark>Bell</mark> Investment Advisors Announces Event: Making a Good Life Happen (R)--The Lunch OAKLAND, CA--(Marketwired - Nov 13, 2014) - <mark>Bell</mark> Investment Advisors, www.bellinvest.com, a Bay Area registered investment advisory firm, announced today that they will be hosting an event, \"Making a Good Life Happen ®--The Lunch\" on Wednesday, November 19, 2014, 12 - 1:30 PM at the firm's Oakland office. The lunch is part of an ongoing series of events that reflect the firm's dedication to providing free educational opportunities to the greater community focused on investment management, financial planning, and career/life coaching. The event will be hosted by <mark>Jim Bell</mark>, CFP ®, President & Founder, and Bonnie <mark>Bell</mark>, MA, MDiv ., Principal, and Director of Career/Life Coaching, who will discuss the firm's philosophy, \"Making a Good Life Happen.\" Attendees will learn how the firm's momentum-based investment strategy can help build positive momentum in other areas of life. Join the firm for lunch and networking with interesting local professionals from the San Francisco Bay Area. Discussion during the event could have a direct impact on the future career and life planning decisions of its participants. \"Most people want to have a good life, but unfortunately too many people simply cross their fingers and hope that will happen. As we always say, hope is not a strategy. Our momentum-based strategy offers insight into our philosophy, Making a Good Life Happen. This is a lunch that could actually change your life!\" says Bonnie <mark>Bell</mark>. http: //www.bellinvest.com/news-events/events/november-making-a-good-life-happen-lunch <mark>Bell</mark> Investment Advisors is a privately-owned, registered investment advisory firm, managing over $500 million in assets. It is in its 24 th year of business, offering investment management, financial planning and career/life coaching services. For more information, visit MEDIA CONTACT: Nancy Isaacs <mark>Bell</mark> Investment Advisors Canadian Paralympic Committee congratulates Sochi 2014 flag bearer and para-alpine ski champion Josh Dueck on career Morgan & Morgan Reminds Investors That a Class Action Lawsuit Has Been Filed Against Retrophin, Inc.--RTRX 5N Plus Winner in Multiple Categories in the 2014 Deloitte Technology Fast 50 (TM) Awards for a Fifth Consecutive Year Telenav Announces New Features for Scout?, Offering a More Social, Personalized and Intuitive Navigation Experience Zacks Investment Research, and Commentary, news and Press Releases provided by YellowBrix and Quotemedia. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. iStockAnalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. The blog articles are opinions by respective blogger. By using this site you are agreeing to terms and conditions posted on respective bloggers' website. The postings/comments on the site may or may not be from reliable sources. Neither iStockAnalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. You are solely responsible for the investment decisions made by you and the consequences resulting therefrom. By accessing the iStockAnalyst.com site, you agree not to redistribute the information found therein."}, {"articleID": "2014061607_00053649_W", "names": {"Brad Snyder": ["Q2923437", "Q3643525", "Q4954275"], "Brad Miller": ["Q15789609", "Q21288566", "Q21549841", "Q21553608", "Q386995", "Q4954126", "Q4954127", "Q4954129", "Q896845"], "Robbie Ross": ["Q3077396", "Q7340988"], "John Buck": ["Q14944060", "Q3181146", "Q51585769", "Q6223748"], "Michael Saunders": ["Q14492084", "Q25183901", "Q3091438"], "Corey Hart": ["Q2997264", "Q709024"]}, "date": "2014-06-16", "url": "http://www.kspr.com/sports/Seager-powers-Mariners-over-Rangers/21051914_26503544", "content": "Seager powers Mariners over Rangers Seager let his bat do the talking again on Sunday, when he went 4-for-4 with two doubles and three RBIs in the Mariners' 5-1 win over the Rangers. In 12 games against the Rangers this season, Seager is hitting .396 with 12 RBIs, five extra-base hits and a .646 slugging percentage. He is hitting .337 with a .667 slugging percentage against Texas over his four-year career. \"That's just one of those weird things,\" he said. \"That's baseball. I'd like to be able to do it against everybody.\" Seager drove in the Mariners' first three runs before scoring on left fielder Dustin Ackley's single in the eighth. Seattle starter Hisashi Iwakuma (5-3) allowed just one run off six hits over eight innings of work as the Mariners (34-35) snapped their five-game losing streak. In the hours before Sunday's game, Iwakuma didn't even think he'd be able to make the start. A sore neck hampered him throughout his pre-game stretch, so much so that a Seattle trainer had to be called in to loosen it up. \"I needed to pitch today,\" Iwakuma said after earning the win. \"I felt responsible, especially after (Seattle) losing five in a row, so I needed to go out there.\" Texas (34-35) got its lone run on a solo homer by <mark>Brad Snyder</mark> in the second inning, giving the Rangers a 1-0 lead. It was <mark>Snyder</mark>'s first career homer. \"I'm not going to lie: I've been working for that first big-league homer for a long time,\" said <mark>Snyder</mark>, the father of a young son whose own dad was watching the game on television back in Ohio. \"It is a big sigh of relief to get that first one out of the way. Especially on Father's Day, it's something I'll never forget.\" Seager, who already had a pair of singles, hit a two-out, two-run double in the fifth to put the Mariners ahead 2-1. He added another RBI double in the eighth for a 3-1 lead before scoring on Ackley's RBI single. Seattle scored its final run on shortstop <mark>Brad Miller</mark>'s sacrifice fly in the eighth. \"We certainly weren't trying to give him anything on the inside of the plate,\" Texas manager Ron Washington said, \"and when we did, he hit it.\" Seattle did most of its damage against Texas reliever <mark>Robbie Ross</mark> Jr., who gave up three runs off four hits before rookie Ben Rowen came on for him in the eighth. Rowen, making his major league debut, got three outs in the eighth to end Seattle's three-run inning. Texas starter Nick Martinez (1-4) went six innings, allowing two earned runs off nine hits. Seattle first baseman Logan Morrison did not finish the game after suffering a laceration to his forehead in the fifth inning. Morrison slammed his bat into a dugout wall in disgust after a popout with two runners on base and took a shard of the broken bat off his left eyebrow. He underwent five stitches after the game. \"I obviously acted like a 3-year-old,\" Morrison said after the game. \"I apologized to my teammates and to (manager Lloyd McClendon)....I'm embarrassed. No matter how bad I'm playing, I can't do that. You move on, and hopefully I can come back soon and start helping this team win games.\" NOTES: Mariners C <mark>John Buck</mark> made his first career appearance at first base in Sunday's sixth inning, when he replaced 1B Logan Morrison after an incident in the dugout. Morrison cut a gash over his left eye when the bat he slammed against a dugout wall cracked and bounced off his eyebrow. <mark>Buck</mark> played flawless defense for three innings before being lifted for a pinch runner in the bottom of the eighth ....Texas CF Leonys Martin was back in the leadoff spot Sunday, marking the second game in a row and the third time this season that he has batted first ....Mariners manager Lloyd McClendon said before Sunday's game that OF <mark>Michael Saunders</mark> (shoulder), 1B Justin Smoak (quad) and DH <mark>Corey Hart</mark> (hamstring) are getting closer to rehab assignments. All three players are currently on the 15-day disabled list, with <mark>Hart</mark> eligible to come off whenever he's healthy ....Rangers 3B Adrian Beltre was initially slated to serve as designated hitter Sunday, but about 30 minutes before the game he changed positions with Donnie Murphy ....McClendon said the team still has no timetable for calling up RHP Taijuan Walker, who threw six innings of no-hit ball before giving up his only hit allowed in a 6 2/3 - inning performance at Triple-A on Friday night. Walker struggled with shoulder problems throughout the spring and early part of the season but appears to be getting closer to a clean bill of health. Distributed by Internet Broadcasting and The Sports Xchange. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2018032903_00138570_W", "names": {"Mark Hoffman": ["Q26935179", "Q56636102"], "Mark Murphy": ["Q1900301", "Q2340169", "Q3294194", "Q6768972", "Q6768973", "Q6768974", "Q933550"]}, "date": "2018-03-29", "url": "http://www.postcrescent.com/story/sports/columnists/paul-smith/2018/03/28/smith-lake-michigan-chinook-and-alewife-near-desired-balance-new-report-says/464240002/", "content": "Share This Story! Let friends in your social network know what you are reading about Facebook Email Twitter Google + LinkedIn Pinterest Smith: Lake Michigan chinook and alewife are near the desired balance, a new report says The latest estimates boost confidence in the future of Lake Michigan salmon fishery amid lower reported levels of forage. Post to Facebook Smith: Lake Michigan chinook and alewife are near the desired balance, a new report says The latest estimates boost confidence in the future of Lake Michigan salmon fishery amid lower reported levels of forage. Check out this story on postcrescent.com: https: //jsonl.in/2pN5WPS Cancel Send Sent! A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Subscribe Today Log In Subscribed, but don't have a login? Activate your digital access. CONNECT TWEET LINKEDIN COMMENT EMAIL MORE The population of Lake Michigan's top predator fish was well balanced with its primary food source in 2017, according to an annual estimate released last week by fisheries scientists. The news helped boost confidence in the future of the chinook salmon fishery even as the species' key forage, the alewife, is historically low. The predator-prey ratio (PPR) on Lake Michigan was 0.058 in 2017, according to a report presented March 22 at the Upper Lake Committees Meeting of the Great Lakes Fishery Commission in Sault Ste. Marie, Ontario. The PPR expresses the balance between chinook and alewife. Higher numbers indicate more predators than desired for the available prey. The target is 0.05, with 0.10 the upper limit. From 2013 to 2016, the values were 0.09, 0.06, 0.51 and 0.56, respectively. \"Overall, it's somewhat positive and encouraging to see the PPR come down from levels of five years ago,\" said Nick Legler, fisheries biologist for the Wisconsin Department of Natural Resources and chairman of the Lake Michigan Committee's Salmonid Working Group. Legler presented the latest chinook information on behalf of the group, which includes fisheries personnel with state agencies in Wisconsin, Michigan, Illinois and Indiana, American Indian tribes, Michigan State University, the U.S. Fish and Wildlife Service and U.S. Geological Survey. The data included creel survey information, annual forage assessments by acoustic and bottom trawls and fish examined at weirs. Facebook Twitter Google + LinkedIn Photos: Salmon egg harvest Fullscreen Post to Facebook Posted! A link has been posted to your Facebook feed. DNR fisheries biologist Nicholas Legler handles a chinook salmon. <mark>Mark Hoffman</mark> / Milwaukee Journal Sentinel Fullscreen DNR workers James Dobie (left) and Miesha Hackett, along with her husband Isaac Hackett corral chinook salmon into a net. <mark>Mark Hoffman</mark> / Milwaukee Journal Sentinel Fullscreen A net full of chinook salmon are lifted from water infused with carbon dioxide to make the fish easier to handle while processing. <mark>Mark Hoffman</mark> / Milwaukee Journal Sentinel Fullscreen A scar from a sea lamprey is shown on a chinook salmon. <mark>Mark Hoffman</mark> / Milwaukee Journal Sentinel Fullscreen A handful off chinook salmon eggs that will be sold for bait. <mark>Mark Hoffman</mark> / Milwaukee Journal Sentinel Fullscreen Chinook salmon await processing. <mark>Mark Hoffman</mark> / Milwaukee Journal Sentinel Fullscreen Fertilized eggs are placed in coolers. <mark>Mark Hoffman</mark>, Milwaukee Journal Sentinel Fullscreen DNR worker Melissa Johnson uses compressed air to force eggs from a chinook salmon. <mark>Mark Hoffman</mark> / Milwaukee Journal Sentinel Fullscreen Like this topic? You may also like these photo galleries: Replay 1 of 8 2 of 8 3 of 8 4 of 8 5 of 8 6 of 8 7 of 8 8 of 8 Autoplay Show Thumbnails Show Captions Last Slide Next Slide Concern over the health of the chinook fishery peaked in recent years as surveys found fewer alewife in the lake, including a record low biomass of adult alewife in 2017, according to bottom trawls conducted by the USGS. In 2016, the Lake Michigan Committee of the Great Lakes Fishery Commission recommended a 62% chinook stocking reduction to help stave off a potentially serious imbalance. In the five years preceding a collapse of the chinook fishery in Lake Huron, the PPR averaged 0.11. Chinook stocking has been reduced multiple times over the decades in response to disease issues and declines in the forage base. The most recent cut was in 2013. But many anglers, including charter captains and members of the Wisconsin Lakeshore Business Association, pushed back in 2016 and convinced the Wisconsin DNR to keep chinook stocking level. Cuts were made instead to plants of brown trout and lake trout. The 2017 assessment of one annual benchmark--weight of a 3-year-old female chinook salmon--made it clear the fish were in good condition last year in Lake Michigan. Like Milwaukee Journal Sentinel Sports on Facebook for the latest Wisconsin sports updates right in your news feed. Visit JS Sports on Facebook Like Milwaukee Journal Sentinel Sports on Facebook for the latest Wisconsin sports updates right in your news feed. Visit on Facebook The data were obtained from 931 chinook gathered at seven spots around Lake Michigan, including the Root River in Racine and Strawberry Creek in Sturgeon Bay. . The 2017 lakewide average weight of a 3-year-old female chinook was 17.8 pounds, a 0.6 pound decrease from 2016 but 5.8 pounds higher than 2015. Significantly, the 2017 weight was 2.3 pounds higher than the long-term (1986-2017) average of 15.5 pounds. The most recent PPR and average chinook weight information validated observations of many Lake Michigan charter captains. \"That's the kind of the data I was expecting based on what I see on a day-to-day basis on the lake,\" said Jason Woda, 43, of Oak Creek, who owns and operates Reel Sensation Charters in Milwaukee. \"Many of us feel like there is more bait out there than the surveys have shown and that the fish are in good shape.\" Woda also serves as secretary of the Wisconsin Lakeshore Business Association, \"There was talk about cutting 500,000 chinook just a couple years ago,\" Woda said. \"That would have put a lot of ports out of business. We said we didn't want an increase, but let's put the brakes on any plans to cut chinook. This recent data shows that was a good decision.\" Chinook are not native to the Great Lakes but were introduced to Lake Michigan in the 1960s to help control nuisance levels of alewife, also a non-native species. Chinook are highly valued by anglers for their sport and table value. In Wisconsin, annual chinook stocking peaked at 2.7 million in 1989 and in recent years was 1.5 million in 2004, 1.17 million in 2006, 724,545 in 2008, 1.23 million in 2010, 1.18 million in 2012 and 823,222 in 2014, according to DNR records. A freshly caught Chinook salmon hauled in by Wendy Morris flops around on the dock in Port Washington. (Photo: <mark>Mark Hoffman</mark>, Milwaukee Journal Sentinel) The most recent plans call for keeping chinook stocking in the 800,000 s. Managing the lake's trout and salmon fishery is complicated by natural reproduction of chinook, primarily in streams in Michigan. In recent years, about two-thirds of chinook sampled lake-wide were wild, or naturally reproduced, according to the U.S. Fish and Wildlife Service. Chinook are watched closely since they consume the most prey fish in the lake and rely most heavily on alewife. In 2017, chinook consumed 47 kilotonnes of forage fish, compared to 21 for steelhead, 19 for lake trout, 8 for brown trout and 4 for coho, according to the report. The recent data and estimates have helped allay fears that a Lake Huron-like collapse was imminent on Lake Michigan. Fisheries scientists will continue to keep a close eye on the lake, however, and caution that year-to-year swings can be substantial. Legler pointed out that the lake's alewife biomass is at a record low, PPR is slightly above target and there has been a slight upward trend over the last three years. \"The goal is to sustain the great fishery that's out there,\" said Brad Eggold, WDNR Lake Michigan fisheries manager. \"It's clear management actions have helped in the past and we're committed to working with our partners and stakeholders around the lake to continue that into the future, too.\" Top Headlines from Sports: Ji-Man Choi is a surprise on the Brewers' opening day roster Bevy of topics on minds of Packers' <mark>Mark Murphy</mark>, NFL Chase Anderson evolved into complete starter CONNECT TWEET LINKEDIN COMMENT EMAIL MORE"}, {"articleID": "2019062615_00159068_W", "names": {"Jeremy Hunt": ["Q333533", "Q929730"]}, "date": "2019-06-26", "url": "http://www.theargus.co.uk/news/national/17731985.scottish-conservative-leader-backs-jeremy-hunt-to-be-next-pm/", "content": "Scottish Conservative leader backs <mark>Jeremy Hunt</mark> to be next PM By Press Association 2019 Ruth Davidson 0 comment Ruth Davidson has announced she is backing <mark>Jeremy Hunt</mark> in the Tory leadership contest. The Scottish Conservative leader tweeted: \"Any Conservative leadership candidate must put the Union first. <mark>Jeremy</mark> has done so and will get my vote.\" She referenced a news article in her tweet in which Mr <mark>Hunt</mark> said preserving the union is more important than ensuring Brexit goes ahead. <mark>Jeremy Hunt</mark> visited Aberdeenshire at the weekend and pledged his support to the union (PA) Mr <mark>Hunt</mark> made the comments in a visit to the north east of Scotland on Sunday, in response to a YouGov poll suggesting a majority of Conservative members want Brexit even if it means Scotland gaining independence. Asked if he would choose Brexit or the union, the Foreign Secretary said: \"The union every time.\" Mr <mark>Hunt</mark> is Ms Davidson's third pick for the next prime minister, after her first two choices were knocked out of the contest. She initially backed Home Secretary Sajid Javid, who exited the contest after the third round of voting among Tory MPs, and she then switched to Environment Secretary Michael Gove, who was eliminated in the final parliamentary ballot. 0 comment"}, {"articleID": "2013022306_00026516_W", "names": {"Zach Nelson": ["Q8063827", "Q8063828"]}, "date": "2013-02-23", "url": "http://inforum.com/event/article/id/391014/", "content": "e-mail published february 22, 2013, 10:57 pm grafton-park river wins nd state boys hockey semifinal grand forks - sometimes, jade miller admits, it's better to be lucky than good. by: greg devillers / forum news service, inforum grand forks - sometimes, jade miller admits, it's better to be lucky than good. the grafton-park river junior bounced a goal off the back of an opponent friday night. that gave the spoilers a 5-3 lead, a two-goal margin they maintained the rest of the way in defeating bismarck century 6-4 in the semifinals of the north dakota state boys high school hockey tournament. the spoilers will meet grand forks red river for the state title at approximately 7:30 p.m. today at ralph engelstad arena. miller approached the net from the right side and his shot hit the side of the net. he recovered the puck, threw it back and the puck bounced off the back of goalie jack abfalter and into the net. \"i knew there were two century guys both down,\" miller said. \"i fired it, looked back and saw it hit the back of the goalie and go in.\" i got pretty lucky. but i'll take a goal any way i can get one. \"it stayed 5-3 until johnny robideaux scored on an empty net with 1:34 left. century's jeff gendreau made the final 6-4 score with a goal with 3 seconds remaining. grafton-park river finished strong after a slow start. century led 2-1 after the first period. but grafton-park river scored three goals unanswered goals in the first 8:38 of the second period to go ahead to stay. peter hills tied the score on a power-play goal at the 1:02 mark. then <mark>zach</mark> feltman intercepted a pass on the left side and centered to cole rehovsky, who scored. brett longtin made it 4-2 when he scored on a 1-on-2.\" we didn't come out (in the first period) with the energy we needed, \"grafton-park river coach scott petersen said.\" but the kids picked up the intensity in the second period. i thought that was the difference. and we didn't take good care of the puck early. we took care of it a little better after the first. \"cole has a great shot. he went hard to the net.\" abfalter finished with 20 saves. spoilers goalie <mark>zach nelson</mark> had 26, including several big ones in a 14-save third period. and then there was miller's goal. \"sometimes you get good bounces,\" petersen said. \"we got a good one.\" first period: 1, gpr, peterson (hills, rehovsky),:45. 2, bc, kelly (flicek), 2:51. 3, bc, hruby, 8:48. second period: 4, gpr, hills (thompson), 1:02. 5, gpr, rehovsky (feltman, hills), 3:50. 6, gpr, longtin (woinarowicz), 8:38. 7, bc, rauhauser (anderson), 15:35. third period: 8, gpr, miller (robideaux), 5:35. 9, gpr, robideaux (miller), 15:26. 10, bc, gendreau (hruby) 16:57. saves: bc, abfalter 4-9-7-20. gpr, <mark>nelson</mark> 7-5-14-26."}, {"articleID": "2017110313_00709375_W", "names": {"Kate Forbes": ["Q24039479", "Q28007154"]}, "date": "2017-11-03", "url": "http://www.bbc.co.uk/news/uk-scotland-highlands-islands-41860773", "content": "Residents buy land near Fairy Pools to ease traffic 3 November 2017 These are external links and will open in a new window Close share panel Image copyright John Allan/Geograph Image caption The series of waterfalls and pools in Glen Brittle have become a major tourist attraction Residents on Skye have bought land near a popular tourist spot in a bid to reduce congestion in the area. Locals say the high volume of visitors and traffic at the Fairy Pools has become \"too much to bear\" . Minginish Community Hall Association (MCHA) is the first to make use of a scheme which allows publicly-owned forestry assets to be transferred for the benefit of local communities. The scheme is run by Forest Enterprise Scotland (FES). The MCHA bought the 12.3 hectares of land for £ 2,500 - a discount of £ 27,500 on the market value - because of the \"substantial public benefit that will be delivered\" . \"World-class attraction' The series of waterfalls and pools in Glen Brittle have become a major tourist attraction and the area was recently named by travel guide Wanderlust as the best place in Britain for wild swimming. Local MSP <mark>Kate Forbes</mark> said there were more than 108,000 visitors to the Fairy Pools last year, but access is restricted by a single-track road and a 35-space car park. The MCHA plans to make space for 137 cars and about 20 mini-buses and camper vans in a bid to reduce congestion. Image copyright Richard Dorrell/Geograph Image caption The access road to the Fairy Pools is single track The land acquisition was announced by Tourism Secretary Fiona Hyslop during a visit to Skye. She said:\" I am delighted FES have agreed to the sale of this land, which will help the local community respond to the pressures and opportunities that come with having a world-class attraction like the Fairy Pools on your doorstep. \"We recognise the recent surge in interest seen by some of our tourism sites, particularly in rural locations. That is why we recently announced a new £ 6m Rural Tourism Infrastructure Fund.\" Alongside the Skye strategic group, the Scottish government will continue to do all we can to support sustainable growth in tourism, working in partnership with local communities - in Skye, throughout the Highlands & Islands and across Scotland. \"\"Too much to bear' Julie Burnett, a director of MCHA, said:\" This is a key milestone in the project to provide improved parking facilities close to the Fairy Pools. \"The community benefit of the land transfer and the overall project cannot be overstated.\" Both residents living in Glen Brittle and future visitors to the Fairy Pools will benefit from the proposal to expand and improve the existing small car park. \"Ms <mark>Forbes</mark> said a\" robust \"tourist strategy was needed for Skye as a whole to improve infrastructure.\" The situation at the Fairy Pools has really become too much to bear for local residents who just want to go about their daily lives, \"she said.\" The single-track road is far too narrow for the volume of traffic parked at the Fairy Pools. \"We've reached a point where enough is enough and I'm pleased the Scottish government is facilitating the community asset transfer at the Fairy Pools.\" She said she had begun a series of meetings to draft a strategy for the island. \"Tourists are welcome on Skye, it's our responsibility to ensure the infrastructure is prepared for them,\" she said."}, {"articleID": "2017102421_00640749_W", "names": {"Ricardo Perez": ["Q1334974", "Q28976377", "Q30122668", "Q5485794"], "Stephen Davis": ["Q3498537", "Q7609026", "Q7609027"], "Walter Koenig": ["Q376176", "Q42832997"], "Ron Howard": ["Q103646", "Q19874445", "Q3940969", "Q4883"]}, "date": "2017-10-24", "url": "https://geektyrant.com/news/full-trailer-for-netflixs-stretch-armstrong-and-the-flex-fighters-animated-series", "content": "Full Trailer For Netflix's STRETCH ARMSTRONG AND THE FLEX FIGHTERS Animated Series Trailer TV Stretch Armstrong and the Flex Fighters Netflix about 35 minutes ago by Joey Paur Netflix has released a full trailer for their upcoming animated series Stretch Armstrong and The Flex Fighters. The series was inspired by the classic late 70's - early 80's action figure that kids could stretch. The series has a very different kind of tone and vibe as the original toy, but it looks like a fun series that the kids will enjoy. The story follows a high school student named Jake Armstrong and his two best friends Nathan Park and <mark>Ricardo Perez</mark> and they are accidentally exposed to an experimental chemical that forever changes their lives. They are transformed into unlikely heroes who embark on a series of adventures. <mark>Stephen Davis</mark>, Chief Content Officer and Executive Vice President, Hasbro Inc. previously had this to say in a statement: \"Stretch Armstrong and the Flex Fighters is the first Hasbro brand to receive a Netflix original series order. We have been waiting for just the right moment to re-imagine Stretch for a new audience and our friends at Netflix got it right away; they have been a tremendous partner. We have hit a superhero sweet spot, and with Netflix's global reach, kids across the world will fall in love with its fun characters and action-packed storyline.\" Stretch Armstrong and the Flex Fighters will feature some great voice talent that includes Scott Menville (Teen Titans Go!, Teenage Mutant Ninja Turtles) as Jake Armstrong/Stretch, Steven Yeun (The Walking Dead, Okja) as Nathan Park/Wingspan, Ogie Banks (Ultimate Spider-Man) as <mark>Ricardo Perez</mark> / Omni-Mass, Wil Wheaton (Teen Titans Go!, Star Trek: The Next Generation) as Rook, Felicia Day (The Guild, Supernatural) as Erika, Keith David (Adventure Time, Rick and Morty) as Kane, Kate Mulgrew (Orange Is the New Black, Star Trek: Voyager) asDr. C, and <mark>Walter Koenig</mark> (Star Trek, Babylon 5) as Mr. Savic. The series will consist of 26 episodes and will debut in late 2017. Facebook Twitter Pinterest Reddit Joey Paur--Co-Founder / Editor of GeekTyrant.com, and if you haven't noticed I write...a lot. Movies are my passion and I live and breathe all things geek. This site is part of my life's work, it's a part of me. I love what I do, and I enjoy sharing everything I can with you when it comes to movies and geekery. In my spare time I travel to the netherworlds to battle demons. @ JoeyPaur | joeypaur @ geektyrant.com Featured Posts on GeekTyrant Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Review: THOR: RAGNAROK is an Insanely Funny and Wild Adventure! Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Review Marvel, Thor: Ragnarok, Taika Waititi, Chris Hemsworth, Cate Blanchett, Mark Ruffalo Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Brutally Intense New Trailer For THE PUNISHER and The Release Date is Set For November! Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 19, 2017 Movie, Trailer The Punisher, Marvel, Netflix Joey Paur Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment The HAN SOLO Film Has Wrapped Production and Finally Has an Official Title SOLO: A STAR WARS STORY Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 17, 2017 Movie Solo: A Star Wars Story, Star Wars, <mark>Ron Howard</mark> Kristian Odland Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Marvel Unleashes an Awesome New BLACK PANTHER Trailer! Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 16, 2017 Movie, Trailer Marvel, Black Panther Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Watch The Incredible and Haunting New STRANGER THINGS Season 2 Trailer Now! Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 TV, Trailer Stranger Things, Netflix Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Creepy Cool First Trailer For The X-Men Horror Movie THE NEW MUTANTS Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Oct 13, 2017 Movie, Trailer New Mutants, X-Men, Horror, The New Mutants Joey Paur Comment Back to GT Homepage"}, {"articleID": "2019021218_00316185_W", "names": {"Jim Patterson": ["Q1185698", "Q20640826", "Q6197397"]}, "date": "2019-02-12", "url": "https://www.journal-topics.com/articles/glenbrook-dist-225-hires-charles-johns-as-new-superintendent/", "content": "Charles Johns, hired by school board members Monday to replace Mike Riggle as Glenbrook High School Dist. 225 superintendent beginning July 1, cuts a cake at the school board meeting welcoming him to the district. (Tom Robb/Journal photo) Glenbrook High School Dist. 225 board members hired Charles Johns to replace Supt. Mike Riggle after Riggle retires. Johns' first day will be July 1 at the start of the district's new fiscal year. Johns is currently superintendent of West Chicago School Dist. 33, but has experience in both elementary and high schools, working his way up from teacher and debate coach at Township High School Dist. 214's Elk Grove High School, to dean, assistant principal, principal, assistant superintendent and superintendent in Dist. 214, Elmhurst Community Unit School Dist. 205 and Dist. 33. Charles Johns (right), hired at Monday's Glenbrook High School Dist. 225 school board meeting to replace retiring Supt. Mike Riggle July 1, chats with Glenview Village President <mark>Jim Patterson</mark> (left) at Monday's school board meeting. (Tom Robb/Journal photo) Asked why he came to Dist. 225, Johns said, \"The Glenbrooks are widely known as one of the finest districts in the entire country. This would be the pinnacle of any educators career.\" Riggle spent more than 20 years working for Dist. 225, starting as Glenbrook North High School principal in 1998 before replacing Supt. Dave Hales in 2008. In September, BWP & Associates was hired to conduct a national search for Riggle's replacement. After pre-screening dozens of candidates, seven potential candidates for the position were identified, including Johns, which were narrowed to three finalists. Those three finalists were interviewed extensively by both school board members and a group of key district stakeholders in December. Charles Johns, hired to replace the retiring Glenbrook High School Dist. 225 Supt. Mike Riggle July 1, chats with an old friend, Dist. 225 Teachers Union President Matt Whipple at Monday's school board meeting. The two taught a summer debate program at the University of Iowa years ago. (Tom Robb/Journal photo) Although school board members voted to approve a contract for Johns at Monday's (Feb. 11) school board meeting, district officials said Johns' salary and contract details would not released until minutes from Monday's meeting are approved by school board members at their next meeting. \"After meeting with many outstanding candidates, Dr. Johns emerged as our finalist because of his systematic approach to providing an equitable education to students,\" said Board President Skip Shein. Johns said his first task will be to learn the organization and build relationships within Dist. 225. He said his process for addressing issues is to, \"be as thoughtful as possible getting a broad view.\" He said understanding any legal issues along with hearing community input is also important to his process. Johns holds a doctorate in educational leadership and policy studies from Loyola University and bachelor's and master's degrees from the University of Iowa in teaching. Glenbrook High School Dist. 225 Supt. Mike Riggle (right) shakes hands with the man who will replace him July 1, Charles Johns (center left) as School Board President Skip Shein looks (center) on at Monday's school board meeting where Johns was hired. (Tom Robb/Journal photo) More From Glenview Go To The Glenview Section Northfield Township Offers Tips On Paying Property Taxes Glenview Opts Back Into County Minimum Wage, Sick Time Ordinances Local Schools React To O’Hare Threat Believed To Be A Hoax"}, {"articleID": "2015102615_00153212_W", "names": {"John Lacey": ["Q16214484", "Q16237846", "Q21518264"]}, "date": "2015-10-26", "url": "http://www.eurosport.com/rugby/world-cup/2015/welshman-owens-to-referee-world-cup-final_sto4966921/story.shtml", "content": "Welshman Nigel Owens to referee World Cup final By Reuters Last update 25 minutes ago - Published on 26/10/2015 at 15:58 By Reuters - 25 minutes ago Welshman Nigel Owens has been officially named as the referee for Saturday's Rugby World Cup final between Australia and New Zealand at Twickenham. The 44-year-old had been widely tipped for the role following his impressive displays throughout the tournament, with New Zealand legend Grant Fox actually breaking the news on Sunday - albeit unofficially. Owens, who was named \"Gay sports personality of the year\" in 2007 shortly after coming out, has won admirers on and off the pitch for his light touch and humour, as well as his rapport with the players. \"This is a huge honour and a privilege for me,\" Owens said on Monday ahead of what will be his 68th test. \"I am humbled to have been chosen. This is my third World Cup and I think it has been the best. It has been inspirational. The quality of rugby on display has been incredible in front of packed venues and so to be given the opportunity to referee the final match between the best two teams in the tournament is an amazing honour.\" I would like to thank World Rugby and the Welsh Rugby Union for their support over many years. There have been so many individual people throughout my career who have helped and supported me along the way and while I can't name everyone here, I will be thanking everyone personally in due course. \"I want to thank my friends and family for their ongoing support and for helping me through some rough times in my life.\" My dad, in particular, is always there for me and is delighted with this news--it's just a shame my mother is not here to see this as she was a pillar of strength for me. She passed away six years ago and I know she would have been very proud. \"Jerome Garces of France and England's Wayne Barnes will be the touch judges with Shaun Veldsman of South Africa taking the role of television match official. The referee for Friday's third place playoff between South Africa and Argentina at the Olympic Stadium will be <mark>John Lacey</mark> of Ireland. Share"}]