[{"date": "2019-10-10", "url": "http://m.military.com/daily-news/2019/10/10/air-force-concludes-investigation-aircrew-trump-resort-stays.html", "content": "FILE - In this July 29, 2015 file photo, a helicopter owned by <mark>Donald Trump</mark> departs from the Turnberry golf course in Turnberry, Scotland. (AP Photo/Scott Heppell) 10 Oct 2019 Military.com | By Oriana Pawlyk JOINT BASE MCGUIRE-DIX-LAKEHURST, N.J.--The U.S. Air Force has concluded an internal travel log investigation prompted by a C-17 Globemaster III stop at Scotland's Glasgow Prestwick Airport earlier this year, and the airlift crews' subsequent decision to stay at a Trump-owned property. \"The [investigation] will show that the policies or procedures we had in place for both using civil airfields and lodging, and the crews [decisions] aligned with [current] policy,\" Gen. Maryanne Miller, head of Air Mobility Command, told Military.com Wednesday. Miller, who signed off on the investigation this week, has submitted it to Air Force Chief of Staff Gen. David Goldfein and Acting Secretary <mark>Matt Donovan</mark> for additional review; the Air Force Inspector General will have final authority over the report before it is submitted to Defense Secretary Mark Esper. \"If you look at Prestwick and you look at the rules for lodging that our crews abide by, 77% of the crews stayed right around there,\" Miller said during an interview here. The Air Force reviewed records and travel vouchers between 2015 and 2019. Another 17% stayed near Glasgow, about 30 miles away; and 6% of other crews stayed at the Trump Turnberry Luxury Collection Resort, roughly 20 miles away, she said. The breakdown is similar to what officials had already provided to lawmakers in recent weeks, AMC said. \"They rolled to Turnberry only because others weren't available,\" the general said. \"Turnberry is not a first option. You end up rolling down [there] as a solution .\" Miller continued, \"There was no violation of anything. There was nothing that was out of alignment with all of that; and we even looked at the perception side of things, and the crews just did exactly what they were supposed to do .\" The House Committee on Oversight and Reform recently began investigating U.S. military stopovers at Prestwick as part of a larger probe into military stays at Trump-owned properties. Related: Air Force Defends C-17 Crew's Stopover at Scotland Trump Resort In March, a C-17 crew, consisting of seven active-duty and National Guard crew members from Alaska, stayed at Trump's Turnberry resort when en route to Kuwait; they only landed at Prestwick airport on the return trip to the U.S., according to the Air Force. But the stop in Scotland prompted the committee to investigate whether U.S. military stays have boosted Turnberry's revenue. An exchange between the Pentagon and lawmakers last month revealed the Defense Department has spent nearly $200,000 at Turnberry since Trump became president in 2017. In a letter from the committee to Esper dated Sept. 18, lawmakers wrote that the Defense Department's response to their query was \"belated and deficient,\" but added that the Pentagon revealed total military spending at Turnberry could be \"more than $184,000\" if calculating in unspecified charges unrelated to hotel rooms. It remains unclear whether associated travel guidance will be updated via Congressional mandate, or if DoD will consider a military-wide policy. Despite the initial findings of the service, lawmakers still want assurances the service will make ethical choices going forward. Sen. Richard Blumenthal, a Democrat from Connecticut, announced Sept. 19 that he intends to place a hold on <mark>Barbara Barrett</mark>, Trump's Air Force secretary nominee, stalling a confirmation vote unless she assures the committee she will \"implement a policy to prohibit Air Force spending at Trump-owned properties .\" During her confirmation hearing Sept. 12, <mark>Barrett</mark> demurred on whether she would issue a sweeping policy, but said any guidance should keep the appearance of propriety in mind. Blumenthal then voiced his displeasure with her answers. \"Ambassador <mark>Barrett</mark> refused to provide a clear commitment to ending unnecessary Air Force spending at President Trump's lavish Scottish hotel. This is unacceptable, especially for a service secretary in an administration run by Grifter-in-Chief <mark>Donald Trump</mark>,\" Blumenthal said days after her testimony. The Senate is expected to vote on her confirmation following its two-week recess .--Oriana Pawlyk can be reached at oriana.pawlyk @ military.com. Follow her on Twitter at @ oriana0214. Read more: Army Confirms Two Soldiers Being Treated for Severe Lung Injuries from Vaping Show Full Article Related Topics Military Headlines Air Force Topics <mark>Donald Trump</mark> Military Scandals © Copyright 2019 Military.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2019101012_00201077_W", "names": {"Barbara Barrett": ["Q3500791", "Q42306056"], "Donald Trump": ["Q22686", "Q27947481"], "Matt Donovan": ["Q6380379", "Q6788574", "Q6788575"]}}, {"date": "2019-10-10", "url": "https://steelersdepot.com/2019/10/devlin-hodges-path-from-undrafted-to-starting-fits-who-i-am/", "content": "It's been a long journey from Milan to Minsk for Devlin Hodges. The undersized quarterback ended up playing his college ball at an FCS school, where he would go on to break the record for the most passing yards thrown in a career. He proceeded to go undrafted, and then unsigned, though he received an invitation by the Pittsburgh Steelers to participate in their rookie minicamp. That was the point at which he began proving himself week in and week out to anyone that mattered. Over the course of three days, he outperformed first-year Brogan Roback, prompting the team to waive him and instead sign Hodges to the 90-man roster. He proceeded to turn heads throughout OTAs and all the way through the preseason, where he saw a disproportionate share of the snaps for a number four quarterback, a clear signal that the Steelers were taking him and his viability seriously. While generally working well within the scope of the opportunities that he was provided, it wasn't enough for the team to conclude that he was one of their three best quarterbacks. Behind Ben Roethlisberger, they decided that <mark>Mason Rudolph</mark> would be the backup, and Joshua Dobbs would be the number three. After being offered a fifth-round pick for Dobbs, however, they made the trade and signed Hodges to the practice squad. A season-ending injury to Roethlisberger a week later saw him promoted to the 53-man roster as <mark>Rudolph</mark>'s backup. Now with <mark>Rudolph</mark> in the concussion protocol, the rookie undrafted free agent is getting first-team reps for the first time and preparing to make his first NFL start after showing promise in his debut on Sunday filling in for the second-year man. \"I tell everyone I think it fits who I am\" , Hodges told reporters yesterday about the journey he has undertaken so far in the NFL. \"I never once didn't think I would be here or could be here. It is crazy, especially to be gone Week One and then coming back on the practice squad\". \"Some of the guys on the team were like,\" it felt like you were gone forever \"', he added .\" But then Ben going down and being brought up and <mark>Mason</mark> getting the concussion last week and getting thrown in. It is just crazy. It is a crazy process \". There's still a long road ahead for Hodges to really prove anything of himself. He only has a handful of pass attempts to his name, and his future is as yet unwritten. But he knows that if his story is one of success, that it will have been because of who he is .\" Even from the beginning, coming here on like a tryout, I told some people before that if five years from now or 10 years, if I am still playing in the NFL, this whole kind of story just fit who I am \", he said .\" It just shows that hard work and confidence in yourself and belief in yourself, you can accomplish your dreams \". Related Items: Devlin Hodges Share Tweet Share Share Email Recommended for you Devlin Hodges Lack Of Practice Reps Makes Debut Even More Impressive Chargers Head Coach On Sunday Play Of Steelers' Hodges:\" I Thought He Was Outstanding' Why Devlin Hodges Winning Sunday Night Probably Wouldn't Surprise Bill Parcells Please enable JavaScript to view the comments powered by Disqus.", "articleID": "2019101012_00341602_W", "names": {"Mason Rudolph": ["Q19666923", "Q3543162"]}}, {"date": "2019-10-10", "url": "http://www.eppingforestguardian.co.uk/news/national/17960435.13-unknown-first-world-war-soldiers-buried-belgium/", "content": "13 unknown First World War soldiers buried in Belgium By Press Association 2019 Coffins arrive for a burial service at the Commonwealth War Graves Commission's Wytschaete Military Cemetery, near Ypres 0 comment Hundreds of people gathered to mark the burial of 13 unknown soldiers who died fighting in Belgium in the First World War. The unidentified war dead--all from the UK and Commonwealth nations--were buried side by side with full military honours near Ypres. Shots from the gun salute rang out across the quiet clearing, the same Flanders field where the men lost their lives. The poignant ceremony at Wytschaete Military Cemetery formed one of the final chapters of the Dig Hill 80 project, which discovered the remains of 110 soldiers. Father Patrick O’Driscoll, chaplain to the 1st Battalion The Royal Regiment of Fusiliers, conducted the service, starting at 11am. Father Patrick O’Driscoll leads a burial service at the Commonwealth War Graves Commission's Wytschaete Military Cemetery, near Ypres (Gareth Fuller/PA) He spoke of the symbolism of the red poppy and the need for enduring peace. He said: \"We are gathered in fellowship today before God to remember those who have made the supreme sacrifice by the giving of their lives in the service of their country .\" We remember and pray for all those who have suffered, and who still suffer, as a consequence of war. \"Finally, we pray for peace and reconciliation--especially remembering those with the responsibility for the leadership of nations--that conflict may be avoided, and peace prevail among all people .\" The service was attended by representatives of armed forces from various nations, there to pay their respects to the fallen 13 men. Two of the unknown soldiers--identified as British--were carried to the ceremony by soldiers from the Fusiliers. Union Jack flags were draped over the coffins. The remaining 11 war dead were buried in a third coffin before the service began. Father O’Driscoll paid tribute to the ultimate sacrifice made by the 13 soldiers as he addressed the crowd. \"We come together today to remember and thank these men for their great sacrifice in fighting and dying together as one. Soldiers prepare to bury two coffins (Gareth Fuller/PA)\" Even though we do not know their names, we remember their humanity and courage and that even in the hell of battle they were there for each other even to death. \"So in prayer and celebration, we place these men together in this consecrated and special ground, so that they rest in peace and we learn and make sure humanity endures in its fullness .\" As we commit the remains of our brothers to the deep, grant them peace and tranquility. \"After the burial, shots from the traditional four-gun salute to the fallen echoed across the quiet clearing. The Exhortation was read out, with guests repeating the famous promise:\" We will remember them. \"Music was performed by a joint venture between British and German schoolchildren, to symbolise peace and co-operation. Pupils from Mildenhall College Academy in Bury St Edmunds and St Joseph's College, Ipswich, formed the contribution from the UK. The service came as a result of the hard work of those at the Dig Hill 80 project, who excavated Hill 80--the site of a German gun emplacement where many UK and Commonwealth soldiers fell. The project led a 1.1-hectare crowdfunded archaeological excavation, which took place at the former site of Hill 80 in Wytschaete, on land that had been allocated for future housing development. The service was held at the Wytschaete Military Cemetery (Gareth Fuller/PA) The project excavated 550 metres of trenches and 430 bomb craters, with the remains of 110 soldiers--including British, French, German and South African personnel--discovered. Dig Hill 80 was highly publicised at the time, attracting international media attention and celebrity patronage from comedian <mark>Al Murray</mark> and support from military historian Dan Snow. It has not been possible to identify the 13 unknown soldiers who were buried on Thursday, but at least two are believed to be British. Three Commonwealth War Graves Commission (CWGC) headstones will mark their collective final resting places, which will be cared for by the commission in perpetuity. In keeping with burial tradition, the casualties were interred together, ensuring that those who served and died together are buried and commemorated together. Hill 80 was the site of a windmill before the First World War, but became an entrenched German gun position following the capture of the village of Wytschaete in 1914. The location afforded observational advantage to the Germans as it overlooked the town of Ypres and formed part of the Messines Ridge. The site remained in German hands until the Battle of Messines in June 1917, when it was recaptured. In 1918, Hill 80 was again taken by the Germans during the Battle of the Lys, before finally returning to Allied hands in September 1918. Dig Hill 80 head archaeologist Simon Verdegem said:\" It is now about a year since the investigation into the soldiers of Hill 80 was completed. \"Thanks to massive international support from individuals and organisations, enough money was raised through crowdfunding to make a detailed excavation possible. Coffins arrive for the burial service (Gareth Fuller/PA)\" The aim was not only to excavate the trenches but also to recover the soldiers. Now, the British and German soldiers will finally be given a definitive and dignified resting place along with their comrades. I dare to believe that it gives them peace, knowing that people from all over the world have joined forces to recover their mortal remains. \"In my opinion, this can count as a symbol of peace and reconciliation .\" CWGC director general Victoria Wallace said: \"It is always moving and a real privilege to attend reburials .\" And it's a credit to the team who excavated Hill 80 that they have recovered these men at last, who will now be laid to rest with former comrades, and cared for in perpetuity by the Commonwealth War Graves Commission. \"It is sad that the men cannot be identified individually, but they will never be forgotten, by their nation, or by the people of Flanders who always show such respect for our war dead .\" The German soldiers discovered on Hill 80 will be laid to rest on Friday at the German war cemetery in Langemark. 0 comment", "articleID": "2019101013_00172478_W", "names": {"Al Murray": ["Q4704500", "Q6000623"]}}, {"date": "2019-10-10", "url": "https://ottawacitizen.com/news/world/two-businessmen-linked-to-trump-ukraine-scandal-arrested-on-u-s-charges/wcm/8342db75-0b94-4d31-8ba9-e7ce79ce21fb", "content": "Two Rudy Giuliani associates charged with illegally funneling cash to pro-Trump group Reuters Updated: October 10, 2019 President <mark>Trump</mark>'s personal lawyer, Rudy Giuliani, has coffee with Ukrainian-American businessman Lev Parnas at the <mark>Trump</mark> International Hotel in Washington, September 20, 2019. (REUTERS/Aram Roston/File Photo) Share Adjust Comment Print WASHINGTON/NEW YORK--Two foreign-born Florida businessmen who have helped President <mark>Donald Trump</mark>'s personal lawyer Rudy Giuliani investigate political rival Joe Biden were arrested in a scheme to illegally funnel money to a pro-Trump election committee and other U.S. political candidates, prosecutors said on Thursday. The arrest of Ukraine-born Lev Parnas and Belarus-born Igor Fruman at an airport outside Washington carrying one-way tickets to Vienna was the latest dramatic development in a political saga that threatens <mark>Trump</mark>'s presidency. Prosecutors said Parnas and Fruman conspired to contribute foreign money including at least $1 million from an unidentified Russian businessman to candidates for federal and state offices to buy influence. Prosecutors separately say they donated $325,000 to a pro-Trump political action committee called America First Action in May 2018, and the money was falsely reported as coming from a purported natural gas company set up to conceal its true source, according to the indictment. A fast-moving Democratic-led House of Representatives impeachment inquiry is centered on the Republican president's request in a July phone call for Ukrainian President Volodymyr Zelenskiy to investigate Biden, the former vice president and a top contender for the 2020 Democratic presidential nomination. Democrats have accused <mark>Trump</mark> of pressuring a vulnerable foreign ally to dig up dirt on a domestic political opponent for his own political benefit. Giuliani has said Parnas and Fruman helped his efforts in Ukraine to investigate Biden and Biden's son Hunter. The younger Biden had served as a director of a Ukrainian energy company. The two men were each charged by federal prosecutors in New York with two counts of conspiracy, one count of false statements and one of falsification of business records. U.S. law prohibits foreign donations in American elections. Parnas and Fruman were trying to buy political influence to help them set up recreational marijuana businesses, prosecutors said. They also said Parnas played a role in a successful effort to have <mark>Trump</mark> remove the U.S. ambassador to Ukraine. \"Protecting the integrity of our elections, and protecting our elections from unlawful foreign influence, are core functions of our campaign finance laws,\" U.S. Attorney Geoffrey Berman told reporters in New York. \"And as this office has made clear, we will not hesitate to investigate and prosecute those who engage in criminal conduct that draws into question the integrity of our political process\" Berman served on <mark>Trump</mark>'s transition team after <mark>Trump</mark> was elected president to prepare for taking office in January 2017. The indictment said Parnas and Fruman falsely claimed the company, called Global Energy Producers or GEP, which was making the political donations, was \"a real business enterprise\" and that \"its major purpose is energy trading, not political activity .\" In fact, the company had no real business, the indictment added. The two were arrested at Dulles airport in Virginia on Wednesday night, prosecutors said. <mark>John Dowd</mark>, the lawyer for Parnas and Fruman, declined to comment on the charges. <mark>Dowd</mark> previously represented <mark>Trump</mark> in former Special Counsel Robert Mueller's investigation that detailed Russian interference in the 2016 U.S. presidential campaign to boost <mark>Trump</mark>'s candidacy. Parnas and Fruman made their initial court appearance in Alexandria, Virginia, with another court date set for next Thursday. They were being represented in the court appearance by lawyers for <mark>Trump</mark>'s former campaign chairman Paul Manafort, who is serving prison time after being convicted last year in Mueller's investigation. Federal Magistrate Judge Michael Nachmanoff imposed a lengthy, strict set of conditions that Parnas and Fruman must meet to be released including each posting $1 million bond and being placed on GPS monitoring in home detention. The prosecution called the men a flight risk. Giuliani did not immediately return a request for comment. Last week, he told Reuters: \"Parnas and Igor helped me on certain things. They helped me with logistics. They know the Ukraine, they speak Russian. They helped me locate people in a few cases .\" Jay Sekulow, a lawyer for the president, told Reuters that \"neither the president nor the campaign was aware of their scheme,\" referring to the defendants. <mark>Trump</mark> has denied wrongdoing and has described the impeachment probe as a partisan smear. Both men were expected to figure in the House impeachment drive and had been asked to produce documents and give testimony. Parnas had been scheduled to take part in a deposition with House lawmakers on Thursday, with Fruman scheduled on Friday. <mark>Dowd</mark> had called the lawmakers' demands \"unreasonable .\" House Democrats on Thursday issued subpoenas for the men to hand over the documents and testify at a later date. According to the indictment, Parnas also sought the help of a U.S. congressman--identified by a person familiar with the matter as Republican Pete Sessions--to get <mark>Trump</mark> to remove U.S. ambassador to Ukraine Marie Yovanovitch. <mark>Trump</mark> eventually did remove Yovanovitch and called her \"bad news\" in his July 25 call with Zelenskiy. Giuliani told Reuters last week he had provided information to both <mark>Trump</mark> and the State Department about Yovanovitch, who he suggested was biased against <mark>Trump</mark>. Yovanovitch is scheduled to give testimony in the House impeachment inquiry on Friday. Sessions lost his House seat from Texas last year to a Democrat. He did not immediately respond to a request for comment. In another development, House Democrats issued a subpoena for a member of <mark>Trump</mark>'s Cabinet, U.S. Energy Secretary Rick Perry, for documents over any role he may have played in <mark>Trump</mark>'s effort to get Ukraine to investigate Biden. Prosecutors said Parnas, Fruman and others also conspired to funnel donations to candidates in Nevada, New York and other states to benefit a planned marijuana business funded by an unnamed Russian businessman. Two other people were charged in the indictment: David Correia, a U.S. businessman, and Andrey Kukushkin, a Ukrainian-born U.S. businessman who was a vice president of a Russian hedge fund before becoming involved in several marijuana-related businesses in California. Photos from Parnas' social media accounts show him meeting on various occasions with <mark>Trump</mark>, his son <mark>Donald Trump</mark> Jr., Sessions, Republican congressman <mark>Kevin Brady</mark> and former congressman <mark>Carlos Curbelo</mark>. In an interview last month, Parnas told Reuters that the FBI was investigating him but that he did not know why, and that he did nothing wrong. \"I don't know what the FBI wants. I'm not going to comment, what they are doing. What they did .\" \"I don't think we know too much\" about the investigation, Parnas said, but added that it had to be political. \"When you have the heads of the Democratic Party not liking you, it's very easy to get the FBI involved .\" Parnas said any violations of U.S. Federal Election Commission rules were unwitting and a \"clerical thing\" because he was not an experienced political donor. Parnas said he was not trying to hide the source of the $325,000 donation. Kelly Sadler, a spokeswoman for America First Action Political Action Committee, confirmed the pro-Trump group received the $325,000 contribution mentioned in the indictment. Sadler said the organization \"placed that contribution in a segregated bank account,\" and it has not been used \"for any purpose .\" Federal records show Parnas has donated $25,200 to Republican candidates and political groups since the 2016 election, including $2,700 to Sessions and $2,700 to House Republican Leader <mark>Kevin McCarthy</mark>. Fruman has donated $44,201 over that period to Republicans, including Sessions, the Republican National Committee and <mark>Trump</mark>'s presidential campaign. The top Senate Democrat, Chuck Schumer, called the developments regarding Giuliani's associates \"very troubling .\" \"Giuliani's been involved up to his neck in this entire mess. He has an obligation to testify under oath so he can be asked questions and so this can come to light,\" Schumer told reporters.", "articleID": "2019101101_00071471_W", "names": {"Carlos Curbelo": ["Q18631533", "Q459498"], "Donald Trump": ["Q22686", "Q27947481"], "John Dowd": ["Q21173981", "Q6229967", "Q6229968", "Q6245783"], "Kevin Brady": ["Q472241", "Q6395881"], "Kevin Mccarthy": ["Q26837187", "Q281404", "Q56875753", "Q6377709", "Q6396888", "Q6396889", "Q6396891", "Q766866"]}}]