[{"date": "2019-10-11", "url": "http://www.eveningtimes.co.uk/news/17961409.tusk-welcomes-promising-signals-barclay-meets-barnier-brexit-talks/", "content": "News Tusk welcomes \"promising signals' as <mark>Barclay</mark> meets Barnier for Brexit talks By Press Association 2019 Brexit Secretary <mark>Stephen Barclay</mark> greets EU chief Brexit negotiator Michel Barnier 0 comment Donald Tusk has welcomed\" promising signals \"from Leo Varadkar that a new deal may be possible, as Brexit Secretary <mark>Stephen Barclay</mark> held key talks with the EU's chief negotiator Michel Barnier. European Council president Mr Tusk offered Boris Johnson lukewarm hope that progress could be made, but warned that the UK has still not presented\" a workable, realistic proposal \". Mr <mark>Barclay</mark> and Mr Barnier met in Brussels on Friday morning as chances of a breakthrough appeared to rise after face-to-face talks between the Prime Minister and Irish Taoiseach Mr Varadkar. The UK has still not come forward with a workable, realistic proposal. But I have received promising signals from Taoiseach @ LeoVaradkar that a deal is possible. Even the slightest chance must be used. A no deal #Brexit will never be the choice of the EU .--Donald Tusk (@ eucopresident) October 11, 2019 The two leaders released a joint statement saying they could\" see a pathway \"to a possible agreement. Mr <mark>Barclay</mark>'s talks should give the clearest indication on whether there has been a significant thawing of relations between London and Brussels after a week of abrupt exchanges. As the meeting got under way, Mr Tusk tweeted:\" The UK has still not come forward with a workable, realistic proposal. But I have received promising signals from Taoiseach @ LeoVaradkar that a deal is possible. \"Even the slightest chance must be used. A no deal #Brexit will never be the choice of the EU .\" Dramatic progress could lead to the start of so-called intensive \"tunnel\" negotiations in the coming days ahead of the crunch EU heads of government summit on October 17 and 18. The unexpectedly cordial atmosphere of the meeting between the two prime ministers led to speculation of a possible compromise on the contentious issue of the Northern Ireland border backstop. Sterling rose sharply on international money markets in the wake of the talks. Prime Minister @ BorisJohnson meets Irish Taoiseach @ LeoVaradkar to discuss the UK's Brexit proposals. pic.twitter.com/k33tVhNX3U--UK Prime Minister (@ 10DowningStreet) October 10, 2019 Education Secretary Gavin Williamson said that the Cabinet had been briefed on the meeting, but would not explain what concessions may have prompted the surprise optimism. \"It does not benefit anyone to have a running commentary on live negotiations,\" he told BBC Radio 4's Today programme. After more than two hours of \"detailed and constructive\" discussions at a country manor on the Wirral on Thursday, the two leaders said it was in \"everybody's interest\" to get an agreement which would allow the UK to leave with a deal. Mr Varadkar said he hoped the progress they had made would be \"sufficient\" to enable intensive negotiations to resume in Brussels ahead of next week's crucial EU summit. The Taoiseach said: \"I think it is possible for us to come to an agreement, to have a treaty to allow the UK to leave the EU in an orderly fashion, and to have that done by the end of October, but there's many a slip between cup and lip,\" he said. \"In terms of how long it will take, I can't predict that with any certainty, but I think all sides would like there to be an agreement next week at the council if possible .\" Obviously there's a further deadline after that which is October 31, so I would say a short pathway rather than a long one, but it's impossible to predict that for sure. \"Mr Varadkar refused to be drawn on any\" concessions \"made by either side, while UK Government sources refused to be drawn on Irish press reports suggesting\" significant movement \"by the UK. Tory former chancellor and arch-Brexiteer Lord Norman Lamont said he wanted to know what any UK concessions were. He told the BBC:\" No, I am not worried. I have to know what the concessions are. \"It does look as though there is a change of mood .\" He added: \"Maybe there is some change on the mechanism whereby the deal is approved by the Northern Ireland Assembly and Executive .\" Maybe there will be an opting-out mechanism rather than an opting-in mechanism. \"The softer mood music after Mr Johnson's meeting with the Taoiseach followed an intensive few days which saw an acrimonious war of words explode between London, Dublin and Brussels in which the talks appeared close to collapse. Briefings by anonymous Downing Street sources had accused Mr Varadkar of backtracking on previous commitments to try to find a deal, and of refusing to negotiate. And following a heated telephone call between Mr Johnson and German Chancellor Angela Merkel on Tuesday, Number 10 sources claimed the EU was making it\" essentially impossible \"for Britain to leave with a deal. On Wednesday, Mr Barnier told the European Parliament there was still no basis for a fresh agreement. He said the UK had yet to put forward an\" operational, legally binding solution \"to replace the Northern Ireland backstop--intended to prevent the return of a hard border with the Republic. Without a deal, Mr Johnson will face demands from opposition parties to comply with the so-called Benn Act which would require him to request a three-month Brexit delay if there is no agreement by October 19. The PM has said while he will abide by the law, he is determined to leave on the Halloween deadline of October 31 come what may. Government sources have said ministers are preparing to hold an emergency Saturday sitting of Parliament on October 19. Many MPs believe if he cannot get a deal, Mr Johnson will use the occasion to push for a\" people versus Parliament \"general election, possibly as early as next month. If a deal did emerge, Mr Johnson would also need the backing of the DUP and Eurosceptic Tories to have any chance of getting it through without opposition support. Lord Lamont said he thought Labour MPs were wary of an early election. He said:\" Backbench Labour MPs, I understand, are really very nervous about it. \"I think they don't want it, and I wouldn't be at all surprised if we didn't slide into next year .\" Lord Lamont said the Tories would choose to fight any election on a no-deal stance if they failed to achieve an agreement with Brussels. 0 comment", "articleID": "2019101109_00222765_W", "names": {"Stephen Barclay": ["Q20200819", "Q260546", "Q40131775"]}}, {"date": "2019-10-14", "url": "http://www.windsorobserver.co.uk/news/17966921.johnsons-first-queens-speech-dominated-crime-bills/", "content": "News Johnson's first Queen's Speech dominated by crime Bills By Press Association 2019 The Queen leaves Buckingham Palace for the State Opening of Parliament 0 comment A crime crackdown dominated the first Queen's Speech of Boris Johnson's premiership. With the Prime Minister pushing for a snap general election the legislative programme presented at the State Opening of Parliament is being seen as a bid by Mr Johnson to set out his campaign agenda. As well as law and order issues, immigration and the environment were also major elements of the programme, which had already been extensively trailed. The package of 26 Bills include seven relating to crime and justice. These include legislation to keep serious criminals in prison for longer, impose tougher sentences on foreign offenders who return to the UK and provide better protection for victims of domestic abuse. The Queen said: \"New sentencing laws will see that the most serious offenders spend longer in custody to reflect better the severity of their crimes .\" A Sentencing Bill will change the automatic release point from halfway to two thirds for adult offenders serving sentences of four years or more for serious violence or sexual offences. The Queen made the short trip to the Palace of Westminster from Buckingham Palace in the Diamond Jubilee State Coach accompanied by the Prince of Wales and the Duchess of Cornwall. Other measures outlined in the speech include strengthening environmental protections, improving the NHS, and raising living standards through increasing the national living wage to £ 10.50 an hour. On adult social care, the Government has pledged to \"bring forward proposals\" for reform, but the lack of a specific Bill dealing with the situation is likely to draw fire from the opposition. At the same time ministers are preparing to rush through a Bill to ratify any Brexit deal Mr Johnson is able to agree this week in Brussels in time for Britain to leave on the EU on October 31. Ahead of the speech, Chancellor Sajid Javid announced he is planning to hold a Budget just six days after the UK's scheduled Brexit date. Mr Javid tweeted: \"On 6th November I'll deliver Britain's first Budget after Brexit and set out our plan to shape the economy and deliver our infrastructure revolution .\" With no Commons majority, it is questionable how much of the proposed legislation in the Queen's Speech ministers can get through Parliament before a general election. And there is a major question mark over whether MPs will pass the legislative programme, which will go to a vote after several days of debate. The law and order package includes a Bill to \"drastically\" increase the sentences for foreign criminals who return to the UK in breach of a deportation order, a move ministers say will help disrupt the activities of international crime gangs. Proposed legislation will make it easier for police to arrest internationally wanted fugitives who are the subject of an Interpol Red Notice without the need to apply for a UK arrest warrant, a process that can take a minimum of six to eight hours. Initially it will only apply to those issued by a limited number of countries with trusted justice systems, the other members of the Five Eyes intelligence group, the US, Australia, Canada and New Zealand, and two non-EU European states, Switzerland and Liechtenstein. However, the Government will be able to add other countries by statutory instrument. The programme includes a \"Helen's Law\" Bill, named after 22-year-old Helen McCourt who was murdered in 1988, to deny parole to murderers who withhold information about their victims. The Government will also bring back the Domestic Abuse Bill which fell as a result of Mr Johnson's unlawful suspension of Parliament last month. Mr Johnson said in a statement: \"People are rightly horrified by the spate of violent crime plaguing our streets, including the sickening rise in knife-related homicides .\" Other measures in the speech include:--Environment Bill setting legally binding targets to reduce plastics, restore biodiversity, improve water quality and cut air pollution .--Immigration and Social Co-ordination (EU Withdrawal) Bill to end freedom of movement and introduce a points-based immigration system from 2021 .--Railway reform with a white paper setting out proposals to overhaul the current system of franchising and creating a new commercial model .--Action on building standards in the wake of the Grenfell Tower fire with the establishment of a new regulator with powers to impose criminal sanctions for breaches of building regulations .--The NHS Health Investigations Bill will create a new independent body with legal powers to ensure patient safety .--Mental health reform to reduce the number of detentions under the Mental Health Act by ensuring more people get the treatment they need. Mr Johnson is promising to deliver on a pledge by his predecessor <mark>Theresa May</mark> to ensure all tips are paid to waiting staff following an outcry that some major restaurant chains--such as Giraffe and Prezzo--were keeping as much as 10% of tips paid by card. The Employment (Allocation of Tips) Bill will put a legal obligation on restaurateurs to \"pass on all trips, gratuities and services charges to workers without deductions\". Labour has dismissed the decision to hold the speech before the Government goes to the country as a \"cynical stunt\". Shadow home secretary Diane Abbott said: \"This Queen's Speech is farcical .\" It is just an uncosted wish list which the Government has no intention and no means to deliver, and nothing more than a pre-election party political broadcast. \"Meanwhile, ahead of the Queen's Speech Mr Johnson received a winter flu jab. 0 comment", "articleID": "2019101411_00060783_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2019-10-14", "url": "https://www.thehindu.com/entertainment/movies/irfan-pathan-all-set-to-make-cinema-debut/article29682012.ece", "content": "Irfan Pathan all set to make cinema debut October 14, 2019 19:03 IST Updated: October 14, 2019 19:03 IST Share Article October 14, 2019 19:03 IST Updated: October 14, 2019 19:03 IST more-in The producers of the film announced taking Pathan on-board the film, directed by Ajay Gnanamuthu. Indian cricketer Irfan Pathan is all set to make his cinema debut, with the left-arm pacer being roped in for a Tamil film featuring popular star Vikram. The producers of the film, who have tentatively titled the movie \"ChiyaanVikram58,' announced taking Pathan on-board the film, directed by Ajay Gnanamuthu. Vikram is addressed as\" Chiyaan' by his fans. \"Proud and honoured to introduce @ IrfanPathan in #ChiyaanVikram 58 in a super stylish action avatar!! Welcome on Board sir and wish you a sensational debut,\" the film's co-producer Seven Screen Studio said on Twitter. Gnanamuthu has directed the critically acclaimed crime thrillers \"Demonte Colony' and\" Imaikka Nodigal', the latter featuring popular Hindi cinema director <mark>Anurag Kashyap</mark> in a leading role. Gnanamuthu tweeted: \"Welcome on board @ IrfanPathan Can't wait to unleash your new avatar to the audience!! Time for some solid action!! .\" The director also tweeted a picture of himself and Pathan. You have reached your limit for free articles this month. Register to The Hindu for free and get unlimited access for 30 days.", "articleID": "2019101413_00240695_W", "names": {"Anurag Kashyap": ["Q2839609", "Q56248257"]}}, {"date": "2019-10-14", "url": "http://mysanantonio.com/sports/spurs/article/Spurs-fans-don-t-know-if-they-should-panic-after-14520184.php", "content": "https: //www.mysanantonio.com/sports/spurs/article/Spurs-fans-don-t-know-if-they-should-panic-after-14520184.php Spurs fans don't know if they should panic after third preseason loss By Madalyn Mendoza, mySanAntonio.com Updated 12:07 pm CDT, Monday, October 14, 2019 @ kellynohandle: Spurs are about to lose their three straight preseason games outer me: it's ok. Spurs are still good. We have tim and pop. And other guys are not bad. inner me: we are not good. we are not gonna be good for along time. We lost by +20 points to fricking mediocre teams less @ kellynohandle: Spurs are about to lose their three straight preseason games outer me: it's ok. Spurs are still good. We have tim and pop. And other guys are not bad. inner me: we are not good. we are not...more Photo: Twitter Screengrab Photo: Twitter Screengrab Image 1 of / 83 Caption Close Image 1 of 83 @ kellynohandle: Spurs are about to lose their three straight preseason games outer me: it's ok. Spurs are still good. We have tim and pop. And other guys are not bad. inner me: we are not good. we are not gonna be good for along time. We lost by +20 points to fricking mediocre teams less @ kellynohandle: Spurs are about to lose their three straight preseason games outer me: it's ok. Spurs are still good. We have tim and pop. And other guys are not bad. inner me: we are not good. we are not...more Photo: Twitter Screengrab Spurs fans don't know if they should panic after third preseason loss 1 / 83 Back to Gallery Reactions from Spurs fans to the team's 0-3 preseason record is a mixed bag. No. 1 draft pick Zion Williamson and the Pelicans were in town Sunday and handed the team their third preseason loss. While some fans are firm in their decision to remain calm, others took to Twitter to share early predictions, citing issues they say could be a red flag for the regular season. \"Folks, I know it's preseason, but this Spurs team does not look good so far. They've played three lower-rung playoff teams, 2 at home, and have looked outmatched every time,\" Twitter user @ yungpopovich chimed in on the conversation. RELATED: Popovich blasts Trump's \"cowardly' approach to dealing with authoritarian figures Another corner of Spurs Twitter combated the preseason jitters and dismal takeaways with memes or by focusing on brighter moments, such as when retired legend Manu Ginobili was featured on the AT & T Center's\" Simba cam, \"when fans hoist their kids in the air to reenact the Mufasa moment from\" Lion King. \"\"I forgot about this but Manu was at the game yesterday. They had the Simba cam, and halfway through it, they cut to Manu holding his youngest like Simba. That was my favorite moment of the game,\" @ astroalehcat tweeted. At this point last season, the Spurs were also on shaky ground as the injured list included Lonnie Walker IV, Dejounte Murray and <mark>Derrick White</mark>. The Spurs take on the Houston Rockets on Wednesday. The regular season tips off on Oct. 23 at home against the New York Knicks. See more of the chatter in the gallery above. Madalyn Mendoza is a breaking news reporter and general assignment writer. Read her on our breaking news site, mySA.com, and on our subscriber site, ExpressNews.com | mmendoza @ mysa.com | @ MaddySkye School Score Database Most Popular 1 Coach Pop again strikes out at President Trump 2 2019 Top Workplaces in San Antonio: Small employers 3 Texas cop fatally shoots woman during a welfare check 4 Police: New Northwest Side intersection to blame for Sunday night crash 5 Megan Thee Stallion is a no-show at ACL 6 2 S.A. resorts receive national nod 7 She began to talk, then fell silent. Months later mom learns why View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019101417_00188421_W", "names": {"Derrick White": ["Q11320818", "Q30122669"]}}, {"date": "2019-10-14", "url": "http://articles.economictimes.indiatimes.com/news/politics-and-nation/nobel-laureates-abhijit-banerjee-and-esther-duflo-on-free-trade-and-growth-from-their-forthcoming-book-good-economics-for-hard-times/articleshow/71586879.cms", "content": "Nobel Laureates <mark>Abhijit Banerjee</mark> and Esther Duflo on free trade and growth from their forthcoming book - Good Economics for Hard Times By ET CONTRIBUTORS | Updated: Oct 14, 2019, 11.37 PM IST READ MORE ON \"poverty alleviation | poor nations | nobel prize | Good Economics for Hard Times | development economics | Abjijit <mark>Banerjee</mark> Esther Duflo becomes the second woman to win the Sveriges Riksbank Prize in Economic Sciences. By <mark>Abhijit</mark> V <mark>Banerjee</mark> & Esther Duflo Many of the issues plaguing the world right now are particularly salient in the rich North, whereas we have spent our life studying poor people in poor countries. It was obvious that we would have to immerse ourselves in many new literatures, and there was always a chance that we will miss something. It took us a while to convince ourselves that it was even worth trying. We eventually decided to take the plunge, partly because we got tired of watching at a distance while the public conversation about core economic issues--immigration, trade, growth, inequality or the environment--goes more and more off-kilter. But also because, as we thought about it, we realised that the problems facing the rich countries in the world were actually often eerily familiar to those used to studying the developing world--people left behind by development, ballooning inequality, lack of faith in government, fractured societies and polity, and so on. We learnt a lot in the process and it did give us faith in what we, as economists, have learnt best to do, which is to be hard headed about the facts, sceptical of slick answers and magic bullets, modest and honest about what we know and understand, and perhaps most importantly, willing to try ideas and solutions and be wrong, as long as it takes us towards the ultimate goal of building a more humane world. A woman hears from her doctor that she has only half a year to live. The doctor advises her to marry an economist and move to South Dakota. Woman:\" Will this cure my illness?' Doctor: \"No, but the half year will seem pretty long .' Why Whisky and Rum Don't Mix The idea that free trade is beneficial is one of the oldest propositions in modern economics. As the English stockbroker and MP David Ricardo, explained two centuries ago, since trade allows each country to specialise in what it does best, total income ought to go up everywhere when there is trade, and as a result, the gains to winners from trade must exceed the losses to losers. The last 200 years have given us a chance to refine this theory, but it is a rare economist who fails to be compelled by its essential logic. Indeed, it is so rooted in our culture that we sometimes forget that the case for free trade is by no means self-evident. For one, the general public certainly does not think so. They are not blind to the advantages of being able to buy cheap abroad, but worry that at least for the direct victims of cheaper imports, the gains are swamped by the costs. In our survey, 42% of respondents thought that low-skilled workers are hurt when the US trades with China (21% thought that they are helped), and only 30% thought that everyone is helped by the fall in prices (and 27% said that they thought everyone was hurt). So, is the public simply ignorant, or might it have intuited something the economists have missed? Stanislas Ulam was a Polish mathematician and physicist, one of the co-inventors of modern thermonuclear weapons. He had a low opinion of economics--perhaps because he underestimated economists' capacity to blow up the world, albeit in their own way. Ulam challenged Paul Samuelson, our late colleague, and one of the great names in 20th century economics, to\" name me one proposition in all of the social sciences which is both true and non-trivial \". Samuelson came back with the idea of comparative advantage, the central idea in trade theory .\" That this idea is logically true need not be argued before a mathematician; that it is not trivial is attested by the thousands of important and intelligent men who have never been able to grasp the doctrine for themselves or to believe it after it was explained to them. \"Comparative advantage is the idea that countries should do what they are relatively best at doing. To understand how powerful the concept is, it is useful to contrast it to absolute advantage. Absolute advantage is simple: grapes don't grow in Scotland, and France does not have the peaty soil ideal for making scotch. Therefore, it makes sense that France should export wine to Scotland, and Scotland should export whisky to France. Where it gets confusing is when one country, like China today, looks like it's pretty much better at producing everything than most other countries. Wouldn't China simply swamp all markets with its products, leaving other countries with nothing to show for themselves? Ricardo realised in 1817 that even if China (or, in his era, Portugal) was more productive at everything, it could not possibly sell everything, because then the buyer country would sell nothing and would have no money to buy anything from China. This proved that not all industries in 19th-century England would shrink. It was then evident that if any industry in England were to shrink because of international trade, it should be the ones that were the least productive. Based on this argument, Ricardo concluded that even if Portugal was more productive than England at producing both wine and cloth, once trade between them opened up, they would nonetheless end up specialising in the product in which they have a comparative advantage (meaning where their productivity is high relative to their productivity in other sector: wine for Portugal, cloth for England). And the fact that both countries make the goods that they are at least relatively good at making and buy the rest, instead of wasting resources producing the latter ineptly, must add to the gross national product (GNP), which is the total value of goods that people in each country can consume. Ricardo's insight underlines why there is no way to think of trade without thinking about all the markets together--China could win in any single market and yet, there is no way for it to win in every market. Of course, the fact that GNP goes up (both in England and in Portugal) does not mean that there are no losers. In fact, one of Paul Samuelson's most famous papers tells us exactly who they are. Ricardo's entire discussion had assumed that production required only labour, and all workers were identical, so when the economy became richer, everyone benefited. Once there is capital as well as labour, things are not that simple. But Samuelson, in a paper published in 1941, when he was just 25, set out the ideas that are still the basis of how we are taught to think about it. The logic, once you understand it--as is often the case with the best insights--is compellingly simple. Some goods require relatively more labour than others to produce and relatively less capital--think of handmade carpets versus robotmade cars. If two countries have access to the same technologies of production for both goods, it should be obvious that the country that is relatively abundant in labour will have a comparative advantage in producing the labour-intensive product, the carpet if you like. We would therefore expect a labour-rich country to specialise in labour-intensive products and move out of capital-intensive ones. This should raise the demand for labour compared to when there was no trade (or more restricted trade) and therefore wages. And, conversely, in a relatively capital-abundant country, we should expect instead that the price of capital goes up (and wages go down) when it trades with a more labour-abundant partner. Since the labour-abundant countries tend to be poor, and labourers are usually poorer than their employers, this implies that freeing trade should help the poor in the poorer countries, and inequality should fall there. The opposite would be true in the rich countries. So, opening trade between the US and China should hurt US workers' wages (and benefit Chinese workers). That does not mean that the workers in the US must necessarily end up worse off. This is because, as Samuelson showed in a later paper, the fact that free trade raises GNP means that there is more to go around for everybody, and therefore, even the workers in the United States can be made better off if society taxes the winners from free trade and distributes that money to the losers. The problem is that this is a big\" if', which leaves workers at the mercy of the political process. When Trees are Seen as Shady When a rickshaw-puller in <mark>Abhijit</mark>'s native Kolkata takes the afternoon off to spend with his lady love, GDP goes down, but how could welfare not be higher? When a tree gets cut down in Nairobi, GDP counts the labour used and the wood produced, but does not deduct the shade and the beauty that are lost. GDP values only those things that are priced and marketed. This matters because growth is always measured in terms of GDP. 2004, the year when TFP (total factor productivity) growth, after jumpstarting in 1995, slowed down again, is when Facebook began to occupy the outsized role that it currently plays in our lives. Twitter would join in 2006, and Instagram in 2010. What is common to all these platforms is the fact that they are nominally free, cheap to run, and wildly popular. When, as is now done in GDP calculations, we judge the value of watching videos or updating online profiles by the price people pay--which is often zero--or even by what it costs to set up and operate Facebook, we might grossly underestimate its contribution to well-being. Of course, if you are convinced that waiting anxiously for someone to like your latest post is no fun at all, but you are unable to kick the Facebook habit because all your friends are on it, GDP could also be overestimating well-being. Either way, the cost of running Facebook, which is how it is counted in GDP, has very little to do with the well-being (or ill-being) that it generates. The fact that the recent slowdown in measured productivity growth coincides with the explosion of social media, poses a problem, because it is entirely conceivable that the gap between what gets counted as GDP and what should be counted in well-being widened exactly at this time. Could it be that there was real productivity growth, in the sense that true well-being increased, but our GDP statistics are missing this entire story? (Edited extracts from <mark>Banerjee</mark> and Duflo's forthcoming book, Good Economics for Hard Times: Better Answers to Our Biggest Problems) <mark>Banerjee</mark> is Ford Foundation International Professor of Economics, at Massachusetts Institute of Technology (MIT), US, and Duflo is Professor of Poverty Alleviation and Development Economics, MIT. Both are founders of the <mark>Abdul Latif</mark> Jameel Poverty Action Lab (J-PAL) with Duflo as its director. Along with Michael Kremer, Gates Professor of Developing Societies, Harvard University, they are recipients of the 2019 Nobel Prize for Economics.", "articleID": "2019101418_00059133_W", "names": {"Abdul Latif": ["Q16018183", "Q16224641", "Q25471297", "Q59554526"], "Abhijit Banerjee": ["Q320578", "Q4667393"]}}, {"date": "2019-10-14", "url": "https://arizonasports.com/story/2120533/saquon-barkley-injured-giants-improving-cardinals-up/?show=comments#comments", "content": "Arizona Cardinals Stories Saquon Barkley, other injured Giants improving with Cardinals up next Share By Arizona Sports October 14, 2019 at 11:18 am New York Giants' Saquon Barkley celebrates his touchdown during the first half of an NFL football game against the Buffalo Bills, Sunday, Sept. 15, 2019, in East Rutherford, N.J. (AP Photo/Adam Hunger) New York Giants running back Saquon Barkley got his team's fanbase excited Sunday with an optimistic tweet. \"I'll be back soon....\" reads the post, which also included smirking and fingers crossed emojis. Barkley was moving around during Giants practice Monday morning after he'd participated in limited fashion last week. Recovering from a high ankle sprain that was projected to keep him out six to eight weeks, Barkley is teasing that his return could come Sunday against the Arizona Cardinals, which would be just four weeks since the injury. \"He's got to handle practice well and be ready to play,\" Giants coach Pat Shurmur said Monday to New York area reporters, including NJ.com. \"He practiced today, so we'll see when he comes in tomorrow, how he feels .\" But Barkley isn't the only New York offensive player who hopes to return, giving rookie quarterback <mark>Daniel Jones</mark> an injection of talent. <mark>Daniel Jones</mark> hands off to Saquon Barkley pic.twitter.com/p2ggHeOWHx--Art Stapleton (@ art_stapleton) October 14, 2019 Related Links K1 Podcast: Murray and Kingsbury continue growing vs. Falcons Cardinals CB <mark>Patrick Peterson</mark> tweets he's clocking in Monday Cardinals' Maxx Williams latest Fitz victim after scoring touchdown Tight end Evan Engram told reporters he is \"pretty optimistic\" he can return from a knee injury against the Cardinals. Receiver Sterling Shepard, who suffered two concussions this year about a month apart, remains in the NFL's concussion assessment protocol, reports NJ.com. Shepard, who has 25 catches for 267 yards in four games played this season, was able to go through light workouts on Monday. Also under watch for concussion symptoms is running back Wayne Gallman, Barkley's backup. Gallman didn't play last week. Instead, undrafted rookie Jon Hilliman took 11 carries for 38 yards Thursday in a 35-14 loss to the New England Patriots but fumbled once. He has since been cut. Over the weekend, New York signed former Ravens running back Buck Allen, who could potentially play depending on the availability of Barkley and Gallman. The Giants will be pleased if any of the injured offensive players can make a return. <mark>Jones</mark> went 15-of-31 for 161 yards, one touchdown and three interceptions last week against the Patriots. The sixth overall pick's top target was veteran receiver Golden Tate, who caught six balls for 102 yards and a score. Rookie fifth-round pick Darius Slayton and tight end Rhett Ellison were the only other two Giants who received more than two targets. They each had three catches. Follow @ AZSports Comments Share Top Stories Bickley: Cardinals finding lost mojo from years past as season progresses Cardinals' pass defense struggling despite 2nd straight win Cardinals happy to reap good luck in win over Falcons Cardinals' Maxx Williams latest Fitz victim after touchdown Comments Comment guidelines: No name-calling, personal attacks, profanity, or insults. Please keep the conversation civil and help us moderate comments by reporting abuse. Please enable JavaScript to view the comments powered by Disqus. comments powered by Disqus Most Popular Cardinals CB <mark>Patrick Peterson</mark> tweets he's clocking in Monday Cardinals finding lost mojo from years past as season progresses Cardinals' pass defense struggling despite 2nd straight win Sign up for the Arizona Sports Insider email Cardinals Interviews and Podcasts", "articleID": "2019101418_00133161_W", "names": {"Daniel Jones": ["Q28065523", "Q39075157", "Q42763780", "Q446447", "Q5217710", "Q5217712", "Q52502267", "Q56596920", "Q56799640", "Q679289"], "Patrick Peterson": ["Q1753941", "Q56254153"]}}, {"date": "2019-10-15", "url": "http://northwalespioneer.co.uk/news/national/17969004.ex-thomas-cook-boss-deeply-sorry-firms-failure/", "content": "Ex-Thomas <mark>Cook</mark> boss \"deeply sorry' over firm's failure By Press Association 2019 <mark>Peter Fankhauser</mark> 0 comment The former boss of <mark>Thomas Cook</mark> has said he is\" deeply sorry \"for the travel firm's collapse. Ex-chief executive <mark>Peter Fankhauser</mark> told MPs that senior figures at the company regretted being unable to save the\" iconic brand \". Employees, customers and suppliers are among those affected by the failure of the firm. Mr <mark>Fankhauser</mark> is one of five senior <mark>Thomas Cook</mark> figures giving evidence to the Commons' Business, Energy and Industrial Strategy Committee. In his opening remarks, he said:\" You heard me probably say it already, but I really want to repeat it in front of the members of the select committee, how deeply sorry we are that we couldn't save this iconic brand and this company who has a long, long standing history in this part of the UK industry. Former <mark>Thomas Cook</mark> employees arrive at Westminster for the hearing (Victoria Jones/PA) \"I'm deeply sorry about this failure and I'm deeply sorry for the distress we caused to millions of customers who booked holidays with us and who were on holidays with us .\" I'm deeply sorry for our suppliers who were long-standing partners and who were loyal to us throughout this time. Former <mark>Thomas Cook</mark> bosses at the hearing (House of Commons/PA) \"I'm especially sorry for all my colleagues who worked extremely hard and tirelessly to make <mark>Thomas Cook</mark> a better company .\" But MPs were quick to call into question some of the accounting policies including the decision to include a £ 2.5 billion \"goodwill\" value on the business in 2018. They also asked the bosses why they based bonuses on profits that excluded one-off payments to pay for the restructuring. A total of £ 1.8 billion was written as \"exceptional\" costs over eight years. Committee chairwoman Rachel Reeves said: \"The proof of the pudding is somewhat in the eating and you failed to turn around this business. In the end you couldn't just hide these numbers (exceptionals) forever, they caught up with you .\" She also called the former <mark>Thomas Cook</mark> chairman Frank Meysman \"deluded\" over the collapse. Ms Reeves added: \"You can point to as many successes as you like but you have brought down a 178-year business with huge repercussions for customers, staff and taxpayers. You can point to the successes but I'll point to the failures and they hugely outweigh the successes you've spoken about. I think you're deluded Mr Meysman about the business you ran .\" 0 comment", "articleID": "2019101509_00053201_W", "names": {"Peter Fankhauser": ["Q18686096", "Q23656762"], "Thomas Cook": ["Q16205324", "Q47452628", "Q53952787"]}}]