[{"date": "2019-10-15", "url": "https://toronto.citynews.ca/2019/10/15/ap-exclusive-julie-andrews-reflects-on-her-hollywood-years/", "content": "LOS ANGELES--Everyone is on their best behaviour when Julie Andrews is around. It's early June in Los Angeles and Andrews is coming to film segments for a night of guest programming on Turner Classic Movies and speak about her new book, \"Home Work: A Memoir of My Hollywood Years,\" which hits shelves Tuesday. The air is thick with anticipation before her arrival. When her car does appear--as prompt as Mary Poppins--the crew, the producers and even the catering staff all abandon their lunches and stand to attention. When she steps out, some even start to softly clap, as though she is royalty or perhaps even something bigger than that. But Andrews, seemingly knowing the effect she has on people, brings it back down to earth. \"Hi gang!\" she says cheerily, with that voice that for many is as familiar as their own mother's, putting everyone (almost) at ease as she glides through the room. Even TCM host Ben Mankiewicz, who is no stranger to speaking to screen legends, is a little awe struck. \"God, every time you talk I think,\" She sounds just like Julie Andrews!' \"Mankiewicz says to his guest. Andrews just laughs .\" Shut up, shut up, \"she says. For the next few hours, The Associated Press got a front-row seat as Andrews and Mankiewicz turned the little soundstage into a cozy living room for movie lovers as they discussed three films from her career: 1967's\" Thoroughly Modern Millie, \"1982's\" Victor/Victoria \"and 1986's\" That's Life!, \"all of which she touches on in her memoir. Although they may not be as well-known as\" Mary Poppins \"or\" The Sound of Music, \"each provides a revealing glimpse into her work at different stages of her career outside of those beloved nanny roles. In talking about George Roy Hill's adaptation of\" Thoroughly Modern Millie, \"Andrews reflected on her friendship with co-star Mary Tyler Moore .\" She called me Millie and I called her Miss Dorothy for the rest of our lives, \"Andrews, who just turned 84 this month, said .\" I miss her so much. \"All of the films are special to Andrews in some way, but naturally the ones she made with Blake Edwards, her husband of 41 years, are particularly so .\" We made seven pictures together, \"Andrews said .\" The first one \"Darling Lili' was such a huge flop it's amazing we stayed together for 41 years!\" On \"Victor/Victoria,\" she said Edwards advised her to watch her old friend <mark>James Garner</mark> for inspiration, telling her \"not only is he a great actor, but he's a great reactor .\" \"Blake would love to be sitting right here,\" she said wistfully as Mankiewicz praised the film. \"He probably is .\" The third film they discuss, \"That's Life!\" may be the least known of the bunch, but is one that is in some ways the most personal. The dramatic comedy starring Jack Lemmon as man dreading his impending 60th birthday party and Andrews as his wife was a low-budget, non-union family affair that was filmed in her and Edwards' own home using all of their friends and nothing but a 13-page outline to guide the process. \"(Blake) wrote his demons in this film,\" Andrews says. \"It was really a gift to us all to say\" I'm sorry if I've offended'...it's his apology to us but it's on film. \"In\" Home Work, \"Andrews writes frankly about her relationship with Edwards, a man she remains deeply and wholly in love with and in reverence of but who also had his struggles with prescription drugs .\" I wanted to honour him properly. I wanted it to be truthful, but didn't want to hurt anybody, especially my kids, \"Andrews told the AP later that day. Deciding what to leave in and what to take out, she said\" was hard and I'm very nervous about that. \"The films and her conversation with Mankiewicz will air on TCM on Oct. 29 beginning at 8pm Eastern and serve as a companion to the memoir, co-written with her daughter Emma Walton Hamilton, which picks up where her first memoir\" Home: A Memoir of My Early Years, \"left off: Her arrival in Los Angeles to film\" Mary Poppins, \"with then-husband Tony Walton and baby Emma in tow. Aided by the diaries she kept throughout her life, some excerpts of which are included in\" Home Work, \"Andrews gives a thoughtful account of her personal and professional highs, lows and everything in between. She tells amusing anecdotes about Alfred Hitchcock teaching her about lenses on\" Tom Curtain, \"her fear of driving on freeways during\" Mary Poppins \"and how Edwards stood up for her when people at a party were trying to pressure her into doing drugs. And she does not shy away from personal stories either: About financial worries, the breakup of her first marriage, deciding to adopt two daughters from an orphanage in Vietnam and her complex relationship with her parents. The book and the TCM evening concludes with\" That's Life!, \"although of course her Hollywood years continued after 1986. But, she said,\" They only wanted x number of pages and I was cutting like crazy anyway. \"Still, it leaves open the possibility of another installment .\" There is so much more if I do write about it, \"Victor/Victoria' on Broadway and\" Princess Diaries' and other things and getting into the book writing, \"Andrews said .\" There might be (another). But not just yet, I only finished it 10 days ago! \"___ Follow AP Film Writer Lindsey Bahr on Twitter: www.twitter.com/ldbahr Lindsey Bahr, The Associated Press", "articleID": "2019101514_00135999_W", "names": {"James Garner": ["Q108510", "Q11170644", "Q6134506"]}}, {"date": "2019-10-17", "url": "https://www.miragenews.com/cross-border-commissioners-visit-east-gippsland/", "content": "East Gippsland Shire Council welcomed Cross Border Commissioners Luke Wilson (Victoria) and James McTavish (New South Wales) to East Gippsland on Tuesday, October 15. Mayor Cr Natalie O’Connell said it was a great opportunity to discuss a range of issues that impact communities accessing services on both sides of the border in the shire's more remote towns. \"Having these conversations and keeping the lines of communication open are very important in Council advocating for our communities and improving opportunities for East Gippsland,\" Cr O’Connell said. \"It's great both Luke and James are showing a genuine, keen interest in East Gippsland. There is a real commitment to addressing some of the issues that face our cross-border communities .\" It's the third time I have met with Luke since he started in the role last October, and it was great to have James visit and provide the New South Wales perspective on some of the opportunities and challenges. \"The Mayor said school bus access, educational opportunities, regulatory and business registration challenges, and tourism promotion opportunities were among the items discussed with councillors .\" Our remote communities close to the border, like Mallacoota and Bendoc, that access services out of NSW particularly should see the benefits of this advocacy and cross-border relationship into the future, \"Cr O’Connell said. Council is also an affiliate member of the Canberra Region Joint Organisation (CRJO), which provides networking and funding opportunities for councils to drive infrastructure projects, investment opportunities and socio-cultural progress .\" The involvement with the CRJO and the willingness of James to travel into East Gippsland shows great progress, \"Cr O’Connell said. Crs Dick Ellis, Colin Toohey and Marianne Pelz, Victorian Cross Border Commissioner Luke Wilson, Crs Mark Reeves and Mayor Natalie O’Connell, NSW Cross Border Commissioner James McTavish, Crs <mark>John White</mark>, Joe Rettino and Ben Buckley, and Council Chief Executive Officer Anthony Basford.", "articleID": "2019101621_00151423_W", "names": {"John White": ["Q10383267", "Q15821600", "Q16215641", "Q17423827", "Q18385573", "Q21230044", "Q21598415", "Q28873238", "Q3182735", "Q3809674", "Q43395687", "Q459082", "Q51586479", "Q53838422", "Q53838425", "Q53838427", "Q53838454", "Q54932732", "Q56817081", "Q6263775", "Q6263782", "Q6263788", "Q6263790", "Q6263798", "Q6263800", "Q6263804", "Q6263809", "Q719350"]}}, {"date": "2019-10-16", "url": "https://www.northernstar.com.au/news/boxer-dead-at-27-after-horror-punch/3856318/", "content": "Boxing Boxer dead at 27 after horror punch 17th Oct 2019 10:05 AM 0 Young boxing star Patrick <mark>Day</mark> has died from the injuries he suffered in a welterweight bout in Chicago last weekend. He was 27. <mark>Day</mark> was knocked out by a left hook against Charles Conwell and was motionless in the ring when the fight was stopped. He had to be taken out of the ring on a stretcher and was immediately transported to hospital where he was placed in a coma. \"Patrick <mark>Day</mark> passed away today, October 16, 2019, succumbing to the traumatic brain injury he suffered in his fight this past Saturday, October 12, at the Wintrust Arena in Chicago, IL,\" promoter Lou DiBella announced in a statement. \"He was surrounded by his family, close friends and members of his boxing team, including his mentor, friend and trainer <mark>Joe Higgins</mark>. On behalf of Patrick's family, team, and those closest to him, we are grateful for the prayers, expressions of support and outpouring of love for <mark>Pat</mark> that have been so obvious since his injury .\" <mark>Day</mark> (17-4-1) was a highly-decorated amateur who turned professional in 2013 and was a fixture in the boxing community in New York City. \"Patrick <mark>Day</mark> didn't need to box,\" DiBella said. \"He came from a good family, he was smart, educated, had good values and had other avenues available to him to earn a living. He chose to box, knowing the inherent risks that every fighter faces when he or she walks into a boxing ring. Boxing is what <mark>Pat</mark> loved to do. It's how he inspired people and it was something that made him feel alive .\" It becomes very difficult to explain away or justify the dangers of boxing at a time like this. This is not a time where edicts or pronouncements are appropriate, or the answers are readily available. \"It is, however, a time for a call to action. While we don't have the answers, we certainly know many of the questions, have the means to answer them, and have the opportunity to respond responsibly and accordingly and make boxing safer for all who participate. This is a way we can honor the legacy of <mark>Pat Day</mark>.\" Many people live much longer than Patrick's 27 years, wondering if they made a difference or positively affected their world. This was not the case for Patrick <mark>Day</mark> when he left us. Rest in peace and power, <mark>Pat</mark>, with the angels. \"Charles Conwell (right) lands a punch on Patrick <mark>Day</mark>. (Photo by Dylan Buell/Getty Images) Conwell wrote a heartbreaking letter to his opponent this week .\" Dear Patrick <mark>Day</mark>, \"Conwell started the letter, which he shared on Twitter .\" I never meant for this to happen to you. All I wanted to do was win. If I could take it all back, I would. \"No one deserves this to happen to them. I replay the fight over and over in my head thinking what if this never happened and why did it happen to you .\" \"I can't stop thinking about it myself. I prayed for you so many times and shed so many tears because I couldn't even imagine how my family and friends would feel .\" I see you everywhere you go and all I hear is wonderful things about you. I thought about quitting boxing, but I know that's not what you would want. \"I know that you were a fighter at heart so I decided not to, and to fight and win a world title because that's what you wanted and that's what I want so I will use you as motivation every <mark>day</mark> and make sure I leave it all in the ring every time. With compassion, Charles Conwell .\" <mark>Day</mark>'s coach, Joseph <mark>Higgins</mark>, replied to Conwell's message to declare there were no hard feelings about <mark>Day</mark>'s injuries. \"I just wanted you to know that we do understand what you must be going thru as well,\" <mark>Higgins</mark> said. \"As devastated as we are, we realise you are equally devastated. We know if it was the other way around, we would be just as distraught .\" Thank you for your kind words. Patrick was born across the street from me, so our relationship is special. He would have wanted you to continue. \"I'm rooting for you to reach your dream, the same one he had. God Bless your Team and we will keep you in our prayers as well. I too am distraught because I feel responsible but do realise there is no fault. Stay strong and please don't think we blame you .\" There's been an outpouring of emotion from the boxing community. This is very sobering. Sadly, Patrick <mark>Day</mark> has lost his toughest fight. Like every man who climbs through the ropes chasing the glory, he risked it all. My thoughts & condolences are with his friends and family at this very tough time. May he rest in eternal peace .--<mark>Frank Bruno</mark> MBE???? (@ frankbrunoboxer) October 16, 2019 Devastated to hear the news of the passing of Patrick <mark>Day</mark>. I met him for the first time last Thursday, what a charming young man with a dream and a smile that lit up the room. Our deepest prayers are with his family, his trainer <mark>Joe Higgins</mark>, Charles Conwell and promoter Lou DiBella??--Eddie Hearn (@ EddieHearn) October 16, 2019 Gutted to hear about Patrick <mark>Day</mark>! Another young man loses his life in a boxing ring. Thought & Prayers with his family at this tragic time. RIP Patrick ❤ ️--matthew macklin (@ mattmacklin) October 16, 2019 Terrible to hear about the passing of Patrick <mark>Day</mark>. Rest In Peace .????--<mark>Sergio Mora</mark> (@ TheLatinSnake_) October 16, 2019 More Stories premium_icon Pill testing will save lives. It must start now premium_icon Aussie to pay \"blood money' to victim's family More Stories premium_icon Pill testing will save lives. It must start now premium_icon Aussie to pay\" blood money' to victim's family 0 boxing Read More Login to follow editors picks Read More Login to follow fatal punch Read More Login to follow patrick <mark>day</mark> Read More Login to follow boxing editors picks fatal punch patrick <mark>day</mark>", "articleID": "2019101700_00069224_W", "names": {"Frank Bruno": ["Q530220", "Q5485522"], "Joe Higgins": ["Q1389005", "Q6210320"], "Pat Day": ["Q6813952", "Q7143355"], "Sergio Mora": ["Q2036108", "Q25238177", "Q7454332"]}}, {"date": "2019-10-18", "url": "http://www.gamereactor.eu/cyberpunk-2077/?sid=70b8dc0beb6382aa856f0983b5ebddee", "content": "CYBERPUNK 2077 NEWS. Written by <mark>Sam Bishop</mark> on the 14th of October 2019 at 12:06 Nothing is set in stone, but with Cyberpunk 2077 also having multiplayer in the works, it's not too far-fetched. NEWS. Written by Lisa Dahlgren on the 1st of October 2019 at 19:23 The polish actor who portrayed Geralt in the original Polish Witcher TV-series will play Johnny Silverhand in the Polish version of Cyberpunk 2077 NEWS. Written by <mark>Sam Bishop</mark> on the 13th of September 2019 at 11:49 \"We really want to make sure players get the representation that they want,\" says level designer Max Pears. NEWS. Written by <mark>Sam Bishop</mark> on the 12th of September 2019 at 12:42 Goodbye Kansas and CDPR release a behind-the-scenes video on the trailer, showing us life in Night City. NEWS. Written by <mark>Sam Bishop</mark> on the 11th of September 2019 at 15:00 CD Projekt Red's lead quest designer <mark>Philipp Weber</mark> spoke in a Q & A recently about the various stories available in the RPG. NEWS. Written by <mark>Sam Bishop</mark> on the 4th of September 2019 at 09:24 This hasn't been set in stone before, but after R & D they've decided to work on it, and they need more staff to do so.", "articleID": "2019101802_00185478_W", "names": {"Philipp Weber": ["Q15840414", "Q2087278", "Q2087282"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-10-18", "url": "https://www.marketwatch.com/story/stock-market-pessimism-is-a-reliable-sign-of-a-pending-rebound-2019-10-18?mod=home-page", "content": "It seems that all investors, from individuals to institutions, have one thing in common: They've been getting out of stocks. Before following the herd, ask yourself: When did the crowd ever correctly foresee a stock market top? There's a reason for this saying: \"No bell rings at the top of the market .\" In fact, the post-2009 bull market has been fueled by hyped-up pessimism. In 2014, when billionaire investors Wilbur Ross and Carl Icahn along with investing icons <mark>Marc Faber</mark>, <mark>Peter Schiff</mark> and David Tepper joined the doomsday crowd, I wrote: \"Here's a message for everyone dying to be the next [Nouriel] Roubini: A watched pot doesn't boil and a watched bubble doesn't burst. There will be a correction, but the bull market won't be over until most bears turn into bulls or the media stops listening to crash prophets .\" Counterpoint: The \"skyscraper indicator' shows we're near a stock market top As the chart below shows, bears remain bears. Last week (denoted by the red line) only 20.3% of retail investors polled by the American Association for Individual Investors (AAII) were bullish, the lowest reading since May 2016. The AAII chart is reminiscent of June 7, 2017, when I published the chart below in this article\" There's still plenty of fuel left to fire up this stock market. \"Managers polled by the National Association of Active Investment Managers (NAAIM), essentially institutions, have had an average equity exposure of 57%. Commercial S & P 500 Index SPX, -0.10% hedgers are net short S & P 500 futures (not to an extreme though). Let's not forget that this is happening while the S & P 500, Dow Jones Industrial Average DJIA, -0.22% and Nasdaq COMP, -0.18% are trading within spitting distance of their all-time highs. Market scapegoats Trade-war tweets, European Union concerns and U.S. recession talk have taken their toll, some claim. But if that's the case, why are stocks near record highs? Case in point. I published the chart of online\" recession \"searches in the Aug. 25 Profit Radar Report and warned that premature bears will likely have to get\" burned \"before the market turns south. How to trade sentiment Long-term sentiment suggests that a major market top has not yet been struck, which means higher prices are still ahead. But long-term sentiment is not an appropriate short-term timing indicator. Here is some short-term help. The S & P 500 seems to be tracing out a triangle (blue lines), which may develop within an even larger triangle (purple line). The S & P 500 could pull back while below blue triangle resistance, but a close above resistance (3,002 points) should unlock higher targets (as high as 3,187). The purple trend line around 3,060 points provides additional resistance. In fact, this trend line is important because it corresponds with similar resistance for the Russell 2000 RUT, -0.14% and Dow Jones Transportation Average DJT, +0.20%. A coordinated breakout of all three indexes has had bullish implications over the past decade. More details about the importance of purple trend line resistance is available here. Simon Maierhofer is the founder of iSPYETF and publisher of the Profit Radar Report. We Want to Hear from You Join the conversation Comment", "articleID": "2019101814_00079461_W", "names": {"Marc Faber": ["Q117011", "Q16439149"], "Peter Schiff": ["Q1560227", "Q512741"]}}]