[{"date": "2019-10-21", "url": "http://www.gazetteandherald.co.uk/sport/national/17982021.photo-peyper-mocking-vahaamahina-elbow-investigated-say-france/", "content": "Photo of Peyper \"mocking Vahaamahina elbow' should be investigated, say France By Press Association 2019 Sebastien Vahaamahina sent off 0 comment France have called for World Rugby to investigate a photo of referee Jaco Peyper in which he appears to mock the elbow to the head that earned Sebastien Vahaamahina a red card. Peyper sent Vahaamahina off for his brazen act of thuggery early in the second-half of Sunday's 20-19 World Cup quarter-final defeat by Wales. In full view of Oita Stadium, the Clermont lock struck Aaron Wainwright on the jaw while France staged an attacking maul, leaving Peyper to make one of the easier decisions of his career. But the South Africa official has now invited controversy on to himself after a picture emerged on social media showing him posing with Welsh fans and playfully landing an elbow on to the head of one. France's Sebastien Vahaamahina sits out after receiving a red card (David Davies/PA)\" This photo if it is true is shocking and explanations will be necessary, \"French Rugby Federation vice president Dr <mark>Serge Simon</mark> said on Twitter. Wales head coach Warren Gatland and his France counterpart <mark>Jacques Brunel</mark> endorsed Peyper's decision to issue the eighth red card of Japan 2019. The 28-year-old forward, scorer of his side's opening try, spent the rest of the game sat on the bench with his hands on his head .\" The officials dealt with it appropriately. I don't think anyone could complain about that. The right decision was made, \"Gatland said .\" Rugby is heat of the moment stuff and he made an error of judgement. When you have got a lot of testosterone involved in some pretty high intensity games, that will sometimes happen. He's made a poor decision. \"<mark>Brunel</mark> agreed that Vahaamahina deserved to be dismissed .\" The red card I don't contest--when you see the images it's very clear. He did have contact with the face so we can't deny that, \"<mark>Brunel</mark> said .\" Of course it changed the game. When you're playing half the match with 14 men it's difficult. \"0 comment", "articleID": "2019102105_00020024_W", "names": {"Jacques Brunel": ["Q2480198", "Q50700550"], "Serge Simon": ["Q3479538", "Q52906755"]}}, {"date": "2019-10-21", "url": "http://gulfnews.com/uae/uae-based-couple-create-top-ranking-school-in-kerala-india-1.67171990", "content": "A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. Image Credit: Supplied Dubai A UAE-based Indian couple's efforts to elevate the standard of a girl's government school in Kozhikode of India's Kerala has paid rich dividends, with the local government now set to implement its exemplary model across 1,000 government schools in the state. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for Girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, has also been ranked as the No. 2 government school in the country in the Education World (EW) India School Rankings in 2019-2020. EW, India, is the world's largest survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. A once-crumbling school, the 120-year-old GVHSS underwent an infrastructural transformation in 2015 with funds from UAE based Faizal and Shabana Foundation, the philanthropy arm of KEF holdings, a Dubai-based company. The school is run by Faizal and Shabana Kottikolon, co-founders of the foundation. Faizal, founder and chairman of KEF Holdings, said: \"The top ranking for Nadakkavu school is a true testament to the success of our foundation's vision,\" Giving to Create Impact'. Our goal is to drive the positive transformation of government--and private--schools through an integrated and participatory approach. We are honoured to have created this benchmark of excellence for education in India. We will continue to drive our education engagement initiatives across the country as well as in other nations. \"How it all began As Faizal said,\" It all started with an interview where someone asked me what I thought India needed to do to change the face of public education. I realised dilapidated infrastructure was the first thing that needed change. Poor conditions not only lowered self-esteem of children but was the main cause of absenteeism and high dropout rate. So in collaboration with <mark>Pradeep Kumar</mark>, a local legislator, we began our work. When we arrived at this school the first time in 2014, we saw the structure was dilapidated. The building housed classes for 2,400 girls, but had only eight toilets. The mid-day meals were not providing enough nutrition and teachers were qualified but had no upgrading of skills programme. \"<mark>Pradeep Kumar</mark>, who had founded Prism (Promoting Regionals Schools to International Standards through Multiple Interventions) was planning to utilise a portion of the development funds granted to local legislators--in this case around Rs10 million (around Dh561,445)--to repair the crumbling school. The Kottikolon's invited the Indian Institute of Managemnt (IIM) Calicut to conduct research into why students were not inspired to study despite free education and free meals along with well qualified teachers. Armed with research and feedback on what was required and with consultation from iternational architects from Denmark and UK, the school underwent the transformation. Faizal said:\" We did not want to disrupt the school for a single day and undertook the project during the summer vacations, completing it in 95 days, Old walls were pulled down, new ones designed, toilets built and teachers imparted training through IIM Calicut. Suddenly the self-confidence of students and teachers went up manifold when the school reopened for the new academic year in 2015. New look New structures at the school included a 132,000-sq ft landscaped garden, a library with around 25,000 books and an 18,110-sq-ft astro-turf multipurpose playing field for athletics, football and hockey. A new sports complex with a 13,000-sq-ft indoor stadium, wood-floored basketball and badminton courts, and spacious changing and locker rooms for students were also built. Learning became fun and interactive as the classrooms were digitally equipped. Students took pride in carrying out experiments in modern laboratories for physics, chemistry and botany. Sanity and hygiene went up several notches with the construction of 92 spotless toilets, a corporate-style kitchen and dining hall that could seat about 600 students at a time. In an economically empowering experiment, village women found employment cooking at the school kitchen providing healthy, wholesome meals to the students and earning a modest income. All this brought about a dramatic turnaround of the average performance of the students as results indicated. In the 2015 board examinations, every student who took the exam passed, with 21 out of 393 students securing A + (above 92 per cent) in all subjects--a 400 per cent increase in A + grades since 2012. Self-sustainable The school has become the pride of Calicut and a central hub for the community, said Faizal. The facilities are utilised for a fee by the community. The entire neighbourhood uses the school grounds for morning walks and yoga camps during the weekends. The modern stadium and playgrounds are also leased out for community functions. Shabana, co-founder of the foundation, and vice chairperson of KEF Holdings, said: \"Since the inception of the foundation over 10 years ago, our single-minded focus was on driving social impact through our programmes. We are privileged to undertake the opportunity to support this school with a history of over 120 years, and to transform it into one of India's leading schools. More importantly, we see incremental value from this transformation. All our students benefit from high-quality education, delivered by a team of committed teachers. We see these students evolving as well-rounded individuals who can contribute incredible value to the society .\" What the students say Ayina P. P: Class 12, studying in Nadakkavu school since 5th std (2013) \"I am from a middle class family. I came here in 5th std and that time there was a small canteen and buildings were not clean. Then suddenly things changed, though I didn't understand that time what happened, today I know the effort it took .\" One important feeling I have is in this school we are asked to decide for ourselves and this has made me responsible and confident about taking decisions, making mistakes and still believing in myself. I am happy to be part of this school and this has changed my outlook in life. \"Neehara E: Class 12, studying in Nadakkavu school since 5th std (2013)\" The school gives us opportunities to grow and develop ideas on our own. Shiju sir my present teacher pushes me to present speeches, thoughts for the day which helps me develop my skills. I feel more confident and my efficiency has grown over the years, My dream is to become an entrepreneur and I would like to study at IIMK. My personal life too has become positive because of this school. \"Suhina Cherott: studied at Nadakkavu from 2010 - 2012 and is now a health care technician planning to do her PhD\" Earlier, when I was studying, the school was in a bad condition. When I passed out, the sudden change happened. I wish I had been there during this change. \"A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: Mr. Faizal E. Kottikollon and Mrs. Shabana Faizal, Co-Founders of Faizal & Shabana Foundation Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: Image Credit: Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: View gallery as list The Morning and Evening Brief A daily brief with the biggest stories of the day Subscribe Please enter your email address This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.", "articleID": "2019102112_00046940_W", "names": {"Pradeep Kumar": ["Q22108021", "Q30689544", "Q37837571", "Q43111538", "Q45813198", "Q48720240", "Q7237408"]}}, {"date": "2019-10-21", "url": "http://stamfordadvocate.com/local/article/Stamford-high-schools-host-haunted-houses-14550499.php?src=sthpln", "content": "https: //www.stamfordadvocate.com/local/article/Stamford-high-schools-host-haunted-houses-14550499.php Stamford high schools host haunted houses By Sophie Vaughan Updated 1:33 pm EDT, Monday, October 21, 2019 Geetha Weerakoon, a senior at Stamford High School, adjusts an animatronic Halloween figure that is part of the annual haunted scare house at the school in Stamford, Connecticut ., Friday, Oct. 19, 2018. Stamford High School student council host the haunted attraction, which runs thru Saturday, Oct. 20, from 7 p.m. to 11 p.m. Funds from the event will go to support the senior class. Tickets are $10 for a single run or $15 for unlimited runs. less Geetha Weerakoon, a senior at Stamford High School, adjusts an animatronic Halloween figure that is part of the annual haunted scare house at the school in Stamford, Connecticut ., Friday, Oct. 19, 2018 ....more Photo: <mark>Matthew Brown</mark> / Hearst Connecticut Media Photo: <mark>Matthew Brown</mark> / Hearst Connecticut Media Image 1 of / 1 Caption Close Image 1 of 1 Geetha Weerakoon, a senior at Stamford High School, adjusts an animatronic Halloween figure that is part of the annual haunted scare house at the school in Stamford, Connecticut ., Friday, Oct. 19, 2018. Stamford High School student council host the haunted attraction, which runs thru Saturday, Oct. 20, from 7 p.m. to 11 p.m. Funds from the event will go to support the senior class. Tickets are $10 for a single run or $15 for unlimited runs. less Geetha Weerakoon, a senior at Stamford High School, adjusts an animatronic Halloween figure that is part of the annual haunted scare house at the school in Stamford, Connecticut ., Friday, Oct. 19, 2018 ....more Photo: <mark>Matthew Brown</mark> / Hearst Connecticut Media Stamford high schools host haunted houses 1 / 1 Back to Gallery STAMFORD--Haunted houses are coming to both Westhill High School and Stamford High School just in time for Halloween. Westhill will host its third annual \"Fall Festival and Haunted Halloween Bash\" this Saturday, Oct. 26 in school's Agriscience building. The Fall Festival will run from 2 to 4 p.m. followed by the Haunted House from 4 to 8 p.m. Stamford High School will host its fifth annual Haunted House both this coming Friday and Saturday, Oct. 25 and 26, from 7 p.m. to 11 p.m. in the high school's auxiliary gymnasium. Admission is $10 for access to each event and and the haunted houses are recommended for those ages 12 or 13 or older, or with guardian consent. svaughan @ hearstmediact.com; 203-964-2265; @ SophieCVaughan1 Most Popular 1 As Trump reels, Democrats wonder which of their candidates can beat him 2 Body found at SCSU 3 Stamford Police give child \"ride of a lifetime\" 4 Woman fled accident in Cos Cob with kids: GPD 5 MLB umpire Eric Cooper dies at 52; did playoffs 2 weeks ago 6 Attorney: Troconis \"abused' her Fifth Amendment rights 7 Stamford man charged with selling anti-anxiety pills View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019102118_00069697_W", "names": {"Matthew Brown": ["Q16205624", "Q22323679", "Q3852260", "Q38801557", "Q48869864"]}}, {"date": "2019-10-22", "url": "https://www.boxingscene.com/oscar-rivas-being-pursued-by-top-rank-eddie-hearn--143567", "content": "<mark>Oscar Rivas</mark> Being Pursued By Top Rank and Eddie Hearn By Luke Furman Published On Tue Oct 22, 2019, 12:20 AM EDT Heavyweight contender <mark>Oscar Rivas</mark> (26-1, 18 KOs) continues to be a hot commodity, despite suffering his first career defeat back in July. <mark>Rivas</mark> suffered a twelve round unanimous decision loss to Dillian Whyte in a WBC final eliminator. Whyte was down in the ninth round. There was controversy in the aftermath of that bout, when it was revealed that Whyte had tested positive for two metabolites of a banned substance in an anti-doping test administered by UKAD in June. <mark>Rivas</mark> and his handlers were unaware of the positive test, and they had no knowledge that a confidential hearing took place on the morning of fight - where a panel allowed Whyte to move forward with the contest. Whyte is still involved in a confidential legal process with UKAD. The WBC have suspended his mandatory status - until the situation with UKAD is resolved. If Whyte is suspended by UKAD, <mark>Rivas</mark> and his handlers would likely petition the WBC for a mandatory title shot. Top Rank Vice President Carl Moretti confirmed that a multi-fight deal has been presented to <mark>Rivas</mark> and his promoter, <mark>Yvon Michel</mark>. That multi-fight deal includes a future fight with undefeated Tyson Fury. But Moretti is not alone in his chase. Eddie Hearn, who promoted <mark>Rivas</mark>' fight with Whyte, is also offering the Canadian heavyweight a multi-fight deal. Top Rank is aligned with ESPN, while Hearn has an exclusive deal with streaming service DAZN. \"I'm aware of Hearn's offer to <mark>Rivas</mark>. It's part of the boxing business. It's up to <mark>Oscar</mark> and his team to make their decision. If he decides not to take our offer [and go with Hearn], it will be more difficult to offer him a fight against Fury,\" Moretti confirmed to The Montreal Journal. This week, <mark>Michel</mark> will travel to Cancún for the WBC convention with the boxer and the manager of <mark>Rivas</mark>, Stéphane Lépine. At the end of the week, they will make a decision on the direction of the heavyweight's career. Tags:", "articleID": "2019102204_00113583_W", "names": {"Oscar Rivas": ["Q3428624", "Q7106230"], "Yvon Michel": ["Q52896469", "Q530848"]}}, {"date": "2019-10-22", "url": "https://www.lynnnews.co.uk/news/pedal-to-the-metal-for-kings-lynn-food-bank-collection-efforts-9086843/", "content": "Pedal to the metal for King's <mark>Lynn</mark> Food Bank collection efforts By Ben Hardy - ben.hardy @ iliffepublishing.co.uk Published: 09:33, 22 October 2019 | Updated: 09:34, 22 October 2019 Around 20 trays of food were collected as motorbike riders gathered in <mark>Lynn</mark> on Saturday for a 50-mile event. The Mayor's Appeal Motorbike run started from West <mark>Lynn McDonald</mark>'s and finished at the King's <mark>Lynn</mark> Innovation Centre (KLIC). A total of 72 bikes and 100 riders took part including mayor Geoff Hipperson who completed the route on his quad bike. Mayor's Appeal Motorbike Ride Organiser <mark>Richard Pike</mark> said: \"The mayor said he really enjoyed it as it went so smoothly and was well marshalled .\" We ask the riders to bring items of food which we then donated to King's <mark>Lynn</mark> Foodbank at KLIC. \"The route took the riders through Downham, Swaffham and close to Wisbech. Mayor Geoff Hipperson and <mark>Richard Pike</mark> Mr <mark>Pike</mark> thanked the marshalls, Kelly Hill from KLIC for letting the riders finish at the building, the mayor's office for providing tea afterwards, Julie Price of Nick's Motorcycle Training and Simon Penfold of AVR Repairs. The event has taken place for the last 25-years with the latest ride taking about an hour-and-a-half to complete according to Mr <mark>Pike</mark>. He added:\" It has been going for a while and was initially aimed at local old folk at Christmas, which was collected by the Round Table. It has evolved through the years. \"Gallery1", "articleID": "2019102208_00175248_W", "names": {"Lynn Mcdonald": ["Q6709127", "Q6709129", "Q6763615"], "Richard Pike": ["Q18593431", "Q7328427"]}}, {"date": "2019-10-22", "url": "https://ottawacitizen.com/news/local-news/barrhaven-youngsters-quick-actions-help-save-mans-life", "content": "Share Adjust Comment Print Juliet Murphy and Darcy Power are best friends, born on the same day, in the same hospital, 11 and a half years ago. They play hockey against one another, and finish each other's sentences. So they were perhaps the perfect duo to spring into action on Saturday afternoon when, pedalling to Juliet's Barrhaven home from a playdate in nearby Furness Park, the two discovered a man in his 60s sprawled on the ground, on his back, in cardiac arrest. The man may owe his life to the two girls. \"He was like this,\" said Darcy, re-enacting the scene, her legs on the sidewalk, her torso on Lydia Way, on the north side of the park. \"And his phone was here,\" added Juliet a Grade 6 student at Jean-Robert Gauthier Catholic school, pointing to a spot on the road near Darcy's outstretched right arm. \"It looked like he was calling someone .\" The man's chest, they noted, was not moving. \"He wasn't breathing,\" recalled Darcy, in Grade 6 at St. John XXIII Catholic school. They recounted, too, how a number of cars approached, slowed, and continued on without stopping. They were frightened, but knew what to do. Darcy, who lives in the Craig Henry neighbourhood and whose father is an Ottawa firefighter, stayed with the man while Juliet went to a friend's house for help. No one was home. Juliet called out to Darcy to go to another house, while she returned to the man's side. Darcy rang a door bell, to no avail. The girls then noticed two men working on a car and approached them for help. One of the men called 911. The other ran over to the fallen man, and told the girls to go get their parents. They then went to the corner of Amarillo and Crestway drives, to direct police, paramedic and fire responders to the scene. Juliet Murphy (right) and Darcy Power pose for a photo at Furness Park in Ottawa Tuesday Oct 22, 2019. Juliet and Darcy found a 60-year-old man who'd suffered a cardiac arrest at Amarillo Drive and Lydia Way, in Barrhaven Saturday and got help. <mark>Tony Caldwell</mark> / Postmedia From their vantage point a block away, the girls couldn't see paramedics use a defibrillator on the man, and didn't learn for a couple of days that he arrived at the hospital unconscious and in critical condition, but alive. It wasn't until Ottawa Paramedic Service put out a news release on Monday, looking to identify the Good Samaritans, that they learned of the man's immediate fate. Juliet cried--tears of joy and relief. Darcy sprang from the dinner table and performed three jumping jacks and one squat. \"It feels really good to help somebody, but if you don't know if they're OK, you start to get scared,\" said Juliet. \"Did I really help this person or did I make it worse?\" \"Did I take too long?\" added Darcy. \"Did I do something wrong?\" But back at the park on Tuesday, the pair were greeted by at least one neighbour who came out to thank them. \"Thanks for what you did,\" he said. People are calling them heroes. \"That means you're helping people in need,\" explained Darcy. \"You're not just helping people to get a reward or something .\" \"Because no matter the cost,\" interjected Juliet, \"you need to help somebody. Because if you don't, it kind of stings .\" \"Nice,\" she added \"always beats self-centered .\" \"We made a good choice,\" said Darcy. \"We were so happy...\"(Juliet)\" ...that we saved a life. (Darcy) \"He could have been gone, just like that .\" I was just scared at the beginning...but getting scared won't help the guy. Things won't go out of control if you just stay calm. \"\"What these two ladies did was really amazing,\" said Marc-Antoine Deschamps of the Ottawa Paramedic Service. \"They took charge. They didn't just walk by and ignore a man in distress .\" The pair credited their parents for teaching them what to do in such emergencies. \"You always learn by your parents because they always talk about it,\" said Juliet. \"Sometimes you don't listen, but the good things always stick in your head .\" ", "articleID": "2019102222_00113778_W", "names": {"Tony Caldwell": ["Q4873687", "Q7822011"]}}, {"date": "2019-10-23", "url": "http://www.bostonherald.com/2019/10/23/patriots-qb-tom-brady-on-retirement-speculation-i-dont-know-what-the-future-holds/", "content": "FOXBORO, MA .--OCTOBER 8: <mark>Tom Brady</mark> #12 of the New England Patriots speaks to reporters at Gillette Stadium on October 8, 2019 in Foxboro, Massachusetts. (Staff Photo By Matt Stone/MediaNews Group/Boston Herald) By Karen Guregian | karen.guregian @ bostonherald.com | Boston Herald PUBLISHED: October 23, 2019 at 9:10 am | UPDATED: October 23, 2019 at 9:28 am Talk of this being <mark>Tom Brady</mark>'s final season stirred Monday night with ESPN's Adam Schefter strongly hinting during the pregrame show the Patriots quarterback is \"setting it up to move on,\" although he wasn't sure what <mark>Brady</mark>'s plans were and what that meant down the road. In other words, that might mean retirement or playing for another team. Appearing on \"The <mark>Greg Hill</mark> Show\" Wednesday morning, <mark>Brady</mark> was asked for his thoughts on the retirement speculation surrounding him. He didn't exactly shoot down any of the talk. He said he was uncertain about his future. \"That is the great part for me, I don't know,\" <mark>Brady</mark> said. \"I think that has been a unique situation that I have been in because I think when you commit to a team for a certain amount of years you kind feel like (there is) the responsibility to always fulfill the contract. For me, it's been good because I am just taking it day-by-day and I am enjoying what I have. I don't know what the future holds and the great part is for me, football at this point is all borrowed time. I never expected to play 20 years and I am playing on a great team and it's just been an incredible 20 years of my life. To play for Mr. Kraft, and Jonathan and the Kraft family and for Coach Belichick and to have so much success is a dream come true .\" One day I will wake up and I will feel like, \"OK, that will be enough .' When that day comes, that day comes. I don't know if it will be after this year. I don't know if it will be five years from now. I don't have to determine those things right now, either. That is kind of a good part of where I am at. Just take advantage of the opportunities that I have this year and do the very best I can do and then those decisions come at probably more appropriate times .\" Both <mark>Brady</mark> along with personal trainer <mark>Alex Guerrero</mark> have put their homes on the market and he's in the last year of his contract. That's added to the speculation this could be <mark>Brady</mark>'s final year in New England, or final year, period. Sign up for email newsletters Subscribe Follow Us Facebook Twitter Instagram RSS", "articleID": "2019102315_00152167_W", "names": {"Alex Guerrero": ["Q15119311", "Q4717106", "Q56275288"]}}]