[{"date": "2019-10-23", "url": "http://www.bostonherald.com/2019/10/23/patriots-qb-tom-brady-on-retirement-speculation-i-dont-know-what-the-future-holds/", "content": "FOXBORO, MA .--OCTOBER 8: <mark>Tom Brady</mark> #12 of the New England Patriots speaks to reporters at Gillette Stadium on October 8, 2019 in Foxboro, Massachusetts. (Staff Photo By Matt Stone/MediaNews Group/Boston Herald) By Karen Guregian | karen.guregian @ bostonherald.com | Boston Herald PUBLISHED: October 23, 2019 at 9:10 am | UPDATED: October 23, 2019 at 9:28 am Talk of this being <mark>Tom Brady</mark>'s final season stirred Monday night with ESPN's Adam Schefter strongly hinting during the pregrame show the Patriots quarterback is \"setting it up to move on,\" although he wasn't sure what <mark>Brady</mark>'s plans were and what that meant down the road. In other words, that might mean retirement or playing for another team. Appearing on \"The <mark>Greg Hill</mark> Show\" Wednesday morning, <mark>Brady</mark> was asked for his thoughts on the retirement speculation surrounding him. He didn't exactly shoot down any of the talk. He said he was uncertain about his future. \"That is the great part for me, I don't know,\" <mark>Brady</mark> said. \"I think that has been a unique situation that I have been in because I think when you commit to a team for a certain amount of years you kind feel like (there is) the responsibility to always fulfill the contract. For me, it's been good because I am just taking it day-by-day and I am enjoying what I have. I don't know what the future holds and the great part is for me, football at this point is all borrowed time. I never expected to play 20 years and I am playing on a great team and it's just been an incredible 20 years of my life. To play for Mr. Kraft, and Jonathan and the Kraft family and for Coach Belichick and to have so much success is a dream come true .\" One day I will wake up and I will feel like, \"OK, that will be enough .' When that day comes, that day comes. I don't know if it will be after this year. I don't know if it will be five years from now. I don't have to determine those things right now, either. That is kind of a good part of where I am at. Just take advantage of the opportunities that I have this year and do the very best I can do and then those decisions come at probably more appropriate times .\" Both <mark>Brady</mark> along with personal trainer <mark>Alex Guerrero</mark> have put their homes on the market and he's in the last year of his contract. That's added to the speculation this could be <mark>Brady</mark>'s final year in New England, or final year, period. Sign up for email newsletters Subscribe Follow Us Facebook Twitter Instagram RSS", "articleID": "2019102315_00152167_W", "names": {"Greg Hill": ["Q11163426", "Q16729823", "Q19663103", "Q30612101", "Q5605708", "Q5605710"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"]}}, {"date": "2019-10-23", "url": "https://www.voanews.com/science-health/us-gates-foundation-plan-200m-sickle-cell-hiv-cures", "content": "Share on Facebook Share on Twitter Share via Email Print this page Comments Science & Health US, Gates Foundation Plan $200M for Sickle Cell, HIV Cures By Agence France-Presse October 23, 2019 03:29 PM Share on Facebook Share on Twitter Share via Email Print this page Comments FILE - Bill and Melinda Gates are interviewed in Kirkland, Washington, Feb. 1, 2019. The philantropist couple has teamed up with the U.S. government to more forcefully tackle HIV and sickle cell disease. WASHINGTON - The U.S. government and the Bill and Melinda Gates Foundation pledged Wednesday to jointly invest $200 million over the next four years to achieve affordable gene therapy-based cures for sickle cell disease (SCD) and HIV. The administration of President Donald Trump announced earlier this year its intention to end the HIV epidemic over the next decade and has also identified SCD, which disproportionately affects people of African descent, as a condition requiring greater attention. Gene therapy is a relatively new area of medicine designed to replace faulty genes in the body that are responsible for a disorder, and has been responsible for new treatments for blindness and certain types of leukemia. But the treatments are complex and costly, ruling them out as an option for most of the world. <mark>Francis Collins</mark>, director of the National Institutes of Health, said the collaboration would focus therefore on \"access, scalability and affordability\" to make sure the eventual treatments are available globally. The NIH and Gates Foundation aim to achieve clinical trials in the United States and countries in sub-Saharan Africa within the next seven to 10 years. Sickle cell disease is a group of inherited red blood cell disorders characterized by the presence of an abnormal protein in the red blood cells, causing the feet and hands to swell, fatigue, jaundice, and episodic or chronic pain. Over time the disease can harm a patients' vital organs, bones, joints and skin and it is currently only curable via a blood and bone marrow transplant, available to only a tiny fraction of people who have the disease. When it comes to HIV, antiretroviral therapy (ART) are now able to reduce patients' viral load to the point that they are undetectable and cannot be further transmitted. But \"a major goal is to find a cure, whereby lifelong ART would not be required,\" said the NIH's Anthony Fauci. Though SCD is a genetically inherited disease, and HIV is acquired from infection, gene-based treatments are said to hold promise for both, and \"many of the technical challenges for gene-based cures are expected to be common to both diseases .\" The goal for SCD is to achieve a gene-based intervention that either corrects the gene mutation responsible or promotes fetal hemoglobin gene expression to achieve normal hemoglobin function. For HIV, the proposed cure would involve targeting the reservoir of proviral DNA that lurks inside a small number of cells even after many years of ART. The NIH said that approximately 95 percent of the 38 million people living with HIV globally are in the developing world, with 67 percent in sub-Saharan Africa, half of whom are living untreated. Around 1.1 million Americans are affected SCD affects approximately 100,000 Americans, according to official figures. Fifteen million babies will be born with SCD globally over the next 30 years, with about 75 percent of those births occurring in sub-Saharan Africans, said the NIH. Written By Agence France-Presse", "articleID": "2019102320_00044498_W", "names": {"Francis Collins": ["Q20740726", "Q336658"]}}, {"date": "2019-10-23", "url": "https://www.sltrib.com/sports/2019/10/23/weekly-run-newsletter/", "content": "The Weekly Run is The Salt Lake Tribune's weekly newsletter on the Utah Jazz. Subscribe here. There was a sense of anticipation Wednesday morning at the Zions Bank Basketball Campus, as the Jazz went through shootaround a few hours ahead of their regular-season opener against the Oklahoma City Thunder. After all the talk, the team is ready to get out there and see how they actually look in a game that matters. \"It's hard to gauge everything that you see in practice until you start playing games, whether it's preseason games or, obviously the regular season. First and foremost, we'll get a chance to see where we are,\" said coach Quin Snyder. \"...It's gotta be about the process of how we're coming together. Also, what's our level today?\" While opening nights are now old hat for veteran point guard Mike Conley, even he couldn't deny that the circumstances will make this one a bit unique and special. \"This is new--it's all new for me. It's my 13th year, but my first year outside of Memphis, so a whole new environment, new fans, new team. I'm just excited to get going,\" he said. He offered that the week of practices between the preseason finale and tonight's opener were devoted pretty much exclusively to defensive improvement, noting, \"I don't think we took any shots .\" He expects that as all the new players become increasingly familiar with both the concepts and each other, progress will come. That's what Snyder will be on the lookout for, as well, to determine how to proceed. \"There's a lot of analysis, and we don't want to overreact to a result, but also, there's nothing that you ignore,\" Snyder said. \"You go with the plan, and then you figure out when to implement and what to implement. If I see 10 things I'd like us to do better, we're not gonna fix 10 things in just a few days .\" In case you missed it First off, the important stuff: The Jazz will be making a \"major\" announcement Wednesday at 3:30. Owner <mark>Gail Miller</mark> will be joined by CEO Steve Starks, Gov. Gary Herbert, Salt Lake City Mayor Jackie Biskupski, and NBA commissioner Adam Silver. All signs point to Utah being awarded the 2023 NBA All-Star Game. Article continues below Related Article s This time it's for real: New-look Jazz open season against new-look Thunder at Vivint Arena <mark>Donovan Mitchell</mark> and other Jazz players lose some inches as official heights are released Jazz to make major announcement Wednesday afternoon; 2023 All-Star Game coming to Utah? Jazz renew 5 For The Fight jersey patch sponsorship; Joe Ingles gets one more year Beyond that interesting tidbit, there's been plenty of coverage leading up to Wednesday's season opener vs. the Thunder. For what it's worth, the team seemed pretty at ease in Tuesday's final practice. There's been no shortage of other news, either: <mark>Donovan Mitchell</mark>, among others, losing some height in the new official measurements; the renewal of the 5 for the Fight jersey patch sponsorship, and Joe Ingles getting a contract extension; and Quin Snyder getting a multiyear contract extension, too. Quin also gave a great interview explaining why the offense is so far ahead of the defense right now. Finally, we produced a special section in advance of the season. Among its contents: Asking if, in fact, the Jazz can compete for an NBA title; a player-by-player breakdown of the roster; a look at goings-on of the players who did not return from last season; a profile of general manager Justin Zanik by new Trib sports writer Julie Jag; a column from Gordon Monson examining the likelihood of the team's championship aspirations; a look at 10 key games on the schedule; an examination of the new backcourt pairing of <mark>Donovan Mitchell</mark> and Mike Conley; and a set of predictions about the best and worst of the coming season. Other people's stuff • John Hollinger of The Athletic (and formerly of the MemphisGrizzlies' front office) picks Jazz point guard Mike Conley as the \"captain\" of his \"2019-20 NBA All-Breakout Team .\" • Also from The Athletic, <mark>Tony Jones</mark> takes a look at <mark>Donovan Mitchell</mark> and asks if the third-year guard can make the leap to superstardom this coming season. • Jasen Lee of the Deseret News did a nice profile of reserve forward Georges Niang, and his journey from \"overweight\" freshman at Iowa State to rotation piece on an NBA team. • <mark>Ryan Miller</mark> of KSL went behind the scenes of the latest Vivint Smart Home television ad featuring Rudy Gobert and <mark>Donovan Mitchell</mark>. • Aaron Falk of utahjazz.com talked to several team members about the lackluster defensive showing from the preseason. The consensus? Not too worried. Up next The regular season begins tonight at Vivint Smart Home Arena against the Thunder. On Friday, the Jazz will their first road game of the season, heading out to Los Angeles to take on the Lakers. That game marks the front end of a back-to-back. The latter part comes Saturday in SLC against the Sacramento Kings. Then, on Monday, they're on the road again, taking on Ricky Rubio and the Phoenix Suns.", "articleID": "2019102320_00088298_W", "names": {"Donovan Mitchell": ["Q30122104", "Q5296848"], "Gail Miller": ["Q21176469", "Q5517132"], "Ryan Miller": ["Q1521532", "Q24005534", "Q250011", "Q29998663", "Q3943079", "Q58227811", "Q7384338", "Q7384339"], "Tony Jones": ["Q1798305", "Q20710818", "Q22673586", "Q4160430", "Q53812649", "Q7822672", "Q7822675", "Q7822676", "Q7822677", "Q7822678", "Q7822679", "Q7822680"]}}, {"date": "2019-10-25", "url": "https://sciencefiction.com/2019/10/25/producer-trinh-tran-gives-the-lowdown-on-disneys-hawkeye/", "content": "Avengers Disney Disney + Marvel Movies Streaming Service TV/Streaming Media Producer Trinh Tran Gives The Lowdown On Disney +'s \"Hawkeye' Leave a comment Posted October 25th, 2019 by Jax Motes Marvel Studios/Disney After popping up here and there in the Marvel Cinematic Universe, Jeremy Renner\" s Hawkeye is finally getting his turn in the spotlight as the star of his own Disney + series called--what else?--\"Hawkeye' .\" Avengers: Endgame' producer Trinh Tran is now spearheading that series, after developing a particular interest in the character from the movies. Marvel Studios/Disney As we saw in \"Endgame', Hawkeye/Clint Barton has really been through the wringer over the past few years. He was already a S.H.I.E.L.D. agent with a sketchy past, but he was grounded by his family--his loving wife Laura (Linda Cardellini), and his kids. But when they all vanished after The Snap, he went off the deep end, becoming Ronin and embarking on a mission to slay criminals all over the world. And while he was reunited with his family at the end of the movie, he'd suffered another debilitating loss, after his longtime partner Black Widow/Natasha Romanoff (Scarlett Johansson) sacrificed her life to bring back all the victims of The Snap. In reality, it was simply time for many of the major stars of the Marvel Cinematic Universe to leave the nest. After a decade, Johnasson, Robert Downey Jr., and <mark>Chris Evans</mark> were ready to move on. But Renner hasn't had the chance to shine like they have. Hopefully, that will change with the new show, but as we already know, this series will introduce Kate Bishop, the young woman who essentially replaced Barton in the comics. Tran discussed what to expect from\" Hawkeye': \"I think with Endgame, it's always going to impact all of the characters that we are introducing in our Disney + streaming shows as well as the future of features, right, for the characters that are still existing. So you're just going to have to find...I can't say much about that!\" Regarding Kate's introduction, Tran said: Marvel Comics \"Well, they're both Hawkeyes in a way, right? So you want to make sure...I'm always interested in introducing new characters. And now we have a fascinating young female who is very interested in this role. So you're going to see a balance of both .\" We're treating our shows as if we're making our features. I mean, the feel and the quality of those TV shows are going to be like the Marvel movies that you've seen. So that's always been [Marvel Studios president Kevin Feige]'s mindset of let's make sure that when people are going to be watching these episodes, it's going to feel like it's just one long movie except rather than two-and-a-half hours, it's going to be much longer. And the idea behind certain characters getting their shows is because we'll have a lot more time to be able to develop these characters rather than the shorter. \"It isn't yet known when the\" Hawkeye' series will arrive on Disney +, but it probably won't be until 2021. Renner is returning, and reportedly Hailee Steinfeld is in talks to portray Kate Bishop. Are you looking forward to the new Marvel shows on Disney +? Source: ComicBook.com Tags: Avengers Avengers: Endgame Black Widow Clint Barton Disney Hailee Steinfeld Hawkeye Jeremy Renner Kate Bishop Marvel Comics Marvel Studios Scarlett Johansson Trinh Tran Jax Motes Jax's earliest memory is of watching \"Batman,' followed shortly by a memory of playing Batman & Robin with a friend, which entailed running outside in just their underwear and towels as capes. When adults told them they couldn't run around outside in their underwear, both boys promptly whipped theirs off and ran around in just capes. Things Are Heating Up As Neill Blomkamp Taps Taylor Kitsch To Star In\" Inferno' <mark>Édgar Ramírez</mark> Has Been Talking To The Director Of \"Doctor Strange' Leave a comment June 25, 2014 James Mangold Suspects A Bleak Future For Mutants If The Disney And Fox Deal Goes Through 2 Comments December 12, 2017 Nick Blood Is Returning As Lance Hunter To Marvel's\" Agents Of S.H.I.E.L.D.'! Leave a comment September 10, 2017 Real Life Flying DeLorean Spotted In San Francisco Leave a comment January 20, 2013", "articleID": "2019102519_00121183_W", "names": {"Chris Evans": ["Q17490263", "Q178348", "Q21538587", "Q23418578", "Q27918241", "Q2964709", "Q2964710", "Q303577", "Q466583", "Q5106513", "Q51990270", "Q5392352"], "Édgar Ramírez": ["Q20030432", "Q273788"]}}, {"date": "2019-10-27", "url": "http://spokesman.com/stories/2019/oct/27/shawn-vestal-head-here/", "content": "Twitter Facebook Email Reddit SMS By Shawn Vestal shawnv @ spokesman.com (509) 459-5431 A few weeks back, the Census Bureau released some new estimates of incomes by ZIP code that showed Spokane continues to have some of the poorest neighborhoods in the state. But those numbers, the subject of a recent column, paint a limited picture. Yes, we have neighborhoods struggling with poverty here--and especially when you compare incomes to the West Side. But what those figures don't show is the broader reality of what's happened with income in Spokane over the past five years: It's grown remarkably overall--more than the rest of the county, the rest of the state and the rest of the nation. Think of it as the $14,700 difference. That's how much the median household income has grown in the city of Spokane between 2013 and 2018. During the same period, incomes nationwide grew by about $9,600. \"Spokane kind of kicked ass and took names,\" said Gavin Cooley, the head dollars-and-cents guy at City Hall under two mayors. Furthermore, the most recent year--between 2017 and 2018--was particularly strong, with median household incomes growing by 16%. That's a leap of more than $7,500 in one year. <mark>Patrick Jones</mark>, the executive director of the Institute for Public Policy and Economic Analysis at Eastern Washington University, referred to the recent income growth here as the best economic year in a generation. \"As a business owner friend told me,\" <mark>Jones</mark> wrote in an email, \"2018 was a very good year .\" The recent income growth comes at a time of great progress and reason for positivity in the city, despite the gloomy nature of our noisy sky-is-falling political campaigns. Cooley sees the income growth as the single most important indicator of community health, bolstered in part by a variety of effective, efficient initiatives that emerged from the city government--divided though it sometimes was--of the past eight years. Innovative and money-saving infrastructure improvements. Continued progress on street fixes citywide. A revitalization of Riverfront Park. More cops on the streets. An incredible expansion of the park, plaza, trail and overlook access to the Spokane River, with the newest plaza in front of the library unveiled on Friday. Cooley sees it as a high point not unlike the Expo era. And he's concerned that what followed that era was a sinking in the city's fortunes--as shown in incomes that didn't keep pace with the nation. For now, though, our numbers look better than they have in ages. Five years ago, Spokane's median household income was 33% lower than the national figure, according to a comparison of census figures Cooley provided. In 2018, we lagged the nation by just 15%. We're now within hailing distance of the national median household income--at $54,085 here, compared to just under $62,000 nationally. \"If we have five more years of growth, we'll be above the national average,\" Cooley said. \"The last time we were on par with the U.S. was before Expo .\" Between 2013 and 2018, the average annual rise in the median household income citywide was roughly twice the national increase--6.7% a year in Spokane, compared to 3.5% nationally. And, though the city still is dealing with higher-than-average poverty levels, the typical Spokane household has seen its income grow more than the county at large or Spokane Valley, and more than the robust statewide average, as well. Here are a few more statistics on income growth: The annual growth in median household income was 4.8% in the county at large, 3.7% in the Spokane Valley and 4.9% statewide. Since 2005, income has grown 56% in the city, compared to 34% nationally, 43% in Spokane County and 50% statewide. The increase in the median income over the most recent five-year period was $12,207 countywide, $8,574 in Spokane Valley and $15,668 statewide. It can be easy to forget--or fail to notice in the first place--what's been happening in this city recently. It's not a disaster. Not downtown, not citywide. Not by a long shot.", "articleID": "2019102707_00038921_W", "names": {"Patrick Jones": ["Q19671843", "Q2057711", "Q28655295", "Q56166336", "Q7146858"]}}]