[{"date": "2019-10-28", "url": "https://www.forbes.com/sites/stanphelps/2019/10/28/old-town-road-by-lil-nas-x-goes-diamond-and-you-should-too-in-business/", "content": "Old Town Road By Lil Nas X Goes Diamond And You Should Too In Business Stan Phelps, CSP is a keynote speaker and workshop facilitator on customer experience, employee engagement, technology, differentiation, and purpose at StanPhelpsSpeaks.com. Share to facebook Share to twitter Share to linkedin NEWARK, NEW JERSEY - AUGUST 26: Billy Ray Cyrus and Lil Nas X speak onstage during the 2019 MTV...[+] Video Music Awards at Prudential Center on August 26, 2019 in Newark, New Jersey. (Photo by <mark>Mike</mark> Coppola/Getty Images for MTV) Getty Images for MTV Old Town Road by Lil Nas X received Diamond Certification by the RIAA this week. It became the 33rd in history and the fastest to achieve the honor. Not bad for a song that was originally produced in Atlanta for less than $50. Diamond is 10 times platinum, when a single achieves the equivalent of 10 million units when combining sales and streaming. Here is a list of the 33 courtesy of Business Insider which includes three singles by both Eminem and Katy Perry. Diamond symbolizes the top honor in the recording industry, but it is also the new standard for achieving prosperity in business. Acting in accordance with the Diamond Rule is the next evolution of managing relationships and winning in sales. It's the 4.0 version that tops silver, golden and platinum approaches in business. Let's look at 1.0, 2.0, and the 3.0 versions for background: Version 1.0 - The Silver Rule The Silver Rule is \"do no harm .\" As stated by Zigong, a disciple of Confucius, in the book, \"What I do not wish others to do unto me, I also wish not to do unto others .\" The Silver Rule merely shares what not to do. It's not a bad start. Case in point, beginning in 2000, Google famously coined \"Don't be evil\" as part of the company's corporate code of conduct. The problem with Silver is that it's not prescriptive. It doesn't tell you how to treat others in business. Analects Version 2.0 - The Golden Rule Throughout nearly every culture and religion, the Golden Rule has become the gold standard of human dynamics. The Golden Rule is simply \"treating others the way you would like to be treated .\" If the Silver Rule deals in what not to do, the Golden Rule broadens it to all situations. In 2015 with the founding of Alphabet, Google revised its motto of \"Don't be evil\" to \"Do the right thing--follow the law, act honorably, and treat each other with respect .\" This approach by Google is more aligned with the Golden Rule. Marriott even has an entire advertising campaign around the Golden Rule. Unfortunately, in sales and managing relationships, the Golden Rule a bad rule. Here's why: In most sales organizations, an acceptable conversion rate is about 25 percent, which means that only one out of every four opportunities converts into a sale. Because you were taught to follow the Golden Rule, it's fair to assume you know what your clients want based on what you would want if you were them. Unfortunately, just looking at the conversion rates tells us that there's an issue. If anything else in our businesses was failing 75 percent of the time, we would immediately look for ways to improve. The Golden Rule leads to suboptimal results. This is because not everybody wants the same thing or to be treated the same way. We always assume that if something is good for us, then it must be good for everyone else. And, that if we want to be treated in a certain way, then that must be how everyone else wants to be treated. Turns out, that assumption couldn't be further from the truth. It leads to failed sales opportunities and strained client relationships all the time! NEW YORK - CIRCA 1961: Entertainer Perry Como rehearses on set of his TV show \"Perry Como's Kraft...[+] Music Hall\" in New York. (Photo by Donaldson Collection/Michael Ochs Archives/Getty Images) Getty Images FACT: Gold is worth significantly more per ounce than silver. It can be as much as 100 times more valuable. It is also the denser of the two metals, which makes a specified volume of gold worth far more than an equal volume of silver. The very first Gold Certification Award by the RIAA was earned in 1958 to Perry Como for his hit single. Catch A Falling Star Version 3.0 - The Platinum Rule The next level of the Golden Rule was popularized by Dr. Tony Alessandra in 1996. It simply is \"treating others the way that they want to be treated .\" Grounded in emotional intelligence, the Platinum Rule asks you to accommodate the feelings of others. Dave Kerpen outlines the shortcomings of the Golden Rule in his book. Kerpen writes, The Art of People \"The Golden Rule, as great as it is, has limitations, since all people and all situations are different. When you follow the Platinum Rule, however, you can be sure you're actually doing what the other person wants to be done and assure yourself of a better outcome .\" The Platinum Rule is more outward facing in its approach. The focus shifts from, \"this is what I want, so I'll give everyone the same thing\" to \"let me first understand what they want...and then I'll give it to them .\" One of the challenges when completely focusing on the other person is that we can overlook how we're feeling and reacting to a situation. For example, we may go into a meeting with the best of intentions to apply the Platinum Rule, but then something happens where we feel upset or disrespected or unheard, and then our capability to actually apply the Platinum Rule is interrupted. Therefore, while the Platinum Rule is aspirational, we must also be true to ourselves and neutralize our biology in order to be capable of addressing the needs of others. Considered one of the wealthiest Americans of all time, <mark>John</mark> D. Rockefeller, business magnate and philanthropist, clearly understood the intrinsic value of the Platinum Rule. He said that, \"the ability to deal with people is as purchasable a commodity as sugar or coffee and I will pay more for that ability than for any other under the sun .\" When you play the game of business by following the Platinum Rule, every game is an away game. You never have the home field advantage because success in the game is filtered through the needs and concerns of the other person. Your playbook focuses only on knowing how others want to be treated and what's important to them. Johnnie Taylor Photo Credit: Wikimedia Commons FACT: Platinum is more sought after than gold because it is rarer. Only 160 tons of platinum are mined annually around the world, as opposed to 1,500 tons of gold. Also, platinum is denser than gold; a platinum ring will weigh significantly more than a same-size ring in gold. Platinum is the new symbol of prestige. Think of the \"platinum credit card,\" which often has better benefits and privileges than the \"gold card .\" In the 1970's, the RIAA awarded the first Platinum Single Award. It was earned by Johnnie Taylor for the song. Disco Lady Version 4.0 - The Diamond Rule The Diamond Rule takes the Platinum Rule to the next level. The key here is understanding both our own biology as well as that of our prospects and customers. Treating someone the way they want to be treated is tricky enough under normal circumstances--but what happens when things start to get heated? In the immortal words of former boxing heavyweight champion, \"Everyone has a plan until they get punched in the mouth .\" <mark>Mike Tyson</mark> Pressure can trigger a biological response that causes us to act in an unpredictable and irrational manner. Under pressure, our brain activates a hard-wired survival strategy every time it detects a perceived threat. Why is the Diamond Rule so critical in sales and managing relationships? The answer is simple. A sales situation is inherently full of pressure. To quote the late artists David Bowie and Freddie Mercury in, \"Pressure pushing down on me. Pressing down on you .\" Pressure can make things unstable. In sales, you need to manage yourself and your prospect/client through these difficult situations. The Diamond Rule combines elements of both Gold and Platinum. Said simply, the Diamond Rule is \"the art of managing yourself under pressure and addressing the needs of others to avoid their triggers .\" Under Pressure Rooted in the understanding of our own behavioral style and the style of others, the Diamond Rule allows you to solve problems and achieve prosperity in the pressure-filled game of business. Practicing the Diamond Rule requires two elements: 1) you have to see your own predictable behavioral style when pressure hits, and 2) you need the capability to assess prospects/clients relative to four different, predictable behavioral styles based primarily on how people respond biologically to pressure. Since we all tend to be pretty strong in only one of the four styles of Control, Influence, Power or Authority, it's no surprise that we tend to connect with those whose style is similar to ours but find ourselves challenged to connect with those who have a different style. Therefore, when working outside of our own category, we may be less effective, leading to upwards of a 75 percent failure rate in sales conversion. Diamond Rule Behavior The Diamond Rule is the most advanced approach for working effectively with other people. As a combination of the Golden Rule and the Platinum Rule, it requires you to consider and satisfy your own instinctive concerns and needs while simultaneously addressing the needs of others. While it takes keen awareness and presence to pull this off, it is truly the \"Holy Grail\" of human dynamics. Diamond Rule behavior means effectively managing your identity (personal brand) with others even when your biology (survival response to pressure) is getting triggered (feeling under attack) in the game of business. When you adhere to the Diamond Rule, you rise above pressure, reaching an elevation that makes it easy to focus on solving client problems and reducing the pressure they feel. This makes you stand out as unique and better in the eyes of your client, dramatically increasing your ability to win business. A diamond is a symbol of wealth and wisdom. The more you mine for diamonds in your pursuits, the more success you will reap. Unlike Gold or Platinum which can be molded, you need to work with the natural elements of Diamonds and the natural reactions of human biology. Are you ready to go Diamond to win in sales and managing customer relationships? Singer <mark>Elton John</mark> performing a rewritten version of his song \"Candle in the wind' as a tribute to...[+] Diana, Princess of Wales, at her funeral. Over a million mourners lined the route of the funeral procession through London. (Photo by PA Images via Getty Images) PA Images FACT: Diamonds are crystals of pure carbon that have formed under a combination of high temperatures and extreme pressure in the Earth's mantle. Diamonds are not found on the Earth's surface, they must be mined with a pick-axe while tunneling deep in the ground. Given the process of sourcing diamonds and their value, they are much more precious and expensive than gold and platinum combined. CASE (S) IN POINT: It's no coincidence that Diamond Medallion is the highest status on Delta Airlines. Status has four levels: Silver, Gold, Platinum--and Diamond. To achieve Diamond Medallion status, you must travel 125,000 medallion qualifying miles a year. That's exactly the amount of Gold (50,000) and Platinum (75,000) combined. Candle in the Wind by <mark>Elton John</mark> was the first single to achieve Diamond certification status by the RIAA. Follow me on Twitter or LinkedIn. Check out my website or some of my other work here.", "articleID": "2019102812_00110873_W", "names": {"Mike Tyson": ["Q30122587", "Q6849116", "Q79031"]}}, {"date": "2019-10-28", "url": "http://www.wsbtv.com/sports/trae-young-wanted-to-start-the-season-off-strong-hes-done-that-and-more/1002277577?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Oct 28, 2019 - 9:30 AM Loading...Trae Young wanted to start the season off strong. He's done that and more. ATLANTA - Four days before the Hawks had even played an exhibition game this season, Trae Young had a fast start on his mind. In his rookie year, Young improved in the second half, making it a much tighter race for Rookie of the Year than most expected, though the Mavericks' Luka Doncic eventually took home the prize. Sure, <mark>John Collins</mark> had missed the first 15 games of last season with an ankle injury, and the chemistry he and Young developed upon his return was key for the Hawks, but Young wasn't buying that as an excuse. \"I just want to see myself start out better than I did,\" Young said Oct. 3. \"I think people judged my whole season off the way I started and so for me, I want to start better and just use that momentum that I had to end the season to begin it .\" Through two games, albeit a small sample size, Young has done just that, and in a historic fashion. As of Sunday, he's the NBA's leading scorer at 38.5 points per game, helping lead the Hawks to a 2-0 start. Young became the first NBA player to tally at least 38 points, seven rebounds and nine assists in each of his team's first two games of the year. Sustaining that pace is highly unlikely, but it's quite an accomplishment, especially this early in the season, and it's helped the Hawks start off on a better note than last year (they went 0-2 their first two games and were 3-16 by Nov. 23). Young had 38 points, seven rebounds and nine assists in the Hawks' season-opening win in Detroit Thursday, then followed it up with 39 points, seven rebounds and nine assists in their home opener Saturday, a 103-99 win over Orlando, a team that beat the Hawks four times last season (his banked-in 3-pointer with 26.2 seconds to play was the dagger, giving the Hawks a 102-97 lead). \"The stars shine brightest in those type of moments,\" Young said of his play in the final minutes. \"That's what makes the big-time players who they are. They step up in those moments for their team and it helps them win. So for me, it's just the mentality you have to have. And for me, I feel like I have it .\" Young attributes his strong start to work he put in during the offseason, and also growing more comfortable in the league in Year 2. \"I put in a lot of work this summer and just for me, going into my second year, I knew what to really work on,\" Young said. \"Going in as a rookie is kind of hard, you don't know what to expect. You just go in there with an open mind. But going into my second year I knew what I needed to get better at and I did it, and my hard work is paying off right now .\" Through two games, Young is shooting 58.7 percent from the field and 55 percent from 3-point range (taking an average of 10 per game). Again, it's likely his numbers will cool off a bit. As a rookie, Young shot 41.8 percent from the field and 32.4 percent from 3-point range. He shot 34 percent from 3-point range and in October but struggled from the perimeter in November, shooting 19.8 percent from 3 (taking an average of 5.4 per game). His 3-point shooting is the main difference second-year coach Lloyd Pierce identified when comparing the beginning of last season to the beginning of this one. \"We all know last year, this time, early in the season, he just wasn't, from the 3, he just wasn't making those shots,\" Pierce said. \"And because he is now, the lane just opens up even more. They've got to chase him over screens. Last year, at this time, they were going under everything .\" That forced Young to take some poor shots. Against Orlando, Pierce saw Young get into a rhythm early (his first shot was a floater), then when Young started sinking 3-pointers, the Magic had to start defending Young farther up the floor, which opened things up further for the Hawks. \"He's getting his rhythm just getting downhill and he's getting floaters, then eventually they've got to step their bigs up the floor and chase him over screens, and he gets going hitting one of those 3's, now he can pick his poison with getting downhill, shooting 3's, the defense collapsing, he can make passes to the weak side, but I thought his first three shots were all in rhythm, they were all floaters, they were all in the paint, he was attacking downhill, and it just opens up everything for us .\" Remaining the NBA's leading scorer certainly isn't the focus for Young. Whether it's 40 points or 40 assists required from him to get the win, he said, the end result is what matters to him. \"Hell nah,\" Young said when asked if being the league's leading scorer is his goal. \"That's not my goal. I don't care about all that. I'm just caring, focusing on winning .\" This article was written by Sarah K. Spencer, who covers the Hawks for The Atlanta Journal-Constitution. © 2019 Cox Media Group.", "articleID": "2019102813_00196098_W", "names": {"John Collins": ["Q10387544", "Q20645386", "Q20984420", "Q22979302", "Q26254380", "Q28935742", "Q29438451", "Q30122510", "Q47504584", "Q51586365", "Q52154681", "Q57413181", "Q57437992", "Q6111740", "Q6226714", "Q6226717", "Q6226721", "Q6226723", "Q6226726", "Q6226733", "Q720921", "Q961079"]}}, {"date": "2019-10-29", "url": "http://www.marinij.com/2019/10/29/marin-hit-with-another-wave-of-pge-power-shutoffs/?fbclid=iwar35scskqohbyhpsbdtecovmz4lil-oqkdzokawd6rwm7pjvji2cjq-b8l0", "content": "By <mark>Adrian Rodriguez</mark> | arodriguez @ marinij.com | Marin Independent Journal PUBLISHED: October 29, 2019 at 8:26 am | UPDATED: October 29, 2019 at 4:12 pm Traffic lights in front of the Marin County Civic Center remained without power during a PSPS in San Rafael on Tuesday. (Alan Dep/Marin Independent Journal) People queue up in their car at the Shell station on Sir <mark>Francis Drake</mark> Boulevard in Greenbrae on Tuesday. After having power shutoff to almost all of Marin County, power to some areas was restored before another expected power shutoff Tuesday. (Alan Dep/Marin Independent Journal) Traffic lights on Fourth Street at A Street were dark during a PSPS in San Rafael on Sunday. (Alan Dep/Marin Independent Journal) Power lines stand along Highway 37 amid the smoky pall over Novato on Monday. (Alan Dep/Marin Independent Journal) A sign reading \"Sorry no ice cream - all melted\" hangs on the door of Celine's Sweets in Novato, Calif. during the power shutoff on Monday, Oct. 28, 2019. (Alan Dep/Marin Independent Journal) People have breakfast outside Grazie restaurant on Grant Avenue in Novato, Calif. during the power shutoff on Monday, Oct. 28, 2019. (Alan Dep/Marin Independent Journal) People charge devices at an outlet in front of Mollie Stone's market in Sausalito on Monday. From left are Sidney Tarlow, Carol Kavalaris, and Jacqueline Amrikhas of Sausalito, and Patty Alexander of Ross. (Alan Dep/Marin Independent Journal) Grazie cooks Alex Ruiz, left, and <mark>Carlos Martinez</mark> make breakfast for patrons in a candlelit kitchen in Novato on Monday. (Alan Dep/Marin Independent Journal) Motorists drive through a darkened Fourth Street in downtown San Rafael at sunset on Sunday. Most businesses remained closed as Marin entered its second day without power due to the Public Safety Power Shutoff. (Alan Dep/Marin Independent Journal) Motorists drive through a darkened Fourth Street in downtown San Rafael at sunset on Sunday. Most businesses remained closed as Marin entered its second day without power due to the Public Safety Power Shutoff. (Alan Dep/Marin Independent Journal) Shoppers, many with bags of ice, leave Costco in Novato on Monday. Costco was one of the Marin businesses that managed to stay open during the power shutoff affecting much of Northern California. (Alan Dep/Marin Independent Journal) A generator hums outside the Coa Chocolate shop on Bridgeway in Sausalito on Monday. It was one of the few shops open during the power shutoff on the part of Bridgeway popular with tourists. (Alan Dep/Marin Independent Journal) A long line of people line up to use the newly opened charging stations at San Rafael Community Center, 618 B St. in San Rafael during the PG & E public safety power shutdown. (Keri Brenner - Marin Independent Journal) Charol Morikawa of San Anselmo holds the fort at a charging tower in the San Anselmo Public Library Monday. (Keri Brenner/Marin Independent Journal) Jeanne Brophy of San Rafael is one of dozens charging phones and other appliances Sunday at San Anselmo Town Hall during the public safety power shutdown. (Keri Brenner/Marin Independent Journal) Tony Boyd, Mill Valley parks supervisor, takes a look at a downed tree on Seaver Drive in Mill Valley on Sunday. (Alan Dep/Marin Independent Journal) Tricia Henley of Santa Rosa sits with her pets and a friend's dog after getting the animals checked in with Marin Humane outside the Marin Exhibit Hall in San Rafael on Sunday. The building on the Marin County Fairgrounds has been set up as an evacuation center for evacuees from the Kincade fire near Healdsburg. (Alan Dep/Marin Independent Journal) Florina Antonio of Santa Rosa sits with her 7-year-old nephew Angel Osario and her cat Pancho as they wait to get checked in with Marin Humane outside a fire evacuation center at the Marin Exhibit Hall in San Rafael on Sunday. Antonio, who lives in the Coffey Park neighborhood, also evacuated here two years ago. (Alan Dep/Marin Independent Journal) Kincade fire evacuees wait in line to get animals checked in with Marin Humane outside the Marin Exhibit Hall in San Rafael on Sunday. The building on the Marin County Fairgrounds has been set up as an evacuation center for evacuees from the Kincade fire near Healdsburg. (Alan Dep/Marin Independent Journal) Motorists drive through a darkened Seventh Street and Grant Avenue intersection in downtown Novato on Saturday. (Alan Dep/Marin Independent Journal) The Shell gas station in Terra Linda was temporarily out of gas ahead of a planned power shutoff in San Rafael on Saturday. Lines were reported at many Marin gas stations after an alert warning of an impending power outage was sent. (Alan Dep/Marin Independent Journal) People line up at a Terra Linda gas station ahead of a planned power shutoff in San Rafael on Saturday. High fire danger prompted PG & E to shut off power to many customers in northern California. (Alan Dep/Marin Independent Journal) Temporary stop signs stand at DeLong and Reichert Avenues as traffic signal lights blink red in Novato on Saturday. A Public Safety Power Shutoff began to be implemented in Marin on Saturday afternoon. (Alan Dep/Marin Independent Journal) Show Caption of Expand Marin County has been crossed off the list for additional power shutoffs, at least for now, Pacific Gas & Electric announced Tuesday afternoon. For those Marin customers who still had no power from the weekend shutoff, the utility said it was continuing to make repairs. \"We've been able to find ways to minimize impact to Marin County customers by isolating areas of the grid,\" said PG & E spokeswoman Deanna Contreras. \"If you are currently out in Marin, we are working safely and as quickly as possible to restore power .\" \"With that being said, customers may experience other un-planned outages, not related to PSPS, due to weather impacts and normal service impacts,\" Contreras added, using the acronym for \"public safety power shutoff .\" As of about 3:45 p.m. Tuesday, nearly 61,000 meters remained without power in Marin, according to the county. That number was down from 78,000 earlier Tuesday. \"Marin County remains under a red flag warning because of extremely dry conditions and high winds forecast for the week,\" said Laine Hendricks, a spokeswoman for the county. \"In addition, the Kincade Fire is still actively burning in Sonoma County. Any wildfire activity in Marin or a change in the Kincade fire status could prompt additional protective outages .\" Lights began to flicker back on for some in Marin on Monday night. The utility re-energized approximately 40% of Marin customers, or about 50,000 of the 123,000 customers who were unplugged Saturday. Power was restored by 10 p.m. Monday for customers in parts of San Rafael, Greenbrae, Corte Madera and Larkspur, according to the Marin County Office of Emergency Services. In total, power was restored to 57%, or 556,400 customers, of the 970,000 affected systemwide before the new round of shutoffs hit, the utility said. A red-flag fire weather warning that is expected to bring high winds through Wednesday prompted another swell of shutoffs that began to sweep across the state at 5 a.m. Tuesday. The Marin County Board of Supervisors on Tuesday declared a countywide local general emergency to seek state and financial assistance for dealing with the power shutdowns. The supervisors also declared a local health emergency due to evacuees of the Kincade Fire overwhelming the Marin County healthcare system. Sonoma County officials evacuated Sutter Health and Kaiser Permanente hospitals causing a surge at Marin hospitals. Marin County Administrator Matthew Hymel said that 662 evacuees from Sonoma County were cared for in Marin, some of whom came from a skilled nursing facility and had special medical needs. The planned outages aim at preventing catastrophic wildfires that could be sparked by electrical equipment during extreme weather events. After the Oct. 9 power shutoffs there were 100 instances of damage and hazards on PG & E infrastructure. There have been seven weather-related instances of damage due to the Oct. 23 shutoffs and more than 50 as a result of the Oct. 26 shutoffs, the utility said. The red-flag warning went into effect at 8 a.m. Tuesday and was expected to last until 4 p.m. Wednesday. A wind advisory is also in effect from noon Tuesday through 11 a.m. Wednesday, with winds expected to range between 20 to 35 mph and peak gusts that could reach up to 65 mph, according to the National Weather Service. Meanwhile, the Kincade Fire grew to more than 75,000 acres Tuesday. Marin County Fire Battalion Chief Bret McTigue said 93 Marin firefighters have joined that North Bay firefight. The Governor's Office of Emergency Services and CalFire have added increased fire staffing in Marin County, including a strike team, a water tender, one fire dozer and additional dispatchers and chief officers. A quarter-acre vegetation near a residential Novato neighborhood was snuffed out early Tuesday. The fire was reported at 12:14 a.m. near the intersection of Center Road and Trish Drive, which is adjacent to 98-acre O’Hair Park. This is the second fire at this location this year, and the third fire there in the past two years, McTigue said. McTigue said thanks to the increased staffing and pre-positioned strike team the fire was quickly doused. \"It would have been a different story if that fire occurred tonight with the expected high winds .\" There were no injuries. The cause of the fire is under investigation, McTigue said. The risk for wildfire in Marin has also prompted officials to close several parks and open space lands across the county. The Marin Municipal Water District has closed Sky Oaks in the Mount Tamalpais Watershed, Natalie Coffin Green Park in Ross, and Leo Cronin Parking Lot at Lagunitas Creek. Mount Vision Road, Inverness and Stinson Beach parking lots were closed. All open burning and burn permits are suspended on public lands during the red-flag warning. In Mount Tamalpais State Park, roads north of Panoramic Highway are closed to motor vehicle traffic on Pantoll Road and Ridgecrest Boulevard. All park use permits north of Panoramic Highway are suspended, including filming. Sonoma-Marin Area Rail Transit canceled train service for a second day Tuesday due to the impacts that the power shutoffs have on traffic signals that cross train tracks. All Marin County public schools were scheduled to be closed Tuesday and Wednesday, according to the Marin County Office of Education. The Golden Gate Bridge District also announced service impacts to the Golden Gate Ferry and Golden Gate Transit. Updates on affected routes and departure times are available at goldengate.org. The Marin Municipal Water District and the North Marin Water District are running on backup generators and ask that customers conserve water during the outages The Bay Area Air Quality Management District has issued a third consecutive Spare the Air Alert for Wednesday, due to unhealthy, smoky air. The district issued similar alerts Monday and Tuesday. On Tuesday, sensors in Novato showed levels as high as 134 on the Air Quality Index, according to purpleair.com. Members of sensitive groups could experience health effects if they are exposed to AQI levels between 100 and 150 for 24 hours. Charging centers, community resource centers and the Red Cross evacuation center for fire evacuees were operational Tuesday. The evacuation center at The Marin Civic Center at 10 Avenue of the Flags in San Rafael is at capacity and is not accepting donations or volunteers. To help, contact the Center for Volunteer and Nonprofit Leadership at cvnl.org. Marin Humane has transferred adoption animals to shelters outside of the area and is offering shelter for evacuated pets and animals in need of urgent shelter. Its Novato shelter was without power from Saturday night to Monday night and is expected to lose power again Tuesday night. The nonprofit has been caring for more than 200 pets from fire evacuees free of charge at its Novato campus and at the Marin Civic Center evacuation center. Marin Humane asks that pet owners who need shelter for their animals provide veterinary records and medications or special food if possible. \"Our staff and volunteers are working tirelessly on behalf of these beloved pets and our Novato shelter is operating mostly without power,\" said Lisa Bloch, spokeswoman for Marin Humane. This story will be updated. Related Articles San Jose bans natural gas as mayor testifies to Congress about car emissions Dick Spotswood: Governor needs to appoint committee on future of PG & E Power shutdown: Do you have to pay PG & E, plus other questions answered PG & E kicks off next wave of power shutoffs Marin \"coming together' amid blackouts RESOURCES IN MARIN First responders urged residents to avoid calling 9-1-1 to keep the lines open for emergencies. For non-emergency information or questions about medical devices, community resource center locations or charging centers, text MARINSHUTOFF or MARINAPAGON (for Spanish speakers) to 898-211 or dial 2-1-1 Medically-vulnerable residents who need help during power shutoffs can call the new non-emergency hotline at 833-284-3473. Community resource centers: San Rafael: Al Boro Community Center: 50 Canal St. (Daily, 8 a.m. to 8 p.m.) Marin City/Sausalito: Marin City Health & Wellness Center, 630 <mark>Drake</mark> Ave. (Daily, 8 a.m. to 8 p.m.) Novato: Old Hamilton gym, 115 San Pablo Ave. (Daily, 8 a.m. to 8 p.m.) Charging stations: Bolinas: Bolinas Fire Department, 100 Mesa Road (9 a.m. to 5 p.m.) Corte Madera: Corte Madera Rec Center, 498 Tamalpais Drive (Monday-Thursday, 9 a.m. to 4 p.m.). Town Hall, 300 Tamalpais Drive (Monday-Thursday, 9 a.m. to 4 p.m.) Fairfax: Fairfax Police Station 114 Bolinas Road. (open 24 hours) Larkspur: Central Marin police station community room, 250 Doherty Drive (open 24 hours) Mill Valley: The Mill Valley Community Center, 180 Camino Alto (Monday-Friday, 8:30 a.m. to 5:30 p.m.) Novato: Margaret Todd Center 1560 Hill Road (Sunday, 9 a.m. to 7 p.m.) San Anselmo: San Anselmo library, 110 Tunstead (Monday-Wednesday 10 a.m. to 8 p.m., Thursday 10 a.m. to 5 p.m., Saturday and Sunday noon to 5 p.m.) San Rafael: San Rafael City Hall, 1400 Fifth Ave.; San Rafael Community Center, 618 B St. (8 a.m. to 8 p.m. for the duration of the shutoff) Sausalito: Sausalito City Hall, 420 Litho St. (7 a.m. to 9 p.m.) EV charging stations: San Rafael: (EV charging stations available as long as power is on) Marin Clean Energy, 1125 Tamalpais Avenue; Marin County Civic Center, 3501 Civic Center Drive. Marin officials are updating information on available resource centers and charging stations at marincounty.org/emergency. Sign up for email newsletters Subscribe Follow Us Facebook Twitter Instagram RSS", "articleID": "2019102923_00077303_W", "names": {"Adrian Rodriguez": ["Q1240059", "Q4685319"], "Carlos Martinez": ["Q16864152", "Q2528896", "Q3660081", "Q5042342", "Q5042348", "Q5750873", "Q57524962", "Q9184701"], "Francis Drake": ["Q52636398", "Q5480773"]}}, {"date": "2019-10-30", "url": "http://www.dailynews.lk/2019/10/30/world/201437/lebanon-pm-resigns-after-mass-protests", "content": "World Lebanon's Prime Minister Saad Hariri has turned in his resignation to President <mark>Michel Aoun</mark>, satisfying one of the main demands of the country's protest movement. The announcement on Tuesday came on the back of 13 days of mass protests demanding the departure of the country's entire political elite amid growing anger over official corruption, poor public services and years of economic mismanagement. \"We have reached a deadlock and we need a shock in order to brave through the crisis,\" Hariri said in a televised statement from the capital, Beirut. \"I'm heading to the presidential palace to tender the resignation of the government. This is in response to the will and demand of the thousands of Lebanese demanding change,\" he added. His address came after a group of people loyal to the Shia Hezbollah and Amal movements attacked and destroyed a protest camp set up by anti-government demonstrators in Beirut. <mark>Aoun</mark> could now either accept Hariri's resignation and begin consultations towards forming a new government, or ask him to rethink. It took nine months to form the Hariri coalition cabinet that took office in January. Hariri's resignation defied the powerful Hezbollah, whose leader Hassan Nasrallah has twice said he was against such a step, citing the risk of a dangerous void. (Source: Al-Jazeera) Tags: Lebanon Prime Minister Saad Hariri Resigns President <mark>Michel Aoun</mark> Protest Movement Visit Kapruka.com Sri Lanka's Largest online shop. Over 125,000 unique categories such as Fresh Flowers, Cakes, Food, Jewllery, Childrens Toys and other Sri Lankan e-commerce categories. Low delivery cost to most cities here and free delivery in Colombo.", "articleID": "2019103006_00034973_W", "names": {"Michel Aoun": ["Q3308880", "Q363392"]}}, {"date": "2019-10-31", "url": "http://thechronicleherald.ca/business/reuters/uk-consumer-sentiment-returns-to-joint-weakest-since-2013-gfk-370129/", "content": "UK consumer sentiment returns to joint-weakest since 2013: GfK David Milliken Sorry you must be at least 19 years of age to consume this content. By David Milliken LONDON (Reuters) - Britain's longest-running measure of consumer sentiment slipped back to its joint-lowest level since 2013 this month, as Brexit uncertainty weighed again on households' assessment of the economic outlook. British consumers have generally remained upbeat since 2016's referendum to leave the EU - partly offsetting weaker business investment - but in recent weeks morale appears to have softened, boding poorly for spending in the run-up to Christmas. The GfK consumer sentiment dropped to -14 in October from -12 in September, a slightly bigger fall than economists had forecast in a Reuters poll. The index was last this low in August, and has not been lower since July 2013. \"The ongoing machinations in Westminster appear to be impacting how we view our personal financial situation for the coming year with a notable fall...in this measure in October,\" GfK strategy director <mark>Joe Staton</mark> said. The survey took place between Oct. 1 and Oct. 14, before Prime Minister Boris Johnson secured a new Brexit deal, which he has since abandoned trying to pass through parliament in favor of holding an early election on Dec. 12. Britain had been due to leave the EU on Oct. 31, but Johnson was forced by parliament to ask for a delay after failing to pass his transition deal in time and the Brexit deadline has moved back to Jan. 31. The GfK survey showed falls across all five measures it use to calculate sentiment, with the steepest decline coming in consumers' assessment of how their personal finances were likely to evolve over the next 12 months. British households declared themselves insolvent at the highest rate in eight years during the 12 months to the end of September, according to official data on Wednesday. Separately, there were also signs that Brexit uncertainty has weighed on Britain's commercial property market. Some 62% of surveyors believe the market had entered a downturn in the three months to September, the most since the survey began in 2015 and up from 53% in the last quarter, according to the poll from the Royal Institution of Chartered Surveyors. Retail was the hardest-hit real estate sector, RICS economist Tarrant Parsons said. \"It remains to be seen what impact the latest Brexit developments have on confidence across the sector, but with the picture unlikely to become clear until into the New Year it may well mean hesitation continues over the near term,\" he added. (Reporting by David Milliken, editing by Andy Bruce)", "articleID": "2019103100_00104880_W", "names": {"Joe Staton": ["Q1691605", "Q6212495"]}}, {"date": "2019-11-01", "url": "https://www.rfa.org/english/news/china/lawyer-detained-11012019142821.html", "content": "Outspoken Human Rights Lawyer Detained, Office Sealed in China's Guangxi 2019-11-01 A file photo of outspoken rights attorney Tan Yongpei, who was detained by authorities in the southwestern Chinese region of Guangxi, Oct. 31, 2019. RFA Authorities in the southwestern Chinese region of Guangxi have detained outspoken rights attorney Tan Yongpei, whose license to practice was revoked last year. Tan was detained on Thursday by officers of the Nanning municipal police department during a raid on his Baijuying legal consultancy company. An employee at a company occupying the same floor told RFA: \"There were 10 or 20 of them. They came shortly after 5.00 p.m., just before we got off work .\" \"They showed their police identification and said they were from the police department and that they were looking for a lawyer surnamed Tan,\" he said. \"Then they went in .\" The employee said the officers were still on the premises when he left after 6.00 p.m. \"They were forceful, but went into their offices quite politely, with somebody shooting video,\" he said. \"They put seals on Tan's office door that said\" Nanning Municipal Police Department. \"The Civil Rights and Livelihood Watch website said the police hadn't produced any official documents authorizing the raid and search, however. It said Tan had tried and failed to prevent them from carrying out the raid, which lasted around three hours, after which the police took Tan away with them. Fellow Guangxi-based lawyer Tan Jiaji said it was hard to tell whether Tan would face criminal charges now, or simply be released after questioning .\" It's pretty hard to say right now, \"he said .\" Anything is possible. \"\"He would regularly post [politically sensitive] stuff to social media, so maybe they now see him as a threat,\" Tan Jiaji said. \"This sort of thing is happening more and more nowadays .\" \"I wasn't surprised at all that this happened .\" \"P icking quarrels and stirring up trouble' He said the authorities can use catch-all charges like\" picking quarrels and stirring up trouble \"to detain people for what they post to social media .\" The whole idea of what is picking quarrels and stirring up trouble is so broad, \"he said .\" It's perfect for those in power to use [against government critics]. \"In January, Tan's China Lawyer's Club was raided by dozens of police office who said it was an illegal organization of banned lawyers. A nationwide police operation under the administration of President Xi Jinping has targeted more than 300 lawyers, law firms, and related activists for questioning, detention, imprisonment, debarring and travel bans since it launched in July 2015. The China Lawyers' Club was set up in Guangxi's regional capital, Nanning, by a group of former rights attorneys who lost their\" business license \"at the hands of local justice departments, and may no longer represent clients in court. Formally established on Sept. 29, 2018, the club's aim was to find employment and income for dozens of experienced litigators who no longer have an income in the wake of the crackdown. The club traded as a legal services company, and had\" signed' lawyers in a manner similar to the way sports teams sign big stars. Under current regulations, Chinese lawyers need a business license to represent clients, but not to offer legal consultancy on petitions and complaints. Reported by <mark>Gao Feng</mark> for RFA's Mandarin Service. Translated and edited by Luisetta Mudie.", "articleID": "2019110119_00087603_W", "names": {"Gao Feng": ["Q16231274", "Q16908273", "Q24834646", "Q3095227", "Q45437663", "Q45512683", "Q45537138", "Q45537211", "Q45587330", "Q45682018", "Q45683278", "Q45702447", "Q711470", "Q8964143", "Q9447417"]}}, {"date": "2019-11-02", "url": "http://www.breitbart.com/news/barcelona-slip-to-shock-defeat-after-levante-goal-flurry/", "content": "Valencia (Spain) (AFP)--Lionel Messi scored again but was helpless to prevent Barcelona conceding three goals in seven minutes on Saturday as Levante stormed to a surprise 3-1 victory in La Liga. Messi converted a first-half penalty at the City of Valencia Stadium for his sixth goal in five games only for Levante to stun the defending champions with an incredible treble shortly after the hour. Jose Campana and Borja Mayoral scored in the 61st and 63rd minutes before Nemanja Radoja added a third in the 68th to finish Barca off and give Real Madrid the chance to move top of the table later on Saturday. Levante climb to eighth. \"Everything unravelled,\" said Barcelona coach Ernesto Valverde. \"We didn't start the second half well, we weren't creating chances and although they weren't either they suddenly scored two goals. The third one hurt us a lot .\" After seven consecutive wins in all competitions, Barcelona arrived in Valencia as overwhelming favourites to cement their place at the summit, particularly given the irresistable form of Messi. His goal here was the 500th of his career with his left foot and it looked likely to give Valverde's team another three points until bedlam ensued in the second half. \"Opponents always play us like it is one of the biggest games of the year,\" Valverde added. \"You have to have an answer .\" After any Barcelona defeat, Valverde's future is always a topic for discussion. Asked if he was surprised by his players or might consider resignation, he said: \"No, to both questions .\" To make matters worse, <mark>Luis Suarez</mark> was forced off in the 41st minute with an injury to his right calf and would now appear to be a doubt for Tuesday's Champions League game at home to Slavia Prague. Levante started well and Barcelona were fortunate to escape a ragged few minutes that included <mark>Suarez</mark> being booked for a foul committed by Arthur Melo. Referee Hernandez Hernandez corrected his error after being made aware by VAR. Barcelona settled, long periods of possession finding a successful outlet down the left where Nelson Semedo twice slipped Antoine Griezmann in behind right-back Jorge Miramon, who then conceded the penalty. This time it was Semedo who broke clear and Miramon clipped the defender's heal, allowing Messi to sweep the spot-kick high into the corner, even if replays suggested Griezmann had been offside .--Seven-minute blitz floors Barca--<mark>Suarez</mark>'s unfortunate half continued as he was replaced by Carles Perez and Messi might have made it two before half-time only for Miramon to restore some credit by clearing the finish off the line. Levante began the second half on the front foot but nobody could have predicted what was to follow as three goals turned the game on its head. First, Pique's under-hit clearance came straight back, as Mayoral and Jose Luis Morales shifted the ball quickly inside to Campana, who struck hard into the corner. Then a loose Perez header allowed Mayoral space and he did brilliantly to curl past the outstretched right hand of Marc-Andre ter Stegen. With the home fans still celebrating, Radoja made it three. Barcelona again failed to clear and Radoja's effort might have been saved had Sergio Busquets, on as a substitute, not shot out his right leg and caused a cruel deflection. Messi thought he had launched a comeback when he bundled through and scored but the goal was ruled out after Griezmann was spotted to have been offside. That seemed to kill Barca's belief and, if anything, Levante should have made it four late on. Gonzalo Melero had only Ter Stegen to beat but he shot wide.", "articleID": "2019110218_00099753_W", "names": {"Luis Suarez": ["Q26517", "Q270367"]}}, {"date": "2019-11-03", "url": "https://www.channelnewsasia.com/news/sport/tennis-impressive-djokovic-beats-dimitrov-as-nadal-pulls-out-in-12058078?cid=cna_flip_070214", "content": "Tennis: Impressive Djokovic beats Dimitrov as Nadal pulls out in Paris Toggle share menu Tennis: Impressive Djokovic beats Dimitrov as Nadal pulls out in Paris close breaking news Sport Tennis: Impressive Djokovic beats Dimitrov as Nadal pulls out in Paris Tennis - ATP 1000 - Paris Masters - AccorHotels Arena, Paris, France - November 2, 2019 Serbia's Novak Djokovic celebrates after winning his semi final match against Bulgaria's Grigor Dimitrov REUTERS/Christian Hartmann 10 related media assets (image or videos) available. Click to see the gallery. 02 Nov 2019 11:26 PM Bookmark PARIS: Novak Djokovic reached the Paris Masters final for the sixth time when he downed Bulgarian Grigor Dimitrov 7-6 (5) 6-4 on Saturday (Nov 2) but Rafael Nadal pulled out injured. Serbia's world number one, who will be supplanted by Nadal at the top of the ATP rankings on Monday, won a high-octane first-set tiebreak before wearing down Dimitrov in the second set. Advertisement Advertisement Djokovic will face Canada's <mark>Denis Shapovalov</mark> in Sunday's final at Bercy after 19-time Grand Slam champion Nadal, who would have secured the year-end number one spot with the title here, withdrew minutes before his semi-final match with an abdominal injury. The Spaniard did not want to take any risks ahead of the Nov. 10-17 ATP Finals, where his participation now hangs in the balance. \"In one of the last serves of the warm-up, I felt something in the abdominal. And immediately I came back to the doctor here to do the echography and to check with the doctor, and the doctor told me that we need to wait a little bit more,\" Nadal told a news conference. \"So I waited for one hour and a half more to do a second test. And we did it, we saw something on the image, probably a small strain .\" Advertisement Advertisement He explained he was hoping to be ready for the season-ending event at the O2 Arena in London and would \"do all I can do and all that's mathematically possible to recover for it\". \"But as you can expect, today I can't answer this question,\" he said when asked if he would recover in time. Top seed Djokovic, who has lifted the trophy here four times and will feature in his 50th Masters final, played better than Dimitrov in the key moments and served well throughout. There were no break points in the first set. In the tiebreak, Dimitrov moved 5-3 up after an untimely Djokovic double fault, only for the Serbian to regain his composure, levelling for 5-5 with an exquisite defensive lob and winning the set at the end of a lung-busting, 35-shot rally. Dimitrov let his guard down in the fifth game of the second set, allowing Djokovic to snatch the only break of the match. The 16-time Grand Slam winner held serve throughout to strengthen his hopes of ending the season as world number one. Djokovic said winning the opening set was the key to a tense match. \"We both really understood the importance of clinching the first set so we could feel a bit more relaxed in the second and start swinging through,\" he told a news conference. \"The beginning of the second I was focused. I did well and managed to break his serve and hold my serve really well towards the end .\" Source: Reuters", "articleID": "2019110218_00193150_W", "names": {"Denis Shapovalov": ["Q20979382", "Q4520285"]}}]