[{"date": "2019-11-03", "url": "https://www.newscenter1.tv/former-president-jimmy-carter-is-back-teaching-sunday-school/", "content": "Former President <mark>Jimmy Carter</mark> is back teaching Sunday school November 3, 2019 Associated Press, PLAINS, Ga. (AP)--Former President <mark>Jimmy Carter</mark> taught a Bible lesson on life after death Sunday less than two weeks after breaking his pelvis in a fall. Using a walker, the 95-year-old Democrat slowly entered the crowded sanctuary at Maranatha Baptist Church in the southwest Georgia town of Plains. \"Morning, everybody,\" he said cheerfully. With help, <mark>Carter</mark> sat on a motorized lift chair at the front of the room to teach a 45-minute lesson based on the Old Testament book of Job. Referring to a cancer diagnosis that resulted in the removal of part of his liver in 2015, <mark>Carter</mark> said he was is \"at ease\" with the idea of dying and believes in life after death. More than 400 people were on hand in the main hall and smaller, overflow rooms where the lesson was shown on television. <mark>Carter</mark> was briefly hospitalized and has since been recovering at home since fracturing his pelvis on Oct. 21. He also fell shortly before that and needed stitches above his left eye. <mark>Carter</mark> is the oldest U.S. ex-President ever and has been teaching Bible lessons since he was in his teens. He missed one Sunday school class after the pelvis fracture. Rev. Tony Lowden said Secret Service agents, relatives and fellow church members all discouraged <mark>Carter</mark> from teaching because of the injury, but he insisted. \"He is pouring out that you might see Christ while he is suffering,\" Lowden told the crowd. <mark>Carter</mark> remained for the worship service after teaching, sitting in a pew beside his wife, Rosalynn, and singing hymns with the congregation. Referring to the former president and Jesus Christ by their initials, Lowden gave thanks for <mark>Carter</mark> in prayer. \"The greatest thing I've learned as a pastor here is watching J.C. follow J.C.,\" Lowden said. Categories: National News Tags: <mark>Jimmy Carter</mark>, sunday school AlertMe Facebook Twitter", "articleID": "2019110318_00095029_W", "names": {"Jimmy Carter": ["Q23685", "Q6199776"]}}, {"date": "2019-11-07", "url": "http://www.themorningbulletin.com.au/news/world-title-beckons-for-moloney/3871845/", "content": "Boxing Mania 6 Boxing World title beckons for Moloney by GRANTLEE KIEZA 6th Nov 2019 12:12 PM premium_icon Subscriber only 0 COMMONWEALTH Games gold medallist Andrew Moloney is the red-hot favourite to be crowned Australia's newest world boxing champion next week. And while his showdown with Brooklyn's Elton Dharry in Melbourne has been overshadowed by the code-war on the same card between AFL great <mark>Barry Hall</mark> and rugby league slugger, Paul Gallen, Moloney has not lost focus on realising a dream that started 17 years ago. Moloney kept chasing a boxing career despite losing his first seven amateur fights and he carries that determination into the biggest fight of his life. The 28-year-old is the No. 1 contender for the world super-flyweight (52.5 kg) title and is unbeaten in 20 pro fights including a stoppage over Panama's former world champ Luis Concepcion and Chile's red-hot <mark>Miguel Gonzalez</mark>. Andrew Moloney punches Selmani Bangaiza during their bout at Seagulls Club on June 15. (Photo by Chris Hyde/Getty Images) He fights the Ghana-born Dharry for the interim WBA title at Melbourne's Margaret Court Arena on Friday week and is at almost unbackable odds to take the belt. Twin brother Jason Moloney, who went within a whisker of winning the world bantamweight title last year in Florida, will fight Nicaragua's world No. 10 Dixon Flores on the same card and is expected to challenge for another world title next February. The brothers have been slugging away in training at their Cudgen base in northern NSW beside <mark>Hall</mark> as he prepares to make his mark in his pro debut against one of the hardest punchers in the country. Andrew Moloney celebrates winning against Selmani Bangaiza at the Seagulls Club at Tweed Heads on June 15. (Photo by Chris Hyde/Getty Images) Moloney is ready for a dangerous opponent in Dharry, who is the No. 6 contender for the world title, and is fully confident he and Jason will be the first Australian brothers to win world boxing championships. \"Dharry is a little bigger than me physically and he has the experience of 30 pro fights,\" Moloney said. \"He's based at the famous Gleason's Gym in Brooklyn and he is sparring big name fighters all the time .\" But I've been working really hard with Jason and some other sparring partners including Andres Campos from Chile and Bruno Tarimo from Tanzania and nothing's going to stop me now. \"I'm really impressed with <mark>Barry Hall</mark>'s preparation as well. I think he will shock a lot of people with his boxing talent .\" More Stories premium_icon Tarantino not guilty of murdering Sydney schoolgirl premium_icon Reason behind brutal attack on 14yo Gamer dies in frenzied all-night session More Stories premium_icon Tarantino not guilty of murdering Sydney schoolgirl premium_icon Reason behind brutal attack on 14yo Gamer dies in frenzied all-night session 0 andrew moloney Read More Login to follow boxing Read More Login to follow paul gallen Read More Login to follow world champion Read More Login to follow andrew moloney boxing paul gallen world champion", "articleID": "2019110602_00040281_W", "names": {"Barry Hall": ["Q23071152", "Q4864289"], "Miguel Gonzalez": ["Q19866797", "Q3312975", "Q3857264", "Q6014403", "Q6844575", "Q6844577"]}}, {"date": "2019-11-06", "url": "https://www.thestatesman.com/sports/skipper-rohit-sharma-admits-to-team-feeling-pressure-ahead-of-second-t20i-against-bangladesh-1502818529.html", "content": "Home / / Skipper <mark>Rohit Sharma</mark> admits to team feeling pressure ahead of second T20I against Bangladesh Sports Skipper <mark>Rohit Sharma</mark> admits to team feeling pressure ahead of second T20I against Bangladesh The 32-year-old also emphasised that the team learns from the mistakes in the national capital and doesn't repeat them in the second T20I. IANS | Rajkot | November 6, 2019 4:26 pm Indian skipper <mark>Rohit Sharma</mark> in action during the 1st T20I match between India and Bangladesh at Arun Jaitley Stadium, in New Delhi on Nov 3, 2019. (Photo: Surjeet Yadav/IANS) Following the crushing seven-wicket defeat in first T20I against Bangladesh, India captain <mark>Rohit Sharma</mark> on Wednesday said the pressure is not just on any particular department, but on the entire team to perform in the remaining two matches of the series. India were able to put up a par-score of 148 at the Arun Jaitley Stadium on Sunday and it was pacer Khaleel Ahmed, who was hit for four boundaries by Mushfiqur Rahim in the 19th over that changed the complexion of the game. \"Pressure is just on the team to perform, as simple as that. Not a particular department. You've lost as a team, you've not lost as a bowling unit. So the focus will be on the team,\" <mark>Rohit</mark> told reporters on the eve of the second match. \"The batsmen need to get the job done, the bowlers need to come out and take those crucial wickets. That will be the idea. We are not focusing on any individual departments. Because we lost as a team, not as individuals,\" he added. The Indian skipper also hinted of changing the pace attack at the Saurashtra Cricket Association Stadium. \"Our batting looks good. So I don't think there's any change we need to make in our batting. But we'll analyze the pitch, and based on that we'll see what we can do as a team,\" <mark>Rohit</mark> said. \"The (pace-bowling) combination that we played in the last game, it was based on the pitch that was on offer in Delhi. We will see the pitch again today and we will think what we need to do in our bowling line-up,\" he added. If India do go in for a change then Shardul Thakur might be seen replacing Khaleel. The 32-year-old also emphasised that the team learns from the mistakes in the national capital and doesn't repeat them in the second T20I. \"We were short in a lot of departments. It is important to focus on the mistakes we made and make sure those mistakes are not repeated again. That is the sign of a good team, when you don't repeat mistakes,\" he said. \"I cannot tell you the strategy, but what I can definitely tell you is that there will be changes in our approach. In the last match (in New Delhi), we played according to the pitch. We were playing as per the ways the pitch was reacting,\" he added. Squads: India: <mark>Rohit Sharma</mark> (c), Shikhar Dhawan, KL Rahul, Sanju Samson, Shreyas Iyer, Manish Pandey, Rishabh Pant (wk), Washington Sundar, Krunal Pandya, Yuzvendra Chahal, Rahul Chahar, Deepak Chahar, Khaleel Ahmed, Shivam Dube, Shardul Thakur Bangladesh: Soumya Sarkar, Mohammad Naim, Mahmudullah (c), Afif Hossain, Mosaddek Hossain, Animul Islam, Liton Das, Mushfiqur Rahim, Arafat Sunny, Al-Amin Hossain, <mark>Mustafizur Rahman</mark>, Shaiful Islam, Abu Haider Rony, Mohammad Mithun, Taijul Islam. TAGS:", "articleID": "2019110611_00006340_W", "names": {"Mustafizur Rahman": ["Q19829386", "Q25189318", "Q39386119", "Q57078132"], "Rohit Sharma": ["Q21622845", "Q21622847", "Q26436595", "Q26837282", "Q30122003", "Q3520045", "Q58049760"]}}, {"date": "2019-11-06", "url": "http://www.gazette-news.co.uk/news/national/18018136.green-party-vows-make-general-election-climate-election/", "content": "Green Party vows to make General Election the \"climate election' By Press Association 2019 General Election 2019 0 comment The Green Party has vowed to make the General Election the\" climate election \"as it launched its campaign with a pledge to borrow more than £ 900 billion over the next decade in a bid to rid the UK of fossil fuels. Co-leader Sian Berry said the party wanted to turn the UK carbon neutral by 2030 and said she wanted the December 12 poll to\" go down in history as the turning point for climate justice \". Ms Berry, who is a London Assembly member, said she was determined to make the General Election more than just the Brexit election. Green Party co-Leader Sian Berry (left) with colleagues Carla Denyer and Amelia Womack (Ben Birchall/PA)\" There is something I want to make clear right from day one of this our Green campaign, \"she said .\" Boris Johnson wants to make this the Brexit election, a re-run of the referendum, a fight on his terms, on his dodgy turf. But this election is about so much more. \"Ms Berry said her party, which more than doubled its MEPs at the last European elections, was the strongest voice for remaining in the EU .\" Yes, the Greens are the strongest voice for remaining in the European Union because we must protect environmental standards and work with our neighbours to avoid climate chaos, \"she said .\" We must protect our precious freedom of movement, our human rights and our peace because we must remain and transform. \"Some things are even bigger than Brexit .\" This must be the climate election and the future won't get another chance. \"We must make sure this election goes down in history as the turning point in our fight for climate justice .\" Despite all this the Greens don't fear the future, we are the future. \"We stand at the threshold of what will be the most exciting and prosperous period of our country's history because taking action on the climate emergency isn't just about averting disaster it's about creating a brand new Britain .\" Under the plans unveiled today at the campaign launch at the We The Curious children's science museum in Bristol, the party are promising to spend £ 100 billion a year over the next decade for a \"Green New Deal\". Some £ 91.2 billion of the proposed yearly spending will come from borrowing, with the party arguing that the low cost of debt and impending climate crisis justifies the commitment. The rest of the money will come from its proposed tax changes, with which it also hopes to service the cost of the borrowing. They would also hike corporation tax by 5%, which will be used to build 100,000 energy-efficient homes a year and upgrade national transport infrastructure. (PA Graphics) The UK's national debt currently sits at £ 1,790.9 billion, according to the latest figures from the Office for National Statistics. Under <mark>Theresa May</mark>, the government committed to reaching net-zero greenhouse gas emissions by 2050. But the Green Party hopes to better that goal with its so-called Green New Deal, which it hopes will also encourage increased investment from the private sector. The spending commitments come after a year of increasing pressure from environmentalists, including the direct action group Extinction Rebellion. Bristol has been seen as a fertile ground for the Green Party, where they currently have 11 councillors. It was the first city to declare a climate emergency following a motion proposed by Councillor Carla Denyer, the party's parliamentary candidate for Bristol West. On Tuesday night the council's cabinet approved plans to ban diesel cars from the city centre by 2021. The Greens are also believed to be targeting Stroud in Gloucestershire, where MEP Molly Scott Cato is standing, and Newport West in South Wales. Speculation over a so-called Remain alliance between the Greens, Liberal Democrats and Plaid Cymru has been growing over recent weeks. A spokesman for the Greens confirmed that the parties were \"having discussions\" but refused to say whether an electoral pact had been agreed. In 2017, the party said 22 candidates were standing aside to boost the electoral hopes of opposing progressive candidates. 0 comment", "articleID": "2019110612_00106126_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2019-11-06", "url": "https://www.seattletimes.com/opinion/editorials/add-columbia-rivers-polluted-bradford-island-to-superfund/", "content": "Add Columbia River's polluted Bradford Island to Superfund Nov. 6, 2019 at 2:32 pm Bradford Island, adjoining the Columbia River's Bonneville Dam near Cascade Locks, Oregon, in 2011 (AP Photo / Rick Bowmer, File) By The Seattle Times editorial board For decades, the U.S. Army Corps of Engineers has treated the Columbia River's Bradford Island shamefully. Just off Bonneville Dam, the Corps used Bradford Island for dumping, painting, sandblasting, pistol practice and other polluting activities from the 1940s into the 1980s, and dumped electrical equipment and even light bulbs into the mighty Columbia. The toxic legacy left by these decades of poor stewardship is still abundant today, contaminating the river waters and the fish that swim in them. Although the Corps since the 1990s has been responsible for evaluating and cleaning up this mess, the process has been inexcusably slow. In a letter last month, nine environmental advocacy nonprofits charge that the Corps has not conducted any cleanup since 2007, and that fish caught near the island \"contain the highest levels of cancer-causing PCBs in the Northwest .\" Lead, mercury, pesticides and petroleum byproducts also pollute the area. Aside from dredging and removal of dumped transformers in 2007, the Corps has done little besides catalog the damage and requested no money in President Donald Trump's 2020 budget to clean up this section of Washington's signature river. Better leadership must be put into place. If the U.S. Army Corps of Engineers is unwilling to take seriously the need to clean up Bradford Island and get the contamination out of the nearby population of bass and clams, the task should be designated for Superfund cleanup. Bradford Island has never been a Superfund site, but the EPA is still adding new pollution cleanup sites to that list even under Trump. Of the 1,335 sites listed nationally as Superfunds as of this month, Washington has 48. Because it straddles the Washington-Oregon border, Bradford Island would become Oregon's 14th site. Assigning the job to the EPA would take the cleanup out of the hands of the Corps, the agency which dumped the toxic pollution and has shirked its duty to make things right. Do you have something to say? Share your opinion by sending a Letter to the Editor. Email letters @ seattletimes.com and please include your full name, address and telephone number for verification only. Letters are limited to 200 words. There must be accountability for this failing. Governments of Washington, Oregon and the Yakama Nation wrote in a letter to the EPA in October that the \"serious threat to human health and the environment\" requires stronger intervention. It's time to get serious about cleaning up Bradford Island and its stretch of the Columbia River. Corps officials said it \"continues to work with state and tribal health agencies to inform area subsistence fishers and recreational anglers about the danger of eating fish that may be contaminated .\" Not good enough. That must not be the last feckless word on this historic neglect. The Seattle Times editorial board members are editorial page editor Kate Riley, Frank A. Blethen, Brier Dudley, Jennifer Hemmingsen, <mark>Mark Higgins</mark>, Derrick Nunnally and William K. Blethen (emeritus). Most Read Opinion Stories", "articleID": "2019110623_00086293_W", "names": {"Mark Higgins": ["Q570357", "Q6768030", "Q6768032", "Q6768033"]}}, {"date": "2019-11-07", "url": "https://www.cleveland.com/osu/2019/11/how-co-defensive-jeff-hafley-has-had-an-immediate-impact-on-ohio-state-football-and-its-recruiting.html", "content": "COLUMBUS, Ohio--Jeff Hafley was one of the first hires for <mark>Ryan Day</mark> as Ohio State football's head coach, and in 11 months, he's proven to be his best. That's shown in both the play of the current group of players in the secondary. Along with the commits, he's garnered in that period, making him the No. 4 recruiter in the country according to 247Sports. His first achievement as the Buckeyes' co-defensive coordinator was getting a recommitment from Lejond Cavazos of IMG Academy (Fla.). That process started the moment he got settled into Columbus, and Cavazos was the first recruit Hafley reached out to. That decision paid off, and four months later, Cavazos was back in Ohio State's 2020 class and has been one of the program's most prominent advocates ever since. Hafley made Cavazos feel comfortable with him. He gave him other reasons to fall in love with Ohio State that didn't require Urban Meyer to be a part of it. Now, as a commit, he's seen the strides Ohio State has taken in the secondary. The relationship he's built with the current players has given him confidence in the future of the defensive backs at Ohio State. Everyone he's talked to has had nothing but positive things to say about their new position coach. \"All of them have changed,\" Cavazos told cleveland.com. \"They say that it's a totally different atmosphere. It's a better technique that they've learned. He's letting them be them and get loose. Hearing that from the players was a big set off for me. I know if he's helping them get to where they want to get to, he can for sure help me .\" While making headway on the recruiting trails, which eventually led to 13 commitments between June and July--four of which he had a hand in--he was also spending time revamping a secondary that had a less than stellar 2018. His first step was sitting down with Okudah and watching every single target the junior cornerback had last season. \"He gave feedback after every single rep,\" Okudah said. \"After listening to him in that one-hour session, I was like\" Ok, he knows what he's talking about .' I listened to his plans for making me better and after that, I just bought in. \"Okudah and the rest of the secondary buying into Hafley's words have resulted in 10 interceptions this season, which sits at No. 2 in the Big Ten. The Buckeyes have also allowed a nation's best 1,062 passing yards per game this season. Jordan Fuller has experienced the Jeff Hafley effect as both from both Cavazos' and Okudah's perspectives. During his time at Rutgers, Halfeyr recruited Fuller's brother, Devin, who eventually chose UCLA. He got a chance to see how Hafley made recruits and their families feel comfortable .\" He was probably my brother's favor coach/recruiter, \"Fuller said .\" I definitely thought he was a great guy. Me and my brother think the same, so whoever he likes, I like. It's just grown from there since he's been here. \"Now he's experiencing it as one of his players, and the feedback has been just as positive. But there's a chance that the entire starting secondary will only get one year of Hafley. Fuller and Damon Arnette are fifth-year seniors, while Okudah and Shaun Wade could both head for the NFL after three seasons. That's played a role in Hafley's success as a recruiter. It'll be open season for every spot in the secondary, and many of the guys in Ohio State's 2020 recruiting class are talented enough to get on the field right away. They've watched how Ohio State has played this season and are ready to continue that tradition of elite-level defensive backs in the upcoming seasons .\" That's the plan, \"Cavazos said .\" It's up for grabs, and it's pretty much whoever wants it at that point. \"More Ohio State coverage Why the CFP committee loves Ohio State, and the results of the pizza challenge: Buckeye Talk Podcast What No. 1 in the first College Football Playoff ranking means for Ohio State football Why Penn State emerged as the biggest threat to Ohio State's Big Ten championship aspirations Ohio State vs. Penn State football will be a noon kickoff on Nov. 23 Ohio State basketball overcomes rough first half to knock off Cincinnati 64-56 in season opener LSU vs. Alabama matchup has implications for the Heisman, playoff: Heisman Watch How can Ohio State football's offense get better? Ohio State vs. Maryland for football, tuition, academics, sports money and more, by the numbers Joe Burrow asked to compare OSU-Michigan to Alabama-LSU: Buckeye Breakfast Get Buckeyes Insider texts in your phone from Doug Lesmerises: Cut through the clutter of social media and communicate directly with the award-winning OSU football reporter, just like you would with your friends. Sign up for insight on the Buckeyes in your phone for $3.99 per month. Buy Buckeyes gear: Fanatics, Nike, Amazon, Lids Buy Buckeyes tickets: StubHub, SeatGeek, Ticketmaster Stream Buckeyes games live: fuboTV, ESPN +, Sling", "articleID": "2019110718_00150363_W", "names": {"Ryan Day": ["Q18921628", "Q402985"]}}, {"date": "2019-11-09", "url": "http://www.kpbs.org/news/2019/nov/08/cinema-junkie-episode-182-ford-ferrari-and-asian-a/", "content": "Cinema Junkie Episode 182: Ford, Ferrari And An Asian American Film Canon Making history and making lists with director James Mangold and programmer Brian Hu Friday, November 8, 2019 By Beth Accomando Photo credit: Twentieth Century Fox Director James Mangold (center) on the set of \"Ford v Ferrari\" with actors Matt Damon and Christian Bale. Listen to the Podcast Episode Cinema Junkie goes from the Le Mans track to debating the best in Asian American films from the past two decades. First up, director James Mangold discusses his new film \"Ford v Ferrari,\" about the showdown between the two car icons in 1966 at the 24-hour Le Mans race. It may be called \"Ford v Ferrari\" but the story is...Read more → Aired: November 8, 2019 | + Subscribe to this podcast Director James Mangold discusses making history as he looks to the story of \"Ford v Ferrari;\" while San Diego Asian Film Festival artistic director and programmer Brian Hu talks about the list he helped create for the Los Angeles Times of the \"20 Best Asian American Films of the Past 20 Years .\" The film is called \"Ford v Ferrari\" but that's a bit of a misdirection because it's less about those famous brands and more about the two men--car designer Caroll Shelby and driver Ken Miles--who designed and raced the Ford that would challenge Ferrari at the 1966 Le Mans in France. For this episode I hit the track at Le Mans to find out what it takes to push a car and a driver to the limit during that celebrated 24-hour race as director James Mangold talks about his new film \"Ford v Ferrari,\" and then I discuss the recent Los Angeles Times list of the \"20 Best Asian American Films of the Past 20 Years\" with San Diego Asian Film Festival artistic director Brian Hu, who initiated the list with film critic Justin Chang as the festival prepared to celebrate two decades of showcasing Asian and Asian American films. Photo by Roland Lizarondo San Diego Asian Film Festival's artistic director Brian Hu demonstrating how to enjoy a VR short playing on opening night of the festival's 20th anniversary. Nov. 7, 2019 I recommend checking out Cinema Junkie Episode 155 in which my friend and stunt driver Steve Lepper picks his favorite car movies and discusses the best car chases ever put on film. Plus, you can hear me on Frank Woodward's latest episode of his podcast Film Sense debating what is cinema and what's the best way to watch a movie to truly enjoy a cinematic experience. FEATURED PODCAST Satisfy your celluloid addiction with the Cinema Junkie podcast, where you can mainline film 24/7. This film and entertainment series is run by KPBS Film Critic Beth Accomando. So if you need a film fix, want to hear what filmmakers have to say about their work, or just want to know what's worth seeing this weekend, then you've come to the right place Want more KPBS news? Find us on Twitter and Facebook, or sign up for our newsletters. + Subscribe to our podcasts To view PDF documents, Download Acrobat Reader. Related Stories San Diego Asian Film Festival At 20 Podcast 155: Stunt Driver Picks Best Car Movies Podcast Episode 154: From <mark>Raymond Chow</mark> To Current Asian Cinema More Like This San Diego Asian Film Festival At 20 Nov. 7, 2019 Examining The Racial Stereotypes Of 1932's \"The Mask Of Fu Manchu' Jul. 2, 2019 Pac-Arts' Spring Showcase Serves Up Eight Days Of Asian Film Apr. 10, 2019 Midday Edition Special: Best Of KPBS Podcasts Dec. 24, 2018 Latest News Got A Weird Text? A Telecom Vendor Says It's To Blame Union-Tribune: CBP Agents Altering Asylum Seekers' Court Documents Immigrant Activism And The Legacy Of Proposition 187", "articleID": "2019110900_00096151_W", "names": {"Raymond Chow": ["Q1194523", "Q27922756", "Q7298668"]}}, {"date": "2019-11-09", "url": "http://www.gamereactor.eu/?system=ios&sid=b98a2cde9763892a5519e5b9f41200fb", "content": "iOS Picomy has crafted a mobile puzzle-platformer that's as unique as it is charming. Preview Written by <mark>Sam Bishop</mark> on the 8th of November 2019 at 07 Com2uS' event in Paris was a success, with millions of viewers tuning in to see the tournament. Team GO Rocket leaders have arrived to the Pokémon GO realm Written by Lisa Dahlgren on the 7th of November 2019 at 17:03 The latest Pokémon GO update brings with it a trio of leaders as well as Team GO Rocket boss Giovanni. Dead Cells' Corrupted Update adds plenty of features Written by <mark>Sam Bishop</mark> on the 7th of November 2019 at 16:30 Recycling Tubes are there for experienced players, and a new mini biome has also been added to the game. Fabulous app apologises for taking Gris artwork Written by <mark>Sam Bishop</mark> on the 7th of November 2019 at 13:30 \"I fully realize that I ripped off the game now, but in the animation process that wasn't my intention at all,\" a designer said. Cardpocalypse coming to consoles on December 12 Written by <mark>Sam Bishop</mark> on the 7th of November 2019 at 11:25 We also have a brand new story trailer as well, celebrating the impending arrival on PS4, Switch, and Xbox One. Blizzard tells us all about the new Hearthstone Invoke keyword Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 14:17 This is coming with the Descent of Dragons set, and we talked with Game Designer Peter Whalen and Engineer <mark>Sarah Chen</mark> about it. Diablo Immortal gets new trailer and some fresh details Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 09:36 The game has shown its face once more after the reveal at BlizzCon 2018, and we know about the equipment and Legendary items. Fortnite pro FaZe Jarvis banned for life Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 08 He's shared videos of his use of aimbots in solos and playground, and this has led to drastic consequences.", "articleID": "2019110912_00043001_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}]