[{"date": "2019-11-09", "url": "http://www.gamereactor.eu/?system=ios&sid=b98a2cde9763892a5519e5b9f41200fb", "content": "iOS Picomy has crafted a mobile puzzle-platformer that's as unique as it is charming. Preview Written by <mark>Sam Bishop</mark> on the 8th of November 2019 at 07 Com2uS' event in Paris was a success, with millions of viewers tuning in to see the tournament. Team GO Rocket leaders have arrived to the Pokémon GO realm Written by Lisa Dahlgren on the 7th of November 2019 at 17:03 The latest Pokémon GO update brings with it a trio of leaders as well as Team GO Rocket boss Giovanni. Dead Cells' Corrupted Update adds plenty of features Written by <mark>Sam Bishop</mark> on the 7th of November 2019 at 16:30 Recycling Tubes are there for experienced players, and a new mini biome has also been added to the game. Fabulous app apologises for taking Gris artwork Written by <mark>Sam Bishop</mark> on the 7th of November 2019 at 13:30 \"I fully realize that I ripped off the game now, but in the animation process that wasn't my intention at all,\" a designer said. Cardpocalypse coming to consoles on December 12 Written by <mark>Sam Bishop</mark> on the 7th of November 2019 at 11:25 We also have a brand new story trailer as well, celebrating the impending arrival on PS4, Switch, and Xbox One. Blizzard tells us all about the new Hearthstone Invoke keyword Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 14:17 This is coming with the Descent of Dragons set, and we talked with Game Designer Peter Whalen and Engineer <mark>Sarah Chen</mark> about it. Diablo Immortal gets new trailer and some fresh details Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 09:36 The game has shown its face once more after the reveal at BlizzCon 2018, and we know about the equipment and Legendary items. Fortnite pro FaZe Jarvis banned for life Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 08 He's shared videos of his use of aimbots in solos and playground, and this has led to drastic consequences.", "articleID": "2019110912_00043001_W", "names": {"Sarah Chen": ["Q48894641", "Q710713"]}}, {"date": "2019-11-10", "url": "https://www.geo.tv/latest/255654-charlize-theron-honoured-with-american-cinematheque-award", "content": "Charlize Theron honoured with American Cinematheque Award By AFP Sunday Nov 10, 2019 Charlize Theron was honored for a \"fearless' career for tackling sexual harassment long before the #MeToo movement up-ended the industry. Photo: Frazer Harrison / Charlize Theron was honored by Hollywood Friday for a\" fearless \"career in which she tackled themes including sexual harassment long before the #MeToo movement up-ended the industry. The 44-year-old South African Oscar-winner, who has often played down her flawless looks to win darker, more complex parts, collected the prestigious American Cinematheque Award at a <mark>Beverly Hills</mark> gala .\" I'm overwhelmed--I need a cocktail! \"she told AFP as stars including Kristen Stewart, Seth Rogen, and David Oyelowo gathered to honor her career .\" These people who are here tonight have been with me through a lot of stuff. \"Theron won the best actress Academy Award in 2004 with her turn as prostitute and serial killer Aileen Wuornos in Monster. She earned Hollywood's respect with a visceral performance which saw her pack on 30 pounds (14 kg) and render herself unrecognizable with makeup and prosthetics to play the unappealing murderer .\" She is the most fearless actor I've ever worked with, and probably the most fearless human being I've ever met, \"said Jason Reitman, who directed Theron in Young Adult and Tully. Next month Theron appears in another transformative role--as former TV anchor Megyn Kelly in Bombshell, which depicts the downfall of Fox News co-founder Roger Ailes after a sexual harassment scandal .\" When I read (the script) it felt like it was part of a conversation that was happening now. And that to me, felt really important, \"she said. In contrast, her 2005 turn as a miner who files the United States' first class-action sexual harassment lawsuit in North Country came at a time when Hollywood turned a blind eye to such issues. Back then there was a sense that sexual harassment\" was in the past and that it's been dealt with, \"said Theron. The part earned her a second Oscar nod. A decade later, the #MeToo movement swept through Hollywood. Theron was born in the small South African town of Benoni in 1975. When she was 15, her mother shot and killed her father after he attacked them in a drunken rage. Her mother was never charged. Theron arrived in Los Angeles as a teenager in the 1990s speaking only broken English--her first language is Afrikaans. She was discovered by a talent scout in a bank, and broke into Hollywood's elite with The Devil's Advocate (1997), alongside Keanu Reeves and Al Pacino. Theron has since mixed commercial films such as the Fast and Furious franchise with tougher, less conventional roles. The American Cinematheque Award is a\" mid-career achievement award, \"with previous honorees including Al Pacino, Tom Cruise, and Steven Spielberg.", "articleID": "2019111010_00069891_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}, {"date": "2019-11-10", "url": "https://www.manchestereveningnews.co.uk/sport/football/man-city-vs-liverpool-highlights-17219303", "content": "Sport Liverpool vs Man City LIVE highlights and reaction Fabinho, Salah and Mane pile misery on Guardiola amid handball controversy Live reaction from a costly Premier League defeat for Manchester City against Liverpool FC at Anfield. Share By Stuart Brennan <mark>Joe</mark> Bray Tyrone Marshall Updated 19:07, 10 NOV 2019 Sport Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Manchester City have been dealt a huge blow in their challenge to retain the Premier League title after a disappointing 3-1 defeat to Liverpool. City went into the game six points behind Liverpool in the title race, and that gap has now been extended to nine after goals from Fabinho, Mo Salah and Sadio Mane secured the result. Bernardo Silva scored City's consolation. City welcomed back Rodri to the starting XI and <mark>David Silva</mark> to the bench, but Ederson was out with injury. Benjamin Mendy was omitted from the matchday squad for tactical reasons. Liverpool took the lead through Fabinho, but City felt they should have been given a penalty at the other end for handball. Mo Salah's header shortly after made matters worse. Sadio Mane sealed the win after the break with a back-post header, before Bernardo Silva's late consolation for City. Follow below for post-match reaction from Anfield. Key Events All the reaction from Liverpool 3-1 City 18:56 Player Ratings 18:32 Bernardo gets one back 18:07 Mane makes it three 17:40 Salah scores 16:43 KEY EVENT All the reaction from Liverpool 3-1 City 19:07 Guardiola's verdict on the title race Guardiola has been speaking about City's title prospects after today's setback. He said: We showed many times. We have three teams in front who have more chances to be champions but we are going to try. I am so proud to see my team play in this stadium against this team. Can you win the league: I don't know. I'm not a magician. 19:03 Klopp's verdict on Liverpool's win Jurgen Klopp tells BBC Sport his side had to be perfect today to beat City: \"They were good. Oh they were good and we had to defend with all we had but we scored incredible goals .\" It was so tough to play, the intensity of the game was so clear. It was all worth it, really great. They pass the ball from outside, Sterling. How good did we defend him until then? Because you saw what happens when we don't defend him anymore. \"The boys were completely focused and concentrated. It was so good. It is the only way we can beat City, maybe other teams can do it a different way but this is the only way we can beat them .\" 18:57 Guardiola explains Mendy absence Guardiola tells Sky Sports Benjamin Mendy did not play for fitness reasons. He said: Mendy was two years injured and trained one game after the [Atalanta] game. Angelino showed quality and played a good game. 18:55 REPORT: What went wrong? 18:51 Guardiola: We showed why we are champions Pep Guardiola has praised his team at full time. He told Sky Sports: What happened today we show why we are champions. I'm so proud of my team more than ever. They are the strongest team in Europe and the way we played made me so proud. On the VAR decisions: Ask the referees. Ask the referees, please don't ask me. Ask <mark>Mike Riley</mark> and the guys on VAR. We try to do our job. Why City lost: I am the first to congratulate Liverpool. At the end, the boxes, it is similar like the Champions League. That's part of the game. We lost because they scored three goals and we scored one. We need to grow and play away on big stages. The last 10/15 mins of the first half we played so good. The performance was so good. We tried. We never give up. That's why we won back-to-back. We want to fight to the end. We drop points for our fault. It is what it is. Important to grow as a team, a club, a opposition. 18:44 Alexander-Arnold defends penalty decision The man at the centre of the VAR controversy surprisingly says it was not a penalty. 18:42 Standards slipping? 18:39 Guardiola's full-time reaction 18:32 KEY EVENT Player Ratings Read Stuart Brennan's player ratings on a disappointing afternoon at Anfield. FT - LFC 3-1 MCFC There's the whistle Full time. City slip to nine points behind Liverpool and remain fourth. (Image: PA) 90' - LFC 3-1 MCFC Four minutes added And City need two goals. 90' - LFC 3-1 MCFC Handbags It looks like <mark>Joe Gomez</mark> was brought on to cause trouble. Here, he gives away a foul against Raheem Sterling and then squares up to the City man to waste a bit of time. From the free kick, Gabriel Jesus heads over. (Image: PA) 86' - LFC 3-1 MCFC Final Liverpool substitute <mark>Joe Gomez</mark> is on for Mo Salah. 85' - LFC 3-1 MCFC Walker heads over Better from City, they build a move that ends in Kyle Walker heading an Angelino cross well over. 82' - LFC 3-1 MCFC Double penalty shout Raheem Sterling wants handball for a shot, before Gabriel Jesus is brought down as he races Alisson for the loose ball. Probably nothing in either call. 80' - LFC 3-1 MCFC So close! Raheem Sterling opts to square it in a great position but it's just behind Jesus. Missed opportunity. 78' - LFC 3-1 MCFC Firmino replaced Alex Oxlade-Chamberlain is on for Roberto Firmino. Jurgen Klopp is furious. He wanted that change made before City scored. 77' - LFC 3-1 MCFC KEY EVENT Bernardo gets one back About time! Bernardo scores as he converts Angelino's cut-back with slight help from a deflection. 76' - LFC 3-0 MCFC Nothing is working In the last couple of minutes, John Stones has driven pass well out of play, then <mark>Kevin de Bruyne</mark> completely overhits an attempted ball to Bernardo. Pep Guardiola looks exasperated. 71' - LFC 3-0 MCFC Heads have gone City are plugging away but their heads have gone. <mark>De Bruyne</mark> looks fed up with his team's performance, throwing his arms in the air when Stones' pass could only find Mane instead of the Belgian. Gundogan's attempted through ball to Sterling then was too heavy, but they still blamed each other for the lapse. 69' - LFC 3-0 MCFC Finally a City substitute Sergio Aguero is hooked for Gabriel Jesus. It's not been working in attack for a while, so this change is about 15 minutes too late. (Image: PA) 67' - LFC 3-0 MCFC Nearly a goal for Aguero How does Aguero not get a touch on this? <mark>Kevin de Bruyne</mark> is out on the left and his ball across the box is perfect for Aguero but the striker somehow misses the ball completely. (Image: PA) 65' - LFC 3-0 MCFC Sterling wants a penalty Raheem Sterling looks to be pushed over by Sadio Mane in the box and wants a penalty but the referee says no. Rodri gets a booking for protesting the decision. VAR back up the referee. 63' - LFC 3-0 MCFC City look beaten City just can't clear their lines, and every ball away is finding a Liverpool shirt. 60' - LFC 3-0 MCFC <mark>Milner</mark> comes on Jordan Henderson comes off, with former City man <mark>James Milner</mark> on to replace him. 60' - LFC 3-0 MCFC WATCH: Mane scores City's third Make your mind up who was at fault. Or was it just a brilliant cross from Henderson? 55' - LFC 3-0 MCFC Who's to blame for the third goal? 53' - LFC 3-0 MCFC So close! Raheem Sterling skips across the edge of the area, but the shot is deflected just over. 50' - LFC 3-0 MCFC KEY EVENT Mane makes it three Hammer blow. Sadio Mane squeezes in a header at the back post after good work from Jordan Henderson on the right. More On Liverpool FC Manchester City FC", "articleID": "2019111019_00048955_W", "names": {"David Silva": ["Q161069", "Q2513023", "Q27580161", "Q5239792", "Q58454602"], "James Milner": ["Q191136", "Q57324227"], "Joe Gomez": ["Q17505113", "Q6210068"], "Kevin De Bruyne": ["Q357984", "Q52835665"], "Mike Riley": ["Q562522", "Q6848575", "Q6848576"]}}, {"date": "2019-11-11", "url": "https://www.herald.ie/news/dail-hopeful-sorry-for-tweets-as-she-hits-out-at-smear-campaign-38678925.html", "content": "Dail hopeful sorry for tweets as she hits out at \"smear campaign' Conor Feehan--11 November 2019 02:30 AM Fianna Fail Dail candidate Senator Lorraine Clifford-Lee Senator Lorraine Clifford-Lee has apologised for tweets she posted in the past in which she used the words\" knacker' and \"Traveller' in a derogatory manner. One Twitter message written by the Fianna Fail politician said celebrity Kim Kardashian had a\" fat arse \", while another told how a\" black Brazilian dwarf with ginger hair \"sat beside her on a bus. Ms Clifford-Lee is a candidate in the Fingal constituency by-election which will be held on November 29, and has branded the publicity surrounding the tweets as a smear campaign. The controversial social media posts will be a headache for Fianna Fail leader Micheal Martin. Wrong Attention has been drawn to the historical tweets on social media over the weekend and Ms Clifford-Lee last night apologised for any offence caused by the posts and admitted they were wrong. In July 2011, she tweeted:\" Just doing up inventory of items in my car when it was stolen by some knacker. I think I'm going to cry. \"In June the same year, she had responded to a tweet about fashion, which is now no longer available, with:\" I think some pieces are cute but others look like something from a traveller wedding. \"In October 2011, Ms Clifford-Lee tweeted:\" Was on Dublin Bus for the first time in about a year yesterday. Forgotten how much fun it is. Black Brazilian dwarf with ginger hair sat beside me. \"Then in June 2012 she wrote\" Fat arse Kardashian is in Dublin apparently with her fella. \"Ms Clifford-Lee is the Fianna Fail Seanad spokesperson on Justice and Equality, as well as Children and Youth Affairs. Her Twitter biography describes her as a solicitor, mother and feminist. Asked by the Herald for a comment on her controversial tweets, Ms Clifford-Lee issued a statement. She said the tweets referred to are from as far back as 2011 and were posted long before she became involved in electoral politics .\" I want to be absolutely clear, the tweets were wrong and I apologise for any hurt or offence caused by them, \"Ms Clifford-Lee said .\" While it does suit some people to take my tweets out of context for their own right-wing agenda, I hope that the people of Dublin Fingal will not be distracted by personal smear campaigns such as this. \"Anyone who has worked with me since my election to the Seanad three years ago can confirm the role I have played in promoting progressive policies .\" I also actively supported the marriage equality referendum and the campaign to repeal the Eighth Amendment, \"added Ms Clifford-Lee. She said she wants the by-election campaign to focus on\" the very real issues that people face every day \". Triggered Ms Clifford-Lee listed these as solutions to transport, housing, health, childcare, climate change and protecting communities from crime. She was elected to the Seanad in 2016 following an unsuccessful bid for a Dail seat in the same constituency in that year's general election. Ms Clifford-Lee got more than 3,300 first preference votes in 2016. Fianna Fail has high hopes she will join Dublin Fingal party colleague Darragh O'Brien in the Dail in this month's election. The by-election was triggered by former Independents4Change TD Clare Daly winning a European Parliament seat in May. There is also a by-election in Dublin Mid-West caused by former tanaiste <mark>Frances Fitzgerald</mark> becoming an MEP in the same election.", "articleID": "2019111102_00068158_W", "names": {"Frances Fitzgerald": ["Q540812", "Q5478653"]}}, {"date": "2019-11-11", "url": "http://brazilbusiness.einnews.com/article/501835245/W-eJsGI3zk438-jH", "content": "Motor racing-Mercedes boss Wolff to skip Brazil now both F1 titles won Reuters Share Adjust Comment Print LONDON--Mercedes boss Toto Wolff will miss Sunday's Brazilian Grand Prix, making it the first race he has not attended since 2013, now that his team have won both Formula One championships for an unprecedented sixth year in a row. A Mercedes spokesman said technical director <mark>James Allison</mark> will be the most senior team member at the track in the Austrian's absence. \"With both championships secured, it gives me more time in Europe to focus on other open topics,\" Wolff said in a team preview of the season's penultimate race at Sao Paulo's Interlagos track. \"It's great to be able to do this and to know that the team will represent the three-pointed star in the best way possible both on and off the track .\" <mark>Lewis Hamilton</mark> won his sixth world championship when he finished second to team mate Valtteri Bottas in Austin, Texas, on Nov. 3 after the team sealed the constructors' championship in Japan on Oct. 13. Mercedes have dominated the V6 turbo-hybrid era that started in 2014 and have won 14 of this season's 19 races so far--<mark>Hamilton</mark> 10 of them. The Briton has 83 career wins and is closing in on <mark>Michael Schumacher</mark>'s all-time record of 91. The 34-year-old won in Brazil last year, while Mercedes wrapped up the constructors' championship there. With both titles secure, and the top three positions in the constructors' standings locked in, Mercedes, Ferrari and Red Bull will also be using the last two races to test ideas for next season. \"Despite this record-breaking achievement, I still feel a lot of hunger and desire for more achievements,\" said Wolff. \"There's no sense of complacency, everybody is still determined to keep on improving...we have two races to go in the 2019 season and we want to end this season on a high .\" The last race is in Abu Dhabi on Dec. 1 (Reporting by Alan Baldwin, editing by Pritha Sarkar)", "articleID": "2019111120_00004098_W", "names": {"James Allison": ["Q22017223", "Q30607948", "Q30612849", "Q3913494", "Q57437357", "Q6140731"], "Lewis Hamilton": ["Q6536656", "Q9673"]}}]