[{"date": "2019-11-11", "url": "http://brazilbusiness.einnews.com/article/501835245/W-eJsGI3zk438-jH", "content": "Motor racing-Mercedes boss Wolff to skip Brazil now both F1 titles won Reuters Share Adjust Comment Print LONDON--Mercedes boss Toto Wolff will miss Sunday's Brazilian Grand Prix, making it the first race he has not attended since 2013, now that his team have won both Formula One championships for an unprecedented sixth year in a row. A Mercedes spokesman said technical director <mark>James Allison</mark> will be the most senior team member at the track in the Austrian's absence. \"With both championships secured, it gives me more time in Europe to focus on other open topics,\" Wolff said in a team preview of the season's penultimate race at Sao Paulo's Interlagos track. \"It's great to be able to do this and to know that the team will represent the three-pointed star in the best way possible both on and off the track .\" <mark>Lewis Hamilton</mark> won his sixth world championship when he finished second to team mate Valtteri Bottas in Austin, Texas, on Nov. 3 after the team sealed the constructors' championship in Japan on Oct. 13. Mercedes have dominated the V6 turbo-hybrid era that started in 2014 and have won 14 of this season's 19 races so far--<mark>Hamilton</mark> 10 of them. The Briton has 83 career wins and is closing in on <mark>Michael Schumacher</mark>'s all-time record of 91. The 34-year-old won in Brazil last year, while Mercedes wrapped up the constructors' championship there. With both titles secure, and the top three positions in the constructors' standings locked in, Mercedes, Ferrari and Red Bull will also be using the last two races to test ideas for next season. \"Despite this record-breaking achievement, I still feel a lot of hunger and desire for more achievements,\" said Wolff. \"There's no sense of complacency, everybody is still determined to keep on improving...we have two races to go in the 2019 season and we want to end this season on a high .\" The last race is in Abu Dhabi on Dec. 1 (Reporting by Alan Baldwin, editing by Pritha Sarkar)", "articleID": "2019111120_00004098_W", "names": {"Michael Schumacher": ["Q1929281", "Q19707089", "Q9671"]}}, {"date": "2019-11-11", "url": "https://www.wtxl.com/news/local-news/gadsden-county-man-was-apart-of-first-class-of-all-black-marines-in-u-s", "content": "Gadsden County man was apart of first class of all black Marines in U.S. Posted: 6:38 PM, Nov 11, 2019 Updated: 2019-11-11 18:38:50 -05 GADSDEN COUNTY, Fla.--A Gadsden County man was in the first class of all black Marines in the United States. Chester <mark>Davis</mark> Sr. was in the Montford Point Marines. His unit, formed in 1942, was segregated from the white Marine units, and even had a separate base, in Montford Point, North Carolina. <mark>Davis</mark>' sons say his unit fought the Japanese alongside the U.S. Marines in the South Pacific, all the way to the surrender to the Japanese in 1945. While he has passed on, Veterans Day is a special day for their family. \"This is a challenge, this is something I wanted to do, that was to help defend my nation, and so he fought with vigor, courage, valor, and patriotism, and for that, I am extremely proud of my dad,\" said <mark>Tom Davis</mark>, <mark>Davis</mark> Sr.'s second oldest son. <mark>Davis</mark>' sons said their father's unit didn't get the recognition it deserved until recently. 70 plus years later, in 2011, Congress unanimously voted in favor, and President Obama signed into law, a proclamation recognizing the Montford Point Marines. They also now proudly display his Congressional Gold Medal. Copyright 2019 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.", "articleID": "2019111123_00090160_W", "names": {"Tom Davis": ["Q14371530", "Q19957326", "Q22814855", "Q2366977", "Q7815530", "Q7815532", "Q7815534", "Q7815535", "Q7815536"]}}, {"date": "2019-11-13", "url": "http://stamfordadvocate.com/news/crime/article/Attorney-General-Barr-plans-visit-to-tout-14827420.php", "content": "https: //www.stamfordadvocate.com/news/crime/article/Attorney-General-Barr-plans-visit-to-tout-14827420.php US attorney general says feds will focus on high-crime areas Mary Hudetz, Associated Press Updated 8:55 pm EST, Tuesday, November 12, 2019 U.S. Attorney General <mark>William Barr</mark>, left, with other federal and officials, announces that nearly 330 fugitives suspected of violent crimes have been arrested as part of a crime-fighting initiative in New Mexico, at a news conference at the office of the Bernalillo County Sheriff in Albuquerque Tuesday, Nov. 12, 2019. <mark>Barr</mark> was in Albuquerque to highlight the results of Operation Triple Beam, a program that has been conducted in numerous U.S. cities and has led to hundreds of arrests. less U.S. Attorney General <mark>William Barr</mark>, left, with other federal and officials, announces that nearly 330 fugitives suspected of violent crimes have been arrested as part of a crime-fighting initiative in New...more Photo: Mary Hudetz, AP Photo: Mary Hudetz, AP Image 1 of / 4 Caption Close Image 1 of 4 U.S. Attorney General <mark>William Barr</mark>, left, with other federal and officials, announces that nearly 330 fugitives suspected of violent crimes have been arrested as part of a crime-fighting initiative in New Mexico, at a news conference at the office of the Bernalillo County Sheriff in Albuquerque Tuesday, Nov. 12, 2019. <mark>Barr</mark> was in Albuquerque to highlight the results of Operation Triple Beam, a program that has been conducted in numerous U.S. cities and has led to hundreds of arrests. less U.S. Attorney General <mark>William Barr</mark>, left, with other federal and officials, announces that nearly 330 fugitives suspected of violent crimes have been arrested as part of a crime-fighting initiative in New...more Photo: Mary Hudetz, AP US attorney general says feds will focus on high-crime areas 1 / 4 Back to Gallery ALBUQUERQUE, N.M. (AP)--Federal authorities will coordinate with state and local law enforcement officers to crack down on violence in cities with high crime rates in the coming months after arresting hundreds of fugitives under a program underway nationwide, U.S. Attorney General <mark>William Barr</mark> said Tuesday. <mark>Barr</mark>'s announcement came as he joined other federal authorities and about 30 state and local law enforcement agents in New Mexico following the recent arrests of 330 fugitives in the state. The arrests had resulted from an initiative known as Operation Triple Beam, a U.S. Marshal-led program that began in 2011, officials said. <mark>Barr</mark> said a push in the past two years to increase arrests under the program had paved the way for more federal crime-fighting efforts that would see a boost in the coming weeks. He did not elaborate or say which cities would be targeted during a news conference in Albuquerque, where he said violent crime rates \"remain stubbornly high\" in comparison to the rest of the country. \"I don't think it's a secret to anyone here that New Mexico generally and Albuquerque specifically are experiencing a violent crime crisis,\" <mark>Barr</mark> said. The state has long struggled to overcome persistently high crime rates, which it has tried to curb with state law enforcement units deployed to arrest fugitives. Lawmakers also have pushed a range of reform measures, including a bill that called for more inmates to be enrolled in Medicaid so they have better access to drug and mental health treatment options after their release. The most recent FBI figures show New Mexico had the nation's second highest violent crime rate and its highest property crime rate last year. That's despite Albuquerque reporting a slight decrease in both categories for the first time in years. Crime in New Mexico's largest city accounted for more than half the state's crime overall. The data offers a broad look at crime in thousands of U.S. cities but can be inconsistent and incomplete. Jessie Damazyn, a spokeswoman for Albuquerque Mayor Tim Keller, a Democrat, did not comment directly on <mark>Barr</mark>'s visit in an email to The Associated Press. But she said the public safety mandate among community members called for long-term partnerships and more community policing, which typically calls for officers to spend enough time in specific neighborhoods to become a familiar and trusted face among residents. \"It takes all of us working together with our community to fight violent crime,\" said Jessie Damazyn, a spokeswoman for Albuquerque Mayor Tim Keller. At the news conference, <mark>Barr</mark> called the state's criminal justice system \"subpar,\" which he blamed on policies that give judges broad discretion over whether to detain suspects awaiting trial. Bennett Bauer, the state's chief public defender, said he has seen no evidence that the state's pretrial release system has spurred more crime in the state. He added that <mark>Barr</mark>'s criticism amounted to a \"blame game\" on judges. \"If the feds really want to help our communities, they should stick around and help fund solutions to the problems underlying crime,\" said Bennett Bauer, the state's chief public defender. \"Help us provide more drug treatment, education, jobs and rehabilitation in our prison system .\" Of the 330 arrests in New Mexico, 10 of the suspects were wanted in homicide cases and 50 faced assault charges, the Justice Department said. About 90 of those arrested were wanted on drug charges, and about 56 pounds of methamphetamine and other drugs were seized. In the past year, federal authorities also touted arrests, and gun and drug seizures under the program in Salinas, California; Phoenix; Tucson, Arizona; and Lawrence, Massachusetts. In New Mexico, the arrests resulted from a three-month operation. <mark>Barr</mark>'s visit follows Gov. Michelle Lujan Grisham's recent announcement that a special state law enforcement unit would renew efforts to find fugitives. The unit's seven state police officers and seven corrections officers are expected to help reduce the 1,600 warrants for people linked to violent crimes in New Mexico. Bernalillo County Sheriff Manuel Gonzales said he welcomed the help fighting crime. His office assigned 100 officers--a third of its force--to assist with Operation Triple Beam, officials said. \"We're not done,\" he said. \"This is just the start .\" Most Popular 1 Anguillan authorities prepare arrest warrant for \"fugitive' Scott Hapgood 2 Worker killed in SoNo Collection construction accident 3 37 pounds of pot seized in two busts in Stamford 4 Attorney: Scott Hapgood\" cannot clear his name if he is dead' 5 Support flows in for gymnast fatally injured in training 6 Police: Man charged with smashing bottle over head of Stamford man 7 Regis Philbin selling Greenwich mansion at a substantial loss View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019111302_00027141_W", "names": {"William Barr": ["Q16683338", "Q43123958", "Q43911234", "Q8005104"]}}, {"date": "2019-11-13", "url": "https://www.caughtoffside.com/2019/11/13/raheem-behaved-like-a-child-more-details-on-gomez-sterling-england-bust-up-revealed-ahead-of-montenegro-qualifier/", "content": "Lorenzo Martín November 13, 2019 A lot has been made of <mark>Joe Gomez</mark> and Raheem Sterling's bust-up whilst on England duty lately, and now, it seems even more details on the incident have revealed by certain sources. <mark>Gomez</mark> and Sterling's beef seemed to start during Liverpool's 3-1 win over Man City on Sunday, after the two squared up with one another following a challenge by <mark>Gomez</mark> on Sterling. This beef seemed to carry on into international duty, with the Daily Mail noting that Sterling and <mark>Gomez</mark> had yet another bust-up in the England canteen, something that lead to Southgate dropping the player from his match-day squad to take on Montenegro. And now, even more details regarding the duo's bust-up have been revealed by reliable source The Athletic. As per the report, sources confirmed that the incident took place at around midday on Monday at England's training ground, St James' Park, with Sterling trying to get <mark>Gomez</mark> in a headlock after confronting him in the canteen. One source even confirmed \"It was a pretty full-on thing and food went everywhere. Sterling behaved like a bit of a child\". Sterling and <mark>Gomez</mark>' beef continued on into Monday according to the Athletic Given that England need to win one of their two Euro 2020 qualifiers this week in order to qualify for the tournament proper, this incident couldn't really have come at a worser time. More Stories / Latest News", "articleID": "2019111313_00066156_W", "names": {"Joe Gomez": ["Q17505113", "Q6210068"]}}, {"date": "2019-11-14", "url": "http://networking.itbusinessnet.com/2019/11/ping-identity-reports-third-quarter-2019-results-provides-outlook-for-full-year-2019/", "content": "ARR was $206.7 million, up 23% from the prior year period Third quarter total revenue was $61.8 million, of which 93% was subscription revenue Company raised $187.5 million in Initial Public Offering DENVER--(BUSINESS WIRE)--Ping Identity Holding Corp. (\"Ping Identity,\" or the \"Company\" ) (NYSE: PING), a pioneer in Intelligent Identity, today announced its financial results for the quarter ended September 30, 2019. \"Our strong third quarter results were driven by Ping Identity's Intelligent Identity leadership in securing customer, employee, partner and IoT identities across the enterprise market, and bolstered by market-wide momentum for identity solutions that enable digital transformation and simultaneously enhance security,\" said <mark>Andre Durand</mark>, Ping Identity's founder and Chief Executive Officer. \"It's been a momentous year to date for both Ping Identity and our clients. We completed our initial public offering, successfully launched several new identity solutions for securing users, applications and APIs across the hybrid cloud, strengthened our leadership in the customer use case, and landed many new Fortune 1000 corporations. Enterprises continue to partner with Ping Identity to modernize their legacy identity systems and accelerate their cloud transformation and API first initiatives. All of this creates momentum toward our main goal, which is to enable seamless user experiences while balancing the need for security and privacy in a real-time world .\" Financial Highlights for the Third Quarter of 2019 ARR: Ending ARR in the third quarter of 2019 was $206.7 million and represented a 23% increase compared to ending ARR of $167.7 million in the same period last year. Ping Identity defines ARR as the annualized value of all subscription contracts as of the end of the period. Revenue: Total revenue was $61.8 million, an increase of 45% year-over-year. Subscription revenue was $57.5 million, an increase of 49% year-over-year. Cash Flow: Cash provided by operations was $8.5 million in the nine months ended September 30, 2019 compared to $23.7 million in the nine months ended September 30, 2018. Unlevered Free Cash Flow was $8.1 million for the nine months ended September 30, 2019, inclusive of contingent deal consideration in the amount of $4.9 million, compared to $26.9 million in the nine months ended September 30, 2018. Dollar-Based Net Retention Rat e: For the period ended September 30, 2019, Ping Identity's dollar-based net retention was 115%. The Company has achieved 115% or higher for each of the past eight quarters. Please refer to the section titled \"Use of Non-GAAP Financial Information\" and the tables within this press release which contain explanations and reconciliations of the Company's non-GAAP financial measures. Recent Business Highlights Ping Identity recently secured a notable customer win with a large global entertainment and ticketing platform, which purchased and is implementing Ping Identity's hybrid cloud platform to replace a homegrown solution. This is a core part of the enterprise's digital transformation strategy to establish a more personalized relationship with their customers and a better user experience for event access. Ping Identity closed the largest PingIntelligence for APIs deal in company history at over $500,000 in ARR, driving further innovation around API security. The Company's industry leadership and accomplishments have been validated recently by the likes of Gartner, KuppingerCole, InfoSec, and CRN. For example, Ping Identity currently scores 92% on \"Willingness to Recommend' by Gartner Peer Insights and was positioned as a Leader in Gartner's August 2019 Magic Quadrant for Access Management. Ping Identity hosted Identify conferences in Chicago, New York, Europe and Asia Pacific, and announced the launch of PingCentral to help customers automate centralized identity services. Ping Identity is now a NYSE-listed company (ticker symbol: PING) after completing its IPO on September 19, raising $187.5 million. The majority of net proceeds were subsequently used to pay down debt .\" We are pleased with our strong third quarter performance, driven by our continued leadership position in the enterprise market due to the flexibility of our platform and our ability to address multi-generational IT realities, \"stated Raj Dani, Chief Financial Officer of Ping Identity .\" Total ARR grew 23% versus the prior year period, which we believe provides the best representation of the underlying health of the business. We've also been able to effectively balance our commitment to invest in growth and innovation with profitability by delivering operating efficiencies that have resulted in a net loss improvement from $5.6 million in the third quarter of 2018 to a net loss of $0.6 million this quarter. Adjusted EBITDA margins were 22% in the quarter, and year-to-date cash flows from operations as well as Unlevered Free Cash Flow were positive. We believe there are significant whitespace opportunities within our existing customer base by adding identities and use cases and selling new solutions, as we further penetrate an overall $25 billion market opportunity for Identity Access Management software and hybrid cloud solutions. \"Fourth Quarter Financial Outlook Ping Identity provides the following expected financial guidance for the quarter and fiscal year ending December 31, 2019: Quarter Ending December 31, 2019: Total ARR of $222.1 million to $223.1 million Total Revenue of $64.7 million to $66.7 million Unlevered Free Cash Flow of $(11.9) million to $(10.8) million Year Ending December 31, 2019: Total ARR of $222.1 million to $223.1 million Total Revenue of $239.3 million to $241.3 million Unlevered Free Cash Flow of $(3.8) million to $(2.7) million, inclusive of contingent deal consideration in the amount of $4.9 million Conference Call Details In conjunction with this announcement, Ping Identity will host a conference call today, November 13, 2019, at 5:00 p.m. Eastern Time to discuss its financial results. To access this call, dial 844.583.4551 (domestic) or 825.312.2270 (international) and reference conference ID 3167765 to the operator. A live webcast as well as the replay of the conference call will be available on the Investor Relations page of the Company's website at investor.pingidentity.com. A replay of this conference call can also be accessed by dialing 800.585.8367 (domestic) or 416.621.4642 (international) until November 20, 2019. The replay passcode is 3167765. Use of Non-GAAP Financial Information In addition to Ping Identity's results determined in accordance with generally accepted accounting principles in the United States (\"GAAP\" ), the Company believes the following non-GAAP measures presented in this press release and discussed on the related teleconference call are useful in evaluating its operating performance: non-GAAP gross profit, non-GAAP operating expenses, non-GAAP net income, non-GAAP net income per share, unlevered free cash flow, and adjusted EBITDA. Certain of these non-GAAP measures exclude stock-based compensation, depreciation and amortization expense, loss on extinguishment of debt and acquisition-related expenses. Ping Identity believes that non-GAAP financial information, when taken collectively, may be helpful to investors because it provides consistency and comparability with past financial performance and assists in comparisons with other companies, some of which use similar non-GAAP financial information to supplement their GAAP results. The non-GAAP financial information is presented for supplemental informational purposes only, and should not be considered a substitute for financial information presented in accordance with GAAP, and may be different from similarly titled non-GAAP measures used by other companies. A reconciliation is provided herein for each non-GAAP financial measure to the most directly comparable financial measure stated in accordance with GAAP. Investors are encouraged to review the related GAAP financial measures and the reconciliation of these non-GAAP financial measures to their most directly comparable GAAP financial measures. Forward-Looking Statements In addition to historical consolidated financial information, certain statements in this press release and on the related teleconference call may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 that involve substantial risks and uncertainties. All statements other than statements of historical fact included in this press release and on the related teleconference call are forward-looking statements. These statements may include words such as \"anticipate,\" \"estimate,\" \"expect,\" \"project,\" \"plan,\" \"intend,\" \"believe,\" \"may,\" \"will,\" \"should,\" \"can have,\" \"likely\" and other words and terms of similar meaning in connection with any discussion of the timing or nature of future operating or financial performance or other events. For example, all statements Ping Identity makes relating to its estimated and projected costs, expenditures, cash flows, growth rates and financial results or its plans and objectives for future operations, growth initiatives, or strategies are forward-looking statements. All forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those that the Company expected. Specific factors that could cause such a difference include, but are not limited to, those disclosed previously in the Company's other filings with the SEC which include, but are not limited to: the Company's ability to adapt to rapid technological change, evolving industry standards and changing customer needs, requirements or preferences; Ping Identity's ability to enhance and deploy its cloud-based offerings while continuing to effectively offer its on-premise offerings; the Company's ability to maintain or improve its competitive position; the impact on Ping Identity's business of a network or data security incident or unauthorized access to its network or data or its customers' data; the effects on the Company's business if it is unable to acquire new customers, if its customers do not renew their arrangements, or if it is unable to expand sales to its existing customers or develop new solutions that achieve market acceptance; Ping Identity's ability to manage its growth effectively, execute its business plan, maintain high levels of service and customer satisfaction or adequately address competitive challenges; the Company's dependence on its senior management team and other key employees; the Company's ability to enhance and expand its sales and marketing capabilities; the Company's ability to attract and retain highly qualified personnel to execute its growth plan; the risks associated with interruptions or performance problems of Ping Identity's technology, infrastructure and service providers; the Company's dependence on Amazon Web Services cloud infrastructure services; the impact of data privacy concerns, evolving regulations of cloud computing, cross-border data transfer restrictions and other domestic and foreign laws and regulations; the impact of volatility in quarterly operating results; the risks associated with the Company's revenue recognition policy and other factors that may distort its financial results in any given period; the effects on Ping Identity's customer base and business if it is unable to enhance its brand cost-effectively; the Company's ability to comply with anti-corruption, anti-bribery and similar laws; the potential adverse impact of legal proceedings; the impact of Ping Identity's frequently long and unpredictable sales cycle; the Company's ability to identify suitable acquisition targets or otherwise successfully implement its growth strategy; the impact on Ping Identity's business and reputation if it is unable to provide high-quality customer support; the Company's dependence on strategic relationships with third parties; the impact of adverse general and industry-specific economic and market conditions and reductions in IT and identity spending; the ability of Ping Identity's platform and solutions to interoperate with its customers' existing or future IT infrastructures; the Company's dependence on adequate research and development resources and its ability to successfully complete acquisitions; Ping Identity's dependence on the integrity and scalability of its systems and infrastructures; the Company's reliance on software and services from other parties; the impact of real or perceived errors, failures, vulnerabilities or bugs in Ping Identity's solutions; the Company's ability to protect its proprietary rights; the risks associated with Ping Identity's use of open source software in its solutions and subscriptions; the Company's reliance on SaaS vendors to operate certain functions of its business; the risks associated with indemnity provisions in the Company's agreements; and the risks associated with liability claims if the Company breaches its contracts. Given these factors, as well as other variables that may affect Ping Identity's operating results, you should not rely on forward-looking statements, assume that past financial performance will be a reliable indicator of future performance, or use historical trends to anticipate results or trends in future periods. The forward-looking statements included in this press release and on the related teleconference call relate only to events as of the date hereof. The Company undertakes no obligation to update or revise any forward-looking statement as a result of new information, future events or otherwise, except as otherwise required by law. About Ping Identity Ping Identity is pioneering Intelligent Identity. The Company helps enterprises achieve Zero Trust identity-defined security and more personalized, streamlined user experiences. The Ping Intelligent Identity ™ platform provides customers, employees, partners and, increasingly, IoT, with access to cloud, mobile, SaaS and on-premises applications and APIs, while also managing identity and profile data at scale. Over half of the Fortune 100 choose Ping Identity for its identity expertise, open standards leadership, and partnership with companies, including Microsoft and Amazon. The Company provides flexible options to extend hybrid IT environments and accelerate digital business initiatives with multi-factor authentication, single sign-on, access management, intelligent API security, directory and data governance capabilities. Visit www.pingidentity.com for more detail. PING IDENTITY HOLDING CORP.. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (In thousands, except per share amounts) (unaudited) Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Revenue: Subscription $57,495 $38,481 $161,387 $129,057 Professional services and other 4,270 4,138 13,276 13,012 Total revenue 61,765 42,619 174,663 142,069 Cost of revenue: Subscription (exclusive of amortization shown below) 5,995 4,526 16,828 12,785 Professional services and other (exclusive of amortization shown below) 4,086 3,347 11,002 9,184 Amortization expense 4,159 3,549 11,981 10,613 Total cost of revenue 14,240 11,422 39,811 32,582 Gross profit 47,525 31,197 134,852 109,487 Operating expenses: Sales and marketing (1) 17,819 13,690 55,153 41,811 Research and development (1) 11,283 9,634 33,594 26,027 General and administrative (1) 10,984 6,411 26,732 19,490 Depreciation and amortization 4,060 3,976 12,334 12,332 Total operating expenses 44,146 33,711 127,813 99,660 Income (loss) from operations 3,379 (2,514) 7,039 9,827 Other income (expense): Interest expense (3,818) (3,959) (12,067) (11,750) Loss on extinguishment of debt (3,150)--(3,150) (9,785) Other income (expense), net (992) (131) (767) (1,043) Total other income (expense) (7,960) (4,090) (15,984) (22,578) Loss before income taxes (4,581) (6,604) (8,945) (12,751) Benefit for income taxes 3,986 983 5,227 1,374 Net loss $(595) $(5,621) $(3,718) $(11,377) Net loss per share: Basic and diluted (0.01) (0.09) (0.06) (0.18) Weighted-average shares used in computing net loss per share: Basic and diluted 66,269 65,004 65,436 65,002 ______________________________________ (1) Includes stock-based compensation as follows: Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Sales and marketing $283 $184 $693 $535 Research and development 225 76 658 184 General and administrative 1,190 444 2,446 1,265 Total $1,698 $704 $3,797 $1,984 PING IDENTITY HOLDING CORP.. CONDENSED CONSOLIDATED BALANCE SHEETS (In thousands) (unaudited) September 30, December 31, 2019 2018 Assets Current assets: Cash and cash equivalents $81,934 $83,499 Accounts receivable, net of allowances of $735 and $455 33,760 50,108 Contract assets, current 66,608 53,435 Deferred commissions, current 4,846 3,746 Prepaid expenses and other current assets 14,094 10,644 Total current assets 201,242 201,432 Noncurrent assets: Property and equipment, net 8,226 5,630 Goodwill 417,696 417,696 Intangible assets, net 192,283 207,043 Contract assets, noncurrent 16,791 14,033 Deferred commissions, noncurrent 7,372 7,287 Deferred income taxes, net 2,622 1,829 Other noncurrent assets 1,866 2,073 Total noncurrent assets 646,856 655,591 Total assets $848,098 $857,023 Liabilities and stockholders' equity Current liabilities: Accounts payable $2,839 $1,766 Accrued expenses and other current liabilities 10,165 7,906 Accrued compensation 10,808 18,394 Deferred revenue, current 30,613 31,493 Current portion of long-term debt 774 2,500 Total current liabilities 55,199 62,059 Noncurrent liabilities: Deferred revenue, noncurrent 1,594 3,874 Long-term debt, net of current portion 74,810 241,051 Deferred income taxes, net 33,839 39,112 Other liabilities, noncurrent 2,860 1,822 Total noncurrent liabilities 113,103 285,859 Total liabilities 168,302 347,918 Commitments and contingencies Stockholders' equity: Preferred stock---- Common stock 78 65 Additional paid-in capital 690,170 515,979 Accumulated other comprehensive loss (582) (787) Accumulated deficit (9,870) (6,152) Total stockholders' equity 679,796 509,105 Total liabilities and stockholders' equity $848,098 $857,023 PING IDENTITY HOLDING CORP.. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (In thousands) (unaudited) Nine Months Ended September 30, 2019 2018 Cash flows from operating activities Net loss $(3,718) $(11,377) Adjustments to reconcile net loss to net cash provided by operating activities: Loss on extinguishment of debt 3,150 9,785 Depreciation and amortization 24,315 22,945 Stock-based compensation expense 3,797 1,984 Amortization of deferred commissions 4,110 2,716 Amortization of deferred debt issuance costs 626 673 Deferred taxes (6,910) (1,755) Other 292 (50) Changes in operating assets and liabilities: Accounts receivable 15,980 10,903 Contract assets (15,931) (2,710) Deferred commissions (5,295) (4,543) Prepaid expenses and other current assets (4,486) (472) Other assets 305 126 Accounts payable 736 111 Accrued compensation (7,639) (1,828) Accrued expenses and other 2,302 (297) Deferred revenue (3,160) (2,526) Net cash provided by operating activities 8,474 23,685 Cash flows from investing activities Purchases of property and equipment and other (4,517) (2,081) Capitalized software development costs (7,260) (4,314) Acquisition of Elastic Beam, net of cash acquired of $0--(17,414) Other investing activities (300)--Net cash used in investing activities (12,077) (23,809) Cash flows from financing activities Payment of Elastic Beam contingent consideration (1,136)--Proceeds from initial public offering, net of underwriting discounts and commissions 174,375--Payment of deferred offering costs (1,093) (52) Proceeds from stock option exercises 1,571--Repurchase of common stock--(76) Proceeds from long-term debt--250,000 Issuance costs of long-term debt--(5,994) Payment of long-term debt (171,743) (170,625) Payment of debt extinguishment costs--(5,085) Net cash provided by financing activities 1,974 68,168 Effect of exchange rates on cash and cash equivalents and restricted cash 168 (310) Net increase (decrease) in cash and cash equivalents and restricted cash (1,461) 67,734 Cash and cash equivalents and restricted cash Beginning of period 84,143 21,469 End of period $82,682 $89,203 PING IDENTITY HOLDING CORP.. SUPPLEMENTAL FINANCIAL INFORMATION RECONCILIATION OF GAAP TO NON-GAAP FINANCIAL DATA (In thousands, except per share amounts) (unaudited) Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Gross profit $47,525 $31,197 $134,852 $109,487 Amortization expense 4,159 3,549 11,981 10,613 Non-GAAP Gross Profit $51,684 $34,746 $146,833 $120,100 Non-GAAP Gross Profit Margin 84% 82% 84% 85% Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Total operating expenses $44,146 $33,711 $127,813 $99,660 Stock-based compensation (1,698) (704) (3,797) (1,984) Acquisition related expenses (522) (1,753) (2,799) (4,928) Amortization expense (3,361) (3,462) (10,316) (10,842) Non-GAAP Operating Expenses $38,565 $27,792 $110,901 $81,906 Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Net loss $(595) $(5,621) $(3,718) $(11,377) Stock-based compensation 1,698 704 3,797 1,984 Acquisition related expenses 522 1,753 2,799 4,928 Amortization expense 7,520 7,011 22,297 21,455 Loss on extinguishment of debt 3,150--3,150 9,785 Provision for income taxes (1) (3,351) (2,462) (8,331) (9,920) Non-GAAP Net Income $8,944 $1,385 $19,994 $16,855 Net loss per share: Basic and diluted $(0.01) $(0.09) $(0.06) $(0.18) Weighted-average shares used in computing net loss per share: Basic and diluted 66,269 65,004 65,436 65,002 Non-GAAP Net Income per Share Basic $0.13 $0.02 $0.31 $0.26 Diluted $0.13 $0.02 $0.30 $0.26 Weighted-average shares used in computing Non-GAAP Net Income per Share: Basic 66,269 65,004 65,436 65,002 Diluted 67,978 65,345 66,801 65,019 _____________________________________ (1) The related tax effects of the adjustments to Non-GAAP Net Income were calculated using the respective statutory tax rates for applicable jurisdictions. Contacts Media Contact: Kevin Sellers press @ pingidentity.com Investor Relations Contact: Hugo Doetsch Tel: 303.396.6213 investor @ pingidentity.com Read full story here Continue Reading Previous KBRA Releases Rating Report for the State of Wisconsin General Obligation Bonds of 2019, Series B Next Turning Point Brands Names Graham Purdy Chief Operating Officer", "articleID": "2019111400_00011243_W", "names": {"Andre Durand": ["Q4754772", "Q518409"]}}, {"date": "2019-11-14", "url": "http://braintreeandwithamtimes.co.uk/news/national/18037648.justice-alfie-lamb-ex-ministers-son-jailed-car-seat-crush-death/", "content": "\"Justice' for Alfie Lamb as ex-minister's son jailed for car seat crush death By Press Association 2019 Alfie Lamb manslaughter court case The family of three-year-old Alfie Lamb said\" justice has prevailed \"after an ex-minister's son was jailed for crushing him to death with a car seat. Stephen Waterson, 26, reversed the seat of his Audi convertible, squashing his girlfriend's young son in the footwell on February 1 last year. He then orchestrated a\" campaign of lies \", even threatening to make witnesses\" disappear \"to avoid responsibility for Alfie's death. The toddler's aunt, Ashleigh Jeffery, eventually broke the wall of silence and recorded Alfie's mother revealing what really happened. A jury had failed to reach a verdict in Waterson's trial and he pleaded guilty of manslaughter by gross negligence in September ahead of his retrial. On Thursday, Mr Justice Kerr sentenced Waterson to seven-and-a-half years for manslaughter, plotting to pervert the course of justice and intimidating witness Marcus Lamb. The judge said:\" I do not find you were annoyed with Alfie and moved your seat back because of that annoyance. \"\"Nevertheless, I am satisfied so that I am sure on the evidence I heard at the trial that albeit not in anger but for your own comfort, you moved the car seat back twice and not only once .\" Stephen Waterson crushed three-year-old Alfie Lamb to death with his car seat (Metropolitan Police/PA) He accepted character references from the defendant's father, the former minister Nigel Waterson and his wife Barbara, who attended court, and agreed he was \"not all bad\". But he said Waterson had been \"cunning, manipulative, dishonest, disloyal, deceitful, threatening, controlling and sometimes violent\". Earlier this year, Alfie's mother, Adrian Hoare, 24, from Gravesend in Kent, was jailed for two years and nine months for child cruelty and her part in the conspiracy. Pregnant barmaid Emilie Williams, 20, had admitted lying to police and was sentenced to five months' imprisonment, suspended for 18 months, and 100 hours of unpaid work. On the cover-up, Mr Justice Kerr told Waterson: \"You orchestrated the campaign of lies, assisted by Ms Hoare who had the misfortune to fall in love with you and was willing to lie to protect you and herself .\" When the conspiracy began to falter in the second half of February 2018 under pressure from a very brave young woman, Ms Ashleigh Jeffery, you resorted to threats of violence, saying you could make people disappear. \"Alfie's mother Adrian Hoare was\" unlucky enough to fall in love' with Waterson and was caught up in the lies. (Met Police/PA) Speaking outside court, Ms Jeffery told how the family had been \"utterly devastated\" by the death of \"a very happy three-year-old boy with his whole life ahead of him\". She said: \"The tragic circumstances surrounding his death is something we will never come to terms with .\" No sentence will ever be enough, but today we finally gave Alfie a voice and justice has prevailed. \"In a victim impact statement, she also said Waterson's guilty plea had been\" like a huge weight had been lifted \". Ms Jeffery, who had given key evidence in court, said:\" He could have avoided so much more upset in people's lives had he just owned up in the beginning. \"\"Justice has prevailed' Alfie's aunt Ashleigh Jeffery speaking outside the Old Bailey in London (Kirsty O’Connor / PA) Detective Chief Inspector Simon Harding described Waterson as a\" very arrogant, selfish, controlling and manipulative man \". He said:\" He knew what happened. He tried to put my officers off the scent from the word go. \"He paid tribute to Ms Jeffery, saying she had been\" incredibly strong and brave \"in her determination to find out what happened and\" changed the course of the investigation \". It is the first time anyone in the UK has died from crush asphyxiation as a result of an electronic car seat, police said. Stephen Waterson and Adrian Hoare with Alfie Lamb were caught on CCTV during a shopping trip to Sutton on the day he died (Metropolitan Police/PA) Waterson and Hoare had gone shopping for cushions in Sutton, south London, accompanied by Alfie, Williams, Marcus Lamb, 22, and another young child. Nightclub worker Waterson wanted to stretch his legs out and twice moved his front passenger seat into Alfie as he sat at his mother's feet, jurors heard. By the time they arrived at Waterson's home in Croydon, the little boy had collapsed and he died from crush asphyxia three days later. Nigel Waterson and Barbara Judge, parents of adopted Stephen Waterson, remained tight-lipped after their son Stephen was sentenced at the Old Bailey (Kirsty O’Connor / PA) In mitigation for Waterson, Tana Adkin QC told the court:\" Whilst thoughtless, I have no doubt, and selfish in his behaviour on February 1, he was not deliberately malevolent and nasty towards Alfie. \"Waterson's father Nigel Waterson was first elected MP for Eastbourne in 1992 and was a junior minister in <mark>John Major</mark>'s government, but was defeated by Liberal Democrat Stephen Lloyd at the 2010 general election.", "articleID": "2019111417_00108670_W", "names": {"John Major": ["Q27957644", "Q47546458", "Q9559"]}}, {"date": "2019-11-14", "url": "http://romseyadvertiser.co.uk/sport/national/18037946.sterling-supports-gomez-england-defender-booed-wembley-fans/", "content": "Sterling supports <mark>Gomez</mark> after England defender booed by Wembley fans By Press Association 2019 <mark>Joe Gomez</mark> came off the bench for England 0 comment Raheem Sterling has criticised England fans who booed <mark>Joe Gomez</mark> during the 7-0 rout of Montenegro at Wembley. Forward Sterling missed the victory which secured the Three Lions' passage to Euro 2020 after his skirmish with <mark>Gomez</mark> at St George's Park on Monday. Liverpool defender <mark>Gomez</mark> was jeered when he came on in the second half, leaving Manchester City star Sterling unhappy in the stands. especially after a difficult week for him to be booed when he came on tonight was wrong. I've taken full responsibility and accepted the consequence. I felt as though I had to say this get home safe every one ❤ ️ #Euro 2020--Raheem Sterling (@ sterling7) November 14, 2019 Sterling tweeted after the match: \"To all the England fans, I wanted to leave things as it was but tonight I have to speak again .\" It was hard for me to see my team-mate get booed for something that was my fault. <mark>Joe</mark> hasn't done anything wrong and for me to see someone who keeps his head down and work hard...\"Especially after a difficult week for him to be booed when he came on tonight was wrong. I've taken full responsibility and accepted the consequence. I felt as though I had to say this, get home safe every one .\" 0 comment", "articleID": "2019111422_00085343_W", "names": {"Joe Gomez": ["Q17505113", "Q6210068"]}}, {"date": "2019-11-15", "url": "https://www.msn.com/en-us/news/opinion/in-impeachment-hearings-donald-trump-is-the-one-blocking-firsthand-witnesses/ar-BBWM9Wf?srcref=rss", "content": "© Julio Cortez/AP Capitol Hill on Nov. 13, 2019. Editor's note: The opinions in this article are the author's, as published by our content partner, and do not necessarily represent the views of MSN or Microsoft. The impeachment inquiry into the behavior of President <mark>Donald Trump</mark> has reached a public phase, giving the American people their first chance to reach their own judgments. Two witnesses testified Wednesday before a House panel, including one who told of a cellphone call during which the president allegedly pushed to use America's national security apparatus to do his own political dirty work. Eight other witnesses have been scheduled. These include the U.S. diplomat on that call with <mark>Trump</mark>, at least one other person at the table listening in, and a decorated Army officer working for the National Security Council. But many others aren't coming because the <mark>Trump</mark> administration is engaged in what could only be categorized as stonewalling. Undercutting House Republicans The White House's refusal to provide witnesses, as well as much needed documentation, for a legitimate and serious congressional inquiry accomplishes little but undercut efforts by Republicans to come to <mark>Trump</mark>'s aid. One of the few coherent arguments that GOP lawmakers could make Wednesday was that the witnesses were sometimes providing secondhand or thirdhand information. All the more reason, then, to go to the source. But several of the key witnesses, including acting chief of staff Mick Mulvaney and former national security adviser <mark>John Bolton</mark>, are balking. The rationale for the stonewalling is supposedly laid out in a letter White House counsel Pat Cipollone sent to Congress last month. The \"due process\" argument in that letter, however, has been superseded by events. A vote to authorize the inquiry has been taken, and once-private proceedings are now public. Much of the rest of the rationale is baffling, unsupported or circular in logic. It declares the inquiry to be invalid because testimony provided by credible witnesses under oath consists of \"falsehoods and misinformation .\" It declares that Democrats fear they will lose the next election. And it throws in references to the Framers and the Constitution much like a high school student might do in hopes of getting a passing grade on an otherwise incomprehensible term paper. Refusal could equal impeachable Surely, if <mark>Trump</mark>'s July 25 phone call with Ukraine's president was as \"perfect\" as the president says, the administration would want to tell its side of the story. Topping the list of people who should want to come forward is Mulvaney, who last month publicly affirmed that <mark>Trump</mark> had conditioned security aid to Ukraine on the announcement of a public investigation into the family of former Vice President Joe Biden. \"I have news for everybody,\" Mulvaney haughtily declared in the White House briefing room. \"Get over it. There's going to be political influence in foreign policy .\" The fact that Mulvaney later tried to walk back his jaw-dropping admission only adds to the urgency of his testimony. <mark>Bolton</mark>, meanwhile, has found time to arrange a book contract and deliver paid speeches. The stonewalling can only contribute to the perception that the administration knows it did wrong and is trying to hide that fact as much as it can. Ultimately, refusal to cooperate with congressional subpoenas might itself be impeachable conduct. USA TODAY's editorial opinions are decided by its Editorial Board, separate from the news staff. Most editorials are coupled with an opposing view--a unique USA TODAY feature. To read more editorials, go to the Opinion front page or sign up for the daily Opinion email newsletter. To respond to this editorial, submit a comment to letters @ usatoday.com. This article originally appeared on USA TODAY: In impeachment hearings, <mark>Donald Trump</mark> is the one blocking firsthand witnesses Read More", "articleID": "2019111515_00111437_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"]}}, {"date": "2019-11-15", "url": "http://brazilbusiness.einnews.com/article/502299546/eOf4Lu2o4XzJfrbt", "content": "Brazilian GP: Sebastian Vettel top as Kubica crashes in Brazil practice By <mark>Andrew Benson</mark> Chief F1 writer at Interlagos 15 Nov From the section Formula 1 Share this page Share this with Digg Facebook Google LinkedIn Reddit StumbleUpon Twitter Copy this link http: //www.bbc.co.uk/sport/formula1/50438953 Read more about sharing. Listen to qualifying on 5 Live Sports Extra and the BBC Sport website from 18:15 GMT on Saturday Sebastian Vettel led Charles Leclerc to a Ferrari one-two in an incident-packed second practice session at the Brazilian Grand Prix. The German was 0.021 seconds ahead of Leclerc with Red Bull's <mark>Max Verstappen</mark> third, ahead of Mercedes drivers Valtteri Bottas and <mark>Lewis Hamilton</mark>. Williams driver Robert Kubica began the session with a heavy crash at Turn Three from which he emerged unscathed. Both Toro Rossos suffered reliability problems, stopping on track. The session ran in cloudy but grey conditions after the wet weather for the morning session, but Kubica appeared to be caught out by dampness on a painted white line when he spun at the fast Turn Three on his first flying lap of the day. Brazilian Grand Prix first and second practice results <mark>Hamilton</mark> to negotiate new F1 contract Albon named Red Bull second driver for 2020 View more on twitter The Pole, whose Williams had been used by reserve driver Nicholas Latifi in the first session, lost the rear, over-corrected and spun into the wall, badly damaging three corners of the car. It was another blow for Williams, who have been struggling for pace all year and in recent races have been suffering from a shortage of spare parts. At the front, the true competitive order is hard to read, as both Ferrari drivers and <mark>Hamilton</mark> had messy runs. Vettel and <mark>Hamilton</mark> were both blocked by Bottas on their fastest laps, the world champion on the exit of Mergulho, the penultimate corner, and Vettel shortly afterwards on the exit of Juncao, just a few metres further on. And Leclerc did not improve in the final sector of his fastest lap, which suggests he, too, had more time in him. <mark>Verstappen</mark> impressed to be just 0.134 secs off the pace as Red Bull's revival in the last few races continues, and Bottas was 0.156 secs behind Vettel. The compromised <mark>Hamilton</mark> - whose time, like Vettel's, was set on his second lap on his tyres - was 0.067 secs behind his team-mate. Media playback is not supported on this device Jack Nicholls: \"Why <mark>Hamilton</mark> is better than Senna & Schumacher' Ferrari may well see the results of the session as vindication after what they consider to be unfounded allegations about their engine in the wake of two rule clarifications from governing body the FIA. Ferrari insist neither ruling - one governing the operation of the hybrid system and fuel-flow meter, and the other the addition of oil into the combustion chamber - have any effect on the running of their engine. They said they would be back to their normal form in Brazil after a disappointing race in the US last time out, and at least on Friday they look to be favourites for pole position on Saturday. Best of the rest was Kevin Magnussen's Haas, for once not struggling with tyre temperature in a disappointing season for the American team, followed by the Renault of Daniel Ricciardo and Alfa Romeo's Kimi Raikkonen. The second Red Bull driver Alexander Albon, confirmed with the team for 2020 earlier this week, was struggling after a crash at the end of the first session and down in ninth place, 0.9 secs off team-mate <mark>Verstappen</mark>. At Toro Rosso, Pierre Gasly's engine failed mid-way through the session forcing the Frenchman to park up at Turn Three, while Daniil Kvyat went off at Juncao, the final corner, with five minutes to go, after his car switched off, causing him to spin lightly into the barrier, bringing out the red flag and the session to a premature end. The team said they did not yet know the cause of the problem. McLaren's Lando Norris was down in 18th place, eight places behind team-mate <mark>Carlos Sainz</mark>, but the 20-year-old Briton said he made a series of mistakes .\" I'm confident if I put the lap together and don't make the mistakes I did today, it will look a bit better, \"Norris said .\" It was actually a relatively good day, \"said <mark>Hamilton</mark>.\" The second session was good, nice and smooth. The Ferraris are quite quick today and they were generally beating us just all on the straights. \"<mark>Hamilton</mark> has an Ayrton Senna inspired helmet for this weekend's grand prix Leclerc was 0.021 behind team-mate Vettel", "articleID": "2019111523_00075575_W", "names": {"Andrew Benson": ["Q4756330", "Q57016943"]}}]