[{"articleID": "2018043001_00189722_W", "names": {"David Reed": ["Q10514791", "Q1176289", "Q20737746", "Q3018673", "Q5238951", "Q5238952"]}, "date": "2018-04-27", "url": "http://chronicleonline.com/news/local/hospital-physical-rehabilitation-focuses-on-bettering-golf-swing/article_7e553af2-4a43-11e8-ad15-0be1d2dc7b3d.html", "content": "Despite decades of playing golf, the next time Richard Decker swings a club, there's no telling where the ball will go. Decker, 72, was a pretty good weekend golfer with scores below 100 and playing two or three times a week. Then his shoulder started hurting and he was hitting the ball 15 yards short. \"Then I hit one too many...and I hurt it more. Then a tried taking another and I just couldn't do it,\" he recalled. That was late last year. He had torn his rotator cuff. Surgery was Jan. 19. Now he can barely raise his left arm above his shoulder and his surgeon doesn't want him playing golf for several more months. \"So I can't swing yet. I can't play,\" he said. As to what his game will be like when he takes up golf again next year? \"I don't know,\" said the former assistant warden from the federal prison system, shaking his head. To give himself the best chance of being able to play again, though, Decker and 32 other golfers attended a recent presentation at the Citrus County YMCA hosted by Citrus Memorial Hospital's rehabilitation program. The program offers physical rehabilitation with a focus on getting your golf game back as we age or recover from surgery or injury. About 40,000 Americans opt for rotator-cuff surgery every year, but more than half don't return to normal use of their arm if they've had a large tear, according to an Orthopaedic Research Institute study done in Australia. Decker is recovering from a bad tear. Physical therapist Fred Shirley told the group of mostly seniors that the hospital's program works like most other rehabilitation strategies, but with the goal that the patient wants to golf again or improve their game. Shirley uses a Blast Motion cell phone app that video records the patient's golf swing. The program also includes a small sensor placed on the handle of the club that records swing velocity along each point in the swing. The rehabilitation focuses on injuries that cause golfers to swing incorrectly or changes in their swing due to surgeries. He said the therapy is useful whether the patient is still recovering from surgery or an injury and not yet back playing golf again. It's also good for patients back at the game but not playing up to par. Shirley said that while he's not a great golfer, that's not important in this therapy program. \"I look at everything from a biomedical (perspective) and I'm looking for balance,\" Shirley said. The problem is that during the healing period, golfers often pick up bad habits to compensate for their injuries or surgeries, he said. \"And that drastically changes your swing,\" he said. And even when the injury heals or the surgery site recovers, those bad habits remain, he told the golfers. \"That's where I come in,\" he said. Shirley analyzes the swing and then gets to work building the patient's strength in the right areas and ending unwanted compensation. In many cases health insurance will pay for the rehabilitation when there is a legitimate injury or when the patient is recovering from surgery, Shirley said. Shirley works out of Citrus Memorial's Crystal River rehabilitation location. Decker and others like him are good candidates for the program, Shirley said. \"The habits he's picking up now are ones we can eliminate before they become really difficult to get rid of,\" Shirley said. Ale Denton is an 80-year-old retired postman. He also came to the event. It's not the surgeries that have slowed his golf game down, Denton said, but rather the natural progression of age. \"I was never really that good,\" Denton said, \"but maybe I can be better .\" He wants Shirley to help with that. Shirley told the group that most people can't hit the ball as far as they could 20 years ago, so analyzing a player's swing as they age and then strengthening where they can would help most players, Shirley said. <mark>David Reed</mark> is the YMCA's operations director and an avid golfer. He lent Citrus Memorial Hospital the YMCA room for the presentation because there are many golfers here enjoying Citrus County's more than a dozen golf courses. \"Golf is a sport; a community,\" <mark>Reed</mark> said. \"People respect the game of golf. It brings people together .\" Katie Myers, Citrus Memorial's director of marketing and public relations, said that all of the hospital's physical therapists enjoy specializing in one kind of rehabilitation in addition to traditional therapy. \"Fred's really honed in on something that's near and dear to him,\" Myers said. \"People don't realize how much that they do during their daily lives that can be helped with physical therapy,\" she said, \"and that includes golf .\" Golf is such an important aspect of our community, \"she said,\" and Citrus Memorial wants people to continue to do what they love. \"People interested in contacting Shirley can reach him at 352-563-0030. Contact Chronicle reporter Fred Hiers at fred.hiers @ chronicleonline.com or 352-397-5914. Sign Up for Email Updates For Email Marketing you can trust."}, {"articleID": "2016091801_00252030_W", "names": {"Vitaly Churkin": ["Q1394102", "Q27524216"]}, "date": "2016-09-17", "url": "http://www.cnbc.com/2016/09/17/reuters-america-update-2-russia-us-tensions-spill-over-at-un-meeting-on-syria.html", "content": "(New throughout, adds details) UNITED NATIONS, Sept 17 (Reuters) - The United States accused Russia of grandstanding on Saturday by calling a U.N. Security Council meeting over U.S.-led coalition air strikes in Syria, as Russia said the attacks killed dozens of Syrian soldiers and could endanger a truce deal between Moscow and Washington. The 15-member council met for an hour on Saturday evening after Russia and a war monitoring group said coalition jets bombed a Syrian army position near Deir al-Zor airport. U.S. Ambassador to the United Nations, Samantha Power, said Washington was investigating the air strikes and \"if we determine that we did indeed strike Syrian military personnel that was not our intention and we of course regret the loss of life .\" She said Russia's decision to call a council meeting was \"cynical and hypocritical\" as Moscow had never expressed such outrage at the killing of civilians by Syrian government forces during more than five years of conflict. \"Russia really needs to stop the cheap point scoring and the grandstanding and the stunts and focus on what matters, which is implementation of something we negotiated in good faith with them,\" Power told reporters. The deal reached last Saturday aims to put Syria's peace process back on track. It included a fragile nationwide truce, improved humanitarian aid access and joint military targeting of banned Islamist groups. When asked if Saturday's air strikes spelled the end of the deal, Russian U.N. Ambassador <mark>Vitaly Churkin</mark> said: \"This is a very big question mark .\" \"I would be very interested to see how Washington is going to react. If what Ambassador Power has done today is any indication of their possible reaction then we are in serious trouble,\" <mark>Churkin</mark> told reporters. <mark>Churkin</mark> said it was a crucial time in the efforts to bring peace to Syria and the fight against terrorism. He said the United States could have waited until Moscow and Washington were to start joint military cooperation in two days instead of carrying out a \"reckless\" operation. \"Who is in charge in Washington? Is it the White House or the Pentagon? Because we have heard statements from the Pentagon which simply fly in the face of what we have heard from President Obama and Secretary Kerry,\" he said. Both parties to the Syrian conflict have accused each other of being responsible for aid deliveries being stuck far from Aleppo. \"All the permissions the Syrian government was supposed to give have been given for humanitarian supplies to reach people in need in various parts of Syria and that the humanitarian convoy to eastern Aleppo is supposed to leave tomorrow morning,\" <mark>Churkin</mark> said. (Reporting by Michelle Nichols; Editing by Paul Simao)"}, {"articleID": "2015092810_00140504_W", "names": {"Ian Walker": ["Q30070066", "Q356378", "Q38589551", "Q57306591", "Q5983175", "Q5983179", "Q5983186"], "John Bryant": ["Q1699442", "Q20630634", "Q55825494"]}, "date": "2015-09-28", "url": "http://www.nasdaq.com/article/kellogg-buys-egyptian-cereal-firm-in-emerging-market-expansion-drive-20150928-00198", "content": "Kellogg Buys Egyptian Cereal Firm in Emerging Market Expansion Drive By Dow Jones Business News, September 28, 2015, 06:33:00 AM EDTSubscribe By <mark>Ian Walker</mark> Breakfast cereal maker Kellogg Co. said Monday it is buying Egyptian cereal firm Mass Food Group for $50 million in cash, as it continues its expansion into emerging markets. Kellogg said it doesn't expect the deal to have a material impact on 2015 earnings. Mass Food, which makes Temmy's cereals and NutriFit cereal bars, was founded in 1996 and has grown annual sales to over $18 million. It also exports foods to more than 30 markets, including Europe, East Asia and Africa. \"Today's announcement builds upon significant progress against our emerging market growth strategy announced earlier this year,\" said <mark>John Bryant</mark>, chairman and chief executive, Kellogg Co. \"We are building a strong foundation for emerging market growth,\" he added. Earlier this year, Kellogg bought Bisco Misr, an Egyptian packaged biscuit company and more recently formed a joint venture with Tolaram Africa to develop snacks and breakfast foods for the West African market, as well as noodles across Africa, which are often eaten at breakfast. It has also bought 50% of Multipro, a premier sales and distribution company in Nigeria and Ghana. Emerging markets are growing in importance to cereal makers as more residents in those countries move to cities and have less time and inclination to make traditional warm breakfasts. Kellogg logged about one-third of its $14.6 billion in sales from outside the U.S. last year, with at least $2 billion coming from sales of cereal and other products in emerging markets. Its cereal sales by volume are rising by double-digit percentages in Asian emerging markets and in the 4% to 6% range in developing countries in Latin America, according to an investor presentation earlier this month. <mark>John</mark> Revill and Annie Gasparro contributed to this article Write to <mark>Ian Walker</mark> at ian.walker @ wsj.com Access Investor Kit for Kellogg's Visit http: //www.companyspotlight.com/partner? cp_code=P479 & isin=US4878361082 Subscribe to WSJ: http: //online.wsj.com? mod=djnwires (END) Dow Jones Newswires 09-28-150633ET Copyright (c) 2015 Dow Jones & Company, Inc.. This article appears in: Commodities"}, {"articleID": "2014111808_00065685_W", "names": {"Taj Mahal": ["Q353023", "Q59627566"], "Azam Khan": ["Q3202243", "Q4832169", "Q50948327", "Q946921"], "Rohit Sharma": ["Q21622845", "Q21622847", "Q26436595", "Q26837282", "Q30122003", "Q3520045", "Q58049760"]}, "date": "2014-11-18", "url": "http://fakingnews.firstpost.com/2014/11/samajwadi-party-to-distribute-buffaloes-instead-of-laptops-to-woo-voters-back-in-uttar-pradesh/?utm_source=fp_widget", "content": "Samajwadi Party to distribute buffaloes instead of laptops to woo voters back in Uttar Pradesh Wife suspects extramarital affair after government employee starts staying in office after 5 PM Pictures: Reactions of various people to Mudgal committee report on IPL spot-fixing To improve India's relations with penguins, Modi to go Antarctica, 50K fans expected to attend his speech Students urge Smriti Irani to retain German, instead replace Maths with Sanskrit Local man wearing more than hundred lucky charms held at Delhi airport Man claims to have actually lifted <mark>Taj Mahal</mark> from its tip while getting clicked Bollywood boycotts Satyamev Jayate for appealing to refrain from objectifying women Those who know the art of celebrating an occasion without alcohol are on the verge of extinction: UNESCO With frequent foreign trips, Narendra Modi declared India's first \"Onsite PM\" Sonia Gandhi's Balance Sheet as declared to the Election Commission 5 ways to meet your financial needs while living your dream of watching popular American TV series all day long Auto driver changes his plan after passenger coincidentally asks him to go where he was already headed Engineering students shocked at AMU students discussing something as unimportant as library Virat playing well in Anushka's presence to make BCCI allow girlfriends on foreign tours: Sources Man tracks down school friend on Facebook to recover money which he had loaned him in class eight Hygienic garbage and statues of brooms to make \"Swachh Bharat Abhiyaan' a success Now weekend coaching classes for working male engineers to help them groom their flirting skills Samajwadi Party to distribute buffaloes instead of laptops to woo voters back in Uttar Pradesh blaming free laptop distribution scheme for his party's debacle in Lok Sabha Polls, Samajwadi Party supremo, Mulayam Singh Yadav has now asked his son to prepare for the next assembly polls in the state by distributing free buffaloes to voters. Arguing that literacy and awareness levels in Uttar Pradesh were increasing at alarming levels ever since the party gave laptops, Mulayam claimed that distribution of buffaloes would keep voters grounded and take them <mark>Azam</mark> has warned Mulayam against eyeing his beloved buffaloes for distribution .\" Look at what TMC did in West Bengal. I mean they did nothing and still won overwhelmingly in elections! \"Mulayam pointed,\" We should have followed their model. Literacy could be a boon to mankind, but certainly not for parties like us. \"Mulayam is confident that after having buffaloes in their house, voters will develop an instant connection with SP leader <mark>Azam Khan</mark> and thus with the party at large .\" <mark>Azam</mark> miyan's statements and acts in the past have made buffaloes completely synonymous with him. The first thing that comes to your mind when you hear buffalo is not milk, but <mark>Azam Khan</mark>, such has been the impact, \"Mulayam claimed. But not willing to take any more chances now, the buffaloes will have tattoos of SP leaders like Mulayam, Akhilesh, Dimple, etc. all over their body .\" If buffaloes don't remind them of SP, these tattoos will, \"explained party spokesperson Gaurav Bhatia. Mulayam was also mulling distributing goats initially for secularism's sake, but dropped the plan after he realized that people may eat the animal and forget about it by the time elections come. Political experts feel that distributing buffaloes is a master-stroke by Samajwadi Party as it will be the best for top-of-the-mind-recall value. Samajwadi Party blames no election in jails as reason for poor performance <mark>Azam Khan</mark>'s buffaloes run away once again, to shift media attention away from UP riots Buffalo chewed <mark>Azam Khan</mark>'s brain before he made Kargil statement Rape survivors request UP govt to show same sympathy as they show towards rapists Babulal Gaur awarded honorary doctorate by SP School of Sociology Abu Azmi turns into a zombie, on a biting spree to mutate Muslims into creatures like himself EC orders sun to stop rising till May 16, calls it a violation of conduct by DMK to influence voters To improve India's relations with penguins, Modi to go Antarctica, 50K fans expected to attend his speech | Faking News Students urge Smriti Irani to retain German, instead replace Maths with Sanskrit | Faking News With frequent foreign trips, Narendra Modi declared India's first\" Onsite PM \"| Faking News Wife suspects extramarital affair after government employee starts staying in office after 5 PM Pictures: Reactions of various people to Mudgal committee report on IPL spot-fixing To improve India's relations with penguins, Modi to go Antarctica, 50K fans expected to attend his speech I will have to run Virat Kohli out again when I'm batting well: <mark>Rohit Sharma</mark> श्रीलंका पर टीम इंडिया की क्लीन स्वीप से शादीशुदा खिलाड़ियों की अाई शामत कुत्तों ने' किस ऑफ़ लव' के प्रदर्शनकारियों को धिक्कारा और कहा,' तुम रहने दो बेटा, तुमसे ना हो पायेगा '"}, {"articleID": "2018121115_00309317_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2018-12-11", "url": "http://feeds.inquisitr.com/~r/google/yDYq/~3/Aj3hrhwYOyw/", "content": "Rachel Dillin Democratic New York Representative-elect Alexandria Ocasio-Cortez reportedly gets called a fraud daily, in part, for allegedly being elected to the U.S. Congress as a 28-year-old woman. While she's busy pointing out the multiple flaws and outrages she's seen as she prepares for her new job, she's also pointed out something else. A not so shocking double standard she faces. According to a report from the Hill, the Representative-elect called out the difference between how she's been treated and how Republican Speaker of the House <mark>Paul Ryan</mark> was treated when he won an election at only 28-years-old. While <mark>Ryan</mark> was called a \"genius,\" Ocasio-Cortez is called a \"fraud .\" She took to Twitter to explain what she's experiencing. \"Double standards are <mark>Paul Ryan</mark> being elected at 28 and immediately being given the benefit of his ill-considered policies considered genius; and me winning a primary at 28 to immediately be treated with suspicion & scrutinized, down to my clothing, of being a fraud .\" Since she's arrived in Washington, the Representative-elect has pointed out all the things she's seen that do not seem right. When she signed up for her Congressional benefit package, Ocasio-Cortez pointed out how it cost so much less than what she paid as a server and a bartender in New York. Then, she pointed out the hypocrisy of unpaid internships for Congress, which led to a colleague offering a paid position after initially posting it as unpaid. Ocasio-Cortez promised to pay her own interns at least $15 an hour while she serves. 29 YEARS OLD: On the left: Rep.-elect Alexandria Ocasio-Cortez (12/3/2018) On the right: Rep. <mark>Paul Ryan</mark> (3/2/1999, his first floor speech) pic.twitter.com/f19KxGRd5Q--Howard Mortman (@ HowardMortman) December 11, 2018 Yesterday, Inquisitr reported that Ocasio-Cortez pointed out how her Congressional orientation program at Harvard Kennedy School is basically a front for pro-corporate lobbyists. Of the event, she tweeted, \"This Harvard session has been going on for new Congress members since the 70s. This year we heard things like\" the $2T tax cut was great' and \"$15 wage is a bad idea .' No labor reps were there. Was this a multi-decade, pro-corporate lobbyist project the entire time?\" Ocasio-Cortez arrives in Congress with more Twitter followers, a broader audience, than the rest of her Democratic freshmen colleagues in the House of Representatives at 1.54 million. In addition to keeping people informed about the things she's doing leading up to taking office, she has also encouraged other younger people to run for office and fill the halls of both the Senate and the House. Ocasio-Cortez pointed out that Congress needs more young people and a wider variety of people to adequately work for the people of the U.S."}, {"articleID": "2013052420_00098381_W", "names": {"Keith Lawrence": ["Q18737087", "Q6384633"]}, "date": "2013-05-24", "url": "http://www.digitaljournal.com/article/350712", "content": "What would Captain Kirk do if ordered to fire burners into the cabin supposedly occupied by Chis Dorner? In \"Star Trek Into Darkness,\" we saw Kirk's solution: disregard immoral and illegal orders and bring the suspect back alive for trial. In the latest Star Trek movie, Captain Kirk is ordered to fire 72 torpedoes at a supposedly deserted planet to execute a man who killed Star Fleet officers, including Kirk's mentor and father figure. This is not unlike the situation with Chris Dorner, where officers were told that Chris had a vendetta against the LAPD and was executing officers and families of officers. While there were no witnesses to the supposed killings attributed to Chris Dorner, Captain Kirk observed the killing spree of John Harrison/Khan. As much as Kirk might have wanted revenge, his sense of justice overrode any anger and he disregarded orders to murder the accused, a choice that rendered Kirk a fugitive himself and risked the lives of his entire crew. This is in stark contrast to the deadly manhunt for Chris Dorner, the firing of burners into the cabin and the lack of any attempt to bring the man back alive for trial. It is important to remember that Chris Dorner was never convicted of anything. He died an innocent man under the laws and Constitution of this country. Unlike with Khan, there appears to be little or no evidence that Chris Dorner killed anyone, though the mainstream media may have told you otherwise. Adding to the tragedy of the Chis Dorner execution is the fact that media outlets throughout the country, without sufficient evidence, claimed that Dorner wrote a manifesto that was clearly written by two different people. Portions of this false manifesto were repeated and repeated in the media for the purpose of firing up the public to support a pre-trial execution. It used to be that the press would place the word \"alleged,\" before an unproven accusation. This was not the case with Chris Dorner. Among the media outlets that joined those cheering on the deprivation of Chris Dorner's rights was opednews.com. Editor-in-Chief and Managing editors Rob Kall, Lisa Milazzo and Meryl Ann Butler officially opposed Dorner's Sixth Amendment right to trial and became cheerleaders for the cook-out. I was an editor at OpEdNews at the time the Dorner story broke. I could not in good conscience remain silent and go along with that site's opposition to one of the most important Amendments to the U.S. Constitution. In refusing to go against my conscience, I joined a large group of former editors and writers who objected to policies that promoted the pharmaceutical industry, the nuclear industry and other matters unrepresentative of OEN's claim that it was liberal and progressive. OEN went further. One of the Kalls actually emailed threats of sending Homeland Security after people complaining about Close-up of security camera across street from parking garage Look again at the picture of the video camera that would have recorded anyone entering or leaving the parking garage where Monica Quan and <mark>Keith Lawrence</mark> were supposedly killed on February 3, 2013. The video was confiscated by the Irvine Police Department. If it showed Dorner entering and leaving, that would have proven that he very well might have done the killings. The video could end the questions. It would be in the public interests to see what happened that night and know that the right man was barbecued--unless that is not what the video shows. So I filed a Freedom of Information request to see the video. Jennifer Kaiser, Business Services Administrator of the for the Irvine Police Department. responded with a denial, citing California Government Code 6254 (f) Here is the exemption within that section: \"the public interest in withholding those records clearly outweighs the public interest in disclosure .\" In other words, the denial had nothing to do with privacy or concerns about police work in progress. It was a concern about the effect on the public of seeing the truth. Is this an admission that the truth is that someone other than Chris Dorner killed Monica Quan and <mark>Keith Lawrence</mark> and the public would revolt if it knew what really happened? Please read other articles on this case. \"A good cup of coffee to go with your police shootouts and burning cabins, but was it really Dorner who was killed?\" \"Op-Ed: March for Women's Rights honors those killed by police .\" Star Trek Into Darkness. It's fun, action-packed, and may actually teach your kids a sense of morality and justice they won't learn from the mainstream media or from those who supported the frying of an untried man at Big Bear. As previously noted, Chris Dorner was innocent under Constitution and laws of the United States of America. He had as much of a right to live as you or I. Before you believe the hype and write off Chris Dorner as not your problem, think of this. If Southern California law enforcement officers are killing innocent people in violation of the U.S. and California Constitutions and a host of other laws, how much danger are you and your family in? What officials did to Dorner, they can do to you or to your brother or to your sister or to your child. Is that the future you want for yourself and your family? There is still time and we still have rights but maybe there isn't too much time and maybe soon, there won't be any rights Martin Niemoller) First they came for Lynne Stewart. and I didn't speak out because I wasn't Lynne Stewart. and I didn't speak out because I wasn't Bradley Manning. and I didn't speak out because I wasn't Julian Assange. and I didn't speak out because I wasn't Chris Dorner and I didn't speak out because I wasn't Dzhokhar Tsarnaev. Amazon to monetize fan fiction using new platform \"Kindle Worlds' Op-Ed: Flying a drone over your neighbour's place - No, it's not OK"}, {"articleID": "2017050807_00590071_W", "names": {"Geoff Jones": ["Q21176422", "Q21598228"]}, "date": "2017-05-08", "url": "http://www.hawkesburygazette.com.au/story/4647516/best-sunday-ever-show-society-said/?src=rss", "content": "Lots of categories saw a resurgence in entries this year, show society says. School entries in the sheep categories were one of the stand out aspects of the 2017 show, with increased entries also in honey, dairy goats and alpacas. Picture: <mark>Geoff Jones</mark> \"IT WAS a top show--every-thing was sensational,\" show society president Ross Matheson summed up on Monday. While Friday was a bit down on numbers, Saturday was on a par with last year's bumper crowd, and Sunday was the best Sunday ever. Hawkesbury District Agricultural Association administration and business manager Linda Beneke said \"our carpark people said they had never parked cars where they had to on Sunday\" due to the huge numbers. She said for her the highlights of the show were the new $3m ride called The Beast, and the animal wrangler who did a breathtaking show with his super-tame horse. \"Also the Aldo's pizza van--it was really popular\". Mr Matheson said quite a few exhibit categories had a resurgence this year. \"We had the largest number of entries in the honey for many years, and the alpacas, poultry and dairy goats all had an increase in entries. He agreed that those categories were ones which hobby farmers could do .\" It's a sign of the times that these are animals that can be kept on smaller acreages, \"he said. The sheep entries were very well supported by schools this year as well. He said entertainment-wise the woodchop was a showstopper .\" We had the biggest number of woodchoppers for around 15 years, \"he said .\" We had as many watch that on the Saturday night as any of the other events at the show. \"One of the teams of eight even came up from Tasmania to compete. He said the new heavy horse foal championships were also very popular .\" Our painted cow competition was also unbelievably successful--we had to split it into two categories--east of the river, won by Windsor Public School, and west of the river--won by Richmond North Public School. \"Another success story was the new Lego creation category .\" We had about 60 entries. \"He said the fruit and veg sections were also\" very well supported by locals \".\" This was good considering the hot summer followed by the rain. \"He said it was a great show for the police as well, with very minimal bad behaviour and no major incidents. Those with special needs enjoyed the show in huge numbers too .\" Our disabled carpark was full on the Sunday, \"Ms Beneke said .\" We'd extended it and it still filled. It has about 250 spots. \"Mr Matheson said they'd also spent $27,000 making an externally accessed unisex toilet next to the craft pavilion, to cater for carers who are a different gender to those in the wheelchair. In the only negative incident the Gazette heard about, a young adult was taken by ambulance on Sunday morning with chest pains."}, {"articleID": "2010021920_00011661_W", "names": {"Scott Brown": ["Q15047261", "Q155125", "Q314160", "Q47233855", "Q7436044", "Q7436045", "Q7436046", "Q7436047", "Q7436048", "Q7436049", "Q7436050", "Q7436051", "Q7436052", "Q933673"]}, "date": "2010-02-19", "url": "http://kpvi.com/Global/story.asp?S=12012906", "content": "woman accused of embezzling from local business montpelier man will face first degree murder charges in north carolina blackfoot family pleads for safe return of daughter and granddaughter school district 91 considering $57.5 million dollar bond police issue arrest warrant for alleged walgreens robber school district 91 considering $57.5 million bond ap national political writer washington (ap) - tim pawlenty, the minnesota governor seeking to raise his profile for a likely presidential run, laid out a vision of smaller government and a strong defense before a crucial conservative constituency friday. the other principle he said guides him: \"god's in charge .\" \"if it's good enough for the founding fathers it should be good enough for each and every one of us,\" said pawlenty, noting that god is enshrined in the country's founding documents. the republican governor, who was raised catholic but now attends an evangelical church, is not known for wearing religion on his sleeve. he noted that some people said it would be \"politically incorrect\" to bring up god. \"hogwash,\" pawlenty said, drawing applause. it was a fitting pitch for his audience. in the speech to thousands of activists and leaders gathered at the annual conservative political action conference, pawlenty sought to introduce himself, outline an agenda, and show he's a credible challenger to other republicans considered more formidable in the hunt for the gop presidential nomination, particularly mitt romney. the former massachusetts governor who lost his 2008 republican primary bid made a splash at the conference one day earlier. romney brought along his state's new republican senator <mark>scott brown</mark> to introduce him. his previous campaign trail experience coming through, romney delivered an impassioned defense of conservatism and indictment of president barack obama's first year to a cheering and chanting crowd. it was standing-room only for his mid-afternoon speech. his would-be campaign staff was on hand. later friday, indiana rep. mike pence, who also is said to be eying a white house bid but isn't believedto be nearly as far along in the planning, delivered a robust speech filled with criticism of obama and lines tailor-made for this partisan crowd. \"the job of the american president is not to manage american decline. the job of the american president is to reverse it,\" pence said at one point, earning thundering cheers. by contrast, the reception for pawlenty's midmorning speech was more muted. he received a standing ovation and polite applause. the ballroom was just partially filled; there were empty seats throughout, though that could have been because of the hour. he, too, had aides nearby who are helping him lay the groundwork for a possible run. pawlenty sought to draw a stylistic contrast from romney, who spoke from prepared remarks on a teleprompter. aides said pawlenty spoke more extemporaneously, drawing from bullet points written in a notebook on the lectern. his speech was part conservative pep talk, part criticism of obama. noting that tiger woods was in the headlines again friday, pawlenty said the gop should take a page from the playbook of the golfer's wife and declared: \"we should take a 9-iron and smash the window out of big government in this country .\" he belittled obama as a president of \"hope and change and teleprompters .\" he also said: \"if government spending were an olympic sport, he would be a repeat gold medalist .\" and he said: \"mr. president, no more apology tours and no more giving miranda rights to terrorists in our country .\" pawlenty also delivered a message to liberals: \"we're planting the flag on constitutional grounds and if you try to take our freedoms, we will fight back .\" paterson's gov bid begins in long island hometown wife of texas man with irs grudge expresses sorrow"}, {"articleID": "2014031318_00080681_W", "names": {"Steve Owens": ["Q16187251", "Q16196201", "Q7613529", "Q7613530"]}, "date": "2014-03-13", "url": "http://www.gpb.org/news/2014/03/13/why-for-profit-prisons-house-more-inmates-of-color", "content": "Why For-Profit Prisons House More Inmates Of Color An inmate walks through the yard at the North Central Correctional Institution in Marion, Ohio, which recently switched to private management. new study by an UC-Berkeley graduate student has surprised a number of experts in the criminology field. Its main finding: private prisons are packed with young people of color. The concept of racial disparities behind bars is not exactly a new one. Study after report after working group has found a version of the same conclusion. The Sentencing Project estimates one in three black men will spend time behind bars during their lifetime, compared to one in six Latino men and one in seventeen white men. These reports and thousands of others have the cumulative effect of portraying a criminal justice system that disproportionately incarcerates black Americans and people of color in general. Sociology Ph. D student Christopher Petrella's finding in \"The Color of Corporate Corrections,\" however, tackles a different beast. Beyond the historical over-representation of people of color in county jails and federal and state prisons, Petrella found, people of color \"are further overrepresented in private prisons contracted by departments of correction in Arizona, California, and Texas .\" This would mean that the racial disparities in private prisons housing state inmates are even greater than in publicly-run prisons. His paper sets out to explain why a question that starts with race, but takes him down a surprising path. Age, race and money First, a bit of background. Private prisons house 128,195 inmates on behalf of the federal government and state governments (or at least they did as of 2010). There's a continual debate among legislators and administrators as to which is more cost effective: running a government-operated prison, with its government workers (and unions); or hiring a private company (like GEO or Corrections Corporation of America) to house your prisoners for you. States like California, Arizona, and Texas use a combination of both. In the nine states Petrella examined, private facilities housed higher percentages of people of color than public facilities did. Looking back at the contracts the private companies signed with the states, Petrella figured out the reason behind the racial disparity: private prisons deliberately exclude people with high medical care costs from their contracts. Younger, healthier inmates, he found who've come into the system since the War on Drugs went into effect are disproportionately people of color. Older inmates, who generally come with a slew of health problems, skew more white. <mark>Steve Owens</mark>, Senior Director of Public Affairs for Corrections Corporation of America, one of the largest private prison companies in the nation, calls the study \"deeply flawed .\" In an email, <mark>Owens</mark> says, \"CCA's government partners determine which inmates are sent to our facilities; our company has no role in their selection .\" Furthermore, he says, \"the contracts we have with our government partners are mutually agreed upon, and as the customer, our government partners have significant leverage regarding provisions .\" It's up to the contracting agency, he says, to decide how it wants to distribute inmates and manage healthcare costs. <mark>Owens</mark> does not, however, dispute Petrella's numbers. Gloria Browne-Marshall, an associate professor of Constitutional Law at John Jay College of Criminal Justice and former civil rights attorney, says \"it's a very interesting study .\" \"What I take away from it is how prisoners are looked at as commodities,\" she says. \"It's all about how the private prisons can make the most money .\" Petrella says he used data compiled by state correctional departments, which are divided by census-designated categories, and included African-Americans, Asian-Americans and Pacific Islanders, non-white Hispanics and Latinos, and essentially anyone except those defined by the census as white. \"I know these categories are fungible, but this is the data we have to work with,\" Petrella says. Browne-Marshall points out that Petrella's findings don't necessarily point to a racial motivation on behalf of private prison companies, and Petrella agrees. \"Profit is the clear motivation,\" he says. The racial component is more incidental. However, he says, \"the study shows that policies that omit race continue to have negative impacts .\" He says there's a larger dialogue to be had about what contemporary racial discrimination actually looks like. Barry Krisberg, director of the Chief Justice Earl Warren Institute at UC-Berkeley, says the findings surprised him. \"I had assumed private prisons were taking a lot of low-risk inmates,\" he says. \"That if you went to a private prison, you'd find a lot of old, Anglo prisoners. That's not the case .\" Prison conditions This raises questions about prison conditions for different kinds of prisoners. \"The rate of violence is higher at private prisons and recidivism is either worse or the same than in public prisons,\" says Alex Friedmann, managing editor of Prison Legal News and the associate director of the Human Rights Defense Center, a group that opposes private prisons. Friedmann says that part of the trouble is attributable to lower-paid, lesser-trained staff used in private prisons. But some of it, he adds, may be due to this higher-risk, younger population in private prisons. So, Browne-Marshall asks, what are private prisons doing for their age-specific populations? \"Public prisons are devoting a lot of resources to the age-specific needs of their prisoners,\" she says, such as building medical facilities, bringing in highly paid medical staff, and providing expensive mental health care services. \"What about the specific needs of the private prison population?\" Younger, higher-risk private prisoners need different kinds of services especially since they're likely to get out of prison, back into society. And historically, younger prisoners are more likely to re-offend, which Browne-Marshall suggests addressing with education, drug counseling, anger management, and other social services. The trouble: while courts have intervened to require prisons to have good medical and mental health care as constitutional necessities things that benefit older and sicker prisoners programs that mainly benefit younger prisoners aren't usually required. (Another reason why they're cheaper to house .) \"How do we get corporations to do what the incarcerated person needs when the government's not dictating it?\" Browne-Marshall says. That she says, is the next question for study. <mark>Owens</mark> says CCA offers \"safe, secure housing and quality rehabilitation and re-entry programming at a cost savings to taxpayers. Our programming includes education, vocational, faith-based and substance abuse treatment opportunities .\" Each year, he says, CCA inmates acquire \"more than 3,000\" GEDs. A footnote In compiling his data, Petrelle deliberately excludes private prisons with federal contracts from the study. He does so because a large portion of federal prisoners in private facilities are there as immigration detainees, not sentenced criminals. Were he to include federally contracted prisons, the disparities would surely be greater. Federally contracted facilities also come with their own baggage and civil rights questions. Federal prisoners in public facilities, as well as state prisoners in private and public facilities, have the right to bring lawsuits based on alleged civil rights violations. This means state inmates in California could sue the state prison system for providing inadequate health care. Arizona inmates in a private facility could do the same against the private corporation that owns their prison and the State of Arizona. However, federal prisoners in private prisons cannot bring such lawsuits, according to a recent U.S. Supreme Court ruling. A prisoner of this status could sue for actual damages, but not bring a civil rights suit against a private prison the kind of suit that usually forces major changes in how prisons operate in the public sphere. \"We've gotten to the point where courts intervene in public prisons, but only under extraordinary circumstances,\" Krisberg says. For federal prisoners in private facilities, there's even less legal recourse, he says."}, {"articleID": "2011011709_00108532_W", "names": {"Yashpal Sharma": ["Q3527549", "Q8049765"], "Zaheer Khan": ["Q24005467", "Q2508461"], "Rohit Sharma": ["Q21622845", "Q21622847", "Q26436595", "Q26837282", "Q30122003", "Q3520045", "Q58049760"]}, "date": "2011-01-17", "url": "http://indianexpress.com/news/best-possible-combination-for-world-cup-srikkanth/738559/", "content": "after announcing the 15-member squad for the forthcoming world cup, selection committee chairman krishnamachari srikkanth on monday said that the selectors have picked the best possible combination for the quadrennial event, to be held in the sub-continent from february 19 to april 2. srikkanth and his selection team of <mark>yashpal sharma</mark>, surendra bhave, narendra hirwani and raja venkat met here this morning to select the squad, with a hope that it will end india's 28-year-old drought. the only time they won the tournament was way back in 1983. srikkanth said this team will end india's 28-year-long wait by winning the sport's biggest event at home. \"this is the best possible winning combination we have picked up and it will win us the world cup. we (selectors) engaged in thorough discussion at the meeting here before finalising the squad. taking into account all the conditions like wickets, the opposition we will be playing, the selectors have chosen a very well balanced team,\" said srikkanth. tamil nadu spinner ravichandran ashwin and piyush chawla were named in the squad to be captained by mahendra singh dhoni, which also includes star players like sachin tendulkar, virender sehwag and <mark>zaheer khan</mark>. but mumbai's <mark>rohit sharma</mark> and kerala pacer s sreesanth were omitted from the squad. the chief selector said the reason behind picking up three specialist spinners were the turning tracks in india."}]