[{"date": "2019-11-15", "url": "http://brazilbusiness.einnews.com/article/502299546/eOf4Lu2o4XzJfrbt", "content": "Brazilian GP: Sebastian Vettel top as Kubica crashes in Brazil practice By <mark>Andrew Benson</mark> Chief F1 writer at Interlagos 15 Nov From the section Formula 1 Share this page Share this with Digg Facebook Google LinkedIn Reddit StumbleUpon Twitter Copy this link http: //www.bbc.co.uk/sport/formula1/50438953 Read more about sharing. Listen to qualifying on 5 Live Sports Extra and the BBC Sport website from 18:15 GMT on Saturday Sebastian Vettel led Charles Leclerc to a Ferrari one-two in an incident-packed second practice session at the Brazilian Grand Prix. The German was 0.021 seconds ahead of Leclerc with Red Bull's <mark>Max Verstappen</mark> third, ahead of Mercedes drivers Valtteri Bottas and <mark>Lewis Hamilton</mark>. Williams driver Robert Kubica began the session with a heavy crash at Turn Three from which he emerged unscathed. Both Toro Rossos suffered reliability problems, stopping on track. The session ran in cloudy but grey conditions after the wet weather for the morning session, but Kubica appeared to be caught out by dampness on a painted white line when he spun at the fast Turn Three on his first flying lap of the day. Brazilian Grand Prix first and second practice results <mark>Hamilton</mark> to negotiate new F1 contract Albon named Red Bull second driver for 2020 View more on twitter The Pole, whose Williams had been used by reserve driver Nicholas Latifi in the first session, lost the rear, over-corrected and spun into the wall, badly damaging three corners of the car. It was another blow for Williams, who have been struggling for pace all year and in recent races have been suffering from a shortage of spare parts. At the front, the true competitive order is hard to read, as both Ferrari drivers and <mark>Hamilton</mark> had messy runs. Vettel and <mark>Hamilton</mark> were both blocked by Bottas on their fastest laps, the world champion on the exit of Mergulho, the penultimate corner, and Vettel shortly afterwards on the exit of Juncao, just a few metres further on. And Leclerc did not improve in the final sector of his fastest lap, which suggests he, too, had more time in him. <mark>Verstappen</mark> impressed to be just 0.134 secs off the pace as Red Bull's revival in the last few races continues, and Bottas was 0.156 secs behind Vettel. The compromised <mark>Hamilton</mark> - whose time, like Vettel's, was set on his second lap on his tyres - was 0.067 secs behind his team-mate. Media playback is not supported on this device Jack Nicholls: \"Why <mark>Hamilton</mark> is better than Senna & Schumacher' Ferrari may well see the results of the session as vindication after what they consider to be unfounded allegations about their engine in the wake of two rule clarifications from governing body the FIA. Ferrari insist neither ruling - one governing the operation of the hybrid system and fuel-flow meter, and the other the addition of oil into the combustion chamber - have any effect on the running of their engine. They said they would be back to their normal form in Brazil after a disappointing race in the US last time out, and at least on Friday they look to be favourites for pole position on Saturday. Best of the rest was Kevin Magnussen's Haas, for once not struggling with tyre temperature in a disappointing season for the American team, followed by the Renault of Daniel Ricciardo and Alfa Romeo's Kimi Raikkonen. The second Red Bull driver Alexander Albon, confirmed with the team for 2020 earlier this week, was struggling after a crash at the end of the first session and down in ninth place, 0.9 secs off team-mate <mark>Verstappen</mark>. At Toro Rosso, Pierre Gasly's engine failed mid-way through the session forcing the Frenchman to park up at Turn Three, while Daniil Kvyat went off at Juncao, the final corner, with five minutes to go, after his car switched off, causing him to spin lightly into the barrier, bringing out the red flag and the session to a premature end. The team said they did not yet know the cause of the problem. McLaren's Lando Norris was down in 18th place, eight places behind team-mate <mark>Carlos Sainz</mark>, but the 20-year-old Briton said he made a series of mistakes .\" I'm confident if I put the lap together and don't make the mistakes I did today, it will look a bit better, \"Norris said .\" It was actually a relatively good day, \"said <mark>Hamilton</mark>.\" The second session was good, nice and smooth. The Ferraris are quite quick today and they were generally beating us just all on the straights. \"<mark>Hamilton</mark> has an Ayrton Senna inspired helmet for this weekend's grand prix Leclerc was 0.021 behind team-mate Vettel", "articleID": "2019111523_00075575_W", "names": {"Carlos Sainz": ["Q211204", "Q544856"], "Lewis Hamilton": ["Q6536656", "Q9673"], "Max Verstappen": ["Q2239218", "Q2744186"]}}, {"date": "2019-11-16", "url": "https://www.winnipegfreepress.com/sports/football/bombers/its-blue-vs-bombers-565007712.html", "content": "Winnipeg Free Press Previous Article Next Article It's Blue vs. Bombers Resilient bunch proved last week reports of their demise were dead-wrong; stay out of their own way in Regina and \"Riders are roadkill en route to CFL salvation Email Opinion REGINA--First, they made it look easy. Too easy, in fact. Then came some adversity. Plenty of it. Suddenly it didn't look so easy anymore. But not only did the Winnipeg Blue Bombers weather the mid-season storm and live to tell the tale, they're now on the verge of writing a pretty epic last chapter, one they hope has a fairy-tale ending next weekend. There's only one remaining obstacle standing in their way, and that's the Winnipeg Blue Bombers. No, not the Saskatchewan Roughriders, their opponent Sunday in the West Division Final at Regina's Mosaic Stadium. And not the Edmonton Eskimos or Hamilton Tiger-Cats, who will battle it out earlier in the day in the East Division Final. REGINA--First, they made it look easy. Too easy, in fact. Then came some adversity. Plenty of it. Suddenly it didn't look so easy anymore. But not only did the Winnipeg Blue Bombers weather the mid-season storm and live to tell the tale, they're now on the verge of writing a pretty epic last chapter, one they hope has a fairy-tale ending next weekend. There's only one remaining obstacle standing in their way, and that's the Winnipeg Blue Bombers. No, not the Saskatchewan Roughriders, their opponent Sunday in the West Division Final at Regina's Mosaic Stadium. And not the Edmonton Eskimos or Hamilton Tiger-Cats, who will battle it out earlier in the day in the East Division Final. Last week's dominating takedown of the Calgary Stampeders--in enemy territory, no less--showed they have the talent, the depth and, yes, the coaching, to go all the way. They slayed the proverbial dragon and exorcised some recent demons, all in one fell swoop. Not to mention that there appears to be a certain\" je ne sais quoi \"about this year's team, an intangible that's hard to put a finger on, or even describe, but is most certainly there. Zach Collaros is now 2-0 in blue and gold as the team's starting quarterback. (Jeff McIntosh / The Canadian Press files) We saw it when the Bombers roared out to a 5-0 start, looking like they were going to lap the CFL field. I wrote at the time that they don't hand out Grey Cups in mid-July, and that's certainly true. And when things suddenly went south--starting quarterback Matt Nichols suffering a season-ending injury, running back <mark>Andrew Harris</mark> sentenced to sit out two games after being caught with a banned performance-enhancing drug in his system--it began to look like a 28-year championship drought would, most certainly, become a 29-year-old championship drought. But a funny thing happened on the way to what seemed to be an inevitable collapse. There wasn't one. Sure, they came back down to Earth, no longer running away with the division and ultimately settling for a third-place finish in the ultra-tough West, meaning they'd have to win not once, but twice, on the road to get to the Promised Land. That might have actually been the best thing that could have happened to this group, which I still maintain is the most skilled that's been assembled around these parts in years. Along the way, they learned that things were no longer going to come easy, that they'd have to work their tails off. And they did. They sure did .\" It's always important that you have to face adversity throughout the season. You don't want your first adverse situation to come in playoffs and not know how you might respond, \"linebacker Adam Bighill told me Friday .\" You want to be able to have to learn from things the hard way during the season. You have to be able to understand how to close games out, how did we let that slip away? We can't let that happen again, how do we finish this drive? How do we deal without this player on our roster? \"The Bombers became battle-tested, their resolve strengthened. And they seem, collectively, to be carrying a massive chip on their shoulders, a product of being written off and counted out in some quarters. A product of their most explosive offensive weapon in <mark>Harris</mark> denying any wrongdoing and then getting snubbed in post-season awards voting, which only seems to have poured more gasoline on the fire that was already burning. Quarterbacks Zach Collaros and Chris Streveler proved to be a great one-two punch in Calgary last weekend. (Jeff McIntosh / The Canadian Press files) There's a determination bordering on sheer desperation to get the job done, with a veteran-heavy group that is mostly intact from last year, when a promising season ended with a thud by losing the West Final to the Stampeders .\" The feeling that, man, if we're back next year we're going to do this thing, \"Bighill said wistfully. You saw all of that on full display when they went into Calgary last weekend as considerable underdogs, with major question marks about who was even going to play quarterback, and came away from a place that has always been a proverbial house of horrors with a 35-14 victory over Bo Levi Mitchell and the Stampeders. It was one of the most impressive overall performances in recent Bombers history--from the two-headed monster behind centre in Zach Collaros and Chris Streveler, the defensive scheme from the much-maligned Richie Hall, the offensive game plan from Paul LaPolice and all the right buttons being pushed by head coach <mark>Mike O'Shea</mark>, who saw his players rise to the occasion. And you know what? They do hand out Grey Cups in late November, and I fully expect to see the Blue & Gold raising the trophy next Sunday night at McMahon Stadium, where they vanquished the Stamps. Unless they get in their own way. Sure, it could happen. One of the great things about professional sports is how unpredictable they can be .\" Any given Sunday, \"as the saying goes. But if you aren't at least reasonably confident in Winnipeg's chances at this point, then you haven't been paying attention. Saskatchewan Roughriders quarterback Cody Fajardo hasn't played since Oct. 30 when he injured an oblique muscle in practice but will be the starter on Sunday. (<mark>Matt Smith</mark> / The Canadian Press files) Considering the stage--not to mention the consequences of what a loss might have meant to the franchise--last week might have been the biggest victory since the 50-11 triumph over Edmonton way back on Nov. 25, 1990, at the 78th Grey Cup. Now comes a legitimate shot at the 107th edition, provided they can pull off two more wins. First up is a Saskatchewan team that will be relying on banged-up quarterback Cody Fajardo, a stifling defence and what they hope will be a raucous home-field advantage. The Bombers were pumping in the crowd noise at ear-splitting levels during their closed practice Friday morning at IG Field .\" We don't think too far ahead. At the end of the day we're always going to say the Grey Cup's our goal, but we're not going to go the Grey Cup if we don't take care of business this week, \"receiver Nic Demski said. Want more great journalism? I agree to the Terms and Conditions, Cookie and Privacy Policies, and CASL agreement .\" Last year we came up short to our ultimate goal. To bring in the crop that we did this year and add a couple pieces, it just makes it that much more clearer that we do have the talent to take this team to the next level. \"As for all those hurdles they've encountered this year? Just part of the journey, one that shows no sign of ending this weekend .\" It definitely builds toughness. It shows who wants to be here through the thick and thin. If everything's pretty, obviously everybody's going to want to come along for the ride. When things get hard that's when you see people's true colours. Everybody stuck together. We knew what we wanted to do in this room. Everybody stuck together and we're making it work. We just gotta go out there and keep fighting, \"said Demski. A real page-turner, these Bombers. mike.mcintyre @ freepress.mb.ca", "articleID": "2019111601_00005815_W", "names": {"Andrew Harris": ["Q16209408", "Q4757239", "Q4757241", "Q4757242", "Q4757244", "Q4760774", "Q58055458"], "Matt Smith": ["Q1882744", "Q20713866", "Q24809160", "Q27074050", "Q30123100", "Q312385", "Q3299556", "Q3852033", "Q40281443", "Q43091034", "Q54152850", "Q6789356", "Q6789357", "Q6789358", "Q6789359", "Q6789360", "Q6789363", "Q6789364", "Q6789365", "Q6789366", "Q6789367", "Q6789368", "Q6791245"], "Mike O'Shea": ["Q16212555", "Q20022451", "Q6848254"]}}, {"date": "2019-11-16", "url": "http://news.msn.com/en-us/news/other/on-gps-inside-trumps-state-department/vi-BBWPPZ0", "content": "AdChoices Latest Stories Analysis: With a Tweet, <mark>Trump</mark> Upends GOP Strategy on Yovanovitch The New York Times 20 mins ago Teen gunman who killed two in shooting at Calif.. HS dies in hospital USA TODAY AdChoices Witness overheard US ambassador tell <mark>Trump</mark> that Ukraine would investigate Biden CNN <mark>Trump</mark> grants clemency to 2 Army officers accused of war crimes FOX News Analysis: 4 takeaways from Marie Yovanovitch's testimony The Washington Post Browns' Garrett suspended for rest of season by NFL Associated Press Prince Andrew says he let the Royal Family down in his relationship with Jeffrey Epstein NBC News <mark>Roger Stone</mark> Is Found Guilty in Trial That Revived Trump-Russia Saga The New York Times Off-duty cops rushed to HS after hearing shots: \"Actions saved lives' USA TODAY Sources: Epstein jail guards had been offered plea deal Associated Press <mark>Trump</mark> defends Yovanovitch attack:' I have freedom of speech' The <mark>Hill</mark> Ex-Envoy to Ukraine\" Devastated' as <mark>Trump</mark> Vilified Her The New York Times Did <mark>Trump</mark> just commit witness tampering? 7 legal experts weigh in Vox.com Dems call for <mark>Stephen Miller</mark> to resign after leak of emails ABC News Court puts hold on Rodney Reed's scheduled execution NBC News Dow tops 28,000 for first time, capping 4-week win streak CNBC Federal Prosecutors Probe Giuliani's Links to Ukrainian Energy Projects The Wall Street Journal. Audience applauds, GOP mic turned off at end of Yovanovitch hearing The <mark>Hill</mark> Impeachment Updates: Envoy Was \"Obstacle' to <mark>Trump</mark>, Schiff Says Bloomberg WH record of <mark>Trump</mark>'s 1st Ukraine call differs from earlier description ABC News Arizona sheriff's deputy tackles 15-year-old boy with no arms or legs NBC News Study: The secret of living to 110 FOX News Australia's fragile koala colonies are being ravaged by brush fires:\" It's a national tragedy' The Washington Post US <mark>Trump</mark> grants clemency to 2 Army officers accused of war crimes FOX News 2 hrs ago Off-duty cops rushed to HS after hearing shots: \"Actions saved lives' USA TODAY Teen gunman who killed two in shooting at Calif.. HS dies in hospital USA TODAY Unregistered guns found in home of Calif. shooting suspect, sheriff says Los Angeles Times States sue <mark>Trump</mark> admin for right to require more fuel-efficient cars The Washington Post 1 hr ago <mark>Trump</mark>'s Doral resort was a last-minute addition in search for G-7 site, newly released email shows The Washington Post Flight attendants have begged not to work on the Boeing 737 Max, union says Business Insider Planned Parenthood Wins Lawsuit Against Anti-Abortion Activists Newsweek Surviving Santa Clarita school shooting victims on road to recovery ABC News Ohio GOP want to charge doctors who perform abortions with murder USA TODAY New <mark>Trump</mark> rule to make more health care rates public The Washington Post Why did Santa Clarita shooting happen? Detectives search for motive Los Angeles Times Alabama company refuses to print university's LGBTQ-inclusive magazine NBC News <mark>Jimmy Carter</mark>'s neighbors know they'll say goodbye one day, but not yet USA TODAY Border Patrol agent shoots Russian allegedly trying to sneak into US FOX News 3 hrs ago' I Need A Kidney:' Indiana Man's Bears Game Sign Prompts Search Patch 3 Indiana judges suspended after a night of drinking turned into a brawl CNN Last survivor of the Hindenburg disaster dies at age 90 Associated Press Politics White House: NSC Ukraine expert wrote summary of April Trump-Zelensky call that conflicts with rough transcript Washington Examiner 2 hrs ago Analysis: With a Tweet, <mark>Trump</mark> Upends GOP Strategy on Yovanovitch The New York Times <mark>Trump</mark> grants clemency to 2 Army officers accused of war crimes FOX News Obama Says Average American Doesn't Want to\" Tear Down System' The New York Times Jordan Brings Pugnacious Style to Impeachment Defense of <mark>Trump</mark> The New York Times 3 hrs ago Who's scheduled to publicly testify next in impeachment hearings Business Insider Analysis: 4 takeaways from Marie Yovanovitch's testimony The Washington Post Ex-Envoy to Ukraine \"Devastated' as <mark>Trump</mark> Vilified Her The New York Times Impeachment Updates: Envoy Was\" Obstacle' to <mark>Trump</mark>, Schiff Says Bloomberg Pelosi: <mark>Trump</mark> Insults Officials Because of \"His Own Insecurity' Mediaite Witness overheard US ambassador tell <mark>Trump</mark> that Ukraine would investigate Biden CNN Audience applauds, GOP mic turned off at end of Yovanovitch hearing The <mark>Hill</mark> Did <mark>Trump</mark> just commit witness tampering? 7 legal experts weigh in Vox.com Poll: Support for <mark>Trump</mark>'s impeachment unchanged after hearings begin Reuters Democrats vow court fight to block new N.C. congressional map POLITICO 4 hrs ago 6 <mark>Trump</mark> associates have now been convicted in Mueller-related probes CNN Dems call for <mark>Stephen Miller</mark> to resign after leak of emails ABC News <mark>Trump</mark> asks Supreme Court to block House subpoena of finances Associated Press Election 2020 Obama Says Average American Doesn't Want to\" Tear Down System' The New York Times 16 mins ago Louisiana governor's race is the latest test of <mark>Trump</mark>'s clout CBS News Bloomberg to skip his own China forum as he mulls presidential run Reuters Progressive media company founder joins race to fill <mark>Katie Hill</mark>'s seat ABC News How Deval Patrick and Michael Bloomberg Could Alter the 2020 Race The New York Times \"I am running for president': Senators brush off delinquent voting records POLITICO Inside <mark>Andrew Yang</mark>'s plan to give every American $1,000 CBS News Warren lays out ambitious timeline to transition to Medicare for All The Boston Globe Democrats vow court fight to block new N.C. congressional map POLITICO 4 hrs ago Wisconsin voters with disabilities face a variety of barriers Milwaukee Journal-Sentinel Elizabeth Warren releases plan to implement Medicare for All CNN Opinion I'm Sorry, Is Impeachment Not Entertaining Enough for You? The New York Times Speaker Pelosi, from one Dem to another, please stop the impeachment bandwagon FOX News House GOP Treats Yovanovich With Respect As <mark>Trump</mark> Calls Her\" Bad News' Intelligencer <mark>Stephen Miller</mark>'s Sinister Syllabus The New York Times Impeachment hearings confirm <mark>Trump</mark>'s misconduct, despite denials FOX News The News In Cartoons Photos Yes, <mark>Trump</mark> released the aid to Ukraine. But the damage was already done. The Washington Post For Democrats, It's Mission: Impeachment U.S. News & World Report Executive Privilege Should Have No Power When It Comes to an Impeachment The Atlantic <mark>Donald Trump</mark> is the one blocking firsthand witnesses USA TODAY One of the defenses of <mark>Trump</mark> is--literally--a TV-cartoon joke The Washington Post World U.S. \"flexible' on military exercises with South Korea as North demands cancellation The Washington Post 2 hrs ago Prince Andrew says he let the Royal Family down in his relationship with Jeffrey Epstein NBC News U.S. troops will die if they remain in Syria, Bashar Al-Assad warns Newsweek Ukraine\" invisible' as impeachment hearings focus on Washington drama NBC News Ethnic Rifts in Bolivia Burst Into View With Fall of Evo Morales The New York Times Widow of ex-KGB agent plans legal action on UK's Russia report Reuters 5 hrs ago Last survivor of the Hindenburg disaster dies at age 90 Associated Press Venice is underwater--and a preview of what climate change will bring to coastal cities The Washington Post Chileans to vote on new constitution in response to protests AFP 1 hr ago US teacher killed in Dominican Republic had dream to retire there, says family ABC News Australia's fragile koala colonies are being ravaged by brush fires: \"It's a national tragedy' The Washington Post AdChoices Crime Court puts hold on Rodney Reed's scheduled execution NBC News 2 hrs ago Parole rejected for Charles Manson follower after 50 years Associated Press Police find 26 children behind false wall at Colorado day care FOX News Sources: Epstein jail guards had been offered plea deal Associated Press Missing woman's husband arrested; carpet found soaked with blood, bleach NBC News Texas parole board recommends delaying Rodney Reed execution Associated Press Kentucky woman charged in death of woman missing since May Associated Press Man suspected of fatal shooting said he was man from\" Joker' Associated Press 5 arrested in connection with deadly shooting at Airbnb Halloween party ABC News California man convicted of torture-murder dies on death row Associated Press In Photos: Santa Clarita school shooting 19-year-old driver faces charges in Forsyth County school bus accident WXIA-TV Atlanta Kratz found guilty of first-degree murder, voluntary manslaughter CBS Philadelphia Teen girl accused in violent Orange Mound carjacking WREG-TV Memphis 2-year-old to leave hospital after shooting himself with father's gun WZZM-TV Grand Rapids-Kalamazoo-Battle Creek Coroner identifies 1 of 2 teens killed by classmate in Santa Clarita ABC 7 Los Angeles Victims wounded in Saugus High shooting \"held their composure' ABC 7 Los Angeles McDaniel student arrested on assault, gun charges WBAL TV Baltimore Local news from the web Curtea De Arges, Romania Places Search for Location / City Search RECENT SEARCHES Curtea De Arges, Romania Make this place my home Sign in to add favorites Detect my location Add to my favorites Detect my location Technology Twitter rolls out total ban on ads from political figures POLITICO Inventor breaks record zooming at 85 mph in jet-powered suit CNET How Google interferes to change your search results The Wall Street Journal. Apple bans vaping apps from the App Store CNBC AirFly Pro can stream Bluetooth audio to and from any 3.5 mm jack Engadget NYT: <mark>Trump</mark> admin set to extend Huawei license again Engadget Disney + will fix its\" Simpsons' widescreen problem in 2020 Engadget Google scales back town hall meetings following leaks Engadget iFixit examines the 16-inch MacBook Pro's \"throwback' keyboard design Engadget TikTok begins testing links in bios The Verge Google's Files app now streams local media to your Chromecast Engadget Pre-installed apps on low-end Android phones are full of security holes Engadget Twitter's political ad ban provides little oversight for fossil fuel companies The Verge Twitter exempts some 'cause - based' messages from political ad ban Relaxnews (AFP) AT & T's latest smartphone plans offer new ways to limit\" unlimited' data USA TODAY Which AT & T wireless unlimited data plan is best for you? You need to consider these three factors first. MacBook Pro first look: Apple fixes the keyboard on powerful pricey new 16-inch laptop USA TODAY Apple could be forced to let Apple Pay competitors access NFC under German law The Verge Fears grow on digital surveillance: US survey Relaxnews (AFP) Good News GoFundMe Honors Good Samaritans at First Heroes Celebration People Woman donates nearly 600 Barbies with prosthetic legs to children at St. Louis hospital KSDK-TV St. Louis \"Dream-Maker' Man Wants to Grant Wishes Through Social Media People Texas Dad Says Apple Watch Changed the Life of His Son with Autism:\" We Had Tried Everything' People Woman living in SUV with dogs gets apartment with community's help ABC News Amari gets heroic birthday surprise Stitch Liver transplant leads to unbreakable bond between strangers TODAY 14-year-old baker gives cupcakes to homeless CBS News Boy uses his Make-A-Wish to get special space that other children can use Stitch Female Thunderbird pilot inspiring others to chase their dreams CBS News Wisconsin bus driver saves children wandering in snow FOX News On a frigid night, man who used to be homeless ushered people to shelter WFAA-TV Dallas-Ft. Worth Pittsburgh Wears Red Cardigans to Honor Mister Rogers CBS Pittsburgh High schoolers build prosthetic arm for student to play the cello People Hero off-duty police officer saves driver from fiery crash Patch Helping vets launch startups: \"There's a level of resilience' Chicago Tribune Sisters raise thousands to buy Thanksgiving meals for families in need WPTZ Plattsburgh-Burlington Money How Google interferes to change your search results The Wall Street Journal. How to save $1 million on a $45K salary, broken down by age CNBC In Japan's vanishing rural towns, newcomers are wanted CityLab GNI per capita: $1,665> 2018 GDP: $9.7 billion (144th out of 208 countries)> Population (2018): 11.1 million> Life expectancy at birth in 2017: 63.3 years Located on the island of Hispaniola in the Carribbean, Haiti is one of the few places outside of Africa to rank among the poorest countries in the world. The country was hamstrung economically since gaining independence from France in the early 19th century, as it was forced to pay reparations to its former European master to compensate former slave owners. The debt was repaid in full by the mid-20th century, but there have been recent calls for France to return the money. In recent years, economic development has been hindered by political instability and devastating natural disasters. Haiti's $1,665 GNI per capita is the lowest in North America and 12th lowest in the world. ALSO READ: The Most Productive Countries in the World\" src = \"http: //static-entertainment-neu-s-msn-com.akamaized.net/sc/9b/e151e5.gif\" title = \"12. Haiti - La_Corivo / Getty Images\" > The world's poorest countries 24/7 Wall St. Dow tops 28,000 for first time, capping 4-week win streak CNBC The stock market warning that everyone is overlooking The Motley Fool 5 hrs ago Bill Gates tops Bezos as world's richest person with Amazon slide Bloomberg How Amazon has become a flea market of fakes The Washington Post The world's most profitable company is about to go public Vox.com Nurses face an epidemic of workplace violence CBS News Smart tax moves to make before the end of the year Cheapism Sports Garrett isn't only athlete to use equipment to fight in game The Boston Globe Report: Rudolph won't take legal action against Garrett Sportsnaut GM wants Luhnow \"banned for life' if he knew of Astros' sign-stealing <mark>Larry Brown</mark> Sports Steelers' Rudolph on\" TNF' incident:' I thought it was pretty cowardly' NFL Browns' Garrett suspended for rest of season by NFL Associated Press Report: At least 24 teams to attend Kaepernick's workout Sportsnaut <mark>Bill Russell</mark> finally accepts Basketball HOF ring Associated Press Carmelo reportedly won't debut before Tuesday Yahoo! Sports Dest makes quick impact as US rebounds to beat Canada 4-1 Associated Press Jones scores 31, No. 2 Duke edges Georgia State, 74-63 Associated Press Judge dismisses lawsuit to overturn Maximum Security's Kentucky Derby DQ USA TODAY SPORTS Opinion: NFL should also discipline Rudolph USA TODAY SPORTS Hardaway: Swift resolution from NCAA on Wiseman \"would be ideal' Commercial Appeal Memphis Opinion: Pouncey is a folk hero but deserved 3 games Yahoo! Sports Yelich slams Darvish after pitcher discussed at-bat <mark>Larry Brown</mark> Sports The Best Photos of College Basketball imagn Warriors on pace for worst winning percentage drop ever Dunk Wire More in News Video Video <mark>Trump</mark> impeachment hearing key moments: Day 2 ABC News Are sanctuary cities doing more harm than good? FOX News On GPS: Inside <mark>Trump</mark>'s State Department CNN The most revealing moments from Marie Yovanovitch's impeachment inquiry testimony CBS News How Ukraine is perceiving the impeachment inquiry NBC News\" This is worse than Nixon:' Neal Katyal on the impeachment latest MSNBC Entertainment Entertainment <mark>Bill Murray</mark> to star in Peter Farrelly comedy series at Quibi Variety Kanye West and his Sunday Service choir perform for inmates at Texas jail E! Tinsley Mortimer confirms she and Scott Kluth are back together US Weekly Bieber shows support for Big Machine Records, Braun amid Swift feud ETOnline Reese Witherspoon reveals she turned down another \"Friends' appearance E! Lizzo sued by Postmates driver she claimed stole her food Billboard Weather Weather Unseasonably early Arctic cold to retreat from much of central, eastern US AccuWeather Venice is underwater--and a preview of what climate change will bring to coastal cities The Washington Post There's a place in the US where its been over 80 degrees since March CNN Australia's fragile koala colonies are being ravaged by brush fires The Washington Post The Outer Banks prepares for yet another storm AccuWeather Ski season begins at Squaw Valley Alpine Meadows AccuWeather Microsoft News Microsoft News About Us Learn what we do in the Microsoft News Blog MSN is worldwide Sign up for newsletters from MSN Get help for questions about MSN and Microsoft News Lifestyle Lifestyle 60 animal photos that will make you say\" awww \"Reader's Digest I'm a queer woman dating a trans man and it's a secret Refinery29 My city was named the\" worst place for black women to live .' Should I leave? HuffPost Archie's photo album: Prince Harry and Duchess Meghan's royal baby US Weekly I confessed to my partner that I cheated for all the wrong reasons Women's Health Never eating dinner together could be a sign that you're headed for divorce Women's Health Health Health I was overeating at dinner until I started doing this on Sundays PopSugar How to get rid of skin tags, according to a dermatologist Reader's Digest Ex-FDA adviser: LASIK surgery should be taken off market CBS News He was a member of a boy band in the 90s. Now he's an ER doctor in Dallas WFAA-TV Dallas-Ft. Worth Will you get dementia? Many may not understand their risk Associated Press Halle Berry shares a photo of 6-pack abs--and her fans are freaking out Health.com Autos Autos Ferrari to launch fewer cars next year after a busy 2019 motor1 Hummer electric pickup truck scheduled to kick off brand's rebirth in 2021 Roadshow Electric Hummer, Escalade to be built at Detroit-Hamtramck? motor1 Tesla applies to trademark \"Cybertruck' and\" CYBRTRK' Autoblog End of an era: Chevy has built the last front-engined Corvette motor1 Ford and Chevy are losing buyers after discontinuing compact cars Car and Driver Travel Travel Therapy dogs help de-stress travelers at Long Beach Airport ABC 7 Los Angeles Delta's new long-haul service is a game-changer for economy class fliers Condé Nast Traveler United is the latest airline to push the Boeing 737 Max's return back, despite Boeing's increasing confidence about the plane's recertification Business Insider On board the world's longest flight CNN Horse yoga and cow cuddling: The world's wackiest hotel activities Travel + Leisure Greek donkeys are still being abused as \"tourist taxis,' PETA claims FOX News", "articleID": "2019111603_00021523_W", "names": {"Andrew Yang": ["Q11118258", "Q28723576"], "Bill Murray": ["Q29250", "Q4910295"], "Bill Russell": ["Q242185", "Q4910727", "Q862419"], "Donald Trump": ["Q22686", "Q27947481"]}}]