[{"date": "2019-11-19", "url": "http://express.co.uk/news/science/1206396/Life-after-death-research-what-happens-after-death-near-death-experience-afterlife-NDE", "content": "Although the science on life after death is inconclusive, thousands claim to have experienced some form of an afterlife. Most commonly, hospital patients who suffered a \"near-death experience\" (NDE) report visions of light and voices at the end of a tunnel. Others have more bizarrely claimed to have stood before the Pearly Gates. Asteroid Apophis terror: NASA reveals date asteroid could hit Earth Life after death: Shock study finds thousands who remember \"past life' The question of whether life continues after death has been at the forefront of research carried out a the University of Virginia Medical Center in the US. In March 2017, the University hosted a lecture dedicated to the last 50 years of research on the afterlife. Professor <mark>Bruce Greyson</mark> who took part in the lecture discussed some of the more bizarre NDEs he has come across through his research. According to the psychiatrist, many patients on the verge of dying experience the slowing down of time, see their lives flash before their eyes and have a sudden sense of clarity. READ MORE: Man claims to have met Jesus in the afterlife Life after death: Many people undergo bizarre\" near-death experiences' or NDEs (Image: GETTY) Life after death: NDE patients have stood on the verge of death (Image: GETTY) ESA warns of satellite damage and blackouts from a major solar storm He said: \"The changes in feeling include a sense of peace and well-being, feelings of joy, a sense of oneness or cosmic unity, an encounter with what seems to be a loving, warm being of light .\" The apparently paranormal features include extraordinary sensory vividness. \"People report seeing colours they have never seen on Earth, hearing sounds they have never hear before, having what seem to be a frank extrasensory perception of things going on elsewhere, visions of the future and a sense of leaving the physical body .\" Professor <mark>Greyson</mark> also said many NDEs induce a sense of \"otherworldly features\". Life after death shock: One in ten people experience \"the afterlife' LISTEN: Eerie sound of Earth being BOMBARDED by solar winds These otherworldly features include feeling transported to another unearthly or mystical realm. People report seeing colours they have never seen on Earth Professor <mark>Bruce Greyson</mark>, University of Virginia This category also includes seeing diseased spirits and religious figures as well as reaching a\" point beyond which you can't come back \". Professor <mark>Greyson</mark> said:\" Now most NDEs, in fact, have a combination of all four of these elements o varying degrees. \"The researcher interviewed patients about their NDEs in the 1980s and followed up with them 40 years later to determine whether time influenced their memories of the events. DON'T MISS The staggering stories that prove the afterlife is real [INSIGHT] Life after death: THIS is the process you will go through when you die [ANALYSIS] Asteroid danger: 100% certainty of impact warns space expert [INTERVIEW Life after death: Some people claim to have seen heaven (Image: GETTY) Life after death: There is no concrete proof to support claims of an an afterlife (Image: GETTY) Life after death: Line between alive and dead blurred Surprisingly, his study found memories of the NDEs were still reliable nearly 40 years later, meaning the stories did not change over time. The psychiatrist did, however, notice experiences of an afterlife were influenced by cultural norms. He said:\" For example, near-death experiences of third world countries do not talk about entering a tunnel the way Americans do. They would talk about entering a cave or a well. \"One truck driver I interviewed, talked about entering a tailpipe. So you have to use whatever cultural metaphors at your disposal to describe the phenomenon .\" So our NDErs are just reporting what they expect to happen when they come close to death. \"According to the NHS, there is a strong possibility people who stand on the verge of dying hold onto consciousness. If blood still runs through the brain, it is plausible people will still see lights and hear voices they later confuse with an afterlife experience. NDEs do not constitute full-on patient deaths, therefore the NHS argued patients could not have\" technically \"experienced the afterlife. The NHS said:\" The existence of an \"afterlife' remains a matter of belief, not scientific proof .\" ", "articleID": "2019111914_00133893_W", "names": {"Bruce Greyson": ["Q3246321", "Q47218741"]}}, {"date": "2019-11-20", "url": "https://www.salon.com/2019/11/20/tucker-carlson-claims-he-didnt-use-anti-semitic-trope-despite-suggesting-vindman-has-a-dual-loyalty/", "content": "Fox News host Tucker Carlson suggested Tuesday that Lt. Col. Alexander Vindman has raised concerns about President Donald Trump's July 25 phone call to Ukrainian President Volodymyr Zelensky because of a dual loyalty. Vindman was born in Kyiv and is Jewish. Carlson opened his monologue by claiming that \"the circus train of impeachment remains stalled on the tracks .\" He described Vindman as \"a low-level U.S. army officer\" and showed a clip in which Steve Castor, a Republican staff attorney, asked Vindman whether <mark>Oleksandr Danylyuk</mark>, a former Ukrainian national security adviser, had offered him the position of Ukrainian defense minister. While Carlson included the part of the exchange in which Vindman confirmed that he had been approached for the job, he edited out crucial context from the lieutenant colonel's response. Advertisement: Vindman said that although he had been offered the post three times, \"every single time, I dismissed it. Upon returning, I notified my chain of command and the appropriate counterintelligence folks about the offer .\" He later added, \"I'm an American. I came here when I was a toddler, and I immediately dismissed these offers--did not entertain them. The whole notion is rather comical that I was being asked to consider whether I would want to be the minister of defense. I did not leave the door open at all. But it is pretty funny for a lieutenant colonel in the United States Army, which really is not that senior, to be offered that illustrious a position .\" Carlson alleged that Vindman was someone who holds \"strongly-held views on Ukrainian politics--views that may or may not align with U.S. policy on the subject .\" Advertisement: There is a long history of accusing Jews of being disloyal to the countries where they reside, which is a form of anti-Semitism. In the 1890s, a French captain named Alfred Dreyfus was accused of being a German spy and publicly disgraced despite exculpatory evidence. T he dual loyalty slur appeared more recently when Trump claimed that American Jews who vote for Democrats, whom he in turn claimed were anti-Israel, were \"disloyal .\" In response to a Salon request for comments, Fox News sent a statement attributed to Carlson. \"Our segment noted that Lt. Col. Vindman was offered a high-ranking position in the Ukrainian government--a fact that emerged during his congressional testimony,\" Carlson said. \"Lt. Col. Vindman's religious faith was never mentioned, because it is entirely irrelevant. Any suggestion to the contrary is outrageous and dishonest .\" Advertisement: Carlson is not the only Fox News host to call Vindman's loyalty of country into question. Last month, fellow primetime colleague Laura Ingraham commented that Vindman \"immigrated from Ukraine along with his family when he was a child and is fluent in Ukrainian and Russian. Ukrainian officials sought advice from him about how to deal with Mr. Giuliani, though they typically communicated in English .\" She added, \"We have a U.S. national security official who is advising Ukraine while working inside the White House, apparently against the president's interest. And, usually, they spoke in English. Isn't that kind of an interesting angle on this story?\" Advertisement: During his opening statement to the House Intelligence Committee on Tuesday, Vindman addressed the various right-wingers who have attacked him and others who have come forward to attest to inappropriate behavior by Trump under oath during the impeachment inquiry. \"I want to take a moment to recognize the courage of my colleagues who have appeared and are scheduled to appear before this committee,\" Vindman said. \"I want to state that the vile character attacks on these distinguished and honorable public servants is reprehensible. It is natural to disagree and engage in spirited debate--this has been our custom since the time of our Founding Fathers--but we are better than callow and cowardly attacks .\" Vindman, who personally listened to Trump's July 25 phone call with Zelensky, told Congress on Tuesday that he was \"concerned\" by the call, because he thought it was \"improper .\" Advertisement: \"It is improper for the president of the United States to demand a foreign government investigate a U.S. citizen and political opponent,\" Vindman said. \"It was also clear that if Ukraine pursued an investigation into the 2016 election, the Bidens and Burisma, it would be interpreted as a partisan play. This would undoubtedly result in Ukraine losing bipartisan support, undermine U.S. national security and advance Russia's strategic objectives in the region .\" You can watch the full Carlson segment below: Advertisement: Watch the latest video at foxnews.com", "articleID": "2019112101_00019676_W", "names": {"Oleksandr Danylyuk": ["Q12099480", "Q20066727"]}}, {"date": "2019-11-21", "url": "http://origin.thehollywoodgossip.com/2019/11/eddie-judge-doubles-down-ryan-vieth-isnt-sick-hes-just-a-loser/", "content": "Earlier this month, The Real Housewives of Orange County viewers saw Tamra Judge fear that her son might die by suicide. Her husband, Eddie, came across as harsh and unsympathetic while speaking to the camera. After suggesting that Ryan Veith might need a metaphorical kick in the butt, Eddie Judge seemed to dismiss Ryan's mental health struggles. \"When you're struggling with childhood issues as a man, you're not a man,\" Eddie told the camera. Ryan is a famously troubled person, from his abhorrent and bigoted statements to his alarming criminal history. Ryan's self-esteem is low, and he had confessed to his mother and to a therapist that he felt worthless. \"Time to move on...just because you see it on TV doesn't mean it's real!\" Eddie writes without context on Instagram this week. \"I'm happy most of you understand this,\" he continues. \"And those that do not, you need to learn how it works .\" \"Reality TV is not Reality,\" Eddie argues. He correctly points out: \"These shows are designed to get maximum reaction from the viewers .\" \"Has anyone reached out to a villain on a TV show,\" Eddie begins to ask. He continues: \"And messaged him/her what a piece of shit he/she is because of what they saw that person do or say to someone else on that show?\" \"Oh yeah, no,\" Eddie answers. \"Because someone wrote that script .\" \"Well, someone writes the script on reality TV .,\" he claims. \"Just not exactly the same way a scripted show is produced .\" \"I stand behind what I said and never did I say that people with a mental illness need to man up,\" Eddie insits. \"I understand mental illness,\" he writes. Eddie explains: \"I also understand when someone uses mental illness as an scapegoat .\" \"Ryan is not mentally ill and he is not using it as an scapegoat,\" Eddie claims. \"He is struggling with life,\" Eddie opines. \"And, you don't have to be mentally ill to feel depressed .\" Depression is literally mental illness, my dude. \"However, the TV show will figure out how to get max reaction by editing a touching moment in such a way to get you to watch for more,\" he writes. \"If they do not, then we have no show,\" Eddie concludes. \"Get it? The end!\" As we mentioned, depression is absolutely a mental illness. It's a brain disorder. That seems to indicate that Eddie is either deeply ignorant about mental health or willfully playing word games. While Ryan is struggling with life, part of that struggle stems from mental illness. However, depression and self-loathing may be factors in Ryan's behavior, but they do not excuse his actions or his statements. As you can tell by the Betsy Ross cosplay that Ryan decided to wear on camera, he is struggling with a number of issues. But neither his domestic violence arrest nor his outspoken support for <mark>Donald Trump</mark> are excused by his mental health. If Eddie had argued that Ryan was refusing to take accountability for his actions and was therefore scapegoating plenty of decent people with mental illness, we would agree. Instead, Eddie decided to make unsubstantiated claims about Ryan's mental state and doubled down upon his unsympathetic words. Not cool. It is entirely possible to hold Ryan accountable and to understand how his mental health and childhood impact his adult life at the same time. Tamra Judge: I'm Scared My Son Is Gonna Kill Himself! Start Gallery Edit Delete Share on Facebook Email", "articleID": "2019112115_00038307_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-11-25", "url": "http://www.thehour.com/entertainment/article/Ryan-Reynolds-Acquires-Ownership-Stake-in-14861557.php", "content": "https: //variety.com/2019/digital/news/ryan-reynolds-acquires-mint-mobile-stake-1203415791/ <mark>Ryan Reynolds</mark> Acquires Ownership Stake in Wireless Carrier Mint Mobile Todd Spangler, provided by Published 2:36 pm EST, Monday, November 25, 2019 Photo: Charles Sykes/Invision/AP / Shutterstock Photo: Charles Sykes/Invision/AP / Shutterstock Image 1 of / 1 Caption Close Image 1 of 1 Photo: Charles Sykes/Invision/AP / Shutterstock <mark>Ryan Reynolds</mark> Acquires Ownership Stake in Wireless Carrier Mint Mobile 1 / 1 Back to Gallery \"Deadpool\" star <mark>Ryan Reynolds</mark> has taken on a new gig as part owner--and pitchman--for low-cost mobile carrier Mint Mobile. Mint Mobile, whose prepaid plans start as low as $15 per month for 3 gigabytes of wireless data, announced that <mark>Reynolds</mark> purchased an ownership stake in the company. The Costa Mesa, Calif.-based company did not disclose the size of <mark>Reynolds</mark>' investment. More from Variety \"Saturday Night Live': <mark>Ryan Reynolds</mark> and <mark>Tracy Morgan</mark> Join Will Ferrell's Monologue (Watch)\" Joker' Passes \"Deadpool 2' to Become the Highest-Grossing R-Rated Movie <mark>Ryan Reynolds</mark>, John Krasinski in Talks for\" Imaginary Friends' Movie Mint Mobile is a \"virtual\" wireless carrier whose service runs on T-Mobile's nationwide network. In connection with the investment, <mark>Reynolds</mark> will \"help with Mint's communications and marketing efforts as well as strategic decision-making,\" according to the company. \"Celebrities generally invest in high-end products like skincare brands or delicious gin companies,\" <mark>Reynolds</mark> said in a statement. \"Yet Mint is making wireless way more affordable at a time when the average American is paying $65 a month. I'm excited to champion a more practical approach to the most essential technology .\" Mint Mobile was previously a division of UVNV Inc., doing business as Ultra Mobile, a virtual wireless provider founded by telecom exec David Glickman in 2012. UVNV recently spun off Mint Mobile as a standalone entity. <mark>Reynolds</mark> tweeted about his stake in Mint Mobile Monday: Related Stories \"Saturday Night Live': <mark>Ryan Reynolds</mark> and <mark>Tracy Morgan</mark> Join Will Ferrell's Monologue (Watch)\" Joker' Passes \"Deadpool 2' to Become the Highest-Grossing R-Rated Movie <mark>Ryan Reynolds</mark>, John Krasinski in Talks for\" Imaginary Friends' Movie Newest @ _MintMobile customer. Also, owner of the company. To keep things above board, I'll be paying myself $15 a month. #MintOwner pic.twitter.com/hrzd8t8T2H--<mark>Ryan Reynolds</mark> (@ VancityReynolds) November 25, 2019 It's not the first business venture for <mark>Reynolds</mark>: Last year, he acquired Portland, Ore.-based Aviation Gin. <mark>Reynolds</mark> recently inked a promotional pact with Samsung and Netflix, tied to Netflix's upcoming \"6 Underground\" original film, with an ad-within-an-ad-within-an-ad campaign telling fans that the best way to watch movies at home is on Samsung's QLED TVs (along with some Aviation Gin). <mark>Reynolds</mark> is repped by WME and the law firm Sloane, Offer, Weber and Dern. Sign up for Variety's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram. View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019112520_00013787_W", "names": {"Ryan Reynolds": ["Q192682", "Q7384463"], "Tracy Morgan": ["Q14542", "Q27119857"]}}, {"date": "2019-11-25", "url": "http://grenfellrecord.com.au/story/6511151/historic-sa-painting-sold-privately/?cs=9397", "content": "Historic SA painting sold privately whatsapp A painting by Adelaide's planner Colonel William Light has sold to a private collector. A 180-year-old painting by Adelaide's planner Colonel William Light that was passed in at auction on Sunday has been sold to a private collector. The watercolour was created by Colonel Light between January and April 1837, around the time he surveyed and laid out the South Australian capital. It was expected to fetch upwards of $100,000 but attracted only one bid of $20,000. Art dealer <mark>Jim Elder</mark> confirmed on Tuesday that the work had since been purchased by a private collector who wanted to remain anonymous and who asked that the sale price not be disclosed. Mr <mark>Elder</mark> said he was bitterly disappointed the painting had passed into private hands. \"This important piece of South Australian history may not be seen again in public for generations,\" he said. \"It has been lost to South Australian society .\" The work spent the past 40 years stored in a camphor wood chest in a garage before being discovered recently by the owner's widow. Before the auction, Mr <mark>Elder</mark> said it was nothing short of a miracle that the painting had survived. \"This is one of the earliest depictions of Adelaide and thus carries significant weight with historians and art collectors alike,\" he said. The work shows a farmhouse with outbuildings and a surrounding settlement of tents and huts with colonists going about their business. Campfire smoke drifts through the gum trees as cattle graze in a nearby clearing. The Mount Lofty Ranges can be seen in the background beneath billowing white clouds. Mr <mark>Elder</mark> said painstaking art history and genealogical research traced the watercolour's provenance back 180 years to a man called Shimmin who worked as a gardener for Colonel Light's fellow surveyor William Jacob on Jacob's Barossa Valley property, Moorrooroo. It had remained in the Shimmin family for generations. Light was a prolific painter and sketcher, often selling his works to support himself, but many were destroyed by a fire at the Land and Survey Office and his adjacent hut in January 1839. He had arrived in the new colony in October 1836 and died of tuberculosis just three years later aged 53. Most of his known remaining works, including an incomplete self-portrait, are housed in the Art Gallery of South Australia, the State Library of South Australia and the Adelaide Town Hall. Australian Associated Press", "articleID": "2019112522_00082127_W", "names": {"Jim Elder": ["Q1150140", "Q6194827"]}}, {"date": "2019-11-26", "url": "https://www.scotsman.com/business/virgin-money-kicks-off-brand-roll-out-to-phase-out-clydesdale-bank-1-5052694", "content": "Virgin Money kicks off brand roll out to phase out Clydesdale Bank The re-branding programme will see the centuries-old Clydesdale Bank name disappear. Picture: John Devlin Hannah Burley Updated: 17:14 Tuesday 26 November 2019 Share this article Sign Up To Our Daily Newsletter Sign up Have your say Virgin Money will open its first wave of \"ground-breaking\" new branches next month as it phases out the Glasgow-headquartered Clydesdale Bank brand. The banking group will open the doors to newly re-branded Virgin Money flagship \"stores\" in Manchester, Birmingham and London in December--the first tranche of a wider roll-out in major cities across the UK. Virgin Money chief <mark>David Duffy</mark> praised the launch. Picture: Contributed It fires the starting gun on a £ 60 million re-branding programme that will see the centuries-old Clydesdale Bank name disappear from the high street. This comes just two months after the group announced it will close Virgin Money's St Andrew Square office in Edinburgh, along with sites in Norwich and Leeds, before the end of the year, as it looked to axe 330 jobs and cut \"duplication\". The Virgin Money brand roll-out follows the acquisition of Virgin Money by CYBG, the owner of Clydesdale and Yorkshire banks, for £ 1.7 billion in 2018. Its new stores, open to both customers and non-customers, are designed to be a place for entrepreneurs to co-work and create, with an offering including free coffee, a venue for events and concerts, and a social media studio for content creation. Alongside this, Virgin Money will also push the button on its first digital current account and mobile app, which it claims will position the group as a \"genuine disrupter\" in the banking market. Virgin Money chief executive <mark>David Duffy</mark> described the new account as \"bringing together the best in digital and mobile technology\" .", "articleID": "2019112617_00056000_W", "names": {"David Duffy": ["Q42888203", "Q5233096"]}}, {"date": "2019-11-29", "url": "https://www.inquisitr.com/5767312/mel-b-another-spice-girls-reunion/", "content": "Fabio Magnocavallo In a recent interview with Grazia, Mel B, also known as Scary Spice, opened up about always wanting another Spice Girls reunion. \"I am always going to hold a candle that we can get back on stage together,\" Mel said. \"I've always supported that and it worked because we all did it this year together. Well, four of us,\" she continued. \"I even sent a text this week to everyone saying,\" Come on, are we going to do something again or what?' We need to. \"According to Music News, Mel's comments came after her other bandmate, Emma Bunton, spoke about another potential reunion .\" We've all got all of our family, our kids, and we love doing stuff together, but it is difficult getting us all to get together to approve things and to make sure we all want to do the same thing, \"the\" Who Do You Think You Are \"chart-topper explained. Bunton stated that they <mark>will</mark> always remain tight friends and occasionally have outbursts of saying they should get back on the road again. Emma did reveal that the Spice Girls have been looking at co-writers for some new music. She didn't announce what it could be for but did hint it could be related to the animated film they are hoping to release. View this post on Instagram It feels like autumn has arrived???? What were your favourite moments of summer 2019? Here are a few of ours???????? #SpiceWorld 2019 A post shared by Spice Girls (@ spicegirls) on Sep 23, 2019 at 9:30 am PDT Earlier this year, the Spice Girls kicked off their reunion tour,\" Spice World 2019 \"in May and performed in stadiums across the U.K. and Ireland. The tour was supported by Jess Glynne for each show and was a complete sell-out. View this post on Instagram Thank you SO MUCH for your incredible support! ❤ ️ ✌???? Can't wait to bring you #SpiceWorld 2019 A post shared by Spice Girls (@ spicegirls) on Nov 27, 2018 at 9:00 am PST Mel B, Mel C, Geri Halliwell, and Bunton all took part in the comeback. However, Victoria Beckham didn't. Loading...According to the Independent, they broke a Ticketmaster record as there were allegedly 700,000 people in the digital queue waiting for a chance to get themselves tickets. As previously reported by The Inquisitr, the group was offered to perform with Adele but turned down the opportunity. While the\" Set Fire To The Rain \"singer may have not sung on stage with them, she did meet them backstage and watch their show. With no confirmation of any future shows, Mel C did admit that if they were offered to play Glastonbury Festival next year, Beckham would join them. In the meantime, Emma <mark>will</mark> continue with her solo career. She <mark>will</mark> be performing her own London Christmas show, titled\" Home For Christmas, \"on December 6 at Royal <mark>Albert Hall</mark>. The show is a one-off and is set to have special guests including her partner Jade, British singer-songwriter <mark>Will Young</mark> and Matt Goss.", "articleID": "2019112913_00017054_W", "names": {"Albert Hall": ["Q1387383", "Q4710404"], "Will Young": ["Q16233670", "Q348906", "Q8003218"]}}, {"date": "2019-12-01", "url": "http://www.theday.com/uconn-sports/20191201/uconn-men-roll-past-maine", "content": "subscribe and support The Day. UConn men roll past Maine UConn's Tyler Polley is pressured by Maine's Nedeljko Prijovic, left, during the first half of Sunday's game at the XL Center in Hartford. (AP Photo/Jessica Hill) UConn's Brendan Adams, left, lines up a dunk as Maine's <mark>Andrew Fleming</mark>, right, defends during the second half of Sunday's game at the XL Center in Hartford. (AP Photo/Jessica Hill) Maine's <mark>Andrew Fleming</mark> grabs a rebound against UConn's Akok Akok, right, during the second half of Sunday's game at the XL Center in Hartford. (AP Photo/Jessica Hill) Published December 01. 2019 5:36 PM Hartford--UConn spends the first hour of every practice working on defense. Nothing else but defense. \"And then we lead to more defense,\" redshirt junior Alterique Gilbert said. \"It's really something that (coach <mark>Dan Hurley</mark>) is emphasizing this year .\" The Huskies are starting to get the desired results from their hard work. An aggressive defense helped turn a tight non-conference game into a runaway, as UConn forced Maine into 28 turnovers on the way to a 64-40 victory before 7,129 fans at the XL Center. It's been 19 years since the Huskies forced that many turnovers, accomplishing the feat against Fairfield. They scored 28 points off the turnovers and also had a season-high 13 steals. \"That's probably the most important thing for us this year is defensive pressure,\" sophomore Brendan Adams said. \"We've got a lot depth so we can run guards and bigs in and out and just keep pressuring the ball .\" Adams and freshman James Bouknight provided a spark off the bench, scoring 11 and a team-best 15 points, respectively. Gilbert (13 points) and junior Tyler Polley (12 points) also hit double figures for the Huskies (5-2). The Huskies entered Sunday's game looking to build on the success that they experienced in the Charleston Classic in South Carolina. Their performance wasn't a thing of beauty, but did the job. They never trailed and led by as many as 24. <mark>Hurley</mark> felt the Huskies didn't take full advantage of their athleticism and edge in talent and depth. They showed signs of immaturity and struggled to finish at the rim, he added. \"I was thrilled with the first two minutes and happier with the last 20...,\" <mark>Hurley</mark> said. \"Coming out of this, we've got to get better offensively. We're not going to be able to out-tough and out-heart the better teams because all the better teams play really hard .\" ...We're not there yet. We've got a lot of work to do. \"Up until UConn's pressure defense changed the game early in the second half, Maine (2-5) controlled the tempo, slowing the action down to a crawl. The Huskies, who shot just 38 percent from the field, needed something to lift them out of an offensive funk. The defense provided the necessary jolt, forcing nine turnovers during a four and a half minute stretch to help ignite a 17-2 spurt that pushed a five-point lead to 20. The Huskies extended their pressure defense and Maine, which was playing without its starting point guard, crumbled. Adams was in the middle of the action. He stole the ball and took off for fast break layup. Then after making a steal, senior Christian Vital fed Adams who rose up a monster dunk over a Maine player for a 42-30 lead .\" That felt great, \"Adams said with a smile. The Huskies kept attacking, building a 52-32 lead with 11:28 left on Jalen Gaffney's steal and transition basket. They cruised to the finish line from there .\" Coach was emphasizing all week that we need to pressure them and pressure them for 40 minutes, \"Vital said .\" If you didn't do that, you were coming out of the game. It's fun as hell to play like that. \"Maine coach <mark>Richard Barron</mark> called UConn's defense elite. The Black Bears shot an icy 35 percent from the field .\" UConn really came out and got in our shorts and made it tough on us, \"<mark>Barron</mark> said. Expect defense to continue to be the backbone for the Huskies this season. They're embracing <mark>Hurley</mark>'s defensive mindset .\" We practiced hard at it and that's what we're definitely going to keep doing all season, \"said Adams who finished with a career-best four steals. <mark>Hurley</mark> has seen improvement in his team's defense since the beginning of the season. But he's far from satisfied .\" We made a big jump just in terms of numbers, \"<mark>Hurley</mark> said .\" Akok (Akok) has helped us so much at that end of the court. Guys are a year more experienced and we emphasize it every day. \"Your only chance to play in any type of significant way in March is if you're a top 50 defensive team. And we're right around that number right now in terms of efficiency. I didn't think we were great today. I thought we had some breakdowns and we'll look at it and get it fixed .\" News and notes The Huskies played without reserve Sidney Wilson, who's sidelined with a knee injury. He may be ready to return for Wednesday's game against Iona in Storrs. \"We got best case scenario news,\" <mark>Hurley</mark> said. \"We're hopeful that he'll be able to do more (Monday).\" ...GIlbert, who entered the game shooting 22 percent, made his first two shots--both three-pointers--and finished 5 for 8 from the field. \"It was just good to see the ball go in,\" said GIlbert, who had 11 points in the first half. g.keefe @ theday.com", "articleID": "2019120122_00114267_W", "names": {"Andrew Fleming": ["Q30126071", "Q4756965", "Q504683", "Q504706", "Q57273195"]}}]