[{"date": "2019-12-02", "url": "http://www.rotoworld.com/article/team-news/late-fitness-check-round-15", "content": "December 2, 2019, 6:39 pm ET Updated On: December 2, 2019, 6:51 pm ET Print Round 15 arrives quickly on the heels...but with games spread across three days, getting a handle on the team news is difficult ahead of the FPL deadline. Only five managers clocked in on Monday, those involved in fixtures on Tuesday, and <mark>Brendan Rodgers</mark> less than 24 hours after his sides last gasp win over Everton. Make sure you're following throughout the build-up for all the latest Premier League updates. Our Player News page contains breaking headlines while last-minute injury updates are added to the Injury Report. Good luck! Follow the entire Rotoworld Premier League team on Twitter: Neal | Steve | <mark>Andrew</mark> | Sean | Stag | <mark>Ben</mark> | Nik Crystal Palace--vs--AFC Bournemouth Mamadou Sakho is set for a possible recall to the starting XI as the Eagles defensive options become stretched. <mark>Scott Dann</mark> was sent for a scan on Monday after picking up an ankle injury at Turf Moor. \"We hope it's not a ligament issue. We hope it's a kick, but of course, it's far too soon, too close to the game for him to recover so he'll miss tomorrow's game .\" <mark>Gary Cahill</mark> (knee) is also sidelined. \"We hope to recover the pair of them for the game at the weekend [Watford].\" No fresh injury concerns from Saturday, the squad came through the defeat to Tottenham relatively unscathed. <mark>Simon Francis</mark> and Philip Billing are back in contention after serving a ban in week fourteen. Lloyd Kelly (thigh) is edging closer while Junior Stanislas (knee) is back on the training pitches, although after several months out, it may be next year before Eddie Howe considers the winger. <mark>Andrew Surman</mark> is working with the group, but <mark>Charlie Daniels</mark> and <mark>David Brooks</mark> remain sidelined. <mark>Adam Smith</mark> missed out on Saturday due to illness, and a decision on his availability could be made closer to kick-off. It's still a little too soon for <mark>Joshua King</mark> (hamstring). Burnley--vs--Manchester City <mark>Charlie Taylor</mark> continues to be assessed, but the early indications are that he did not suffer a serious hamstring injury against Crystal Palace. However, with the quick turnaround, Sean Dyche will look to make a late call. Erik Pieters is a ready-made replacement, and despite picking up a knock, he is expected to start at left-back. <mark>Ashley Westwood</mark> is available after suspension, although the midfielder is struggling with a slight groin problem and faces a late test. Tuesday will come too soon for Johann Berg Gudmundsson who is back on the grass and working with the physios. \"He is building up his power and sharpness, and that is the final bit to come .\" Danny Drinkwater is \"as close as you can get\" in terms of his fitness, and Matej Vydra is fit after recovering from a hip injury. Pep Guardiola reveals Sergio Agüero will miss the Manchester derby (GW16) after failing to recover from a muscular issue. Ilkay Gundogan is suspended for Tuesday, so expect a return for Rodri who was left out of the draw on Tyneside until the 84th minute. No other injury concerns - Aymeric Laporte and Leroy Sané remain out until early 2020 - while <mark>Oleksandr Zinchenko</mark> is back on the training pitches. Fernandinho will continue at centre-back as Pep prefers the Brazilian to be in his backline, which is why Stones/Otamendi have not been paired together. Leicester City--vs--Watford Demarai Gray is the only fitness concern for Wednesday; the winger has been ill over the weekend. \"Everyone else is fine,\" apart from long-term absentee Matty James (Achilles). Three months (or just 85 days). That was all the time afforded to Quique Sanchez Flores in his second spell at the club before results ultimately dictated the board's decision to sack the 54-year-old. Hayden Mullins will take temporary charge of the Hornets with an extensive injury list...Up to eight players are at risk of missing out, and with a press conference still to come, I'll focus on the definites, the maybes, and those almost there. Danny Welbeck is out until the new year, and it's difficult to see Sebastian Prodl or Tom Cleverley returning for this one given the game time they've missed. Daryl Janmaat and Christian Kabasele - knee and hamstring respectively--can't be ruled out entirely as the severity of their injuries remains unclear. Craig Dawson is best placed to return despite stitches in a head wound. Kiko Femenía suffered a knock at St Mary's and QSF had suggested that one of his substitutes was injured during the warm-up, and that was the reason Andre Gray came on to replace Gerard Deulofeu. That suggests Troy Deeney, Domingos Quina or <mark>Roberto Pereyra</mark> won't be ready. Manchester United--vs--Tottenham Hotspur Ole Gunnar Solskjaer is hopeful of having Scott McTominay or Paul Pogba back for the game on Wednesday as the pair step up their recovery. The former seems best placed as he had been touted for a return in week 14, but Pogba won't be too far away following a stint in the US to build fitness. Anthony Martial is one to watch; his withdrawal may have been enforced, although there was no mention of a problem post-match. Assessments will continue throughout the build-up to the game, and last-minute decisions are not uncommon with such a quick turnaround. Luke Shaw returned to the matchday squad but looks way off the pace after more than three months out, so <mark>Brandon Williams</mark> should keep his place. Eric Bailly, Timothy Fosu-Mensah, <mark>Marcos Rojo</mark>, Nemanja Matic and Diogo Dalot remain sidelined. Jose returns to his former stomping ground and Spurs will be looking to make it four straight wins, although they will need to be a bit more Mourinho-like after conceding twice in each of the last three. Jan Vertonghen and Tanguy Ndombele were back in the XI on Saturday, but unless Christian Eriksen commits his future to the club, then his game time looks to be very limited. No fresh concerns--Hugo Lloris, Michel Vorm, <mark>Ben Davies</mark> and Erik Lamela are out--although the Argentine is in the last phase of his conditioning before re-joining the group. Wolverhampton Wanderers--vs--West Ham United Romain Saiss comes back into contention with Max Kilman, who made his full Premier League debut on Sunday, being the player most likely to miss out. The status of <mark>Ryan Bennett</mark> (groin) and Morgan Gibbs-White is unknown, but both have been managing issues for a while now, and I wouldn't expect a great deal of change within 48-72 hrs. Willy Boly is progressing and is on schedule to return in January. Saturdays' coupon buster--a win at Stamford Bridge--ended a run of eight games (all comps) without victory and Manuel Pellegrini will be hoping for more of the same. Michail Antonio will need to be checked after his first start in over three months, and with Issa Diop back in the frame, Fabián Balbuena could make way. <mark>David Martin</mark>, 33, and son of former West Ham legend Alvin kept a clean sheet on his debut and looks set to continue with <mark>Roberto</mark> missing out. Jack Wilshere is training, alongside <mark>Winston Reid</mark>, but it's too soon, and neither will be considered. Chelsea--vs--Aston Villa <mark>Frank Lampard</mark> will give Tammy Abraham every chance to prove his fitness ahead of the game. \"We will find out more today and tomorrow. He needs to get outside and move a little bit over the next two days .\" If he fails to recover, then the Blues boss suggested that Christian Pulisic is an option. \"He does have an ability to run behind the line, and to be sharp in central areas which will naturally get him more goals .\" He also went onto add that the decision to play Olivier Giroud over Michy Batshuayi was just a \"choice for this game .\" No sign of Ross Barkley and Antonio Rüdiger needs to get \"properly fit\" following knee and muscle injuries which have kept him sidelined for the best part of seven months. El Mohamady could start his first league game since August after Frédéric Guilbert collected his fifth caution of the season at Old Trafford. And <mark>Dean Smith</mark> may be forced into a second change with El Ghazi a major doubt due to a knee injury, the Dutchman was replaced by Trézéguet after just 18 minutes, and the winger is expected to keep his place. Bjorn Engels has recovered from a hip issue, but the defender will struggle to displace Ezri Konsa who has grasped his opportunity with both hands. Jed Steer (Achilles) is out for around three months, and Jota is training after groin surgery, but he lacks conditioning and will build fitness behind-closed-doors. Southampton--vs--Norwich City The Saints staged a remarkable comeback to take an unlikely three-points in the late kick-off on Saturday, a victory which ultimately cost Sanchez Flores his job. Danny Ings started the ball rolling in the 78 th minute--his seventh of the campaign--before James Ward-Prowse capped his man-of-the-match performance with a stunning free-kick. The pair are responsible for the Saints' last ten league goals. Stuart Armstrong (hamstring) is the only confirmed injury doubt, and the Scot is pencilled in for a return in week seventeen. The Canaries almost made it back-to-back wins, but Arsenal came from behind for a share of the spoils. Pukki got the party underway, and Todd Cantwell followed up his goal at Goodison Park with his fourth of the season. The return of <mark>Christoph Zimmermann</mark> cannot be underestimated, and the big German has offered some solidity to the Norwich backline, something which they missed in his absence. There was no Alex Tettey on Sunday due to personal reasons, and the midfielder is the only one of those who were unavailable in week 14 who stands a realistic chance of returning. Liverpool--vs--Everton Adrián will start in the Merseyside derby following Alisson's dismissal against Brighton. Jurgen Klopp said the \"frozen\" goalkeeper was his man-of-the-match on Saturday after two \"really good saves .\" Ballon d’Or runner-up Virgil Van Dijk was the pundit's choice with two headed first-half goals which helped the Reds to another three-points. Fabinho (ankle) will probably not feature again this year, while there is no timeline for Joel Matip (knee) who was scheduled for a follow-up scan last Friday. <mark>Marco Silva</mark> is hanging on in there, but another defeat here could see the Portuguese boss relieved of his duties with Everton sitting in 17 th just two points above the drop zone. Theo Walcott and Fabian Delph will be checked, but even though Morgan Schneiderlin made the bench on Saturday, the midfielder was not 100 per cent. Jean-Philippe Gbamin, <mark>André Gomes</mark> and Seamus Coleman are already confirmed as out. Sheffield United--vs--Newcastle United Chris Wilder is expected to confirm that his squad have a clean bill of health following the return of <mark>John Egan</mark> (calf) on Sunday. Lys Mousset continued his rich vein of form at Molineux, and his 5-goals have helped the newly-promoted side climb to seventh in the table. Allan Saint-Maximin probably offers Newcastle's biggest attacking threat, so Steve Bruce will be hoping the Frenchman can shake off a minor knock. The additional recovery time for the Thursday night kick-off will undoubtedly help...Andy Carroll should be close after missing out on Saturday with a rib injury, and a decision on DeAndre Yedlin (groin) will be left until late - Javier Manquillo could deputise once again. Jamaal Lascelles (knee) is out while Fabian Schär must be patient after losing his place; the <mark>Federico Fernandez</mark> and Ciaran Clark partnership has worked well with Paul Dummett making up the central trio. Florian Lejeune can be called upon if required. Arsenal--vs--Brighton and Hove Albion Freddie Ljungberg suggested that the performances of Pepe in training meant that the big-money summer signing would not be considered for a starting berth. Indeed, the Ivorian was an unused substitute during the draw at Carrow Road. Shkodran Mustafi was back for the first time on Sunday, but it was the same old Arsenal who were lucky to leave Norwich with a point. There has been very little mention of Rob Holding--not listed on the site as injured--although he has been carrying a knee problem. Héctor Bellerín's hamstring will be tested after missing the last two. No Dani Ceballos until mid-December following his injury in the Europa League. Brighton were very unfortunate to leave Anfield with nothing, after a slow start the Seagulls steadily grew into the game, and following Alisson's sending off, Graham Potter's men took the game to the league leaders. However, the result means that they have now lost 4 of their last six away matches and the Emirates will be another tough test. Aaron Connolly was handed an immediate recall, but with Leandro Trossard and Neal Maupay both champing at the bit to be involved, Brighton have lots of attacking options. It may or may not include Solly March who is managing a slight groin problem. Bernardo returned for the U23s last week, and it remains to be seen whether the full-back is deemed fit enough for the first team after close to three months on the sidelines. <mark>Ben</mark> Dinnery", "articleID": "2019120300_00005437_W", "names": {"Joshua King": ["Q436237", "Q57433295", "Q58137018"], "Marco Silva": ["Q20118419", "Q57025699", "Q6757714"], "Marcos Rojo": ["Q27916806", "Q507890"], "Oleksandr Zinchenko": ["Q1803666", "Q19636859"], "Roberto Pereyra": ["Q42398698", "Q55468620", "Q93504"], "Ryan Bennett": ["Q2053661", "Q57837483"], "Scott Dann": ["Q16214802", "Q448074"], "Simon Francis": ["Q7518777", "Q7518785"], "Winston Reid": ["Q150289", "Q8026119"]}}, {"date": "2019-12-02", "url": "http://screenrant.com/star-wars-new-hope-alec-guinness-hated-dialogue/", "content": "Star Wars: Why Alec Guinness Hated Working On A New Hope Comment Email Copy Link Copied Here's why Alec Guinness hated his experience filming. Back when <mark>George Lucas</mark> was first creating the now iconic franchise, no one knew what it would become. But, the movie took the world by storm and introduced everyone to the galaxy far, far away. In doing so, Star Wars launched the acting careers of Carrie Fisher, Mark Hamill, and Harrison Ford. A New Hope Amid this cast of newcomers though was Alec Guinness as the wise old Jedi, Obi-Wan Kenobi. He helped bring some early legitimacy to the project thanks to his extensive and acclaimed filmography. By this point in Guinness' career, he had already won an Academy Award for his performance in The Bridge on the River Kwai, was nominated for his work in The Lavender Hill Mob, and even received a nomination as a writer on The Horse's Mouth. He also was featured in a major role in Lawrence of Arabia. In many ways, his presence in the film helped bring a sense of believability to this new mythology <mark>Lucas</mark> created - but Guinness was not a fan. Related: Star Wars: Every Change <mark>George Lucas</mark> Made To Han Killing Greedo Guinness made for a great Obi-Wan in the original trilogy but did not enjoy his experience with A New Hope. He only took the role after his higher salary demands were met. But, his doubled pay did not keep him happy throughout the production process. As discussed in the latest Screen Rant video, Guinness hated working on the film and his chief complaint was <mark>Lucas</mark>' dialogue. He said in a since published letter that the writing was \"rubbish\" and was not pleased that \"none of it makes my character clear or even bearable .\" He is hardly the only actor to not like the movie he worked on though, so check out the video for more such examples. Although Guinness' top complaint about A New Hope was the constantly rewritten dialogue, there were other issues he had with the production. He lamented the conditions of filming in another letter, saying that the shoot was \"tedious to a degree - hot, boring and indecisive .\" Guinness also struggled to connect with his much younger co-stars. Despite all of his dissatisfaction for A New Hope, Guinness did not let any of it stop him from putting his best foot forward. He was rewarded in 1978 with another Academy Award nomination, this time for playing Obi-Wan - rubbish dialogue and all. While Guinness may have helped make <mark>Lucas</mark>' dialogue work, his complaint about the quality of it has been shared by other actors in the franchise. It's also no secret that dialogue is not <mark>Lucas</mark>' strong suit. He's proven to be an exceptional storyteller with a vision for the big picture and pushing the limits of technology, but he's just not as great with the dialogue. While <mark>Lucas</mark> wrote all on his own, Lawrence Kasdan was brought aboard to help fine-tune the sequels with <mark>Lucas</mark> passing directing duties to others. So, hopefully Guinness was happier with the dialogue he received in his future appearances. Star Wars: A New Hope Star Wars 9 / Star Wars: The Rise of Skywalker (2019) release date: Dec 20, 2019 Share Subscribe for the hottest movie, TV, and gaming news! I agree to let Screen Rant send me emails. ScreenRant.com values your privacy. We and our trusted partners use cookies and tracking technologies to create custom content for your enjoyment and to provide advertising in line with your interests. Screen Rant--Privacy Policy We respect your privacy and we are committed to safeguarding your privacy while online at our site. The following discloses the information gathering and dissemination practices for this Web site. This Privacy Policy was last updated on May 10, 2018. Legal Ownership Screen Rant (the \"Website\" ) is owned and operated by Valnet inc. (\"us\" or \"we\" ), a corporation incorporated under the laws of Canada, having its head office at 7405 Transcanada Highway, Suite 100, Saint Laurent, Quebec H4T 1Z2. Personal Data Collected When you visit our Website, we collect certain information related to your device, such as your IP address, what pages you visit on our Website, whether you were referred to by another website, and at what time you accessed our Website. We do not collect any other type of personal data. If you are accessing our website through a social media account, please refer to the social media provider's privacy policy for information regarding their data collection. Log Files Like most standard Web site servers, we use log files. This includes internet protocol (IP) addresses, browser type, internet service provider (ISP), referring/exit pages, platform type, date/timestamp, and number of clicks to analyze trends, administer the site, track user's movement in the aggregate, and gather broad demographic information for aggregate use. Cookies A cookie is a piece of data stored on the user's computer tied to information about the user. We and some of our business partners (for example, advertisers) use cookies on our Website. These cookies track usage of the site for security, analytics and targeted advertising purposes. We use the following type of cookies: Essential cookies: these cookies are essential to the provision of our Website. Functionality cookies: these cookies help us remember choices you have made while on our website, remember your preferences, and personalize your Website experience. Analytics and performance cookies: these cookies help us collect statistical and analytical usage to help up analyze website usage. Social media cookies: These cookies allow you to interact with content on certain social media platforms, such a \"liking\" our articles. Depending on your social media setting, the social media network will have record of this and may display your name or identifier in relation to this action. Advertising and targeted advertising cookies: these cookies track your browsing habits and location to provide you with advertising in line with your interests. Please see our \"advertisers\" section below for details. If you wish to disable cookies, you may do so through your individual browser options. For further information regarding cookies and how to manage them, please see http: //www.allaboutcookies.org/. Pixel tags We use pixel tags, which are small graphic files that allow us and our trusted third party partners to track your Website usage and collect usage data, including the number of pages you visit, the time you spend on each page, what you click on next, and other information about your Website visit. Advertisers We use third-party advertising companies to serve ads when you visit our Web site. These companies may use information (not including your name, address, email address or telephone number) about your visits to this and other Web sites in order to provide advertisements about goods and services of interest to you. If you would like more information about this practice and to know your choices about not having this information used by these companies, click here. Advertisers, as third-party vendors, use cookies to collect usage and demographic data in order to serve ads on our site. For example, Google's use of the DART cookie enables it to serve ads to our users based on their visit to our sites and other sites on the Internet. Users may opt out of the use of the DART cookie by visiting the Google ad and content network privacy policy. We have reviewed all of our advertising partners' policies to ensure that they comply with all applicable data privacy laws and recommended data security practices. We use the following advertisers:", "articleID": "2019120302_00152044_W", "names": {"George Lucas": ["Q1507803", "Q38222"]}}]