[{"date": "2019-12-03", "url": "https://www.prokerala.com/news/articles/a984040.html", "content": "Nissan Image Source: PK Road accident. Image Source: PK Washington, Dec 3: Two Indian students were killed in a hit-and-run incident in the US state of Tennessee, with the accused surrendering himself to the police, media reports said. The accident took place on Thanksgiving Day on November 28 and the victims were identified as Vybhav Gospisetty, 26, and Judy Stanley Pinheiro, 23, who were both Indian graduate students at the Tennessee State University, the Knoxville-based WVLT-TV said in a report. The accused <mark>David Torres</mark>' GMC truck reportedly collided with the 2015 Nissan Sentra, which Gospisetty was driving with Pinheiro sitting in the front seat. The Sentra reportedly attempted to cross Nolensville Pile from the parking lot of the US Bank to Walmart. Police said the truck hit the passenger side of the car as it was driving north. The car was sent off the east side of the road, through a fence and into a tree on Walmart property, according to the WVLT-TV report. Witnesses told police that the GMC was speeding and ran the red light at the intersection. <mark>Torres</mark> surrendered on December 1 to the Metro Nashville Police. The university also released a statement, saying: \"The Tennessee State University family is mourning the loss of two students killed in an auto accident on Thanksgiving night. Judy Stanley, 23, and Vybhav Gopisetty, 26, were both graduate students from India pursuing food science degrees in the College of Agriculture. Stanley was seeking a master's, and Gopisetty a doctorate .\" ", "articleID": "2019120305_00131507_W", "names": {"David Torres": ["Q5797514", "Q5800412"]}}, {"date": "2019-12-03", "url": "http://daijiworld.com/news/newsDisplay.aspx?newsID=649837", "content": "<mark>Reynolds</mark>' tweets praise over clipping of girl students singing \"Believer' <mark>Reynolds</mark>' tweets praise over clipping of girl students singing\" Believer' Tue, Dec 3 2019 09:03:12 PM New Delhi, Dec 3 (IANS): A video clipping of a group of schoolchildren rendering Imagine Dragon's popular song Believer has created quite a buzz on social media. The well-synchronised singing by the girls' choir left people praising the effort. The band's lead singer <mark>Dan Reynolds</mark> also tweeted his praise. A Twitter user posted the clipping a week ago and wrote: \"Schools in India are singing Believer in morning assembly .\" The post got 2.2 K retweets and 9.3 K likes. <mark>Reynolds</mark> wrote on @ DanReynolds: \"So beautiful. Thank you for sharing this .\" The fan replied back: \"Thanks for replying. Big fan of your work .\" One user conjectured that it was sung in the morning assembly. But another differed: \"This is definitely St Charles School in Bengaluru. This is not assembly. Rather they are practising for their school function which was held last week .\" When one user objected to the singing of the song in the morning assembly, one Twitter user posted: \"People can find controversy in everything. Find religion in music. And I thought music has no language .\" --IANS You have 2000 characters left. Disclaimer: Please write your correct name and email address. Kindly do not post any personal, abusive, defamatory, infringing, obscene, indecent, discriminatory or unlawful or similar comments. Daijiworld.com will not be responsible for any defamatory message posted under this article. Please note that sending false messages to insult, defame, intimidate, mislead or deceive people or to intentionally cause public disorder is punishable under law. It is obligatory on Daijiworld to provide the IP address and other details of senders of such comments, to the authority concerned upon request. Hence, sending offensive comments using daijiworld will be purely at your own risk, and in no way will Daijiworld.com be held responsible. Security Validation", "articleID": "2019120315_00260125_W", "names": {"Dan Reynolds": ["Q5214274", "Q5214275"]}}, {"date": "2019-12-04", "url": "http://www.maldonandburnhamstandard.co.uk/uk_national_sport/18079177.osullivan-cruises-last-16-despite-running-injury/", "content": "National Sport News O'Sullivan cruises into last 16 despite running injury By Sportsbeat staff O'Sullivan cruises into last 16 despite running injury Five-time world champion Ronnie O’Sullivan admitted a recurring foot injury was affecting his credentials at the table despite cruising into the Betway UK Championship last 16. The 43-year-old hadn't dropped a frame en route to a third-round clash with Thailand's Noppon Saengkham, and continued his comfortable progression at the first Triple Crown event of the season with a 6-2 win over his world No. 32 opponent. But while O’Sullivan safely continued his journey toward the defence of his crown--in what would be a record eighth win at the York Barbican--he explained an old running injury was threatening his ongoing performances. \"My foot's in a lot of pain,\" he said. \"I've had problems with it for ages and I've been trying to rest it but running's something I really love and I'm not prepared to stop forever .\" I can feel it in the arena and it affects my back, but I'll just have to manage it, not run on the days I'm not playing and hopefully it'll be OK. \"It was an enjoyable game against Noppon. The conditions were hard, and it was quite difficult to score and get in amongst the balls .\" The table played a lot easier in the first two rounds which made it harder but I quite enjoyed the challenge out there and I'm pleased to get through. \"With Judd Trump having been knocked out by veteran Nigel Bond on Monday, O’Sullivan has emerged as the outright favourite to lift the trophy, but he insisted anyone left in the tournament is capable of winning on their day. And with a mouth-watering match-up against two-time UK Championship winner Ding Junhui next up, the Londoner is confident he and his counterpart can produce a snooker spectacle for fans around the world. He said:\" There should be a lot of people watching that match--here and in China. I have a good following in China and I love my time out there so it should be good fun. \"Ding seems to be playing well. I haven't been taking too much notice and I just take care of my own business, but he's been beating some good players so I'm sure it'll be a tough test .\" The tournament changes as it goes on and the main arena reduces to two tables. It's going to be a good occasion, for sure. \"Watch the UK Championship live on Eurosport and Eurosport Player with analysis from Ronnie O’Sullivan and <mark>Jimmy White</mark>.", "articleID": "2019120413_00062087_W", "names": {"Jimmy White": ["Q27942290", "Q366681", "Q6201553", "Q6201558"]}}, {"date": "2019-12-04", "url": "https://www.sciencedaily.com/releases/2019/12/191204090753.htm", "content": "Follow all of ScienceDaily's and! latest research news top science headlines Science News New screening method identifies potential anticancer compounds that reawaken T cells The technique may be useful in developing new combination-immunotherapy regimens against cancers and persistent infections Date: Scripps Research Institute Summary: Scientists have developed a method for rapidly discovering potential cancer-treating compounds that work by resurrecting anti-tumor activity in immune cells called T cells. Cancerous tumors often thrive because they render T cells dysfunctional or \"exhausted .' The new method uncovers medicinal compounds that can restore the function of these T cells, making cancers vulnerable to them again. Share: FULL STORY Scientists at Scripps Research have developed a method for rapidly discovering potential cancer-treating compounds that work by resurrecting anti-tumor activity in immune cells called T cells. advertisement Cancerous tumors often thrive because they render T cells dysfunctional or\" exhausted. \"The new method uncovers medicinal compounds that can restore the function of these T cells, making cancers vulnerable to them again. The approach, described in a study published in Cell Reports, may also help restore T-cell responses to persistent infections from viruses or other pathogens. It therefore should speed the development of new cancer and infectious-disease immunotherapies, including those that can be combined with existing immunotherapy drugs to enhance their effects. The scientists demonstrated the potential utility of the approach by using it to rapidly screen a collection of more than 12,000 drug compounds--uncovering 19 that can reawaken exhausted T cells .\" This new screening method should be particularly useful because we can use it not only to identify compounds that restore needed function to exhausted T cells, but also to quickly analyze these T cells to determine how these compounds work on them, \"says senior author Michael Oldstone, MD, Professor Emeritus in the Department of Immunology and Microbiology at Scripps Research. The new screening system--and to some extent, the wider field of cancer immunotherapy--is based in part on research over the past several decades by Oldstone's laboratory and several former lab members including Rafi Ahmed, <mark>David Brooks</mark>, and John Teijaro, along with other scientists that have conducted animal-based research on how the immune system responds to lymphocytic choriomeningitis virus (LCMV). A unique variant of LCMV known as\" clone 13 \"establishes a persistent infection by exhausting the virus-specific T cells that are required to clear the infection. It does this by boosting signals through T-cell receptors such as PD-1 and IL-10. The discovery that LCMV clone 13 can survive by switching off anti-LCMV T cells was quickly followed by the recognition that cancers often persist using the same trick. advertisement Immunotherapies that block signaling from PD-1 or similarly acting receptors to restore T cells' anti-cancer responses are among the most powerful cancer medicines available today. These therapies save many patients who in the past had seemingly untreatable tumors. But because treatment with these drugs typically works well for only a few cancers, including melanoma--and less often on other cancers--scientists suspect that cancers usually hijack multiple inhibitory T-cell pathways. This suggests that a combination of immunotherapies directed to different molecular pathways could be more effective than the current therapy .\" The idea now is to develop more immunotherapy drugs and find the best combinations of them, \"Oldstone says. A promising hit The new screening system is designed to enable scientists to swiftly find such drugs--in this case, pharmacologically active small-molecule compounds that might work better than, or augment, the current injectable antibody immunotherapies now available. The system uses T cells that have been exhausted by LCMV clone 13 and detects signs of renewed activity in these cells when a tested compound works to reawaken them. An advantage of the new screening system is that it is specific and highly automated; thus, thousands of compounds can be tested within days, with the\" hits \"verified in experiments involving mice. Oldstone and colleagues applied the new screening system to a drug repurposing library of more than 12,000 compounds that either are FDA-approved or have been tested as potential drugs. They quickly identified 19 hits--compounds that, at modest doses, can effectively resurrect the activity of exhausted T cells. One of these compounds, ingenol mebutate, is a plant-derived molecule that is already used in gel form (Picato) to treat actinic keratosis, a pre-cancerous skin condition. The researchers employed elements of their screening system to study the reactivated T cells and determined that ingenol mebutate restores function for these cells largely by activating signaling enzymes called protein kinase C enzymes, a known pathway of activity for this compound. Co-first authors of the study, postdoctoral fellows Brett Marro, PhD and Jaroslav Zak, PhD, in the Department of Immunology and Microbiology, are currently collecting and exploring the therapeutic potential of other reported hits that may work in combination with treatments that block PD-1 - and another T-cell-inhibitory receptor, CTLA-4. Indeed, one such hit in combination with antibody to PD-L1 is already undergoing evaluation in patients. Oldstone notes that the new screening approach is flexible enough to adapt for finding compounds that have other effects on T-cells, such as reducing T-cell activity to treat autoimmune conditions. make a difference: sponsored opportunity Story Source:", "articleID": "2019120416_00206725_W", "names": {"David Brooks": ["Q16105043", "Q19948555", "Q27909737", "Q28498255", "Q31151243", "Q5231788", "Q5231789", "Q5231790", "Q938475"]}}, {"date": "2019-12-04", "url": "http://telegraphindia.com/india/india-worst-climate-victim-report/cid/1724363", "content": "India India worst climate victim: Report The report places India at fifth position in overall \"climate vulnerability' in 2018, behind Japan, the Philippines, Germany and Madagascar By Jayanta Basu in Madrid Published 5.12.19, 2:05 AM 2 mins read The Global Climate Risk Index 2020, released by the non-profit Germanwatch on the sidelines of the UN climate change meeting in Madrid, says India witnessed 2,081 deaths--the highest in the world--caused by extreme weather events in 2018, followed by Japan with 1,282. (Shutterstock) India has become the world's worst victim of extreme weather events driven by climate change, with a sharp increase in climate-linked deaths and economic damage in recent years, analysts said in a report released on Wednesday. The Global Climate Risk Index 2020, released by the non-profit Germanwatch on the sidelines of the UN climate change meeting in Madrid, says India witnessed 2,081 deaths--the highest in the world--caused by extreme weather events in 2018, followed by Japan with 1,282. In 2017, India was in second position. The report places India at fifth position in overall\" climate vulnerability \"in 2018, behind Japan, the Philippines, Germany and Madagascar. Analysts said this marked a significant fall from India's 14th position in an analysis for 2017. According to the report, India's economic losses from extreme weather events touched $37,808 million (Rs 2.7 lakh crore) in 2018, almost a threefold rise since 2017. India has been ranked third on climate-linked fatalities and economic losses over the two-decade period spanning 1999 to 2018 .\" A series of extreme weather events impacted India in 2018, \"Vera Kunjel, the report's lead author, told The Telegraph. The extreme weather events included the heavy rainfall and floods in Kerala, the tropical cyclones Gaja and Titli, and a prolonged heat wave .\" All of these have collectively propelled India into the position of being the country worst hit by extreme weather, \"Kunjel said. The report said the Kerala disaster was\" the worst in a hundred years \"and that India was\" affected by extreme heat in both 2018 and 2019 \". The reportsaid that since 2004, India had experienced 11 of its 15 warmest years on record. Maik Winges, another of the report's authors, said that although the developing countries continued to bear the brunt of climate change, two developed countries--Japan and Germany--had for the first time occupied positions among the three worst-hit nations .\" This is a clear signal that the impacts of climate change are (being witnessed) everywhere, \"Winges said. <mark>Harjeet Singh</mark>, global climate lead of ActionAid, said the long-term climate effects documented in the report underlined the importance of implementing a\" loss and damage \"process under the global climate pact. UN climate negotiations have included discussions on loss and damage, which propose that the developed countries should provide support, including finance, to the developing and underdeveloped countries affected by climate change. The argument is that the less developed nations bear less responsibility for the greenhouse gas emissions that have triggered climate change. Although a mechanism was set up during the Warsaw climate summit in 2013 to work on loss-and-damage-related issues, sustained opposition from the developed countries, especially their resistance to providing funds, has put it on the backburner .\" It is expected that loss and damage will be a key issue during the negotiations in Madrid, \"Aarti Khosla of Climate Trend said. Tags", "articleID": "2019120421_00158670_W", "names": {"Harjeet Singh": ["Q15102143", "Q21336246", "Q21898054", "Q28043301", "Q47086639"]}}, {"date": "2019-12-05", "url": "http://www.gamereactor.eu/?system=3ds&sid=9ce0e3f8e1d233b69dc109bb4450e466", "content": "3DS Catch all the news from the world of competitive gaming, as well as the latest details about Gamereactor's own CS: GO League. GRTV Vatican priest sets up a Minecraft server for players to join Written by <mark>Sam Bishop</mark> on the 3rd of December 2019 at 11:36 Nothing ungodly will be going on here, as it's \"about getting people together who can then maybe move those relationships to the real world\". We explore Layton's Mystery Journey on today's stream Written by <mark>Sam Bishop</mark> on the 14th of November 2019 at 11:56 Katrielle and the Millionaires' Conspiracy might be a mouthful, but we're ready to chew on the various puzzles inside. Written by <mark>Sam Bishop</mark> on the 12th of October 2019 at 10:41 The series is over 30 years old, and they've shared some little tidbits of information with fans. Mario & Luigi developer AlphaDream files for bankruptcy Written by <mark>Sam Bishop</mark> on the 3rd of October 2019 at 09:25 The filing took place this week with the Tokyo District Court, and they were responsible for many Mario & Luigi games. Minecraft is getting a Nether Update Written by <mark>Sam Bishop</mark> on the 30th of September 2019 at 11:36 This adds new biomes, increased accessibility, Piglins, and more to the game, since Mojang wants you to explore more of the Nether. Written by Jonas Mäki on the 23rd of September 2019 at 11:44 It's time to sing \"happy birthday to U\" with Nintendo celebrating a huge milestone today. Minecraft has 112 million players each month Written by <mark>Sam Bishop</mark> on the 16th of September 2019 at 13:00 Studio head Helen Chiang revealed the colossal number, and says it's a game people always come back to. Shovel Knight Showdown offers \"robust experience\" Written by <mark>Sam Bishop</mark> on the 4th of September 2019 at 14:50 Yacht Club Games' Sandy Gordon ran us through all of the content coming here and with the King of Cards DLC. Written by Jonas Mäki on the 4th of September 2019 at 08:25 A Kickstarter campaign has been launched, and has already gone above and beyond the bottom limit. Minecraft's Super Duper Graphics update has been cancelled Written by Eirik Hyldbakk Furu on the 13th of August 2019 at 09:04 After two years of delays and hard work, Mojang has realised that it's just not technically possible to deliver on their pretty promise. Dragon Quest XI S is getting a demo Written by <mark>Sam Bishop</mark> on the 5th of August 2019 at 13:00 The Switch version lands next month, but Square Enix has revealed a demo that has certain incentives attached. Play Captain Toad: Treasure Tracker in VR Written by Jonas Mäki on the 31st of July 2019 at 10:05 The Labo VR kit has been put to use again, following updates to Super Mario Odyssey and Breath of the Wild. A sponge mod in Minecraft can absorb the ocean itself Written by <mark>Sam Bishop</mark> on the 9th of July 2019 at 13:25 Sponges don't pack that much of a punch, so one user took to Reddit to share a much more enhanced version. Ubisoft giving away Rayman Origins for speedrun viewers Written by <mark>Sam Bishop</mark> on the 5th of June 2019 at 12:45 Next week Glackum will try to break the record for Rayman 2, and those who watch can get Origins for nothing.", "articleID": "2019120502_01295754_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-12-05", "url": "https://www.sunshinecoastdaily.com.au/news/former-scouts-leader-guilty-over-brutal-child-porn/3895430/", "content": "Scout leader Daniel Leslie Cooper pleaded guilty to eight offences involving the possession, transmission and solicitation of more than 25,000 horrific child abuse images and videos. Crime Twisted Scout: \"Baby pics are so hot. Love brutal' by Vanessa Marsh 5th Dec 2019 2:52 PM premium_icon Subscriber only 0 A FORMER Queensland Scouts leader has faced court over his sickening and\" highly depraved \"obsession with child abuse material that a prosecutor described as some of the worst examples ever seen. Deception Bay man Daniel Leslie Cooper today pleaded guilty to eight offences involving the possession, transmission and solicitation of more than 25,000 horrific child abuse images and videos using covert online messaging services. Crown Prosecutor Krista Breckweg told the Brisbane Supreme Court that Cooper, a former Scouts leader, had sent and received thousands of appalling images and videos showing the sexual abuse and torture of children including newborn babies and toddlers. Scout leader Daniel Leslie Cooper pleaded guilty to eight offences involving the possession, transmission and solicitation of more than 25,000 horrific child abuse images and videos .\" Underpinning it all is this sense of absolute contempt, degradation, of dehumanising them, \"she said .\" It is unusual because it is highly depraved...it is some of the worst examples of offending of this type in terms of child pornography. \"Ms Breckweg said in the sickening exchanges between Cooper and other offenders online in 2016 and 2017, he discussed his love of\" babies and brutal \"and showed interest in incest, bestiality, rape and torture of children as young as newborn babies .\" I love everything sick, \"Cooper told one user during and exchange in which he spoke of his interest in sexual images of little children saying\" I just love them tiny \",\" baby pics are so hot \",\" love babies \",\" love brutal \". Ms Breckweg said the images found in Cooper's possession were\" highly depraved \"including pictures of dead and mutilated babies, newborns being sexually penetrated by adults and the torture of babies .\" This material demonstrates an extraordinary level of debasement and cruelty, \"Ms Breckweg said. Justice <mark>Elizabeth Wilson</mark> will sentence Cooper next week. 0 child exploiation material Read More Login to follow child sex abuse Read More Login to follow court Read More Login to follow crime Read More Login to follow daniel leslie cooper Read More Login to follow editors picks Read More Login to follow scouts queensland Read More Login to follow child exploiation material child sex abuse court crime daniel leslie cooper editors picks scouts queensland", "articleID": "2019120505_00110907_W", "names": {"Elizabeth Wilson": ["Q28835124", "Q43392923", "Q43393617", "Q43393858", "Q43393983", "Q43394943", "Q43394992", "Q43395968", "Q944952"]}}, {"date": "2019-12-06", "url": "http://kait8.com/2019/12/06/uber-reports-more-than-sexual-assaults-rides/", "content": "Uber reports more than 3,000 sexual assaults on 2018 rides Uber reveals thousands of reports of sexual assaults By RACHEL LERMAN and BARBARA ORTUTAY | December 5, 2019 at 7:51 PM CST - Updated December 5 at 9:14 PM SAN FRANCISCO (AP)--Uber, as part of a long-anticipated safety report, revealed that more than 3,000 sexual assaults were reported during its U.S. rides in 2018. That figure includes 229 rapes across the company's 1.3 billion rides. The ride-hailing company noted that drivers and riders were both attacked, and that some assaults occurred between riders. The Thursday report, which the company hailed as the first of its kind, provides a rare look into the traffic deaths, murders and reported sexual assaults that took place during billions of annual rides arranged in the U.S. using Uber's service. It is part of the company's effort to be more transparent after years of criticism over its safety record. In 2017, the company counted 2,936 reported sexual assaults during 1 billion U.S. trips. Uber bases its numbers on reports from riders and drivers, meaning the actual numbers could be much higher. Sexual assaults commonly go unreported. \"I suspect many people will be surprised at how rare these incidents are; others will understandably think they're still too common,\" Uber CEO Dara Khosrowshahi tweeted about the report. \"Some people will appreciate how much we've done on safety; others will say we have more work to do. They will all be right .\" Uber's share price dropped more than 1% in after-hours trading. Uber and competitor Lyft have faced harsh criticism for not doing enough to protect the safety of their riders and drivers. Dozens of women are suing Lyft, claiming the company should have done more to protect them from driver assaults. A Connecticut woman sued Uber last month, claiming she was sexually assaulted by her driver. London refused to renew Uber's license to operate in the city in November after the company was plagued with safety issues including concerns about impostor drivers. Uber said it will appeal the decision. The companies have both formed partnerships with sexual assault prevention networks and other safety groups, and have touted their background check policies for drivers. But many say they haven't gone far enough to protect passengers and drivers, who are contract workers for the companies. \"Keeping this information in the dark doesn't make anyone safer,\" Uber said in a statement announcing the report. It plans to release its safety report every two years going forward. Lyft said last year it would also release a safety report. A company spokeswoman confirmed Thursday that it \"remained committed\" to releasing a report, but did not say when. Mike Bomberger, a lawyer representing more than 100 victims of sexual assault in lawsuits against Uber and Lyft, applauded Uber for releasing the numbers. \"One of the problems with both of these companies is that they have hidden and have tried to conceal the number of sexual assaults that occur in their vehicles,\" he said. In response, an Uber spokesperson pointed to the just-released report. Lyft called Bomberger's charge \"baseless .\" Bomberger said he believes 80% to 90% of the assaults in the Uber report could have been prevented by measures such as cameras in the cars recording rides and the companies reporting every assault they learn of to the police. The Rape, Abuse & Incest National Network said it appreciated Uber's transparency. \"This is an issue that affects every institution in America,\" RAINN press secretary <mark>Emily Robinson</mark> said in a statement. She added that organizations in every industry, including education, should \"make a similar effort to track and analyze sexual misconduct within their communities .\" The report stated that Uber rides were involved in 97 reported crashes in 2017 and 2018, resulting in 107 deaths. The company said the figure represents about half of the national rate for fatal crashes. Sexual assault in the report is defined broadly into categories including non-consensual kissing of a non-sexual body part, attempted non-consensual sexual penetration, non-consensual touching of a sexual body part, non-consensual kissing of a sexual body part and non-consensual sexual penetration. The company also said Uber rides were involved in nine murders during 2018, and 10 during 2017. Uber noted that the vast majority--99.9%--of its rides had no reported safety issues. Copyright 2019 Associated Press. All rights reserved. 55", "articleID": "2019120603_00100561_W", "names": {"Emily Robinson": ["Q26405870", "Q44226063"]}}, {"date": "2019-12-06", "url": "http://uspolitics.einnews.com/article/504098815/m766lHgP9KXGdChx", "content": "Top Judiciary Republican Says White House Should Participate In Inquiry, With Caveats By Jason Breslow Thursday, December 5, 2019, 8:12 pm Share: With Democrats in the House of Representatives formally moving to draft articles of impeachment against President Trump, the top Republican on the committee that will author those articles is saying the White House should participate in the impeachment inquiry. But participation should happen only, he says, \"when there is an actual opportunity in which it is a situation in which they can present, do the presentation that they need to .\" In a forceful critique of the impeachment inquiry, Rep. <mark>Doug Collins</mark> of Georgia, the ranking member of the House Judiciary Committee, accused Democrats of making White House participation all but impossible by not allowing for \"a robust set of hearings .\" \"At the end of the day, if people don't believe what you're doing is fair, then it doesn't matter,\" <mark>Collins</mark> said in an interview Thursday with All Things Considered host Mary Louise Kelly. Speaking from his office on Capitol Hill, <mark>Collins</mark> said Republicans on the Judiciary Committee are not being given the opportunity to question the fact witnesses who have testified before the House Intelligence Committee since the start of the impeachment inquiry in September. Republican members of the Intelligence Committee were present for those testimonies and were allowed to question the witnesses. The White House has blocked key witnesses from testifying in the inquiry and declined to participate in this week's Judiciary Committee hearing but has left open the possibility of participating in future proceedings. <mark>Collins</mark> argued thatDemocrats are presuming guilt and creating a scenario for the president where \"you have to prove your innocence...and that's just not the way our system works .\" <mark>Collins</mark>' remarks followed the announcement by House Speaker Nancy Pelosi, D-Calif ., earlier Thursday that Democrats will begin the process of drafting articles of impeachment. Addressing reporters against a backdrop of American flags, Pelosi said the president had \"abused his power for his own personal political benefit\" by seeking to pressure a foreign nation into conducting politically motivated investigations to aid his reelection. \"His wrongdoing strikes at the very heart of our Constitution,\" Pelosi said. \"Our democracy is what is at stake. The president leaves us no choice but to act because he is trying to corrupt, once again, the election for his own benefit .\" <mark>Collins</mark> said the announcement was \"only breaking news if you've been in hibernation for the last year,\" adding, \"They've been wanting to do this .\" The Democratic case against Trump was detailed in a scathing 300-page report released by the Intelligence Committee on Tuesday. In the report, Democrats allege that the president sought to coerce Ukraine into opening an investigation into former Vice President Joe Biden by withholding $391 million in U.S. assistance for Ukraine, as well as aWhite House meeting long coveted by Ukraine's president, Volodymyr Zelenskiy. The report's release was followed on Wednesday by the start of formal impeachment proceedings in the Judiciary Committee. Wednesday's hearing featured testimony from four constitutional scholars who were called to answer whether the president, in his dealings with Ukraine, engaged in \"treason, bribery, or other high crimes and misdemeanors,\" the threshold for impeachment as spelled out in the Constitution. From his perch as the Judiciary Committee's top Republican, <mark>Collins</mark> has emerged as one of Trump's chief defenders in the battle for public opinion. In his interview with NPR, the former attorney and military chaplain said he did not believe the president has done anything wrong and said he had no issue with the way Trump has conducted himself in regards to Ukraine. \"He did nothing wrong. The call did not show anything wrong,\" he said, referring to the White House's account of the July 25 call between Trump and Zelenskiy that helped spark the inquiry. \"At the end of the day, it's not about holding anything accountable,\" <mark>Collins</mark> said of the impeachment inquiry. \"It's about next year's election for them, to make sure that he is damaged going into an election cycle .\" <mark>Collins</mark> also pushed back against the charge among Democrats--and a potential article of impeachment--that the White House has obstructed the work of Congress through its decision, detailed in an Oct. 8 letter by White House counsel Pat Cipollone, to not cooperate with the impeachment inquiry. Democrats say that since that order, the administration has failed to produce a single document in response to 71 specific demands for information. They also say that at the president's direction, 12 current or former administration officials have refused to testify in the inquiry, including 10 officials who refused to in defiance of subpoenas. <mark>Collins</mark> said the remedy is not to rush forward with impeachment but to allow the process to play out in the courts. \"There is a precedent for the president himself, not just for himself, but for the presidency, to make sure that there are certain constitutional bounds that they're claiming and privileges that they're claiming,\" said <mark>Collins</mark>. Democrats, however, have said they are not willing to allow the White House to run out the clock on impeachment through a court fight, and they say the evidence they have already collected is enough to impeach the president. The Judiciary Committee is scheduled to hold its second hearing in the impeachment inquiry on Monday, when counsel for Democrats and Republicans on the Intelligence Committee will discuss the evidence against the president. In a letter on Thursday to the chairman of the Judiciary Committee, Rep. Jerry Nadler, D-N.Y., <mark>Collins</mark> said Republicans on the committee should be allowed a hearing day before articles of impeachment can move forward. Meanwhile, the White House faces a Friday deadline to inform the committee on whether it will participate in future proceedings. A vote by the full House on whichever impeachment articles are adopted by the Judiciary Committee could come by the end of the month. The process would then move to the Senate, where 20 Republicans would need to break ranks and join Democrats to reach the 67 votes, or two-thirds majority, required to convict and remove the president from office. Given those numbers, <mark>Collins</mark> said there is nothing to indicate impeachment can pass the Senate. \"Many of us believe it's already been decided,\" he said. \"Why waste our time?\" Copyright 2019 NPR. To see more, visit NPR. Commenting Policy Wisconsin Public Radio and WPR.org welcome civil, on-topic comments and opinions that advance the discussion from all perspectives of an issue. Comments containing outside links (URLs) will only be posted after they've been approved by a moderator. WPR.org will delete comments that violate our guidelines. Visit our social media guidelines for more information about these policies. Sponsored by: Keep updated on the latest news and information. Sign up now!", "articleID": "2019120605_00112959_W", "names": {"Doug Collins": ["Q18352424", "Q3162841", "Q5300375", "Q919954"]}}, {"date": "2019-12-02", "url": "http://www.yorkshirecoastradio.com/news/sport/3003117/manchester-derby-combined-xi-do-any-man-utd-players-make-team/", "content": "Manchester derby combined XI: Do any Man Utd players make team? Manchester derby combined XI: Do any Man Utd players make team? Published at 1:06 pm 2nd December 2019. (Updated at 12:35 pm 6th December 2019) Do any United players make the Manchester combined XI? The Sky Sports Football Weekend Preview podcast panel discuss...Sky Sports' features editor <mark>Peter Smith</mark>, features writer <mark>Nick Wright</mark> and senior journalist Gerard Brand came to a consensus on a Manchester XI containing two players from Old Trafford, with Pep Guardiola's champions dominating. Do you agree with the team? Pick your own Manchester combined XI in our team selector below, and listen to the panel discuss their choices in the podcast above...Goalkeeper: <mark>David</mark> <mark>de</mark> Gea This was one of few moot points for the panel, with Manchester United goalkeeper <mark>David</mark> <mark>de</mark> Gea getting the nod over Ederson, the consensus being that the Spaniard is still among the best goalkeepers in the world, and that Ederson's abilities are uniquely suited to Manchester City. Defenders: Kyle Walker, <mark>Harry Maguire</mark>, Aymeric Laporte, Benjamin Mendy The centre-halves were shoe-ins - <mark>Harry Maguire</mark> and Aymeric Laporte - and despite some debate over the full-back areas, the panel settled on Kyle Walker and right-back and Benjamin Mendy on the left, despite calls for Aaron Wan-Bissaka and <mark>Oleksandr Zinchenko</mark>. <mark>Nick</mark>: \"I think Mendy gives you a lot more than <mark>Zinchenko</mark>. Man City haven't lost a single game that Mendy has started since he joined the club; that's 22 games, 18 wins and four draws .\" Gerard: \"I'm not sure Pep Guardiola trusts either Joao Cancelo or Kyle Walker - neither have started three consecutive games this season, and it feels less like rotation and more like a lack of trust. I think <mark>Zinchenko</mark> is Mr Reliable for Guardiola, and do think he comes back into the starting XI when he is fit, but I'm happy to be overruled on Mendy two to one!\" Midfielders: <mark>Kevin De Bruyne</mark> - Fernandinho - <mark>David Silva</mark> Despite the arguments in defence, the midfield was unanimous, even if Fernandinho is now deployed in defence for City. He gets in alongside <mark>Kevin De Bruyne</mark> and <mark>David Silva</mark>, but was anybody else in contention? And how close was PaulPogba to the XI? <mark>Nick</mark>: \"It's interesting that we'd touch on Scott McTominay before Paul Pogba, I think that says a lot about how Pogba is perceived at the moment, and just how good McTominay has been. Pogba is obviously an absolutely brilliant player, but I'm not sure he justifies a place in that midfield. When you look at what these three have achieved in the Premier League, it's no contest really .\" Gerard: \"What's funny is that we've put Fernandinho in midfield, and I think everyone you ask would, but Pep Guardiola places him in defence. Every game he's played this season have been at CB. He doesn't trust Nicolas Otamendi and John Stones together, but you wonder what that takes away from City's midfield from having Fernandinho in defence .\" Forwards: Bernardo Silva - Sergio Aguero - Raheem Sterling Plenty of consideration for Marcus Rashford up front, but the three City men of Bernardo Silva, Sergio Aguero and Raheem Sterling get the nod as the champions register nine players to United's two. <mark>Peter</mark>: \"I really like Marcus Rashford, I thought he was fantastic in midweek, coming off that left side, he is so dangerous with 12 goals in 13 games for club and country, but you've got Raheem Sterling playing in that position, who has been so consistent for a number of years .\" <mark>Nick</mark>: \"I was pretty conflicted with Rashford, he's obviously been fantastic recently, but he doesn't really play off the right. Bernardo has a lot in the bank, he hasn't been as impressive this season, but I had to get him in there .\" Gerard: \"What's funny is that Mahrez could easily start ahead of Bernardo on Saturday. I really like him, whenever I've seen him he has match-winning qualities about him .\" Watch Man City vs Man Utd on Saturday Night Football from 5pm on Sky Sports Premier League and Main Event; Kick-off 5.30 pm", "articleID": "2019120612_00288698_W", "names": {"David Silva": ["Q161069", "Q2513023", "Q27580161", "Q5239792", "Q58454602"]}}]