[{"date": "2019-12-02", "url": "http://www.yorkshirecoastradio.com/news/sport/3003117/manchester-derby-combined-xi-do-any-man-utd-players-make-team/", "content": "Manchester derby combined XI: Do any Man Utd players make team? Manchester derby combined XI: Do any Man Utd players make team? Published at 1:06 pm 2nd December 2019. (Updated at 12:35 pm 6th December 2019) Do any United players make the Manchester combined XI? The Sky Sports Football Weekend Preview podcast panel discuss...Sky Sports' features editor <mark>Peter Smith</mark>, features writer <mark>Nick Wright</mark> and senior journalist Gerard Brand came to a consensus on a Manchester XI containing two players from Old Trafford, with Pep Guardiola's champions dominating. Do you agree with the team? Pick your own Manchester combined XI in our team selector below, and listen to the panel discuss their choices in the podcast above...Goalkeeper: <mark>David</mark> <mark>de</mark> Gea This was one of few moot points for the panel, with Manchester United goalkeeper <mark>David</mark> <mark>de</mark> Gea getting the nod over Ederson, the consensus being that the Spaniard is still among the best goalkeepers in the world, and that Ederson's abilities are uniquely suited to Manchester City. Defenders: Kyle Walker, <mark>Harry Maguire</mark>, Aymeric Laporte, Benjamin Mendy The centre-halves were shoe-ins - <mark>Harry Maguire</mark> and Aymeric Laporte - and despite some debate over the full-back areas, the panel settled on Kyle Walker and right-back and Benjamin Mendy on the left, despite calls for Aaron Wan-Bissaka and <mark>Oleksandr Zinchenko</mark>. <mark>Nick</mark>: \"I think Mendy gives you a lot more than <mark>Zinchenko</mark>. Man City haven't lost a single game that Mendy has started since he joined the club; that's 22 games, 18 wins and four draws .\" Gerard: \"I'm not sure Pep Guardiola trusts either Joao Cancelo or Kyle Walker - neither have started three consecutive games this season, and it feels less like rotation and more like a lack of trust. I think <mark>Zinchenko</mark> is Mr Reliable for Guardiola, and do think he comes back into the starting XI when he is fit, but I'm happy to be overruled on Mendy two to one!\" Midfielders: <mark>Kevin De Bruyne</mark> - Fernandinho - <mark>David Silva</mark> Despite the arguments in defence, the midfield was unanimous, even if Fernandinho is now deployed in defence for City. He gets in alongside <mark>Kevin De Bruyne</mark> and <mark>David Silva</mark>, but was anybody else in contention? And how close was PaulPogba to the XI? <mark>Nick</mark>: \"It's interesting that we'd touch on Scott McTominay before Paul Pogba, I think that says a lot about how Pogba is perceived at the moment, and just how good McTominay has been. Pogba is obviously an absolutely brilliant player, but I'm not sure he justifies a place in that midfield. When you look at what these three have achieved in the Premier League, it's no contest really .\" Gerard: \"What's funny is that we've put Fernandinho in midfield, and I think everyone you ask would, but Pep Guardiola places him in defence. Every game he's played this season have been at CB. He doesn't trust Nicolas Otamendi and John Stones together, but you wonder what that takes away from City's midfield from having Fernandinho in defence .\" Forwards: Bernardo Silva - Sergio Aguero - Raheem Sterling Plenty of consideration for Marcus Rashford up front, but the three City men of Bernardo Silva, Sergio Aguero and Raheem Sterling get the nod as the champions register nine players to United's two. <mark>Peter</mark>: \"I really like Marcus Rashford, I thought he was fantastic in midweek, coming off that left side, he is so dangerous with 12 goals in 13 games for club and country, but you've got Raheem Sterling playing in that position, who has been so consistent for a number of years .\" <mark>Nick</mark>: \"I was pretty conflicted with Rashford, he's obviously been fantastic recently, but he doesn't really play off the right. Bernardo has a lot in the bank, he hasn't been as impressive this season, but I had to get him in there .\" Gerard: \"What's funny is that Mahrez could easily start ahead of Bernardo on Saturday. I really like him, whenever I've seen him he has match-winning qualities about him .\" Watch Man City vs Man Utd on Saturday Night Football from 5pm on Sky Sports Premier League and Main Event; Kick-off 5.30 pm", "articleID": "2019120612_00288698_W", "names": {"Harry Maguire": ["Q165772", "Q5670856"], "Kevin De Bruyne": ["Q357984", "Q52835665"], "Nick Wright": ["Q10399189", "Q10413152", "Q16143219", "Q57018261", "Q7028172"], "Oleksandr Zinchenko": ["Q1803666", "Q19636859"], "Peter Smith": ["Q12331731", "Q1344098", "Q16095881", "Q16221181", "Q16744426", "Q17140360", "Q2073575", "Q2078388", "Q21464247", "Q23418812", "Q2426347", "Q30106739", "Q30122591", "Q38053711", "Q42305788", "Q42842578", "Q43200108", "Q50042954", "Q56281118", "Q57984828", "Q7176991", "Q7176994", "Q7176996", "Q7176997", "Q7176998", "Q7176999", "Q7177003", "Q7177004", "Q7177005", "Q7177006"]}}, {"date": "2019-12-07", "url": "http://www.northwaleschronicle.co.uk/news/national/18086207.nicola-sturgeon-gets-skates-parties-hit-streets-final-bid-votes/#comments-anchor", "content": "Nicola Sturgeon gets skates on as parties hit the streets in final bid for votes By Press Association 2019 Nicola Sturgeon 2 comments Nicola Sturgeon got her skates on as she visited Aberdeen's Christmas market on the election campaign trail. The SNP leader was joined on the ice by Scottish Finance Secretary Derek Mackay and the party's Aberdeen North candidate Kirsty Blackman. The visit was the first on her tour of the north east, as she urges voters to unite around the SNP to stop Boris Johnson re-entering Number 10, and to prevent Brexit. Ms Sturgeon and Mr Mackay took to the ice (Jane Barlow/PA) Her later engagements involved taking part in a traditional music workshop with Aberdeenshire West and Kincardineshire candidate Fergus Mutch, and a Christmas arts and crafts class with children and Gordon candidate <mark>Richard Thompson</mark>. Meanwhile, Scottish Conservative leader Jackson Carlaw was in Moray campaigning with Tory candidate <mark>Douglas Ross</mark>. Mr Carlaw called on voters to \"lend\" votes to his party, regardless of their voting history, to \"stop Nicola Sturgeon and her second divisive independence referendum\". Brilliant to be in Moray this morning for @ Douglas4Moray with @ MorayTories. <mark>Douglas</mark> has a long record of working hard for the people of Moray and he is the only one who can beat Nicola Sturgeon's separatist candidate here. Just 5 days to go!?????????????????????? pic.twitter.com/Kxs9puqkyd--Jackson Carlaw MSP (@ Jackson_Carlaw) December 7, 2019 Posting online, he added: \"There are just 5 days left to save the union .\" Another referendum would be more divisive, more brutal and more corrosive than last time. \"Independence was also on the agenda as Scottish Liberal Democrat leader Willie Rennie visited a farmers' market in St Andrews, Fife. He said:\" Across the country we are finding people who are willing to lend their vote to the Liberal Democrats to stop another independence referendum. \"You don't have to love every single Liberal Democrat policy, you just have to be among the majority of Scots who look at the prospect of another referendum next year and say no thanks .\" Campaigning in Glasgow, Scottish Labour leader <mark>Richard Leonard</mark> vowed to take seats from the SNP to get his party in power at Westminster. It's the final Saturday of the campaign and I'm with this top team in Glasgow South West. Two years ago @ MattKerrLabour missed out by just 60 votes. We are going to turn it red on Thursday and deliver a majority Labour government. #RedWave pic.twitter.com/ouT6IbfUCi--<mark>Richard Leonard</mark> (@ LabourRichard) December 7, 2019 He was canvassing with Glasgow South West candidate Matt Kerr, who lost the seat in the 2017 General Election by just 60 votes to the SNP's <mark>Chris Stephens</mark>. Mr <mark>Leonard</mark> tweeted: \"We are going to turn it red on Thursday and deliver a majority Labour government .\" In Glasgow on Saturday evening, Labour shadow chancellor <mark>John McDonnell</mark> is to speak at a \"Rally for Real Change\". We are at Ineos Grangemouth calling for an end to imports of fracked gas To #DemandClimateAction vote Scottish Green on Thursday in #GE 2019 pic.twitter.com/fz1GbW51Ji--Scottish Greens (@ scotgp) December 7, 2019 Elsewhere, Scottish Greens co-leader Patrick Harvie joined Linlithgow and East Falkirk candidate Gillian Mackay for a demonstration outside Ineos in Grangemouth, and urged voters to back his party on Thursday for climate action. The party wants imports of fracked gas at the site to stop, arguing that since fracking has been ruled out in Scotland it should not instead enable the controversial gas extraction technique. 2 comments", "articleID": "2019120715_00136856_W", "names": {"Chris Stephens": ["Q19059345", "Q30056655"], "Douglas Ross": ["Q24039769", "Q5301949", "Q56165274"], "John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "Richard Leonard": ["Q24039896", "Q50365677", "Q7327335"], "Richard Thompson": ["Q17403001", "Q17722161", "Q19845266", "Q21389996", "Q21466506", "Q21466999", "Q27926877", "Q3130586", "Q359373", "Q4460338", "Q45893438", "Q539955", "Q7326541", "Q7329458", "Q7329459", "Q7329460", "Q7329461", "Q7331804"]}}]