[{"date": "2019-12-07", "url": "http://www.gamereactor.eu/?system=vita&sid=d9fb0ed1a0d0952ef5f934a172cedac1", "content": "Don't expect another handheld console from Sony Written by Jonas Mäki on the 4th of December 2019 at 15:13 Sony Interactive Entertainment president <mark>Jim Ryan</mark> has made clear that \"it's a business that we're no longer in now\". Stardew Valley gets a lot of fixes for the huge 1.4 update Written by <mark>Sam Bishop</mark> on the 3rd of December 2019 at 15:17 We also get some new content as well, like the fact that Vincent now loves snails, which is certainly something. Vatican priest sets up a Minecraft server for players to join Written by <mark>Sam Bishop</mark> on the 3rd of December 2019 at 11:36 Nothing ungodly will be going on here, as it's \"about getting people together who can then maybe move those relationships to the real world\". Undertale Live concert will let fans dictate the music Written by <mark>Sam Bishop</mark> on the 20th of November 2019 at 15:15 You can see the music from Toby Fox's game live, and have a say in \"each show's unique storyline\". Multiplayer update lands for Stardew Valley on Xbox One Written by <mark>Sam Bishop</mark> on the 11th of November 2019 at 12:07 ConcernedApe also revealed that progress for update 1.4 on PC is coming along nicely, and that it's \"very close\". Minecraft is getting a Nether Update Written by <mark>Sam Bishop</mark> on the 30th of September 2019 at 11:36 This adds new biomes, increased accessibility, Piglins, and more to the game, since Mojang wants you to explore more of the Nether. Minecraft has 112 million players each month Written by <mark>Sam Bishop</mark> on the 16th of September 2019 at 13:00 Studio head Helen Chiang revealed the colossal number, and says it's a game people always come back to. Shovel Knight Showdown offers \"robust experience\" Written by <mark>Sam Bishop</mark> on the 4th of September 2019 at 14:50 Yacht Club Games' Sandy Gordon ran us through all of the content coming here and with the King of Cards DLC. A Plants vs. Zombies stream is happening tonight Written by <mark>Sam Bishop</mark> on the 4th of September 2019 at 10:25 What could it mean? We have mere hours to find out, as a countdown timer has begun already. Written by Lisa Dahlgren on the 18th of August 2019 at 09:00 Epic Games Store is giving away indie gem Fez for free starting next week on August 23. Minecraft's Super Duper Graphics update has been cancelled Written by Eirik Hyldbakk Furu on the 13th of August 2019 at 09:04 After two years of delays and hard work, Mojang has realised that it's just not technically possible to deliver on their pretty promise. Hyper Light Drifter and Mutant Year Zero to be free on Epic Store Written by <mark>Sam Bishop</mark> on the 9th of August 2019 at 14:26 These are coming next week, as part of the Epic Games Store's continual offerings of free titles on PC. A sponge mod in Minecraft can absorb the ocean itself Written by <mark>Sam Bishop</mark> on the 9th of July 2019 at 13:25 Sponges don't pack that much of a punch, so one user took to Reddit to share a much more enhanced version.", "articleID": "2019120717_00213221_W", "names": {"Jim Ryan": ["Q15498400", "Q23621762", "Q3178937", "Q39070492", "Q6197932", "Q6197934"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-12-10", "url": "http://www.shropshirestar.com/news/local-hubs/telford/2019/12/10/home-extension-can-go-ahead-after-telford-couples-appeal/", "content": "Home extension can go ahead after Telford couple's appeal By <mark>Alex Moore</mark> | Telford | News | Published: Less than an hour ago A couple have won permission to extend their home despite concerns it might impact on a \"historically significant\" pub and pair of houses nearby. Subscribe to our daily newsletter Sign UpThe Church Wicketts pub, one of the buildings Telford & Wrekin Council said the extension could have negatively impacted. Photo: Google Maps Mr and Mrs J Murfin applied for permission to build a conservatory at the side of their home at Church Road, Dawley, but Telford and Wrekin Council's planning department refused permission in August. But, after a site visit last week, government-appointed planning inspector Robert Hitchcock has overturned that appeal and allowed the development. Council planners had said the conservatory, which would be visible from the street, would be \"incongruous\" , but, in a Planning Inspectorate decision notice, Mr Hitchcock points out that nearby homes are already significantly altered, and the area no longer has \"consistent rhythm or character\". Mr Hitchcock writes that the Murfins' home is in \"an area of mixed age and character dwellings, including traditional semi-detached and detached properties intertwined with more modern terraces, individually-styled properties and infill development\". He adds: \"The proposed development would not appear incongruous or adversely affect any consistent rhythm or character of development within the locality .\" An appraisal document, prepared by council planning officers at the time of the original refusal, said the proposed conservatory, being visible from the street, would be an \"incongruous addition\". It also said \"the proposed scheme would have a detrimental impact upon the setting, character and appearance of surrounding local interest buildings, distracting from the historic character of the surrounding area\". Mr Hitchcock says this refers to a semi-detached pair of homes next to the Murfins' house and The Church Wicketts, a pub opposite. \"The buildings' significance stems from their forming part of an earlier 19th-century settlement, now incorporated within the wider Malinslee suburb,\" he writes. He adds that, while the conservatory would narrow the gap between the houses, a \"visual break\" would remain and \"no direct physical effect\" on the next-door house would result. In his decision notice, published on Monday, Mr Hitchcock allowed Mr and Mrs Murfin's appeal but said they must use approved building materials on the external surface \"in the interest of the character and appearance of the area\" .", "articleID": "2019121020_00134639_W", "names": {"Alex Moore": ["Q21104247", "Q28658001"]}}, {"date": "2019-12-11", "url": "http://uspolitics.einnews.com/article/504568984/Yd-02WSQ1-bpGm1J", "content": "https: //www.greenwichtime.com/news/article/Warren-s-new-ocean-plan-includes-Western-drought-14896771.php Warren pushes back against more moderate path to White House Scott Sonner, Associated Press Updated 1:09 am EST, Wednesday, December 11, 2019 Sen. Elizabeth Warren, D-Mass ., pushed back at fellow Democrats who advocate a more moderate path to the White House during a speech at Truckee Meadow Community College, Tuesday night, Dec. 10, 2019, in Reno, Nev.. She said her party will lose the 2020 presidential election if it settles for a \"business as usual\" agenda that \"only nibbles around the edges .\" (Andy Barron/The Reno Gazette-Journal via AP) less Sen. Elizabeth Warren, D-Mass ., pushed back at fellow Democrats who advocate a more moderate path to the White House during a speech at Truckee Meadow Community College, Tuesday night, Dec. 10, 2019, in Reno,...more Photo: Andy Barron, AP Photo: Andy Barron, AP Image 1 of / 7 Caption Close Image 1 of 7 Sen. Elizabeth Warren, D-Mass ., pushed back at fellow Democrats who advocate a more moderate path to the White House during a speech at Truckee Meadow Community College, Tuesday night, Dec. 10, 2019, in Reno, Nev.. She said her party will lose the 2020 presidential election if it settles for a \"business as usual\" agenda that \"only nibbles around the edges .\" (Andy Barron/The Reno Gazette-Journal via AP) less Sen. Elizabeth Warren, D-Mass ., pushed back at fellow Democrats who advocate a more moderate path to the White House during a speech at Truckee Meadow Community College, Tuesday night, Dec. 10, 2019, in Reno,...more Photo: Andy Barron, AP Warren pushes back against more moderate path to White House 1 / 7 Back to Gallery RENO, Nev. (AP)--Pushing back against fellow Democrats who advocate a more moderate path to the White House, Sen. Elizabeth Warren said Tuesday her party will lose the 2020 presidential election if it settles for an agenda that's \"business as usual\" and only \"nibbles around the edges\" of past U.S. policies. The Massachusetts senator said in a speech at a community college in Reno that her progressive campaign has the \"big ideas\" the country needs, including a 2% wealth tax on incomes over $50 million and Medicare for All. She also told the crowd of more than 600 in the biggest gold producing state in the U.S. that in addition to ending all new drilling and mining on federal lands, she would give Native American tribes veto power over pipelines and other development with environmental impacts on lands adjacent to their tribal lands. \"This country is in a crisis,\" Warren said at the close of a speech that devoted about half of her nearly 90-minute appearance to answering questions from audience members. Polls show former Vice President Joe Biden with a slight lead in Nevada over Warren and Vermont Sen. Bernie Sanders. Biden has been critical of both for pushing agendas he believes are overly ambitious and too costly, including Medicare for All. Warren didn't name any of her Democratic rivals during Tuesday night's speech but took direct aim at such concerns. \"Party insiders...think that somehow that running a vague campaign that nibbles around the edges on these huge problems is a safe strategy,\" Warren said. \"If the best that Democrats can offer is business as usual after <mark>Donald Trump</mark>, then Democrats will lose. When we have ideas big enough to meet the problems in people's lives, that's when we win .\" An individual's first $50 million of income would be exempt from Warren's proposed wealth tax, with 2% levied on every dollar after that and an additional 1% surcharge above $1 billion. She estimates it would raise $800 billion annually. Earlier Tuesday, Warren updated her strategy to combat climate change with a focus on protecting ocean habitat as well as Western drought and wildfires. She released her plan for The New Blue Deal Tuesday as an addendum to the Green New Deal following a gathering with a powerful casino workers' union in Las Vegas Monday night. Th addition is mostly directed at ways to address how climate change is affecting oceans, including expanding protection of marine areas and prohibiting new offshore drilling in federal waters. But it also highlights the need for new plans to ease the stress on critical water supplies like the Colorado River basin, where drops in reservoir levels forced mandatory water cuts this summer in Arizona and Nevada. Sanders appeared before the Culinary Workers in Las Vegas Tuesday after stops in Carson City, Reno and Elko the past two days. Biden plans to meet with the union in Las Vegas on Wednesday. Most Popular 1 \"We ate their lunch': Democrats claim legislative victories with dealmaker <mark>Trump</mark> 2 Greenwich teen pleads guilty to two burglaries 3 Child dies after being struck by vehicle in New Canaan driveway 4 Snowfall could impact Wednesday morning commute in CT 5 We shopped at Kohl's and JCPenney, and both had real issues. Here's why I'd rather shop at Kohl's anyway. 6 Fotis Dulos faces foreclosure on New Canaan house 7 Greenwich police: Drunken driver had left child alone before crash View Comments © 2019 Hearst Communications, Inc. .", "articleID": "2019121116_00048406_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-12-11", "url": "https://torontosun.com/news/world/i-am-inevitable-thanos-creator-attacks-donald-trump-over-sick-re-election-campaign-video/wcm/fa5e68c9-4516-4999-bfc5-973419969f3f", "content": "The man behind Marvel supervillain Thanos has attacked <mark>Donald Trump</mark>'s presidential campaign managers for comparing the U.S. leader to his creation. A video of Trump's head superimposed onto Thanos as he delivers his famous \"I am inevitable\" line from Avengers: Endgame was posted to the verified Twitter account managed by the President's 2020 re-election campaign on Tuesday. House Democrats can push their sham impeachment all they want. President Trump's re-election is????????????????????. pic.twitter.com/O7o02S26nS--Trump War Room (Text TRUMP to 88022) (@ TrumpWarRoom) December 10, 2019 The aides captioned the footage: \"House Democrats can push their sham impeachment all they want. President Trump\" s re-election is inevitable. \"In the video, leading Democrats turn to dust as Trump's Thanos clicks his fingers. However, Marvel fans have pointed out that Thanos is defeated following that part of the film, and now the man behind the character, Jim Starlin, has weighed in with his thoughts, calling Trump a\" pompous fool \".\" After my initial feeling of being violated, seeing that pompous fool using my creation to stroke his infantile ego, it finally struck me that the leader of my country and the free world actually enjoys comparing himself to a mass murderer. How sick is that? \"Jim tells The Hollywood Reporter .\" These are sad and strange times we are going through. Fortunately all things, even national nightmares, eventually come to an end. \"Comments Share your thoughts", "articleID": "2019121121_00023249_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2019-12-12", "url": "http://www.cbssports.com/nfl/news/cowboys-kai-forbath-ready-to-make-an-impact-after-replacing-brett-maher-lets-go-make-some-kicks/", "content": "CBSSports.com Cowboys' Kai Forbath ready to make an impact after replacing <mark>Brett Maher</mark>: \"Let's go make some kicks' The veteran is ready to get to work, and the Cowboys need him at his best Dec 12, 2019 at 2:37 pm ET • 2 min read Failing to address the issue when they had the chance in April, or even shortly thereafter, the Dallas Cowboys are now hoping against hope they've somehow bucked the odds and found a solution to their kicking woes in mid-December. It took <mark>Brett Maher</mark> missing 10 field goals in his second year with the club for him to finally be dismissed, leaving the team with a 2019 accuracy rate of 66.7 percent, which includes an abysmal 20 percent accuracy between 40-49 yards and 50 percent from 50 yards or more. Enter Kai Forbath, after a successful workout on Monday. Although he lacks the leg strength of his predecessor to boot it from 60 yards out, the 32-year-old does boast a higher career accuracy than <mark>Maher</mark> across distances, and he most recently went 5 for 6 from 50 yards or greater as a member of the Minnesota Vikings in 2017. who was signed this week in <mark>Maher</mark>'s place Plot twist cometh. It's not Forbath's first stint with the Cowboys, having been signed as an undrafted free agent in 2011. Sidelined by injury that summer, he was released and the nod was given to a fellow undrafted rookie named Dan Bailey, who went on to become a legend in Dallas before being replaced by <mark>Maher</mark> in 2018. Bailey now takes up residence for the same Vikings that employed Forbath one year prior to Bailey being cut in Dallas. Forbath's career took a much different arc after 2011, needless to say, going on to play for six different teams--his last being the New England Patriots--before finding his way back to North Texas, and he's bringing with him a career accuracy rate of 85.5 percent and a list of valuable lessons learned .\" Yeah, that's what I learned from college to the NFL, \"Forbath said .\" You have to take every single day serious and treat it like a game and try to get better every day. When you get complacent and take practice for granted, that's when things go bad. \"Even if Forbath is flawless from here on out (doubtful in today's landscape of kickers), it will have only resolved one of the many issues holding the Cowboys back from realizing their full potential in 2019. Sitting at 6-7 and barely clinging onto the NFC East lead, they need to fix everything from coaching issues to inconsistent play calling to disheveled play on the field and lack of takeaways if they're truly going to right the ship and make a possible run into and through the playoffs. Kicking matters, however, as the Cowboys have recently been reminded time and again. To his credit, Forbath, who's been around the block, says the workout was more stressful than kicking in the actual game will be .\" It might be more [pressure in the tryout] actually, \"he said .\" There's very important people watching you kicking each kick. I told my agent I got through the hard part and now let's go make some kicks. \"The potentially good news here is the Cowboys will no longer crutch their offense on the belief they can stroll out <mark>Maher</mark> for a 63-yard kick or a 58-yarder on an opening drive, instead potentially opting to now be more aggressive and push the ball downfield. That's ideally speaking, but whenever Forbath does take the field for his Cowboys debut on Sunday against the Los Angeles Rams, the silence he'll hear will be 100,000 people refusing to breathe until the ball sails through the uprights. And it he whiffs, it'll be 100,000 people calling for his head. But hey, no pressure. Pick Six Newsletter", "articleID": "2019121219_00194904_W", "names": {"Brett Maher": ["Q16731836", "Q2924616"]}}, {"date": "2019-12-14", "url": "http://brentwoodweeklynews.co.uk/news/national/18101485.new-train-timetable-will-add-1-000-weekly-services/", "content": "New train timetable will add 1,000 weekly services By Press Association 2019 Great Western Railway is making the biggest timetable change on its network since the 1970s (GWR/PA) 0 comment Britain's railways will undergo a major timetable change on Sunday including the first non-stop trains between London and Bristol in decades. Journey times will be cut, frequencies increased and new routes added across the country following infrastructure investment and upgraded carriages. Industry body the Rail Delivery Group (RDG) said the new timetable change will feature 1,000 extra weekly services, on top of the 4,000 introduced over the past two years. Train timetables are changed twice a year, in May and December. The launch of the May 2018 timetables saw services crippled in parts of the North and the South East, with blame attributed to Network Rail, train operators and the Government. <mark>Anthony Smith</mark>, chief executive of the passenger watchdog Transport Focus, said: \"This time around passengers need the rail industry to deliver a smooth set of timetable improvements--so they can reliably use both new and existing services .\" Many passengers should have a greater choice of services with more seats as result of these changes. However, there will also be some who lose out with fewer or slower services. \"Train companies must have plenty of visible staff on hand to guide passengers, to answer questions on how these changes will affect them, and to explain what travel choices they have .\" The RDG sought to reassure passengers over the upcoming timetable, stating that the industry has put \"years of work into drafting, consulting and planning for these changes\". <mark>Robert Nisbet</mark>, the organisation's director of nations and regions, urged passengers to check their journey details in advance as many times are changing. He added: \"Train operators and Network Rail will be working together to run a reliable service and respond quickly to any teething problems as people get used to the change .\" Sunday will see the biggest timetable change on the Great Western Railway network since the 1970s, taking advantage of Network Rail's electrification of the line between London and Bristol, and the operator's new intercity express trains. Non-stop trains between London Paddington and Bristol Parkway will have journey times as short as one hour and eight minutes, shaving 12 minutes off the existing quickest services. Fastest journey times between the capital and Bristol Temple Meads--near the centre of the city--will be cut by 17 minutes to one hour and 19 minutes. The frequency of trains on this routes will be increased from two per hour to three during the morning and evening peaks. There will be major improvements on the ScotRail network, with additional services in north-east Scotland and extra seats between Edinburgh and Glasgow. A new station, Robroyston, will open in north-east Glasgow on the line between Queen Street and Cumbernauld. Other operators introducing new services are Greater Anglia, London North Eastern Railway, Northern, TfL Rail, Thameslink, Transpennine Express (TPE), Transport for Wales, West Midlands Railway and London Northwestern Railway. TPE admitted last week that the frequency of its new direct Liverpool-Edinburgh trains will initially be lower than the planned hourly service. The firm blamed a maintenance backlog and infrastructure problems for delaying crew training, as well as the late delivery of new trains. 0 comment", "articleID": "2019121400_00018808_W", "names": {"Anthony Smith": ["Q16197257", "Q20640889", "Q27838053", "Q2852962", "Q2852963", "Q4773483", "Q4773484", "Q4773486", "Q4773487", "Q4773488", "Q4773489", "Q7823446", "Q7823448"], "Robert Nisbet": ["Q16292939", "Q21999572", "Q7348044"]}}, {"date": "2019-11-21", "url": "http://www.gamereactor.eu/age-of-empires-iv-on-consoles-isnt-a-definite-no/?sid=3faa201744c825825ab21a08306c2896#comments", "content": "Age of Empires IV Age of Empires IV on consoles isn't a definite no Microsoft's Shannon Loftis and Adam Isgreen both said that PC was the main focus, but we may still see it on consoles. 2019-11-21 16:00 <mark>Sam Bishop</mark> The majority of Age of Empires players will be used to experiencing strategy games like this on the PC, but when Stevivor spoke with Microsoft's Shannon Loftis and Adam Isgreen at X019 last week, they didn't rule out the possibility of console gamers getting Age of Empires IV. \"It's hard, as a PC game,\" Loftis said. \"We want to make it great on PC. But then, I think the whole concept of platform is about to change with Xbox .\" \"We are working hard to make sure to visualize all the different ways that people are going to want to experience Age [of Empires]. But our number one priority is to make it work great with keyboard and mouse .\" \"We're going to explore our options,\" Isgreen added. \"Once we have our wonderful PC game, then we'll start looking at other ways that we can show up .\" We also found out earlier this month that microtransactions won't be in Age of Empires IV, and the X019 event gave us a full reveal of the newest entry in the strategy series. Would you play Age of Empires IV on console? You watching", "articleID": "2019121515_00194534_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2019-12-18", "url": "http://www.bracknellnews.co.uk/news/national/18109486.low-inflation-provides-festive-cheer-consumers-say-economists/", "content": "Low inflation provides festive cheer for consumers, say economists By Press Association 2019 Stirling Currency Stock 0 comment Economists have said that continued low inflation will give consumers \"further cheer\" over Christmas, as it continues to sit significantly below wage growth. The latest data from the Office for National Statistics revealed that the Consumer Price Index (CPI) held firm at 1.5% in November, the same figure as a month earlier. Inflation was last lower in November 2016. Inflation was higher than analysts had predicted, having forecast a decrease to 1.4% for the month. Emma-Lou Montgomery, associate director for personal investing at Fidelity International, said the latest figures are positive for consumer finances. \"Today's UK CPI figures reveal, once again, the rate of inflation continues to lag behind wage growth--in a boon for households around the country .\" A continued easing in the cost of goods and services included within the index will no doubt bring further cheer to consumers as they celebrate the festive season, particularly following yesterday's news of a strong jobs market. \"Wage growth remains significantly ahead of the rate of inflation, although figures released by the ONS on Tuesday revealed that average wage growth slipped to 3.2% in October, from 3.6% a month earlier. Employment increased for the month, but the number of vacancies contracted for the tenth consecutive month as the labour market remained tight. Analysts also highlighted that consumers will only feel a benefit in their purse if they do not have a sweet tooth, with the price of chocolate jumping as food prices increased for the month. <mark>Victoria Clarke</mark>, economist at Investec, said:\" The biggest upward force to the 12-month inflation rate in November month was the \"food and non-alcoholic beverages' category where British chocolate lovers were hit with a bigger price rise for chocolate boxes and chocolate-covered ice cream bars than in the same month last year .\" However, Howard Archer said the new figures are still \"decent news for consumer purchasing power\". He added: \"It also gives the Bank of England ample scope to cut interest rates if the economy fails to decisively pick up early in 2020 .\" UK CPI readings remain below the BoE's 2% threshold but not really far enough to warrant rate cuts. OIS pricing shows v little chance of a move tomorrow from the Bank--also seen as unlikely in the coming months. One 25bps cut largely discounted by Nov 2020 pic.twitter.com/OznIo4J3sF--David Cheetham, CFA (@ DavidCheetham3) December 18, 2019 Although the rate stayed noticeably below the Bank of England's target rate of inflation, economists said they still do not expect a change to policy by rate-setters. David Cheetham, chief market analyst at XTB, said: \"The core reading of 1.7% was unchanged from the previous month and is close enough to the Bank of England's 2% target to not by itself give too much food for thought amongst rate-setters ahead of tomorrow's decision .\" After being widely criticised for becoming politicised following the bank's comments on the EU referendum, it would not be at all surprising if they decide that the best course of action is no action at all and simply stand pat until there's great clarity on the Brexit outcome. \"The pound increased against the dollar on the announcement but tailed off shortly after as concerns over Brexit continued to dominate trading. 0 comment", "articleID": "2019121813_00040159_W", "names": {"Victoria Clarke": ["Q15504611", "Q39069999"]}}]