[{"articleID": "2014110121_00021601_W", "names": {"Mike Tyson": ["Q30122587", "Q6849116", "Q79031"]}, "date": "2014-11-01", "url": "http://granitefallsnews.com/article/ZZ/20141101/NEWS/311019998/10063/ENTERTAINMENT", "content": "Local real estate broker, Edman, opens Exit Realty Scenic Valley Morning Jolt: At least 3,000 UNC student-athletes may have cheated <mark>Mike Tyson</mark> says he was sexually abused by an older man as a child. In an interview with Opie Radio this week, <mark>Tyson</mark> said that at age 7, an older man \"bullied me, sexually abused me and stuff...snatched me off the street.\" <mark>Tyson</mark>, 48, claims he ran away and never saw the man again. The former boxing champ never reported the abuse, which he says only happened once. \"It's nobody's business to know,\" he said during the interview. <mark>Tyson</mark> was doing the interview to promote his new show <mark>Mike Tyson</mark> Mysteries. In 1992, <mark>Tyson</mark> himself was convicted of raping a woman and was sentenced to six years in prison. He was released in 1995. Sign up for our newsletter and have the top headlines from your community delivered right to your inbox. © Copyright 2006-2014 Gatehouse Media, Inc.. Some rights reserved Gatehouse Media Publications Original content available for non-commercial use under a Creative Commons license, except where noted."}, {"articleID": "2013082206_00008545_W", "names": {"Floyd Brown": ["Q5462385", "Q5462386"]}, "date": "2013-08-21", "url": "http://www.charlotteobserver.com/2013/08/21/4253465/settlement-means-another-1475.html#storylink=rss", "content": "By Joseph Neff and Mandy Locke Anson County and its insurers paid $1.475 million to <mark>Floyd Brown</mark>, the mentally disabled man jailed in a psychiatric hospital for 14 years based on a confession that his lawyers said was fabricated by an SBI agent and two county sheriff's deputies. When added to $7.85 million settlement paid by the State Bureau of Investigation and its insurers, <mark>Brown</mark> has been compensated a total of $9.325 million for the 14 years he spent locked in Dorothea Dix Hospital in Raleigh. <mark>Brown</mark> had been charged with the 1993 murder of Katherine Lynch, a retired Anson County school teacher. The only piece of evidence against <mark>Brown</mark> was a six-page confession that SBI Agent Mark Isley claims to have written down verbatim during a 1993 interrogation. Anson County sheriff's deputy Robert Poplin assisted during the interrogation. <mark>Brown</mark>'s attorneys called the confession a work of fiction. Doctors and psychologists agreed that its elaborate details were far too advanced for <mark>Brown</mark>, 49, who has an IQ around 50 and the mental capacity of a 7 year old. The Anson County settlement was struck in December. <mark>Brown</mark>'s attorney, David Rudolf of Charlotte, asked a federal judge to seal the settlement agreement to protect <mark>Brown</mark> from being \"manipulated and taken advantage of by ill-disposed individuals\" if the amount of the settlement were known. A federal judge agreed. Following the Anson settlement, Rudolf set up a special trust, which will manage the proceeds from both settlements on <mark>Brown</mark>'s behalf. The trust will receive about $5 million; the lawyers receive 40 percent of the award plus expenses. State law requires that all settlements by public agencies be public records. After being contacted by The News & Observer, a lawyer for the Anson County insurer asked that the settlement be opened. A federal judge unsealed it Wednesday afternoon. Anna Baucom, chairwoman of the Anson County Commissioners, said she had no idea that a settlement had been reached or its amount until contacted by a reporter. \"It's a sad situation all the way around,\" Baucom said. \"Nobody wins in this case.\" Anson County paid a $5,000 deductible in the case, according to Sean Perrin, the lawyer for the insurer. Insurance picked up the rest. In addition to SBI Agent Isley, two Anson County deputies worked the case; Lt. Bud Hutchinson and Poplin. No other evidence connected <mark>Brown</mark> to the scene. None of the evidence tested at the SBI crime lab linked <mark>Brown</mark> to the crime scene. Subsequently, Anson sheriff's deputies lost virtually all of the physical evidence. According to evidence discovered during the lawsuits, neither Isley nor the deputies investigated alternative suspects, including men who had assaulted Lynch two years previously. And none of the deputies nor Isley developed evidence to corroborate <mark>Brown</mark>'s alleged confession. In 1998, Poplin and Hutchinson pled guilty to federal racketeering charges for soliciting and taking bribes from criminal suspects in return for dropping or reducing charges against the suspects. Soon after his arrest, <mark>Brown</mark> was declared incompetent to stand trial by doctors at Dorothea Dix Hospital in Raleigh. <mark>Brown</mark> was jailed at Dix until 2007, when Durham County Superior Court Judge Orlando Hudson freed him after determining that <mark>Brown</mark> had been unlawfully held and that the confession wasn't enough to prove he had committed murder. <mark>Brown</mark> was never brought to trial because he did not have the mental competency necessary to stand trial. <mark>Brown</mark> is living fulltime with a caretaker, learning life skills at programs for the mentally disabled and dealing with health problems. In a recent interview, he said he would like to visit New York City and Washington, DC."}, {"articleID": "2020022013_00031903_W", "names": {"William Turner": ["Q51584412", "Q54634429"], "Adam Smith": ["Q14950467", "Q16255210", "Q20023132", "Q22121229", "Q33035156", "Q350916", "Q350920", "Q42763651", "Q4679545", "Q4679802", "Q4679803", "Q4679807", "Q4679808", "Q48976986", "Q52116879", "Q5539790", "Q56997269", "Q57451408", "Q58051258", "Q58219052", "Q59065"], "David Clarke": ["Q1174015", "Q16728080", "Q21165907", "Q29642480", "Q3017681", "Q3703144", "Q47091771", "Q51952713", "Q5232396", "Q5232398", "Q5232401", "Q5232402", "Q5232403", "Q5232404", "Q5232405", "Q5239350", "Q54153120", "Q7248140"]}, "date": "2020-02-20", "url": "http://salisburyjournal.co.uk/news/national/18249661.jmw-turner-20-banknote-enters-circulation/", "content": "News National JMW <mark>Turner</mark> £ 20 banknote enters circulation By Press Association 2020 New 20 pound note 0 comment A new £ 20 banknote featuring artist JMW <mark>Turner</mark> will start to appear in ATMs and tills from Thursday as it enters circulation. The new polymer £ 20 note will replace the paper £ 20 note featuring economist <mark>Adam Smith</mark> and has been hailed by the Bank of England as its most secure banknote yet. It includes two see-through windows and a two colour foil to help thwart counterfeiters. The Bank expects half of all ATMs across the UK to be dispensing polymer £ 20 banknotes in just two weeks' time. The son of a barber and a wig maker, Joseph Mallord <mark>William Turner</mark> (1775-1851) became renowned as one of the great masters of painting. He first exhibited at the Royal Academy in 1790 aged just 15. (PA Graphics) <mark>Turner</mark> produced more than 550 oil paintings, 2,000 watercolours, and 30,000 sketches and drawings. He became known as \"the painter of light\" and had a keen interest in depicting nature such as extreme weather conditions and the violent power of the sea. Features on the new <mark>Turner</mark> note include:--A large see-through window with a blue and gold foil on the front depicting Margate lighthouse and <mark>Turner</mark> Contemporary. The foil is silver on the back. The shape of the large window is based on the shape of the fountains in Trafalgar Square. Just 2 days to go until the launch of the new £ 20 note and we have another fact for you: all together, the £ 20 notes currently in circulation weigh 1,780 tons. That's the same as 141 buses! https: //t.co/9IkPHceWKN #TheNew 20 pic.twitter.com/L4it9shL0S--Bank of England (@ bankofengland) February 18, 2020--<mark>Turner</mark>'s self-portrait, painted around 1799 and currently on display in Tate Britain .--One of <mark>Turner</mark>'s most celebrated paintings The Fighting Temeraire--a tribute to the ship HMS Temeraire which played a distinguished role in Nelson's victory at the Battle of Trafalgar in 1805. It was voted the nation's favourite painting in a BBC Radio 4 poll .--A metallic hologram which changes between the word \"twenty\" and \"pounds\" when the note is tilted .--A purple foil patch containing the letter \"T\" and based on the staircase at Tate Britain .--A quote \"Light is therefore colour\" from an 1818 lecture by <mark>Turner</mark> referring to the use of light, shade, colour and tone in his pictures .--<mark>Turner</mark>'s signature from his will, in which he bequeathed many of his paintings to the nation. The paper £ 20 notes can still be used as normal and the Bank will give six months' notice ahead of their legal tender status being withdrawn. The new £ 20 note arrives in 3 days. Did you know that there are currently two billion £ 20 notes in circulation? If you laid them in a line, you could wrap them around the world nearly seven times! https: //t.co/M9EpX6x1qd #TheNew 20 pic.twitter.com/LNFxutrupz--Bank of England (@ bankofengland) February 17, 2020 There are over two billion £ 20 notes in circulation. Laid end to end, two billion polymer £ 20 notes would stretch around the world almost seven times and weigh the equivalent of more than 141 double decker buses, the Bank said. The note will join the Sir Winston Churchill £ 5 and the Jane Austen £ 10 in the Bank of England's first series of polymer notes. A new polymer £ 50 featuring Bletchley Park codebreaker Alan Turing will be issued next year. Speaking at Tate Britain, which houses the <mark>Turner</mark> Bequest, Bank of England Governor Mark Carney said: \"Our banknotes celebrate the UK's extraordinarily rich and diverse heritage and highlight the contributions of its greatest citizens. <mark>Turner</mark>'s art was transformative.\" I am delighted that the work of arguably the single most influential British artist of all time will now appear on another two billion works of art--the new £ 20 notes that people can start using today. \"<mark>Turner</mark>'s self-portrait, as featured on the new £ 20 note, is on display at Tate Britain alongside the banknote. Home to the <mark>Turner</mark> Bequest which includes 300 oil paintings and many thousands of sketches and watercolours, Tate Britain will present a major new exhibition dedicated to <mark>Turner</mark> later this year--<mark>Turner</mark>'s Modern World. The new £ 20 note is the first to feature the signature of Sarah John, the Bank's chief cashier. She said:\" Moving the £ 20 note to polymer marks a major step forward in our fight against counterfeiting. I am very grateful to everyone across the cash industry who has made this transition possible and I hope the public enjoy using their new <mark>Turner</mark> £ 20s. \"The Royal National Institute of Blind People (RNIB) has been working with the Bank to make money accessible for people with sight loss. The new note has tactile markings on it with three separate clusters of dots along the short edge to differentiate it from the £ 10 note, which has two clusters of dots. It is larger than both the £ 10 and £ 5 notes. <mark>David Clarke</mark>, RNIB director of services, said:\" Handling cash can often be a challenge if you're blind or partially sighted, because it can be difficult to tell the difference between the different notes and coins. We hope the creation of these notes will help enable people with sight loss to use money more easily and with confidence. \"By incorporating tactile features on money, we are closer to creating a more inclusive society; it's the small changes that can make a big difference to independent living.\" The Bank has said that polymer notes last longer than paper notes and remain in better condition. But a previous freedom of information request by the PA news agency found that nearly 50 million plastic £ 5 and £ 10 notes have had to be replaced since they were launched by the Bank of England due to wear and damage. Around 20 million of the Bank's new polymer £ 5 notes were replaced in the first three years since they were introduced. And about another 26 million £ 10 notes were replaced in the two years since they were launched in September 2017. Alex Farquharson, director of Tate Britain, said: \"We are thrilled that <mark>Turner</mark> is featured on the new £ 20 banknote.\" As one of Britain's greatest artists--perhaps even the greatest--<mark>Turner</mark> is a key figure in the history of art. \"0 comment"}, {"articleID": "2018022015_00085296_W", "names": {"Rick Gates": ["Q42429771", "Q92901"]}, "date": "2018-02-20", "url": "https://www.washingtonpost.com/local/public-safety/mueller-probe-london-based-son-of-russian-businessman-to-plead-guilty-to-false-statements/2018/02/20/142f4d2e-164b-11e8-b681-2d4d462a1921_story.html?tid=pm_local_pop", "content": "The London-based son-in-law of a Russian businessman is set to plead guilty Tuesday afternoon in Washington to making false statements in special counsel Robert S. Mueller III's probe of alleged Russian interference in the 2016 U.S. presidential election, according to a new court filing. Alex Van der Zwaan was charged with one count of making false statements, a felony, about his work as an attorney employed by a law firm engaged in 2012 by the Ukraine Ministry of Justice to prepare a report on the trial of former Ukrainian Prime Minister Yulia Tymoshenko. Tymoshenko was imprisoned by former president Viktor Yanukovych for signing in 2009 a controversial gas supply deal with Russia. Van der Zwaan is the son-in-Russian oligarch German Khan. U.S. prosecutors in Mueller's office said the case was related to former Trump 2016 presidential campaign manager Paul Manafort, who was an adviser to Yanukovych. Manafort and his longtime employee, <mark>Rick Gates</mark>, have pleaded not guilty to conspiracy, fraud and money laundering charges arising from the allegedly secret lobbying work for a Russian-friendly political party in Ukraine. Former associate to former Trump campaign manager Paul Manafort, <mark>Rick Gates</mark> (Michael Reynolds/Epa-Efe/Rex / Shutterstock) [Judge lashes out at \"unacceptable' delays in setting trial of Manafort and <mark>Gates</mark> in Mueller probe] Van der Zwaan is expected to appear at an arraignment and plea hearing at 2:30 p.m. Tuesday before U.S. District Court Judge Amy Berman Jackson of Washington. In a two-page information document, prosecutors alleged that Van der Zwaan falsely told the FBI and Mueller's office that his last communication with <mark>Gates</mark> was in mid-August 2016 in an innocuous text message and his last communication with another, unnamed person was in 2014 when Van der Zwaan discussed that person's family. Van der Zwaan also allegedly falsely said he did not know why a September 2016 email between him and the other person, identified in court documents only as\" person A \"was not produced to prosecutors. In fact, prosecutors alleged, Van der Zwaan spoke with both <mark>Gates</mark> and Person A regarding the report on Tymoshenko and recorded the calls. Van der Zwaan also allegedly\" deleted and otherwise did not produce emails \"sought by prosecutors and an unnamed law firm. A criminal information is a type of charging document that can be filed only with a defendant's permission and usually indicates the person is cooperating with investigators. A judge does not have to accept a plea deal, and a defendant can change his mind before making a plea. U.S. authorities in 2016 asked the Skadden, Arps, Slate, Meagher & Flom law firm for information and documents related to its work on behalf of Yanukovych's government, including Manafort's work arranging the report that was used by the former president's allies to justify his rival Tymoshenko's arrest. Correction: An earlier version of this story described Alex Van der Zwaan as German Khan's son. He is his son-in-law and the story has been corrected."}, {"articleID": "2014101511_00093139_W", "names": {"Mark Thomas": ["Q15273374", "Q1900455", "Q25184467", "Q48360466", "Q50147826", "Q57143303", "Q6767708", "Q6769973", "Q6769975", "Q6769976", "Q6769978", "Q6769980", "Q8835918"]}, "date": "2014-10-15", "url": "http://upi.com/Top_News/US/2014/10/14/Oklahoma-newspaper-publisher-wife-daughter-slain-in-home/1001413313626/?spt=hts&or=3", "content": "Oklahoma newspaper publisher, wife, daughter slain in home The publisher of two weekly newspapers in Oklahoma, his wife and daughter were found slain in their home in Duncan, police said. The bodies of John Hruby, 50, his wife, Katherine \"Tinker\" Hruby, 48, and Katherine, 17, were found by a housekeeper Monday morning. Investigators believe they were killed late Thursday or early Friday. \"It is a homicide...It may well be a day or two or three before we really know exactly what all was going on,\" Stephens County District Attorney Jason Hicks said late Monday. Hruby sold the Duncan Banner in 1997. He returned to weekly newspapers with the purchase of the Marlow Review in 2007 and the Comanche County Chronicle last year. <mark>Mark Thomas</mark>, executive vice president of the Oklahoma Press Association, Legal problems plagued family in Bell, Florida for years Oregon governor's fiancée Cylvia Hayes admits to pot growing Gunpowder residue detected on Vonderrit Myers' hands, t-shirt and jeans © 2014 United Press International, Inc.. All Rights Reserved. Any reproduction, republication, redistribution and/or modification of any UPI content is expressly prohibited without UPI's prior written consent. Oregon governor's fiancée Cylvia Hayes admits to pot growing ABOUT UPI Since 1907, United Press International (UPI) has been a leading provider of critical information to media outlets, businesses, governments and researchers worldwide. UPI is a global operation with offices in Beirut, Hong Kong, London, Santiago, Seoul and Tokyo. Our headquarters is located in downtown Washington, DC, surrounded by major international policy-making governmental and non-governmental organizations. UPI licenses content directly to print outlets, online media and institutions of all types. In addition, UPI's distribution partners provide our content to thousands of businesses, policy groups and academic institutions worldwide. Our audience consists of millions of decision-makers who depend on UPI's insightful and analytical stories to make better business or policy decisions. In the year of our 107th anniversary, our company strives to continue being a leading and trusted source for news, analysis and insight for readers around the world. Privacy Policy © 2014 United Press International, Inc.. All Rights Reserved. UPI.com is your trusted source for world news, top news, science news, health news and current events."}, {"articleID": "2016052507_00319771_W", "names": {"David Mitchell": ["Q16732686", "Q18719365", "Q20641188", "Q21997614", "Q24804720", "Q30347996", "Q40479", "Q43912296", "Q457134", "Q5237616", "Q5237619", "Q5237621", "Q5237622", "Q5237623", "Q5237624", "Q5237625", "Q5237626", "Q5237629", "Q52422545"]}, "date": "2016-05-24", "url": "http://www.dailymercury.com.au/news/melinda-does-doris/3033060/", "content": "Melinda Does Doris will show at the Mackay Entertainment and Convention Centre on June 9. Contributed Related Items Graeme Connors to perform in Mackay after new album release MECC turns their focus to attracting more business events Local Real Estate Subscribe Now AUSTRALIAN country singer Melinda Schneider is the ideal woman to pay tribute to American screen icon Doris Day. They share a love of dogs and a career in the spotlight. Both are blonde singers, born into German Catholic families. They both - in Schneider's words - have \"chosen a few shockers of men\" in their time. It's fitting that Schneider has co-written (with <mark>David Mitchell</mark> of Dusty and Shout! fame) a stage show tribute to pay tribute to the iconic actress and singer, who is now in her 90s. Schneider will bring Melinda Does Doris to Mackay next month. Schneider was seven or eight years old when she first saw Day on screen, starring in the film Calamity Jane. \"I just fell in love with her in that role,\" she said. \"I just loved her as a personality - she was a great singer, great dancer, wonderful comedian.\" Being born into a country music family, that film resonated with me because of the Western theme. \"What Schneider loves best about Day is that she is a\" survivor \".\" She's survived four tumultuous marriages, her third husband lost all of her money so she went bankrupt, \"she said.\" She even had a brush with Charles Manson. \"In researching the show, Schneider read many biographies and got to know some of Day's friends, who live in Sydney. Schneider said the Melinda Does Doris show she was bringing to Mackay next month was a smaller,\" more intimate \"version of her full theatre show of the same name.\" That version of the show was like a mini-musical, with big sets, an eight-piece band, horns and two dancing boys, \"she said. Budgeting restraints made the show difficult to tour regionally, so Schneider has adapted it.\" (<mark>Mitchell</mark> and I) came up with the idea to strip it back, do it with a little jazz trio, make it a more intimate show, \"she said.\" It's 26 songs, and I tell all the same amazing stories of Doris' life. \"Melinda Does Doris will show at the Mackay Entertainment and Convention Centre (MECC) Auditorium on Thursday, June 9 at 7.30 pm. Tickets are $49 for adults, $39 for pensioners and $29 for children under 14. To purchase, visit http: //www.mackaytix.com.au or phone the MECC on (07) 4961 9777. doris day Read More Login to follow entertainment Read More Login to follow mackay entertainment and convention centre Read More Login to follow melinda schneider Read More Login to follow music Read More Login to follow pulse Read More Login to follow Topics: doris day, entertainment, mackay entertainment and convention centre, melinda schneider, music, pulse 0 PRINT Have your say Recommended Reading Man jailed for Wolf Creek style backpacker attack Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now"}, {"articleID": "2017052318_00159532_W", "names": {"Scott Bailey": ["Q1464826", "Q6379124", "Q7435932"], "Corey Norman": ["Q20649212", "Q5170410"]}, "date": "2017-05-23", "url": "http://au.news.yahoo.com/a/-/sport/35615693/french-keen-to-make-sure-hes-no-1-eel/", "content": "<mark>Scott Bailey</mark> - AAP on May 24, 2017, 3:35 am Share Tweet Whatsapp Email Share French keen to make sure he s No. 1 Eel - Yahoo7 Pinterest Tumblr Bevan French is back from his knee injury and ready to stake his permanent claim on the Parramatta fullback spot. French returned for the Eels' in their 22-16 NRL loss to Canberra on Saturday night, after a six-week lay-off with a ruptured posterior cruciate ligament. He pulled up tender following Saturday's game, but is certain he will be fit to take on South Sydney at ANZ Stadium on Friday night. Currently without five-eighth <mark>Corey Norman</mark>, French has slotted straight in at the back with Clinton Gutherson, who deputised for French in his absence, now covering <mark>Norman</mark>. And such was Gutherson's form at fullback, the flashy French knows he has to earn the spot back. \"It's a big five weeks for me,\" French said. \"I want to play fullback and hopefully stay there all season...It is my preferred position. Hopefully I do cement the spot but it's what's good for the team.\" Gutherson's numbers at fullback are marginally better than those of the ultra-impressive French, while the pair can each fill a number of positions in the backline. \"Gutho is killing it wherever he plays,\" French said. \"He went really good at fullback when he was there...I've got to really keep my game up over the next few weeks.\" I was probably a bit off my game there on the weekend but hopefully I can turn it around this week. \"Key to that will be his combination with new halfback Mitchell Moses, given French's ability to find the try line once given the ball in open space. And while he admitted Moses at times looked\" lost \"in the Eels' attack last week, the pair had worked closely in video sessions to quickly remedy any problems they might have had combining.\" Mitch came in last week and offered quite a bit. He looked a bit lost at times attacking the try-line, but worked on that this week, \"French said.\" It was expected, we only had two sessions coming in, but still no excuses. \"We've watched a bit of video and seen what we need to work on.\" Share Tweet Whatsapp Email Share French keen to make sure he s No. 1 Eel - Yahoo7 Pinterest Tumblr"}, {"articleID": "2015040214_00050768_W", "names": {"Anne Richard": ["Q27995611", "Q2851261"]}, "date": "2015-04-02", "url": "http://news.yahoo.com/us-resettle-more-syrian-refugees-near-future-142513509.html", "content": "BEIRUT (AP) - A U.S. official says Washington is planning to increase the number of Syrian refugees allowed to resettle in the United States, mostly for vulnerable cases. Assistant Secretary of State <mark>Anne Richard</mark> says the numbers will still be very small compared with the nearly 4 million Syrians who have become refugees in neighboring countries, mostly Lebanon, Jordan and Turkey. <mark>Richard</mark> told reporters at the U.S. Embassy in Beirut on Thursday that the U.S. has received 648 Syrian refugees since the crisis began in 2011. She says the U.S. is \"moving to bring more refugees to the United States, and that between 1,000 and 2,000 will be brought in by the end of September. <mark>Richard</mark> says Washington seeks to bring\" those who have severe medial conditions, widows and orphans \"and traumatized people. <mark>Anne Richard</mark> Syrian refugees"}, {"articleID": "2014121200_00016857_W", "names": {"Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"]}, "date": "2014-12-11", "url": "http://www.morningstaronline.co.uk/a-88ae-Goodbye-Gordon-Brown/", "content": "He brought us boom and bust, facilitated City gambling, increased in-work benefits and oversaw the decline of British manufacturing. Nick Matthews on <mark>Brown</mark>'s legacy As <mark>Gordon Brown</mark> disappears into the dustbin of history as the man who saved the Union, it is appropriate to take a look at his significance. There is no doubt that he was both the architect and builder of new Labour's economic policy which has been so difficult for Ed Miliband to shake off. This is probably because he has persisted in dragging the dead weight of Ed Balls around with him. Balls not only represents the <mark>Brown</mark> legacy but offers little hope that Labour has learned anything from those years. My own view is that history will be much kinder to <mark>Brown</mark> the prime minister than to <mark>Brown</mark> the chancellor. This is probably the exact opposite of the popular perception. <mark>Brown</mark> the prime minister may have offered up a Freudian slip in the Commons when he said he had \"saved the world\" but to a large extent he had. When the banks teetered on the edge of collapse in 2008 he bailed them out and put up taxes. <mark>Brown</mark>'s bank nationalisation and bailout was the right thing to do. The alternative would have been catastrophic. However at a greater distance one can see that in effect the banks nationalised the government and socialised their losses. Did <mark>Brown</mark> extract enough from the state's newfound role as the owner or part owner of these banks? The answer is no. That bargain could only have been struck at the moment of disaster when - for a moment - the power moved to the state. But <mark>Brown</mark> asked for little or nothing for underwriting the banks to the tune of £ 1,162 billion. On the plus side, <mark>Brown</mark>'s Keynesian efforts to counteract the crisis meant the economy was returning to growth - before <mark>George Osborne</mark> put the brakes on with his first emergency budget and derailed the whole process, costing billions in lost output. However that is only a small part of <mark>Brown</mark>'s record. As chancellor he was a slavish supporter of Alan Greenspan who for 18 years was boss of the US Federal Reserve. The same Greenspan who finally admitted when the banks were collapsing that he had found a flaw in the theory of \"perfect markets\" - a flaw that had been obvious to most of us for years. Having pursued policies of deregulation and liberalisation, Greenspan had now found \"he made a mistake in presuming that the self-interests of organisations, specifically banks and others, were such that they were best capable of protecting their own shareholders and their equity in the firms.\" In pursuing the same policies and making London a safe haven for rogue global capital, <mark>Brown</mark> turned the City in to the world's largest tax haven. One of his daftest ideas and one the Establishment continues to praise him for was making the Bank of England \"independent.\" One of the greatest triumphs of the post-war Labour government was the nationalisation of the Bank of England. The idea that the policies pursued by the bank can somehow be depoliticised is fatuous. At this level economics is politics. What's more, an independent bank for years kept UK interest rates higher than those in mainland Europe, doing untold damage to Britain's manufacturing sector. <mark>Brown</mark> managed to destroy one-and-a-half million manufacturing jobs in the process. As well as liberating the City and the financial services sector to do their worst, his next crime was the way he structured the welfare state to create a set of subsidies to the private sector. His complex web of in-work benefits kept workers trapped on low pay and subsidised bad employers. Simultaneously housing benefit grew as private-sector landlords had a field day ratcheting up rents to milk the subsidy. What's more, because ordinary people received little benefit from his largesse they did not thank him at the ballot box for this spending. There are other examples, including the way that private-sector provision of care for children and the elderly has fallen in quality and risen in cost. A week does not go by without some scandal in these private services. He was truly naive in thinking ownership did not matter and you could use regulated markets to achieve better services for the public. Clearly Blair and <mark>Brown</mark> both had a malign influence in the Labour Party. <mark>Brown</mark> was ruthless in rooting out any opposition to his policies and spent an inordinate amount of time jousting with Blair in placing his cronies in safe parliamentary constituencies. It is clear now that the golden years of <mark>Brown</mark>'s chancellorship can be seen as being funded by fool's gold. Owned By Our Readers We're a reader-owned co-operative, which means you can become part of the paper too by buying shares in the People's Press Printing Society. Subscribe Have the Morning Star at your fingertips, wherever you are. All Rights Reserved Owned by Our Readers Companies House Number: IP12750R Registered office:"}, {"articleID": "2010072410_00066529_W", "names": {"Johnny Mathis": ["Q3809734", "Q449612"], "Steve Martin": ["Q16473", "Q2347163", "Q48152466", "Q55085130", "Q55085225", "Q7613276", "Q7613279", "Q7613281", "Q7613283"]}, "date": "2010-07-24", "url": "http://headlines.ocregister.com/entertainment/million-82708-center-performances.html", "content": "the orange county performing arts center saw significant increases in attendance and income during its recently concluded 2009-10 season, according to figures released friday. total income in 2009-10 was $47.2 million, an 88.8 percent increase over $25 million in 2008-09. the center took in $23.5 million in ticket revenue, compared with $15 million in 2008-09. the increases can be attributed to a bigger broadway presence, including well-attended performances of \"the lion king,\" \"spamalot,\" \"dreamgirls\" and \"fiddler on the roof.\" the bolshoi ballet's \"don quixote,\" <mark>johnny mathis</mark> and <mark>steve martin</mark> also drew large crowds. \"the community responded very favorably this past year, and we were very pleased,\" said center president terrence w. dwyer. \"it was a busy season. a number of high-quality, popular productions and acts were available, and we were very pleased we were able to secure them.\" with greater income, operating expenses also rose. the operating budget was $47 million in 2009-10, compared with $39 million in 2008-09. in 2007-08, it was $57 million. contributions remained relatively steady, with $9.2 million to the center fund and $2 million in endowment fund support. in 2008-09, the center fund received $9.5 million and the endowment got $4.7 million. the endowment now stands at more than $45 million. results were announced thursday evening during the center's annual members' meeting. overall, the center posted a $200,000 surplus, which will be applied to the deficit of $700,000. the orange county performing arts center saw significant increases in attendance and income during its recently concluded 2009-10 season, according to figures released friday. the county's largest arts nonprofit organization presented 273 public performances in its four venues from july 1, 2009, to june 30, with total paid admissions of 414,418. that compares with 210 public performances in 2008-09, with paid attendance totaling 300,409 people - increases of 30 percent and 38 percent, respectively. user agreement. 1. keep it civil and stay on topic. 2. no profanity, vulgarity, racial slurs or personal attacks. we were unable to request friendship with this user. are you logged in? please wait while we file your abuse report. we're sorry, but the comment you are sending has been removed from the site. would you line up to buy blizzard's long-awaited starcraft ii game sequel?"}]