[{"date": "2019-12-22", "url": "http://www.somersetcountygazette.co.uk/sport/national/18117808.ancelotti-sets-sights-champions-league-everton/", "content": "Ancelotti sets sights on Champions League with Everton By Press Association 2019 Carlo Ancelotti watched on against Arsenal 0 comment Carlo Ancelotti has targeted Champions League football with Everton, who he has described as \"one of the greatest clubs in England\". Everton appointed Ancelotti as their permanent new manager on Saturday and the 60-year-old Italian has signed a four-and-a-half-year contract. \"I'm excited to be here at one of the greatest clubs in England,\" Ancelotti told evertontv in his first interview at the club .?? | \"I am excited to be here, at one of the greatest clubs in England. This is a Club with a lot of history--and ambition for the future. It's my dream to bring success .\" #EFC @ MrAncelotti gives his first interview. And it's brilliant .?? #EFC #WelcomeMrAncelotti pic.twitter.com/q9zoJSCCB5--Everton (@ Everton) December 22, 2019 \"The ambition is for us to try to win and be competitive. The goal is there to reach the Champions League or Europa League. Winning honours has to be the dream for this club and for the supporters. I am here to try to do this .\" Ancelotti won the Premier League and FA Cup double at Chelsea in 2010 and is one of only three managers to win Europe's elite competition on three occasions. \"Our goal is to be competitive in the Premier League, to be towards the top of the table, to be competitive in Europe,\" Ancelotti added. \"It's not going to happen straight away, but we have to work for this .\" To Evertonians I would like to say, stay with the team as you always do because it's really important for the players to have your support. \"I would like to work together with the supporters. My dream is to bring success to this club .\" Ancelotti, who won the European Cup twice with AC Milan and the Champions League with Real Madrid and also had spells at Juventus, Paris St Germain and Bayern Munich, is already \"loving\" being at Everton, according to chairman Bill Kenwright. Kenwright sat next to Ancelotti in the directors' box at Goodison Park on Saturday to watch the Toffees play out a goalless draw with Arsenal that was hardly inspiring. But Kenwright is confident Ancelotti is the man to push Everton back towards the top of the Premier League and praised majority shareholder <mark>Farhad Moshiri</mark> for aiming high .?? | \"Duncan gave the Club and fans a reminder of what a privilege it is to be an Evertonian .\" Emotional praise from the Chairman for Duncan Ferguson, as the Blues look forward to an exciting new era under \"world-class\" @ MrAncelotti. #EFC--Everton (@ Everton) December 21, 2019 Kenwright told evertontv: \"I have to take my hat off to <mark>Farhad</mark>. We interviewed a lot of people and <mark>Farhad</mark> was pushing for a world-class manager .\" He wants this team to be where he's wanted it to be for three and a half years. He wants this club to be winning trophies. \"That is what he is here for. We want a world-class manager to help us do that and to get us to this magnificent new stadium .\" Carlo's had a little bit of an Everton experience today. He's already loving the club. You can't not feel the embrace of this club, can you? \"While Kenwright is hugely excited for the start of a new era he reserved special praise for Duncan Ferguson, who stepped in as caretaker boss following the sacking of <mark>Marco Silva</mark>. Bill Kenwright praised the work done by caretaker Duncan Ferguson (Peter Byrne/PA) Ferguson's four-game spell resulted in victory over Chelsea, draws with Manchester United and Arsenal and a loss on penalties to Leicester in the Carabao Cup. The Scot, a hero as a player at Goodison Park, brought a huge amount of passion and energy to the role, and Kenwright said:\" It'd be hard for me to put into words the Duncan Ferguson era. \"I get emotional because I am an emotional chairman. He gave the club and fans a reminder of what a privilege it is to be an Evertonian .\" I don't know anyone else who could have done it, who could have said, \"We're going to work now and show those fans (what it means to play for Everton), because he loves those fans as much as they love him. Carlo Ancelotti (left) replaces <mark>Marco Silva</mark> as Everton manager (Anthony Devlin/PA)\" It's not just a game to him, it's Everton. \"Ferguson will stay at the club as part of Ancelotti's backroom staff and Freddie Ljungberg has also been told he will be kept on under Mikel Arteta's management at Arsenal. It was a unique situation with both men on the touchline at Goodison Park being watched by their new bosses after Arteta's appointment on Friday. 0 comment", "articleID": "2019122212_00041402_W", "names": {"Farhad Moshiri": ["Q3066849", "Q861168"], "Marco Silva": ["Q20118419", "Q57025699", "Q6757714"]}}, {"date": "2019-12-23", "url": "https://www.independent.co.uk/sport/football/premier-league/frank-lampard-chelsea-antonio-rudiger-racist-abuse-tottenham-fans-a9257651.html", "content": "Sport> Football> Premier League Close Antonio Rudiger: <mark>Frank Lampard</mark> would back Chelsea players walking off pitch over racist abuse <mark>Lampard</mark> responded after his German defender reported suffering from monkey chants during their 2-0 win at Tottenham Nick Purewal Monday 23 December 2019 09:58 {{^ moreThanTen}} {{total}} comments {{/ moreThanTen}} <mark>Frank Lampard</mark> has promised to back his Chelsea players if they ever ask to walk off the pitch amid any future racist abuse. Antonio Rudiger claimed he was subjected to racist chanting during Chelsea's 2-0 Premier League derby win at Tottenham. Referee <mark>Anthony Taylor</mark> halted play at the Tottenham Hotspur Stadium, while announcements reminded fans there is \"no place for racism in the game\". Download the new Indpendent Premium app Sharing the full story, not just the headlines Download now And after the match, the German asked: \"When will this nonsense stop?\" In a series of tweets on Sunday evening, he said: \"I really hope that the offenders will be found and punished soon, and in such a modern football ground like the Tottenham Hotspur Stadium with dozens of TV and security cameras, it must be possible to find and subsequently punish them. Shape Created with Sketch. Ratings: Tottenham vs Chelsea Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Ratings: Tottenham vs Chelsea 1/22 Paulo Gazzaniga: 4 out of 10 AFP via Getty Images 2/22 Serge Aurier: 6 out of 10 AFP via Getty Images 3/22 Davinson Sanchez: 6 out of 10 Tottenham Hotspur FC via Getty I 4/22 Toby Alderweireld: 5 out of 10 AFP via Getty Images 5/22 Jan Vertonghen: 5 out of 10 AFP via Getty Images 6/22 Eric Dier: 4 out of 10 Getty Images 7/22 Moussa Sissoko: 6 out of 10 AFP via Getty Images 8/22 Lucas Moura: 5 out of 10 IKIMAGES/AFP via Getty Images 9/22 Dele Alli: 6 out of 10 AFP via Getty Images 10/22 Son Heung-Min: 4 out of 10 Tottenham Hotspur FC via Getty I 11/22 <mark>Harry Kane</mark>: 5 out of 10 Getty Images 12/22 Kepa Arrizabalaga: 6 out of 10 IKIMAGES/AFP via Getty Images 13/22 Antonio Rudiger: 7 out of 10 IKIMAGES/AFP via Getty Images 14/22 Kurt Zouma: 6 out of 10 Getty Images 15/22 Fikayo Tomori: 6 out of 10 Getty Images 16/22 Cesar Azpilicueta: 7 out of 10 Getty Images 17/22 N’Golo Kante: 7 out of 10 Getty Images 18/22 Mateo Kovacic: 6 out of 10 AFP via Getty Images 19/22 Marcos Alonso: 6 out of 10 AFP via Getty Images 20/22 Mason Mount: 8 out of 10 Getty Images 21/22 Willian: 9 out of 10 Getty Images 22/22 Tammy Abraham: 7 out of 10 IKIMAGES/AFP via Getty Images 1/22 Paulo Gazzaniga: 4 out of 10 AFP via Getty Images 2/22 Serge Aurier: 6 out of 10 AFP via Getty Images 3/22 Davinson Sanchez: 6 out of 10 Tottenham Hotspur FC via Getty I 4/22 Toby Alderweireld: 5 out of 10 AFP via Getty Images 5/22 Jan Vertonghen: 5 out of 10 AFP via Getty Images 6/22 Eric Dier: 4 out of 10 Getty Images 7/22 Moussa Sissoko: 6 out of 10 AFP via Getty Images 8/22 Lucas Moura: 5 out of 10 IKIMAGES/AFP via Getty Images 9/22 Dele Alli: 6 out of 10 AFP via Getty Images 10/22 Son Heung-Min: 4 out of 10 Tottenham Hotspur FC via Getty I 11/22 <mark>Harry Kane</mark>: 5 out of 10 Getty Images 12/22 Kepa Arrizabalaga: 6 out of 10 IKIMAGES/AFP via Getty Images 13/22 Antonio Rudiger: 7 out of 10 IKIMAGES/AFP via Getty Images 14/22 Kurt Zouma: 6 out of 10 Getty Images 15/22 Fikayo Tomori: 6 out of 10 Getty Images 16/22 Cesar Azpilicueta: 7 out of 10 Getty Images 17/22 N’Golo Kante: 7 out of 10 Getty Images 18/22 Mateo Kovacic: 6 out of 10 AFP via Getty Images 19/22 Marcos Alonso: 6 out of 10 AFP via Getty Images 20/22 Mason Mount: 8 out of 10 Getty Images 21/22 Willian: 9 out of 10 Getty Images 22/22 Tammy Abraham: 7 out of 10 IKIMAGES/AFP via Getty Images\" If not, then there must have been witnesses in the stadium who saw and heard the incident. It's just such a shame that racism still exists in 2019. When will this nonsense stop? \"Chelsea boss <mark>Lampard</mark> lamented the situation, admitting he would support his players walking off if subjected to a future racism storm .\" In terms of walking off the pitch, I think that has to feel right in the moment, \"said <mark>Lampard</mark>.\" And until that moment comes I don't want to guess what I would do. It would depend what the players were feeling and saying. \"But I would be absolutely, 100 per cent behind them if (they wanted to walk off), and I'm sure it would be a group decision. But we're not there yet, so it's hypothetical to a degree .\" All I know is that Toni Rudiger said he heard some racist chanting or comments, and I haven't had chance for an individual conversation with Toni. Watch more Tottenham issue statement after Chelsea's Rudiger \"racially abused'\" Of course I'll support Toni as we would support any of our players, or in fact any opposition players. Wherever this happens it needs to be dealt with. \"If it happened and it's fact, then punishment is needed and it needs to be strong .\" Willian's brace handed Chelsea a stunning 2-0 win at Spurs, who had Son Heung-min sent off for kicking out at Rudiger. Defender Rudiger complained of alleged racist abuse in the second half in north London, leaving Tottenham pledging to complete a full investigation. \"We are now conducting a thorough investigation which will include liaising with Chelsea and their players for their observations,\" read a Tottenham statement. \"Any form of racism is completely unacceptable and will not be tolerated in our stadium. We take any such allegations extremely seriously and shall take the strongest possible action against any individual found to be behaving in such a way, including stadium bans .\" Tottenham boss Mourinho--who sarcastically said he hoped Rudiger \"recovers quick from the broken ribs\" after Son's glancing blow--backed referee <mark>Taylor</mark>'s stance in halting the match. <mark>Frank Lampard</mark> applauds his Chelsea players at Tottenham (REUTERS) \"I've not much to say apart from it's something that saddens me,\" said Mourinho. \"I hate racism in society, I hate racism in football, I'm disappointed that things like that can still happen .\" But the referee stopped the game, spoke with the players, spoke with the coaches, spoke with the captains. \"As soon as I knew the reasons why the game was stopped I obviously understood and accepted it .\" Rudiger tweeted after the game and included the hashtags £ NoToRacism and £ PleaseGetSomeBasicEducation, and Chelsea forward Tammy Abraham hailed his team-mate's response. \"He is a strong character and it showed because he is a fantastic player and overcame it,\" he said. \"Everyone is doing as much as they can to make a stop for it. But there are going to be one or two people who will always remain the same .\" More about <mark>Frank Lampard</mark> | Antonio Rudiger | chelsea fc | Premier League | Show {{#moreThan 3_total}} {{value_total}} {{/ moreThan3_total}} comments Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive news and stats from the Premier League, every weekday by email Update newsletter preferences Comments Share your thoughts and debate the big issues Learn more {{#singleComment _ p}} {{value_p}} Independent Premium comment {{/ singleComment_p}} {{^ singleComment_p}} {{value_p}} Independent Premium comments {{/ singleComment_p}} {{#singleComment _ open}} {{value}} open comment {{/ singleComment_open}} {{^ singleComment_open}} {{value}} open comments {{/ singleComment_open}} Open Comments Join the discussion Create a commenting name to join the debate Submit Please try again, the name must be unique Only letters and numbers accepted Post Loading comments...{{^ comments}} There are no comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} Loading comments...{{^ comments}} There are no comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} {{#showMore}} Read more {{/ showMore}} Minds Comments Join the discussion {{^ nickname}} Create a commenting name to join the debate Submit Please try again, the name must be unique {{/ nickname}} Post Loading comments...{{^ comments}} There are no Independent Premium comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} Loading comments...{{^ comments}} There are no Independent Premium comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} {{#showMore _ p}} Read more {{/ showMore_p}} Follow comments Enter your email to follow new comments on this article. Subscribe Thanks for subscribing! {{errorMessage}} Vote Are you sure you want to submit this vote? Submit vote Cancel You must be logged in to vote. Report Comment Are you sure you want to mark this comment as inappropriate? Cancel Flag comment This comment has been flagged. Subscribe to Independent Premium to debate the big issues Want to discuss real-world problems, be involved in the most engaging discussions and hear from the journalists? Start your Independent Premium subscription today. Subscribe Already registered? Log in Report Comment Are you sure you want to mark this comment as inappropriate? Flag comment Cancel This comment has been flagged. Delete Comment Are you sure you want to delete this comment? Cancel Delete comment Deleting comment...This comment has been deleted. This comment has been deleted. About The Independent commenting Independent Premium Comments can be posted by members of our membership scheme, Independent Premium. It allows our most engaged readers to debate the big issues, share their own experiences, discuss real-world solutions, and more. Our journalists will try to respond by joining the threads when they can to create a true meeting of independent Premium. The most insightful comments on all subjects will be published daily in dedicated articles. You can also choose to be emailed when someone replies to your comment. The existing Open Comments threads will continue to exist for those who do not subscribe to Independent Premium. Due to the sheer scale of this comment community, we are not able to give each post the same level of attention, but we have preserved this area in the interests of open debate. Please continue to respect all commenters and create constructive debates. Subscribe Already registered? Log in", "articleID": "2019122310_00156680_W", "names": {"Anthony Taylor": ["Q21457929", "Q3618544", "Q4453759", "Q572863", "Q7823537"], "Frank Lampard": ["Q41533", "Q461633"], "Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}}, {"date": "2019-12-24", "url": "http://www.kob.com/albuquerque-business-news/former-uber-ceo-kalanick-to-resign-from-companys-board/5588719/?cat=649", "content": "Advertisement Former Uber CEO Kalanick to resign from company's board FILE - In this Feb. 26, 2017, file photo, Uber CEO Travis Kalanick arrives at the Vanity Fair Oscar Party in <mark>Beverly Hills</mark>, Calif.. Former Uber CEO Kalanick will resign from the company's board next week, effectively severing ties with the company he co-founded a decade ago. (Photo by Evan Agostini/Invision/AP, File) | Photo: AP Updated: December 24, 2019 08:01 AM Created: December 24, 2019 07:53 AM New York (AP) - Former Uber CEO Travis Kalanick will resign from the board next week, effectively severing ties with the ride-hailing company he co-founded a decade ago. Uber turbocharged the gig economy and since 2010 has logged 15 billion trips. Kalanick was ousted as CEO in the summer of 2017 with the company mired in numerous lawsuits. Advertisement The departure did not come as a surprise. Kalanick recently sold more than $2.5 billion worth of shares in the company, more than 90% of his holdings. \"Uber has been a part of my life for the past 10 years. At the close of the decade, and with the company now public, it seems like the right moment for me to focus on my current business and philanthropic pursuits,\" Kalanick said in a prepared statement Tuesday. \"I'm proud of all that Uber has achieved, and I will continue to cheer for its future from the sidelines .\" Uber under Kalanick grew with incredible speed, but like a number of other tech startups, the company ran into trouble with a corporate culture that appeared at times to be reeling out of control. A former Uber engineer, Susan Fowler, discloses sexual harassment and sexism claims in a blog post about her year at Uber. Fowler says her boss propositioned her and higher-ups ignored her complaints. Kalanick calls Fowler's accusations \"abhorrent\" and hires former U.S. Attorney General <mark>Eric Holder</mark> to investigate. Days later, Waymo, a self-driving car company spun off from Google, sues Uber. Waymo alleges that Anthony Levandowski - a former top manager for Google's self-driving car project - stole pivotal technology from Google before leaving to run Uber's self-driving car division. Then, The New York Times reveals that Uber used a phony version of its app to thwart authorities in cities where it was operating illegally. Uber's so-called Greyball software identified regulators who were posing as riders and blocked access to them. The U.S. Justice Department is investigating Uber's use of the Greyball software. (Copyright 2019 by The Associated Press. All Rights Reserved.)", "articleID": "2019122415_00023794_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "Eric Holder": ["Q312644", "Q3591180"]}}, {"date": "2019-12-25", "url": "http://www.echonews.com.au/news/simple-rule-behind-aussies-30m-empire/3909373/", "content": "Business Simple rule behind Aussie's $30m empire by Alexis Carey 25th Dec 2019 1:58 PM 0 When Aussie man Sabri Suby was young, he watched his single mum juggle three exhausting jobs to support her kids. She would then return to the family's Byron Bay home only to start cooking healthy, homemade meals for him and his sister, and it taught him one crucial, lifelong lesson - something he dubs the \"single mum work ethic\". It had a \"profound impact\" , and as soon as he could, Mr Suby began taking on after-school jobs to help out, including his first role grinding peanut butter at a health food store for just $2.50 an hour. \"I also started busking at markets with my harmonica on the weekends trying to earn $80 to $100 to help with electricity bills or groceries - I gave all my money to my mum,\" he told news.com. au. Sabri Suby worked multiple jobs as a teen to help his single mum but now runs a $30 million company. \"Watching her work so hard had a profound effect on me and it has served me in life .\" You might have more connections or have grown up in a better area or with two parents, but one thing you can't take away from me is my work ethic. \"Mr Suby got an after-school sales job at 16 and discovered a natural knack for it. After finishing high school, he made a conscious decision not to go straight to uni, so he packed his bags and moved to London for two years, working in sales\" door to door, face-to-face and over the phone \". Again, it was an industry he thrived in, and he decided to move back to Australia and study business marketing at RMIT. He worked full time for a company selling Google AdWords and specialising in online marketing and search engine optimisation to support himself as he studied, making a near-minimum wage base salary and earning sales commissions on top. However, he was\" not living a lavish lifestyle by any means \"and the wage was\" just enough to survive \"- so at 21, he started his own business after realising he could do things better. It made more than a million dollars in revenue, and Mr Suby went on to launch a string of other businesses. <mark>King Kong</mark> now employs 34 people in its Melbourne office .\" Some failed, some did OK and some I sold, \"he explained. Then, five years ago, he launched digital marketing company <mark>King Kong</mark>. At the time he had just a\" couple of hundred dollars in the bank \"after experiencing years of business ups and downs and having just gotten married .\" I was at ground zero but I had made a commitment to this girl, so it was time to pony up and forge a real business career, \"he said .\" It was the moment I drew a line in the sand - I was literally wondering how I was going to pay rent, so I decided to go back to my roots, making 150 cold calls a day. \"I had no rich uncle, no venture capital or loans or savings, so I had to go out there and make it myself .\" In the beginning, Mr Suby was working 18-hour days doing everything himself from running errands to cleaning the office and bookkeeping. But then he stumbled upon a simple rule that changed everything. It was the \"80-20 rule\" - also known as the Pareto principle. The 34-year-old is now a married father of one. \"The principle is that 20 per cent of the input of anything will give you 80 per cent of the output - so 20 per cent of customers will give 80 per cent of profits, or 20 per cent of the roads in a city will carry 80 per cent of the traffic,\" he said. \"It wasn't until I sat down and had a real audit of my time that I realised what I was doing wasn't sustainable - so I asked myself,\" what are the things I'm doing that are actually moving the money needle and driving the business forward or making more revenue?' So I started to automate or delegate and take the grunt work out of the business. \"That's when things truly\" exploded \".\" It was like a switch - once I made the conscious decision to spend all my time selling, within a couple of days, instead of getting one or two clients a week we were getting four to five. It doubled sales almost overnight, \"he said. Today <mark>King Kong</mark> is valued at $30 million with a three-year growth rate of 314 per cent, has 65 staff members in its shiny new Melbourne office and attracts thousands of new clients each month. Mr Suby, now a 34-year-old father of one, said it was a\" humbling experience \"to have gone from such a modest upbringing to become a multimillion-dollar success story. Sabri Suby says the key to success is to work hard--and work smart .\" The opportunities we have in Australia are incredible - you can come from an unfortunate upbringing with just one parent working three jobs with no money, no private school and no cheque written for uni...and turn yourself into a multimillion-dollar success, \"he said .\" You can go out there with no resources from an unfortunate situation...but when people roll up their sleeves and get the job done it doesn't matter the colour of your skin, where you come from or who your parents are, it evens the playing field. \"Don't wait for somebody to tell you you're worthy of success, just get out there .\" Mr Suby, whose first book, Sell Like Crazy, became a bestseller this year, said the secret to success came down to \"working tirelessly\" - but also working smart. \"Isolate the things you have to do to drive the business forward, and work like a dog on those things. Find the small hinges that swing the big doors,\" he said. Mr Suby's book was released earlier this year. \"One thing that is constant is that the hardest worker in the room will be a success, and my advice is you want to exercise your work ethic like a muscle - you won't make money without hard work .\" More Stories From $7 Pizza Hut wage to $250m empire premium_icon Burger chain's rapid expansion to 50 outlets More Stories From $7 Pizza Hut wage to $250m empire premium_icon Burger chain's rapid expansion to 50 outlets Show More 0 80-20 rule Read More Login to follow australian entrepreneur Read More Login to follow editorship Read More Login to follow entrepreneur Read More Login to follow millionaire Read More Login to follow 80-20 rule australian entrepreneur editorship entrepreneur millionaire", "articleID": "2019122503_00028272_W", "names": {"King Kong": ["Q2171232", "Q22278621", "Q6411824"]}}, {"date": "2019-12-26", "url": "https://timesofindia.indiatimes.com/city/delhi/businessman-with-bullet-injury-found-dead-in-car/articleshow/72986788.cms", "content": "Delhi: Businessman with bullet injury found dead in car Top Searches: Delhi: Businessman with bullet injury found dead in car TNN | Updated: Dec 27, 2019, 5:35 IST Sachin Agarwal NEW DELHI: A 36-year-old businessman was found dead with a gunshot wound on his right temple in Vivek Vihar area in east Delhi on Thursday morning. A friend of the deceased, who was also with him when the incident took place, claimed that he shot himself. <mark>Amit Sharma</mark>, deputy commissioner of police, Shahdara, said \"The weapon has been seized. Whether the businessman shot himself or not will only be clear once we get the forensic report .\" Police were informed around 11.30 am about a man found dead in an SUV car. The deceased was identified as Sachin Agarwal, a resident of Surajmal Vihar C Block area. He ran a tiles business. Agarwal was in his car outside his house with another friend Prasoon when the incident took place. Prasoon later told police that while they were in the car, he shot himself. Agarwal is survived by his wife and two children. While a police officer said that prima facie it appears to be a case of suicide, his relatives say that he couldn't have committed suicide. \"The weapon used was unlicensed,\" said a police officer. Agarwal, along with his wife and friends, had gone to attend a party at a hotel in his Fortuner car. They all returned in the morning and after having breakfast, he stepped out to drop his friends. \"Agarwal dropped one of his friends after which he and Prasoon were sitting in the car outside his house. Prasoon claimed that Agarwal shot himself soon after which he informed a security guard and called the family members. They rushed him to a nearby hospital but Agarwal was declared dead on arrival,\" the officer added.", "articleID": "2019122701_00054251_W", "names": {"Amit Sharma": ["Q42710044", "Q47150541", "Q4746882", "Q50583295"]}}, {"date": "2019-12-28", "url": "http://www.gamereactor.eu/fortnite/?sid=9e4ef3a20d2e9ea2228068c2a2f30e04", "content": "FORTNITE REVIEW. Written by Petter Hegevall on the 6th of April 2018 at 16 \"Fortnite for iPhone is something of a gem in terms of content and its free-to-play structure .\" NEWS. Written by <mark>Sam Bishop</mark> on the 20th of December 2019 at 12:41 The feature has been enabled once again after being taken out, letting you play alongside a friend on the same console. NEWS. Written by <mark>Sam Bishop</mark> on the 17th of December 2019 at 09:00 To celebrate the Star Wars collaboration in Epic's game, the pair have partnered for a special something on Thursday. NEWS. Written by <mark>Sam Bishop</mark> on the 11th of December 2019 at 13:06 Epic is allegedly trying to skip the 30% cut Google gets from in-app purchases, while Google is staying firm with its own rules. NEWS. Written by <mark>Sam Bishop</mark> on the 10th of December 2019 at 13:30 Matt Gailer has allegedly asked Epic to stop offering the Pump It Up emote, and Epic wants to make clear that it's not an infringement of trademark or copyright.", "articleID": "2019122806_00123788_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}}]