[{"date": "2019-12-28", "url": "https://www.newindianexpress.com/world/2019/dec/28/mars-2020-rover-to-seek-ancient-life-prepare-human-missions-2082001.html", "content": "Home World Mars 2020 rover to seek ancient life, prepare human missions The Mars 2020 mission also carries hopes for an even more ambitious target--a human mission to Mars. Share Via Email Published: 28th December 2019 12:37 PM | Last Updated: 28th December 2019 12:37 PM | A + A A - NASA (File Photo | AP) By PTI PASADENA: The Mars 2020 rover, which sets off for the Red Planet next year, will not only search for traces of ancient life, but pave the way for future human missions, NASA scientists said Friday as they unveiled the vehicle. The rover has been constructed in a large, sterile room at the Jet Propulsion Laboratory in Pasadena, near Los Angeles, where its driving equipment was given its first successful test last week. Shown to invited journalists on Friday, it is scheduled to leave Earth in July 2020 from Florida's Cape Canaveral, becoming the fifth US rover to land on Mars seven months later in February. \"It's designed to seek the signs of life, so we're carrying a number of different instruments that will help us understand the geological and chemical context on the surface of Mars,\" deputy mission leader <mark>Matt Wallace</mark> told AFP. Among the devices onboard the rover are 23 cameras, two \"ears\" that will allow it to listen to Martian winds, and lasers used for chemical analysis. Approximately the size of a car, the rover is equipped with six wheels like its predecessor Curiosity, allowing it to traverse rocky terrain. Speed is not a priority for the vehicle, which only has to cover around 200 yards per Martian day--approximately the same as a day on Earth. Fuelled by a miniature nuclear reactor, Mars 2020 has seven-foot-long articulated arms and a drill to crack open rock samples in locations scientists identify as potentially suitable for life. \"What we're looking for is ancient microbial life--we're talking about billions of years ago on Mars when the planet was much more Earth-like,\" said <mark>Wallace</mark>. Back then, the Red Planet had warm surface water, a thicker atmosphere and a magnetic force around it, he explained. \"And so it was much more conducive to the types of simple single-cell life that evolved here on Earth at that time,\" <mark>Wallace</mark> said. Once collected, the samples will be hermetically sealed in tubes by the rover. The tubes will then be discarded on the planet's surface, where they will lie until a future mission can transport them back to Earth. \"We are hoping to move fairly quickly. We'd like to see the next mission launched in 2026, which will get to Mars and pick up the samples, put them into a rocket and propel that sample into orbit around Mars,\" said <mark>Wallace</mark>. \"The sample would then rendezvous with an orbiter and the orbiter would bring the sample back to the Earth .\" Samples should reach Earth \"in the course of a decade or so,\" he added. To maximize its chance of unearthing traces of ancient life, Mars 2020 will land in a long dried-up delta called Jezero. The site, selected after years of scientific debate, is a crater that was once a 500-yard-deep lake. It was formerly connected to a network of rivers that flowed some 3.5 to 3.9 billion years ago. The crater measures just under 30 miles across, and experts hope it may have preserved ancient organic molecules. The Mars 2020 mission also carries hopes for an even more ambitious target--a human mission to Mars. \"I think of it, really, as the first human precursor mission to Mars,\" said <mark>Wallace</mark>. Equipment on board \"will allow us to make oxygen\" that could one day be used both for humans to breathe, and to fuel the departure from Mars \"for the return trip .\" The ambitions come as a new space race hots up, with Beijing increasingly vying to threaten US dominance. China on Friday launched one of the world's most powerful rockets in a major step forward for its own planned mission to Mars next year. NASA's Mars 2020 will remain active for at least one Martian year, which is around two years on Earth. But Martian rovers have frequently exceeded their intended lifespans--its predecessor Curiosity landed on Mars in 2012 and is still trundling around the planet's Mount Sharp region. Stay up to date on all the latest World news with The New Indian Express App. Download now (Get the news that matters from New Indian Express on WhatsApp. Click this link and hit \"Click to Subscribe'. Follow the instructions after that .) TAGS Mars 2020 rover NASA", "articleID": "2019122808_00116518_W", "names": {"Matt Wallace": ["Q26858662", "Q30122765", "Q513309"]}}, {"date": "2019-12-29", "url": "http://www.harpersbazaar.co.uk/uk/celebrities/news/a30352798/katie-holmes-suri-cruise-photo/", "content": "A post shared by <mark>Katie Holmes</mark> (@ katieholmes212) on Dec 25, 2019 at 7:34 am PST <mark>Holmes</mark> previously revealed to, \"My child is the most important person to me, and her upbringing is paramount to my work right now. It's very important that I'm present and she has a stable, innocent childhood .\" She continued, \"I feel so blessed to do what I do, but there's nothing in the world better than watching your child succeed .\" Town & Country The Dawson's Creek star was recently praised for posting unretouched photos which showed her stretch marks. Posing in a brazer and bra, <mark>Holmes</mark> revealed her midriff, and didn't Photoshop any of her images, which fans found incredibly refreshing. She captioned the pics, \"it is wonderful to be working today with such amazing women!\" ", "articleID": "2019122910_00095429_W", "names": {"Katie Holmes": ["Q174346", "Q6377464"]}}, {"date": "2020-01-08", "url": "http://www.expressandstar.com/news/uk-news/2020/01/08/boris-johnson-to-face-questions-from-mps-on-deepening-crisis-in-gulf/", "content": "Boris Johnson to face questions from MPs on deepening crisis in Gulf UK News | Published: Less than an hour ago The PM's Commons appearance comes after the Defence Secretary said the Government was putting in place \"urgent measures' to protect British nationals. Subscribe to our daily newsletter Sign UpBoris Johnson Boris Johnson will face questions from MPs on the deepening crisis in the Gulf as he takes his first Prime Minister's Questions since the General Election. The PM came under fire for his failure to address the Commons on the Iran situation on Tuesday, with Jeremy Corbyn accusing him of\" hiding behind \"the Defence Secretary <mark>Ben Wallace</mark>. Mr Johnson has been accused of being slow to respond to the crisis--not returning from his new year break on the private Caribbean island of Mustique until the weekend. However, he chaired a meeting of the National Security Council on Tuesday afternoon to discuss the issue and held a Cabinet meeting earlier in the day. The PM's Commons appearance comes after the Defence Secretary said the Government was putting in place\" urgent measures \"to protect British nationals and interests amid rising tensions in the region. Mr <mark>Wallace</mark> said non-essential personnel had been moved out of Baghdad while Royal Navy warships and military helicopters were on heightened readiness to assist if needed. In a Commons statement on Tuesday afternoon, he again appealed for all sides to\" de-escalate \"after the killing of the Iranian military chief Qassem Soleimani in a US drone strike. Advertising At the same time he defended the right of the US to act in self-defence, saying Gen Soleimani had been in neighbouring Iraq when he was hit to\" co-ordinate murder and attacks on US citizens \". British forces in the Middle East (PA Graphics) Mr <mark>Wallace</mark> said the safety and security of UK nationals and interests in the region were of\" paramount concern \". Non-essential personnel had been relocated from Baghdad to the military base at Camp Taji, north of the Iraqi capital, while the Department of Transport was reviewing its advice to British shipping on a daily basis. Advertising\" At the same time, Defence are changing the readiness of our forces--including helicopters and ships on stand-by to assist if the need arises, \"he said .\" As part of prudent planning, a small team has been sent to the region to provide additional situational awareness and contingency planning assistance. \"Watch Jeremy Corbyn answer questions about whether Soleimani was a terrorist pic.twitter.com/qNvJcZGxrn", "articleID": "2020010800_00114213_W", "names": {"Ben Wallace": ["Q263166", "Q295364"]}}, {"date": "2020-01-08", "url": "https://www.westsussextoday.co.uk/sport/football/how-the-carlo-ancelotti-factor-will-impact-brighton-and-hove-albion-at-everton-this-saturday-1-9194981", "content": "How the Carlo Ancelotti factor will impact Brighton and Hove Albion at Everton this Saturday The arrival of new manager Carlo Ancelotti has given all at Everton at huge boost Published: 12:50 Wednesday 08 January 2020 Share this article By Jacob Panons Brighton and Hove Albion will face an Everton team on a high this Saturday at Goodison Park thanks to the recent appointment of Carlo Ancelotti. The Italian has won two of his four games in charge and has helped rejuvenate the Toffees after a sticky spell under <mark>Marco Silva</mark>. Ancelotti is a man who needs little introducing. The manager has worked at Juventus, AC Milan, Chelsea, Paris Saint-Germain, Real Madrid, Bayern Munich, and Napoli to name a few and during his exceptional career has won three Champions Leagues, four domestic league trophies, seven domestic cups, and 20 trophies overall. Ancelotti has been praised in the past for his versatility in choosing formations and the personal relationships he builds with his players. The Italian is known to be fond of playing two up front and this has been evident in his start at Everton with Dominic Calvert-Lewin featuring alongside either Richarlison or Moise Kean in three of the manager's four games in charge. Life at Goodison Park has begun relatively well for Ancelloti as he won his first two games in charge 1-0 at home to Burnley and 2-1 away at Newcastle. His first defeat came in a 2-1 loss away against current champions Manchester City but the club's most recent loss against Liverpool in the FA Cup has drawn the most criticism. An almost full-strength Everton side lost 1-0 at Anfield against a youthful Liverpool team with seven players featuring under the age of 23. Following the game Ancelotti said he spoke to his players about what they must do to find a solution and labelled their second-half performance \"not good enough .' Throughout Ancelotti's 25-year managerial career his focus has been to sustain European and domestic success which he achieved winning a plethora of silverware. Everton is a new challenge for Ancelloti as his new role is to help revitalise an underperforming Everton-side with the long term aim of breaking into the top-6. Dawson strike proves Horsham is the place to see incredible goals He had a similar objective at Napoli as the side looked to threaten Juventus' recent dominance in Italy. He somewhat achieved this with Napoli finishing second in his first season but the club were still 11-points behind Juventus. Ancelloti eventually ended up getting sacked last month after a 4-0 win against Belgian-side Genk as Napoli secured their place in the knockout stages of the Champions League. Some saw Ancelloti's sacking as harsh but Everton fans won't be complaining as they have appointed arguably one of the greatest managers in world football. The Italian is no stranger to praise with Chelsea manager <mark>Frank Lampard</mark> complimenting his former manager following Ancelotti's dismissal at Napoli. <mark>Lampard</mark> said:\" I have huge respect for him...I think he can work anywhere in the world at the top level. \"Pep Guardiola is another Premier League manager who also admires the Italian. He said:\" Carlo is one of the smartest guys. He is always able, it doesn't matter the team, to make them work. I think it is incredible news for English football (that) he is back and I think he can make an incredible job there. \"Bringing in the Italian as manager has shown real ambition from the Toffees and after years of investment it looks as if their dream of consistent European football may be on the horizon. Brighton can expect organised, direct football from Everton on Saturday but the team comes alive in the final third. This has been Ancelloti's philosophy for many years and it has been evident in Everton's start under him. Calvert-Lewin is a player who will be on Brighton's radar going into the game as the striker has scored three goals in his four games under Ancelotti. The striker also scored at the Amex back in October so Graham Potter and his side already know the damage he can cause. Calvert-Lewin has also praised Ancelotti since his arrival telling Match of the Day:\" He has a presence about him. That is just from the man he is and what he has done in football. To be working with him on a daily basis is a privilege. \"Brighton could jump up to tenth on Saturday if results go their way and Potter will be focused on getting back-to-back wins against the Toffees whereas Ancelloti will be looking to get his team back to winning ways. Trending Chelsea and Manchester City still in title race, Liverpool's miserable run continues - Five talking points from the Women's Super League weekend BBC pundit gives a thrilling prediction for Brighton and Hove Albion's FA Cup tie against Sheffield Wednesday Plans for 460 homes north of Burgess Hill given thumbs up Eighty arrests made by Sussex Police on New Year's Emergency works to shore up rail embankment near Haywards Heath The Essentials", "articleID": "2020010814_00048406_W", "names": {"Frank Lampard": ["Q41533", "Q461633"], "Marco Silva": ["Q20118419", "Q57025699", "Q6757714"]}}, {"date": "2020-01-09", "url": "http://www.enfieldindependent.co.uk/news/national/18147314.privately-owned-roman-fort-hadrians-wall-gifted-nation/", "content": "Privately owned Roman fort on Hadrian's Wall gifted to nation By Press Association 2019 Carrawburgh Roman Fort 0 comment A Roman fort on Hadrian's Wall has been donated to the nation by the landowner. Carrawburgh Fort in Northumberland is one of 16 along the 73 miles of Hadrian's Wall and has been handed over to the care of English Heritage by owner Jennifer Du Cane. The 1.4 hectare site, which sits between the cavalry fort at Chesters and the infantry outpost at Housesteads, would once have been the garrison of 500 soldiers defending the wall from tribes in the north. The fort's surviving structures, including the remains of its walls, lie beneath the turf and it has been investigated archaeologically less than other sites nearby, meaning it could hold undiscovered treasures. Carrawburgh's garrison on the edge of the Roman Empire was made up of soldiers from south-west France and later southern Belgium, and they built a nearby temple to their god Mithras. The site has been cared for by the Du Cane family since 1950. Jennifer Du Cane said: \"It has been a great privilege, but also a serious responsibility, to own Carrawburgh Roman Fort .\" The time has come to pass on this amazing site as a gift to the nation. \"Legal ownership of Carrawburgh has transferred to Historic England, the Government's heritage adviser, and it will be cared for by English Heritage. The site has been owned by the du Cane family (Justin Minns/English Heritage/PA) It will join the National Heritage Collection which are important historic sites, dating back to Stonehenge and as recent as a Cold War bunker outside York. The fort is the first acquisition for the National Heritage Collection since English Heritage became a charity in 2015. Kate Mavor, English Heritage's chief executive, said:\" This is a great start to the New Year, not only for English Heritage but for the nation who will get to enjoy this wonderfully evocative site on what was once the edge of the Roman Empire. \"We would like to thank Jennifer Du Cane for her generosity and look forward very much to welcoming the public to Carrawburgh .\" It is already open for visitors (Justin Minns/English Heritage/PA) <mark>Duncan Wilson</mark>, chief executive at Historic England, said: \"We are enormously grateful for this generous gift .\" Hadrian's Wall is one of England's most important historic sites and Carrawburgh makes a really valuable addition to our National Collection of historic properties. \"The fort represents a key part of the Roman frontier and is of outstanding archaeological significance .\" It has the potential to contribute significantly to our knowledge of the Roman Empire and to visitor enjoyment of the Wall. \"Carrawburgh Roman Fort is now open to the public and entrance is free. 0 comment", "articleID": "2020010907_00193145_W", "names": {"Duncan Wilson": ["Q21063532", "Q59504415"]}}, {"date": "2020-01-09", "url": "http://thesundaily.my/local/police-promise-action-against-personnel-involved-in-removal-of-cny-decorations-AF1878714", "content": "Police promise action against personnel involved in removal of CNY decorations 09 Jan 2020 / 19:58 H. Students hang up a Chinese New Year lantern decoration at SMK Pusat Bandar Puchong 1 yesterday .--Bernama SERDANG: Stern action will be taken against any police personnel if they were found to have had a hand in a secondary school's decision to remove the Chinese New Year decorations it had put up at its premises, following an alleged threat by Parti Bumiputera Perkasa Malaysia (Putra). Serdang police chief ACP Ismadi Borhan today said investigations are being carried out to ascertain if there is truth to allegations that police personnel advised the school's officials to take down the decorations. Ismadi said police have received two reports on the matter from the public. There were claims that following Putra's demand to the school, several police personnel had advised the teachers of SMK Pusat Bandar Puchong 1 to remove the decorations. He said the case is being investigated for \"issuing a statement which is likely to incite a race or community\" under Section 505 (c) of the Penal Code and for \"initiating communication to threaten or harass\" under Section 233 of the Communications and Multimedia Act. \"We have recorded statements from members of Putra, the school's officials and also its Parents-Teachers Association. We will investigate and submit our findings to the Attorney-General Chambers for further action,\" Ismadi said. Putra vice-president and lawyer Mohd Khairul Azam <mark>Abdul Aziz</mark> was summoned for questioning over the case by Serdang police this morning. On Monday, he had issued a letter to the SMK Pusat Bandar Puchong 1 school's headmistress ordering her to remove the elaborate CNY decorations that were put up at the school claiming he had received complaints from some school pupil's parents. Referring to CNY as a \"Chinese religious celebration\" he complained that the decorations were excessive and that it made the school look like a Chinese-owned business centre and had elements of religion which caused displeasure among Muslim students. The school officials caved in to Putra's demands and removed the decorations but it was reported that it put them up again following the intervention of several politicians who slammed Putra over the matter. The issue also caught the attention of Inspector-General of Police Tan Sri <mark>Abdul Hamid</mark> Bador who defended the school's initiative to place the CNY decorations, praising the move as one that will enhance greater ties among the races. The top cop also said there were elements of threats in Putra's letter and ordered an investigation to be initiated on Khairul. Did you like this article?", "articleID": "2020010912_00069341_W", "names": {"Abdul Aziz": ["Q22958462", "Q23542680", "Q23542681", "Q27830812", "Q30121874", "Q30600990", "Q4665272", "Q59601323"], "Abdul Hamid": ["Q3246667", "Q4665391", "Q46996242", "Q47118441", "Q938136"]}}, {"date": "2020-01-09", "url": "http://www.smh.com.au/world/asia/police-brief-taiwan-authorities-on-alleged-election-bribery-plot-20200109-p53q73.html", "content": "Play video Mr Wang caused an international scandal in November when he told The Age, the Herald and 60 Minutes that he had worked on behalf of a Beijing-directed foreign interference ring targeting independence and democracy movements in Hong Kong and Taiwan. Mr Wang fled to Australia to seek asylum and assist the Australian Security Intelligence Organisation (ASIO). The Chinese government dismissed his claims as false and said he was a convicted criminal, while ASIO director-general <mark>Mike Burgess</mark> issued a rare statement saying his agency took claims of foreign interference seriously. On Thursday, The Age and the Herald revealed that Mr Wang was warned on Christmas Eve and the following days that he could be sent back to China and killed unless he publicly retracted his story and read from a script prepared by a Chinese businessman working together with a senior operative from Taiwan's Kuomintang opposition party, Deputy Secretary-General Alex Tsai. Mr Tsai, who is being investigated by the federal police over his role in the plot, held a press conference on Thursday morning where he denied having threatened Mr Wang. He also denied being involved in the attempt to have Mr Wang falsely implicate the ruling DPP in bribery, instead repeating the allegations the DPP was involved in misconduct. Messages between Alex Tsai (wearing a business suit) and Mr Sun (wearing a hat). And several of Mr Tsai's denials about his involvement in a potentially illegal plot appear to be inconsistent with messages he sent the second man being investigating over the Christmas Eve plot, a Chinese businessman called Mr Sun. In messages obtained by The Age and the Herald, Mr Tsai sent Mr Sun three guarantees that he allegedly agreed to offer Mr Wang if he followed Mr Tsai's directives. Another message between Mr Tsai and Mr Sun. They include promises that the Chinese Communist Party would assist Mr Wang and cease harassing him. While Mr Tsai has also denied having offered financial inducements to Mr Wang, the messages show that he also promised to organise the repayment of any debts held by Mr Wang. In another message, Mr Tsai appears to ask Mr Sun to urge Mr Wang to issue a statement in return for a benefit: \"Please have Wang Liqiang record a video\" , in return for which the Kuomintang would allow him to freely settle in Taiwan. Shortly after these promises were made, Mr Wang was sent a script in which he recants his original claims and states he was paid by the DPP to fabricate them. Other messages show Mr Sun telling Wang Liqiang he was acting on behalf of Mr Tsai's Kuomintang party. Mr Tsai also sent Mr Wang photos of himself with China's President Xi Jinping in what appears to be an attempt to demonstrate his close connections to the Chinese Communist Party. Other messages show the Chinese businessman Mr Sun telling Mr Wang that he was acting on behalf of Mr Tsai's Kuomintang party. \"All your problems will be resolved by the Kuomintang,\" reads one message from the businessman. The AFP is treating seriously the alleged threats and inducements directed at Mr Wang, with sources confirming they opened an investigation in the hours after the first message was received by Mr Wang on Christmas Eve. \"The Australian Federal Police is aware of threats made against a man currently residing in Australia,\" a spokesman said on Wednesday. \"The AFP takes threats of this nature seriously and has commenced an investigation .\" Loading Mr Wang's November television interview sparked a political firestorm in Taiwan. The Chinese government is seeking to unify Taiwan with the mainland despite overwhelming opposition to reunification among Taiwanese citizens, and Chinese influence in Taiwan has become a key political issue.", "articleID": "2020010914_00182645_W", "names": {"Mike Burgess": ["Q6846186", "Q6846189"]}}, {"date": "2020-01-09", "url": "https://www.plymouthherald.co.uk/news/uk-world-news/mps-extra-month-year-3722692", "content": "Sign up to FREE daily email alerts from PlymouthLive - Daily Subscribe We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights Thank you for subscribing See our privacy notice Invalid Email MPs will get a whopping 64 days off this year - the most since 2014 and an increase of a month from 2019. Leader of the House of Commons Jacob Rees Mogg said that his colleagues will take a two-week break next month. Something that they weren't allowed to do last year due to the impending Brexit deadline. The Commons will be in recess for 64 working days this year - not including conference season and the Christmas break, which has yet to be announced, reports the Mirror Online. The bumper breaks mean Boris Johnson will have to fewer sessions of Prime Minister's Questions and ministers won't have as many departmental questions sittings. It will give Parliamentary committees less time to scrutinise Government decisions through the year. Last year the Commons was in recess for just 46 working days, excluding the dissolution for the General Election. Read More Related Articles Prince Harry and Meghan Markle removed from Royal Family display at Madame Tussauds Read More Related Articles Sainsbury's issue urgent product recalls over allergy fears The Prime Minister faced criticism last week after failing to appear in public for 12 days, despite Britain facing a growing international crisis over <mark>Donald Trump</mark>'s Iran air strike. Both the Summer and Easter recesses are a full week longer than 2019. At 35 working days, MPs summer holiday this year will be the longest since 2009. Many MPs use the recess to catch up on constituency work - but they are free to use the time as they wish. The average holiday entitlement for British workers is 33.5 days. And even this wasn't enough for one Tory MP. Early May's bank holiday has been moved from May 4th to May 8th to coincide with VE day commemorations. Read More Related Articles Baby names that could help your child earn big money Read More Related Articles Meghan Markle and Prince Harry \"will be punished' for quitting royal duties But former minister Karen Bradley urged Mr Rees-Mogg to make both days bank holidays, because it might\" adversely affect \"weddings, sporting fixtures and civic events. She said:\" Perhaps he might consider whether it might be in the spirit of a new, forward-looking Britain that we might have a second bank holiday in May, and reinstate that Monday as well as have the Friday. \"\"There is a great cost to bank holidays and I think the chances of having another one, though we all like to have a day of, are relatively slim, so I wouldn't want to build up my right honourable friend's hopes .\" ", "articleID": "2020010917_00227815_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}]