[{"date": "2020-01-10", "url": "https://www.ksl.com/article/46702584/san-franciscos-beefeater-doorman-retires-after-43-years", "content": "SAN FRANCISCO (AP)--Another bit of old, quirky San Francisco will be no more when Tom Sweeney finally hangs up his white pressed collar and signature Beefeater jacket this weekend after more than four decades of opening doors at the Sir <mark>Francis Drake</mark> Hotel downtown. Sweeney has taken the luggage of movie stars and shaken hands with every U.S. president from Gerald Ford to Barack Obama. Visitors from around the world have had their photos taken with him, often after he's told them where to catch the cable car and how to get to Fisherman's Wharf. \"It's one of the best jobs in San Francisco,\" says Sweeney, 62, as a cable car clanks by. \"Working outside a landmark hotel, cable cars come by every nine minutes, it doesn't get much better than that .\" The man known as a \"San Francisco original\" and \"living landmark\" retires Sunday after 43 years in a changed city. San Francisco continues to grapple with homelessness, aggressive panhandling and vehicle break-ins even as some residents have become wealthier amid a tech boom. The hospitality industry has also changed dramatically, making Sweeney a throwback to an era when doormen hailed cabs and wrangled wheel-less suitcases. Today, most people hail rides via smartphone, and hardly anyone carries cash for tips. <mark>Joe</mark> D’Alessandro, president and CEO of the San Francisco Travel Association, said Sweeney \"has been not just an ambassador but the embodiment of San Francisco's spirit--cheerful, helpful, upbeat, welcoming. He made visitors from around the world feel like instant friends .\" This week, Sweeney stood guard outside the Sir <mark>Francis Drake</mark>, near Union Square, in his elaborate British-style Beefeater jacket and knickers, red socks pulled to the knees and black hat decorated with red and white flowers. The 1928 hotel, named for the Elizabethan-era English explorer, has the costumes for its doormen custom-made. Sweeney's latest gold - and black-trimmed suit cost $3,000 and weighs about 40 pounds (18 kilograms). He tags luggage, waves to cable car passengers and grins for photos. Every now and then, Sweeney shoots his signature move: a finger snap accompanied by an \"Oh, yeah .\" \"I love your hat,\" says a boy checking into the hotel with his family. \"I love the flowers around it,\" says his sister, carrying a glittery pink backpack and a doll. Jennifer Emperador, a 39-year-old hotel concierge at Fisherman's Wharf, stopped by after her shift, determined to take a photo with Sweeney before he's gone. She lamented the loss of another fixture in a city where beloved businesses have shut down because of rising rents and changing consumer tastes. Luxury retailer Gump's, for example, closed its downtown doors in 2018, although new ownership may revive the store. \"It's almost like,\" What else is leaving in San Francisco?' \"she said .\" It's just not the same. \"Sweeney is not the hotel's only Beefeater doorman, although he is the best-known and the longest-lasting doorman in a city with about 100 of them. The San Francisco Chronicle toasted his 40th year on the job on its front page; he has his own plaque on the sidewalk in front of the hotel. The third-generation San Franciscan never dreamed he'd make such a mark impersonating a British guard when he took the job at 19 because his mother knew the hotel's general manager and they needed a doorman for the summer. He fell in love with the job, and San Francisco treated him like royalty. Then-Mayor Dianne Feinstein honored him with a special award in 1982 after he tackled--in full costume--two robbers fleeing with stolen suitcases. The other\" Nick of Time \"award winners that year were San Francisco 49ers quarterback <mark>Joe Montana</mark> and nimble-fingered receiver Dwight Clark for their role in\" The Catch, \"which led to the team's first Super Bowl win. Sweeney was frequently mentioned in the columns of Chronicle journalist and humorist Herb Caen, who memorialized San Francisco for decades. Getting a call from Caen, who died in 1997, was like getting a call from God, Sweeney said. At his San Francisco home, Sweeney stores news clippings, Beefeater memorabilia from fans, and previous costumes--he's had 46, one for every year plus some spares. The term\" Beefeater \"may refer to the guards who taste-tested food for French kings, or to the Beefeaters who still stand guard at the Tower of London, allegedly paid in beef chunks at one point. Sweeney is an avid marathoner who regularly runs San Francisco's annual\" Bay to Breakers \"race in costume. He has photos of himself with former British Prime Minister Tony Blair, actress Sharon Stone and U.S. House Speaker Nancy Pelosi. Dolly Parton was\" really cool, \"he recalls, and Prince had purple suitcases. And it's not just the famous he remembers. Sweeney still cracks up over the guest from Texas who double-parked outside the hotel and waved at a cable car--which runs on fixed rails--\"to go around\" her. \"As a doorman, you're a greeter, a porter, a guide, a ringmaster, a constable, a valet and a concierge all in one gig,\" he said. \"I'll miss it, the people. You're dealing with positive people all day .\" He marvels at how San Francisco has grown, from 11,000 hotel rooms when he started to more than three times that today. He's not as enchanted, however, with the panhandlers who trail after tourists. \"The homeless problem is out of control, car break-ins, we never saw that growing up here,\" he said. \"It's just so sad to see this happening .\" Sweeney has been working since he was 14, selling soda alongside Tom Hanks at the Oakland Coliseum. He's up for spending more time with his wife, Cindy, a hospitality executive whom he chatted up at a cable car stop about a quarter-century ago, and their four grandchildren. Outside the hotel, cable car training instructor Tsombe Wolfe hopped off for his own photo with Sweeney. \"Tom's the guy. Man, he's the staple,\" he says. \"He's an ambassador to the city, just like the cable cars .\" Copyright © The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. × Photos Janie Har", "articleID": "2020011005_00137782_W", "names": {"Francis Drake": ["Q52636398", "Q5480773"], "Joe Montana": ["Q348011", "Q6211408"]}}, {"date": "2020-01-10", "url": "http://philly.com/politics/nation/marianne-williamson-democratic-presidential-trump-20200110.html", "content": "Democratic presidential candidate Marianne Williamson speaks at a the Faith, Politics and the Common Good Forum at Franklin Jr.. High School, Thursday, Jan. 9, 2020, in Des Moines, Iowa. Andrew Harnik / AP DES MOINES, Iowa--Democratic presidential candidate Marianne Williamson, the spiritual guru and bestselling author, ended her campaign on Friday, weeks before voting begins, saying she did not want to make it tougher for a progressive to win. She also said she did not believe she would be able to gain enough support in the upcoming contests to make a difference in the race to challenge President Donald Trump. Related stories Elizabeth Warren is gearing up for the 2020 Pennsylvania primary Takeaways from the Democratic debate: Buttigieg keeps rising, Warren gets an easier ride Joe Biden told this protester to \"vote for Trump .' Bernie Sanders just hired him. Related stories Elizabeth Warren is gearing up for the 2020 Pennsylvania primary by Julia Terruso Takeaways from the Democratic debate: Buttigieg keeps rising, Warren gets an easier ride by Jonathan Tamari Joe Biden told this protester to\" vote for Trump .' Bernie Sanders just hired him. by Julia Terruso In a post on her website, Williamson said \"we will not be able to garner enough votes in the election to elevate our conversation any more than it is now .\" Williamson has barely registered in the polls and struggled in fundraising since launching her bid for president last January. She laid off her entire staff from her campaign at the end of last year, but continued to appear at campaign events in Iowa and New Hampshire in recent weeks. Her decision leaves 13 candidates remaining in the primary. Posted: January 10, 2020 - 1:10 PM Alexandra Jaffe, Associated Press Clout Newsletter Clout: your guide to the wild world of politics Sign Up Clout Newsletter We Recommend Nancy Pelosi: House moving to send impeachment to Senate next week Lisa Mascaro and Mary Clare Jalonick, Associated Press U.S. announces new sanctions on Iran after missile strikes Associated Press As Iran and U.S. take step back from the brink, Canada grieves Rob Gillies and <mark>Tim Sullivan</mark>, Associated Press Justice Department winds down Clinton-related inquiry once championed by Trump. It found nothing of consequence. Devlin Barrett and Matt Zapotosky, The Washington Post Iran's next move: A cyber attack on the U.S.? David Gambacorta House approves measure demanding Trump pull back on Iran Karoun Demirjian, Washington Post We Recommend", "articleID": "2020011018_00260256_W", "names": {"Tim Sullivan": ["Q16122829", "Q17033913", "Q466552", "Q59368830", "Q7804357", "Q7804358"]}}, {"date": "2020-01-11", "url": "https://indianexpress.com/article/india/jk-porter-beheaded-army-says-looking-into-pak-hand-6212118/", "content": "J & K porter beheaded, Army says looking into Pak hand J & K porter beheaded, Army says looking into Pak hand While it was earlier believed that the head of 28-year-old <mark>Mohammad Aslam</mark> may have blown off due to a mortar blast, the Army has been unable to recover it so far, leading them to suspect BAT may have beheaded him. Written by <mark>Arun Sharma</mark> | Jammu | Published: January 12, 2020 4:45:38 am The Army has not yet confirmed a BAT role (Representational) ONE OF the two porters killed in cross-border shelling in Jammu's Poonch district on Friday morning could have been beheaded by Pakistan's BAT (Border Action Troops). While it was earlier believed that the head of 28-year-old <mark>Mohammad Aslam</mark> may have blown off due to a mortar blast, the Army has been unable to recover it so far, leading them to suspect BAT may have beheaded him. If proved right, it would be the first instance of BAT, which comprises Pakistani army regulars and terrorists, targeting a civilian, although similar incidents involving security personnel have taken place in the past. While the Army did not confirm a BAT role, Defence Ministry spokesperson Lt Colonel Devender Anand said that one of the porters had been found to be headless, and that they were investigating whether there was Pakistani hand in it. A senior police officer said the head appeared to have been severed by a sharp-edged weapon. Asked about the incident at a press conference in Delhi Saturday, Army Chief Gen M M Naravane said that professional armies never resort to such \"barbaric\" acts. \"We will deal appropriately with such situations in a military manner .\" The last such incident was reported back in September 2018, when a BSF jawan was killed and his body mutilated in Samba district, leading to the cancellation of Indo-Pak talks scheduled days later. In December 2017, bodies of four soldiers, including a Major, killed in Rajouri sector were found to be mutilated by a BAT team that infiltrated 300-400 metres inside the LoC. Similar incidents were reported in 2017, 2016 and 2013. The two porters, along with four others, were in Poonch district, falling ahead of the barbed wire fence marking the Line of Control. The Army generally hires civilians for logistics duties here. While <mark>Aslam</mark>, a resident of Kasalian, was killed on the spot, fellow villager <mark>Altaf Hussain</mark>, 23, died on way to hospital. The families carried out the funeral on Friday evening. injured during Pakistani shelling at Kassalian village The three injured porters are recuperating and said to be stable. The Army had retaliated with heavy firing to the attack. Condemning the killings, the Congress asked why Prime Minister Narendra Modi and Defence Minister Rajnath Singh were \"silent\" on the \"barbarism\" by Pakistan, and recalled that the BJP had attacked the UPA government mercilessly over the matter. \"When will Pakistan's cowardly acts be given a befitting reply?\" 10 heads for 1' when? \"Congress spokesperson Randeep Surjewala tweeted, referring to the BJP's threats against Pakistan.", "articleID": "2020011123_00086626_W", "names": {"Altaf Hussain": ["Q16199407", "Q20065239", "Q23905417", "Q2840298"], "Arun Sharma": ["Q24005693", "Q27531866", "Q38054951", "Q43380263", "Q59156251"], "Mohammad Aslam": ["Q13120210", "Q21572785", "Q27831147", "Q6891843"]}}, {"date": "2020-01-13", "url": "https://www.wwno.org/post/mark-it-down-ashley-mcbryde-massive-year", "content": "Mark It Down: Ashley McBryde Is In For A Massive Year By <mark>Stephen Thompson</mark> • 5 minutes ago Share Tweet Email Originally published on January 13, 2020 9:52 am YouTube Every sign points to Ashley McBryde having a huge, huge year in 2020: The country singer experienced a major breakthrough in 2018 with the Grammy-nominated Girl Going Nowhere (one of that year's best albums) and an attention-grabbing single in 2019 with \"One Night Standards\" (one of that year's best songs). Now that it's 2020, McBryde has another auspicious milestone in mind, with what's sure to be one of the year's grabbiest videos. But let's start with \"Martha Divine\" the song: The Arkansas-born singer's rowdiest jam to date, the track weaves its revenge narrative into a family's complicated history. The cheater in question is the singer's dad, but the target of McBryde's ire is his paramour, the titular Martha, who's in for a world of hurt. What \"Martha Divine\" lacks in healthy boundaries, appropriately placed anger or clarity about the proper legal definition of \"murder,\" however, it more than makes up for in raucous, hooky, fist-pumping catharsis. When she plays it live, this thing will shake ceilings--and that's saying nothing of McBryde's profoundly awesome delivery of \"idn't .\" (You'll know it when you hear it .) Then there's the video, which--like the subtler short film accompanying \"One Night Standards\" --uses a seedy motel as the backdrop for scenes ripped from a gritty crime drama. What the song implies, the video shouts: Martha Divine is sorry she ever saw the likes of Ashley McBryde, to say nothing of that shovel. \"\"Martha Divine' was so much fun to write because [the song's co-writer] Jeremy Spillman wasn't afraid to get weird with me,\" McBryde writes via email. \"I told him I wanted to write something dark, and we created this story that surrounds the most delightful trollop of a human being and gets down underneath the fingernails of the uncomfortable truth about family dynamics. I was certain no one would let me shoot a video that actually reflected the lyrics, but Reid Long helped me bring it to life in a way that only he could .\" Ashley McBryde's as-yet-announced second album is coming soon via Warner Music Nashville. Copyright 2020 NPR. To see more, visit https: //www.npr.org. Share Tweet Email View the discussion thread.", "articleID": "2020011318_00027156_W", "names": {"Stephen Thompson": ["Q11253984", "Q18588210", "Q57878587", "Q59587831", "Q7610676", "Q7610677", "Q7610681", "Q782348"]}}, {"date": "2020-01-15", "url": "http://www.herald-dispatch.com/ap/ap_politics/the-latest-democratic-debate-ends-with-talk-of-hope-for/article_cd7beb21-4db3-52a4-b4bc-4eb26c592659.html", "content": "Facebook Twitter WhatsApp SMS Email 1 of 14 Workers prepare for a Democratic presidential primary debate hosted by CNN and the Des Moines Register, Tuesday, Jan. 14, 2020, in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate Sen. Bernie Sanders, I-Vt ., speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky From left, Democratic presidential candidates businessman Tom Steyer, Sen. Elizabeth Warren, D-Mass ., former Vice President Joe Biden, Sen. Bernie Sanders, I-Vt ., former South Bend Mayor Pete Buttigieg, and Sen. Amy Klobuchar, D-Minn ., stand on stage, Tuesday, Jan. 14, 2020, before a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Charlie Neibergall Democratic presidential candidate former Vice President Joe Biden, left, watches as Sen. Bernie Sanders, I-Vt ., answers a question Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate former Vice President Joe Biden answers a question Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa, as Sen. Elizabeth Warren, D-Mass ., left and Sen. Bernie Sanders, I-Vt ., listen. Patrick Semansky Democratic presidential candidate Sen. Elizabeth Warren, D-Mass ., speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate businessman Tom Steyer speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate Sen. Bernie Sanders, I-Vt ., speaks as former Vice President Joe Biden looks on Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate Sen. Elizabeth Warren, D-Mass ., left, speaks to candidate Sen. Bernie Sanders, I-Vt ., right as former Vice President Joe Biden watches Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky From left, Democratic presidential candidate former Vice President Joe Biden, Sen. Bernie Sanders, I-Vt ., and former South Bend Mayor Pete Buttigieg look to answer a question Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate Sen. Amy Klobuchar, D-Minn ., speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate former Vice President Joe Biden speaks, Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate former South Bend Mayor Pete Buttigieg speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Sen. Amy Klobuchar, D-Minn ., right speaks as from left, Democratic presidential candidates businessman Tom Steyer, Sen. Elizabeth Warren, D-Mass ., former Vice President Joe Biden, Sen. Bernie Sanders, I-Vt ., and former South Bend Mayor Pete Buttigieg listen Tuesday, Jan. 14, 2020, before a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Facebook Twitter WhatsApp SMS Email Print Save DES MOINES, Iowa (AP)--The Latest on the January Democratic presidential debate (all times local): 10:25 p.m. Six Democratic presidential candidates have wrapped up their final debate before primary voting begins with talk of hope, defeating President <mark>Donald Trump</mark> and bringing a divided nation back together. Former Vice President Joe Biden said Tuesday that \"character is on the ballot\" in the 2020 election and that eight years of <mark>Trump</mark> in office would be \"an absolute disaster .\" Sen. Bernie Sanders said \"this is the moment when we have got to think big, not small,\" and have courage to take on the \"1%,\" while Sen. Elizabeth Warren said she has hope in America's future despite its challenges and looks forward to becoming the first female president. Sen. Amy Klobuchar says she'll be a president who finds \"common ground instead of scorched earth\" to get things done, while former Mayor Pete Buttigieg says Democrats will get one shot to win big and \"send Trumpism into the dustbin of history .\" Businessman Tom Steyer says he thinks of the American people as his teammates, and pledged he won't permit \"someone to run down the field and kick my teammate in the face .\" ------10:05 p.m. Democratic presidential hopeful Pete Buttigieg says he will keep up his effort to appeal to black voters, whose support will be vital to winning his party's nomination. The former mayor said during Tuesday night's debate in Des Moines, Iowa, that \"the black voters who know me best are supporting me,\" referencing local leaders in his hometown of South Bend, Indiana. Buttigieg has built up support in some of the early states but has struggled in South Carolina, where black voters comprise the majority of the Democratic primary electorate. It's the first state where candidates' mettle with black voters is tested. Buttigieg pointed Tuesday to his endorsement from U.S. Rep. <mark>Anthony Brown</mark> of Maryland, who earlier this month became the first member of the Congressional Black Caucus to back Buttigieg's campaign .------9:55 p.m. Minnesota Sen. Amy Klobuchar says the upcoming Senate trial on President <mark>Donald Trump</mark>'s impeachment \"is a decency check on our government .\" \"This is a patriotism check,\" she added at Tuesday night's Democratic presidential debate, noting the upcoming 2020 election is yet another check. Klobuchar and her fellow senators running for president will have to contend with the impeachment trial as the push to the Iowa caucuses enters its final days. Other candidates like former Vice President Joe Biden and former South Bend, Indiana, Mayor Pete Buttigieg will be able to continue campaigning freely as the Senate trial gets underway. Klobuchar also criticized her Senate Republican colleagues over reluctance to allow certain witnesses for the Senate trial, saying, \"We've asked for only four people .\" \"And if our Republican colleagues won't allow those witnesses, they may as well give the president a crown and a scepter. They may as well make him king,\" Klobuchar said .------9:45 p.m. Joe Biden says the outcome of a Senate impeachment trial against President <mark>Donald Trump</mark> won't affect his arguments against the Republican president in the 2020 campaign. And the former vice president said at Tuesday night's Democratic presidential debate that it's \"irrelevant\" whether <mark>Trump</mark> claims exoneration if the Republican-led Senate votes as expected and doesn't remove him from office. Biden said House Democrats had \"no choice\" but to impeach the president for <mark>Trump</mark>'s efforts to pressure Ukrainian officials to launch investigations into Biden's son Hunter's business dealings in the country and his own foreign policy engagement in Ukraine when he was vice president. <mark>Trump</mark>'s claims about the Bidens have been debunked. But Biden said he expects <mark>Trump</mark> and Republicans to continue to allege that the Bidens are corrupt. \"I did my job,\" Biden said at the debate .------9:35 p.m.. It all comes back to health care. Even after Democratic presidential candidates had an extended foreign policy discussion at Tuesday's presidential debate, they saved the fireworks for another fight over how to expand health insurance coverage. Joe Biden suggested that Bernie Sanders wasn't being \"candid\" with voters over the cost of his single-payer insurance idea. Amy Klobuchar said \"Medicare for All\" is so impractical that the \"debate isn't real .\" And Pete Buttigieg bristled at the suggestion that adding a \"public option\" plan to the existing market isn't a major step forward. Sanders said those more moderate candidates misrepresent a plan he said would indeed increase Americans' taxes but eliminate the \"absurdity\" of private insurance costs. Elizabeth Warren tried a bit of a twist. She defended single payer, but noted that Republicans want to roll back even existing coverage. \"I'll take our side of the argument any day,\" she said of the entire Democratic field .------9:25 p.m. Former Vice President Joe Biden says one of his top rivals needs to \"be candid\" with voters on the cost of his health care reform proposal. Biden said Tuesday during the Democratic presidential debate in Des Moines, Iowa, that Vermont Sen. Bernie Sanders should be more upfront with voters on how much it will cost to move the country to a single-payer \"Medicare for All\" system. Asked if voters deserved more information on the price of his signature proposal, Sanders maintained his argument that his proposal \"wouldn't bankrupt the country\" because it would end out-of-pocket and prescription drug prices. Biden proposes making fixes to the existing Affordable Care Act system, and former South Bend, Indiana, Mayor Pete Buttigieg proposes somewhat of a hybrid. Noting she would use executive power to cut prescription drug prices, Massachusetts Sen. Elizabeth Warren said her $20-plus trillion plan costs more than those ideas because they represent only incremental change .------9:10 p.m. Elizabeth Warren's argument that a woman is best suited to take on President <mark>Donald Trump</mark> led to a prolonged awkward dispute with Bernie Sanders. Sanders denied during Tuesday night's debate that he told Warren in 2018 that he didn't think a woman could beat <mark>Trump</mark>. Warren says he did and argued Tuesday night that she's the only candidate on stage who defeated an incumbent Republican candidate any time in the last 30 years. The Vermont senator disputed that, arguing that he defeated incumbent Republican <mark>Peter Smith</mark> in a 1990 congressional race. Warren then began counting quietly with her finger, asking, \"Wasn't it 30 years ago?\" Sanders noted his win again and then said the dispute isn't a pressing concern .------9:05 p.m. Bernie Sanders and Elizabeth Warren declined an opportunity to continue their recent campaign trail feud during Tuesday night's debate, but Warren still took on her progressive opponent. Sanders again denied that he told Warren in a private 2018 meeting that a woman couldn't win the presidency. He called it \"incomprehensible\" that he would believe such a thing and said he didn't want to \"waste a whole lot of time\" on the issue \"because this is what <mark>Donald Trump</mark>... wants .\" He also committed to doing \"everything in my power\" to making sure the eventual nominee wins. Warren has said Sanders did in fact tell her a woman can't win, and on the debate stage, she took on the issue of whether a woman can win head-on. Warren told the crowd that the male candidates on the stage collectively lost 10 races while she and Sen. Amy Klobuchar were \"the only people on this stage who have won every single election that they've been in .\" She also argued that female candidates have outperformed men, noting that female candidates and voters were pivotal in taking back the House and flipping statehouses during the last midterms. Warren pivoted to an implicit contrast with Sanders on electability, arguing that \"the real danger\" for Democrats \"is picking a candidate who can't pull our party together .\" ------9 p.m. Former Vice President Joe Biden and businessman Tom Steyer say they would not meet with North Korea's leader without \"preconditions,\" as President <mark>Donald Trump</mark> has done. Biden said at Tuesday night's Democratic presidential debate in Iowa that <mark>Trump</mark>'s meetings with <mark>Kim Jong Un</mark> gave the North Korean leader \"legitimacy,\" and he criticized <mark>Trump</mark> for weakening sanctions against the country. He said his approach to North Korea would include working with China and Japan. Biden also noted that <mark>Kim</mark> once described him as a \"rabid dog\" who \"must be beaten with a stick .\" Steyer, a billionaire businessman, said the U.S. would need to work with its allies in regard to North Korea. He said staff could meet \"and see how far we can get .\" ------8:55 p.m.. What has become a signature trade deal of President <mark>Donald Trump</mark>'s administration is a conflict point among the Democrats competing to replace him. Vermont Sen. Bernie Sanders said at Tuesday night's Democratic presidential debate at Drake University in Des Moines, Iowa, that he opposes the United States-Mexico-Canada trade agreement, or USMCA, in part because it \"does not incorporate very, very strong principles to significantly lower fossil fuel emissions in the world .\" Asked why she backed the deal, Massachusetts Sen. Elizabeth Warren said it was a \"modest improvement\" over existing agreements and could be a placeholder for future reform. Former Vice President Joe Biden said that, as president, he wouldn't push a trade deal that didn't include buy-in from environmentalists and unionists. Minnesota Sen. Amy Klobuchar said she backed the deal, as did former South Bend, Indiana, Mayor Pete Buttigieg, who said it \"has been improved. It is not perfect .\" ------8:35 p.m.. There's a divide in Tuesday night's Democratic presidential debate over the American military footprint abroad. The leading progressive candidates, Sens. Elizabeth Warren and Bernie Sanders, blasted the trillions of dollars that the U.S. has spent in Middle East wars since the Sept. 11 terror attacks. Warren said \"We have to stop this mindset\" and bring home \"combat troops .\" The more moderate candidates countered that a U.S. presence is necessary in the Middle East, though former Vice President Joe Biden, Sen. Amy Klobuchar and former Mayor Pete Buttigieg said the focus should be on small special forces. To some degree, the debate is about framing. Sanders and Warren don't go so far as to say they would never order military deployments. Biden, Klobuchar and Buttigieg are careful to express caution about large, extended missions of ground troops. But the differences highlight two distinct foreign policy camps within the Democratic Party .------8:25 p.m. Democratic presidential hopeful Bernie Sanders says he fears that President <mark>Donald Trump</mark>'s actions involving Iran could be leading the United States into a foreign policy quagmire of the highest level. The Vermont senator said at Tuesday night's Democratic candidate debate at Drake University in Des Moines, Iowa, that what he sees as the country's top foreign policy disasters - the wars in Vietnam and Iraq - were \"based on lies .\" Sanders accused <mark>Trump</mark> of being dishonest about the intelligence that led to the U.S. airstrike that killed Iranian Gen. Qassem Soleimani. Sanders pressed the need for an international coalition, adding, \"We cannot keep acting unilaterally .\" Defense Secretary Mark Esper said this week that he had seen no hard evidence that four American embassies had been under threat when <mark>Trump</mark> authorized the targeting of Iran's top commander, raising questions about the scale of the threat described by <mark>Trump</mark> last week .------8:15 p.m. Former Vice President Joe Biden wasted no time in the opening minutes of Democrats' presidential debate in calling his 2002 vote authorizing an Iraq invasion a mistake. It was an unusually matter-of-fact tone of contrition for Biden, especially as he tries to emphasize his long foreign policy record as a vice president and a six-term U.S. senator. The 77-year-old candidate has throughout his campaign mostly defended portions of his record that have come under criticism from his party's progressive flank. Vermont Sen. Bernie Sanders nonetheless tried to capitalize on the issue Tuesday night. He pointed out that he voted against the Bush administration's war powers request as a member of the House, and he called the war the \"worst foreign policy blunder in history .\" Biden maintained that he'd compare his \"record overall\" to any of his Democratic competitors, and he pointed to his role in the Obama administration in dramatically scaling back U.S. involvement in Iraq .------8 p.m. Six Democratic presidential candidates are taking the debate stage in Des Moines, Iowa, in a final showdown before primary voting begins. The half dozen candidates on stage Tuesday are all white and include four men. It's a stark winnowing of the Democratic field that was once the most diverse in history. The first debate of 2020 is starting with fresh tension between Vermont Sen. Bernie Sanders and Massachusetts Sen. Elizabeth Warren. Warren said Monday night that Sanders privately told her in 2018 that he didn't think a woman could defeat President <mark>Donald Trump</mark>. Sanders has vigorously denied making the comment. The dispute isn't likely to be the only one on stage. Sanders has ratcheted up his criticism of Vice President Joe Biden over his past support of the Iraq War and other issues. Minnesota Sen. Amy Klobuchar is looking to break out of the pack, building on strong debates and her arguments that former South Bend, Indiana, Mayor Pete Buttigieg doesn't have enough experience to be president. Billionaire Tom Steyer is expected to face criticism that he's trying to buy his way to the White House as he floods early voting states with campaign ads .------Catch up on the 2020 election campaign with AP experts on our weekly politics podcast, \"Ground Game .\" Copyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Facebook Twitter WhatsApp SMS Email Print Save Tags Government And Politics General Elections Political Debates Campaigns Elections Political Parties Political Organizations 2020 United States Presidential Election United States General Election United States Presidential Election Presidential Elections National Elections Political Conventions Foreign Policy International Relations Government Policy 2016 United States Presidential Election Trade Agreements Trade Policy International Trade Economy Business Economic Policy Government Business And Finance International Agreements Emissions Reduction Pollution Environmental Concerns Environment Environment And Nature Health Care Reform Health Care Policy Political Issues Health Care Costs Health Prescription Drugs Medication Diagnosis And Treatment Prescription Drug Costs Medicare Government-funded Health Insurance Government Programs Access To Health Care Trials Legal Proceedings Law And Order General News Political Corruption Legislature Impeachments Primary Elections Locations Des Moines Iowa United States North America Iran Middle East Iraq Indiana South Bend Vermont East Asia Asia North Korea Massachusetts Minnesota Welcome to the discussion. Keep it Clean. Please avoid obscene, vulgar, lewd, racist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another person will not be tolerated. Be Truthful. Don't knowingly lie about anyone or anything. Be Nice. No racism, sexism or any sort of - ism that is degrading to another person. Be Proactive. Use the \"Report' link on each comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness accounts, the history behind an article.", "articleID": "2020011504_00129028_W", "names": {"Anthony Brown": ["Q17213897", "Q18000961", "Q19874162", "Q20013619", "Q20440606", "Q24007230", "Q43891343", "Q4772157", "Q4772158", "Q57242881", "Q59295705", "Q59560609", "Q7668276"], "Donald Trump": ["Q22686", "Q27947481"], "Kim Jong Un": ["Q14045951", "Q56226"]}}]