[{"date": "2020-01-15", "url": "http://www.herald-dispatch.com/ap/ap_politics/the-latest-democratic-debate-ends-with-talk-of-hope-for/article_cd7beb21-4db3-52a4-b4bc-4eb26c592659.html", "content": "Facebook Twitter WhatsApp SMS Email 1 of 14 Workers prepare for a Democratic presidential primary debate hosted by CNN and the Des Moines Register, Tuesday, Jan. 14, 2020, in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate Sen. Bernie Sanders, I-Vt ., speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky From left, Democratic presidential candidates businessman Tom Steyer, Sen. Elizabeth Warren, D-Mass ., former Vice President Joe Biden, Sen. Bernie Sanders, I-Vt ., former South Bend Mayor Pete Buttigieg, and Sen. Amy Klobuchar, D-Minn ., stand on stage, Tuesday, Jan. 14, 2020, before a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Charlie Neibergall Democratic presidential candidate former Vice President Joe Biden, left, watches as Sen. Bernie Sanders, I-Vt ., answers a question Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate former Vice President Joe Biden answers a question Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa, as Sen. Elizabeth Warren, D-Mass ., left and Sen. Bernie Sanders, I-Vt ., listen. Patrick Semansky Democratic presidential candidate Sen. Elizabeth Warren, D-Mass ., speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate businessman Tom Steyer speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate Sen. Bernie Sanders, I-Vt ., speaks as former Vice President Joe Biden looks on Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate Sen. Elizabeth Warren, D-Mass ., left, speaks to candidate Sen. Bernie Sanders, I-Vt ., right as former Vice President Joe Biden watches Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky From left, Democratic presidential candidate former Vice President Joe Biden, Sen. Bernie Sanders, I-Vt ., and former South Bend Mayor Pete Buttigieg look to answer a question Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate Sen. Amy Klobuchar, D-Minn ., speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate former Vice President Joe Biden speaks, Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Democratic presidential candidate former South Bend Mayor Pete Buttigieg speaks Tuesday, Jan. 14, 2020, during a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Sen. Amy Klobuchar, D-Minn ., right speaks as from left, Democratic presidential candidates businessman Tom Steyer, Sen. Elizabeth Warren, D-Mass ., former Vice President Joe Biden, Sen. Bernie Sanders, I-Vt ., and former South Bend Mayor Pete Buttigieg listen Tuesday, Jan. 14, 2020, before a Democratic presidential primary debate hosted by CNN and the Des Moines Register in Des Moines, Iowa. Patrick Semansky Facebook Twitter WhatsApp SMS Email Print Save DES MOINES, Iowa (AP)--The Latest on the January Democratic presidential debate (all times local): 10:25 p.m. Six Democratic presidential candidates have wrapped up their final debate before primary voting begins with talk of hope, defeating President <mark>Donald Trump</mark> and bringing a divided nation back together. Former Vice President Joe Biden said Tuesday that \"character is on the ballot\" in the 2020 election and that eight years of <mark>Trump</mark> in office would be \"an absolute disaster .\" Sen. Bernie Sanders said \"this is the moment when we have got to think big, not small,\" and have courage to take on the \"1%,\" while Sen. Elizabeth Warren said she has hope in America's future despite its challenges and looks forward to becoming the first female president. Sen. Amy Klobuchar says she'll be a president who finds \"common ground instead of scorched earth\" to get things done, while former Mayor Pete Buttigieg says Democrats will get one shot to win big and \"send Trumpism into the dustbin of history .\" Businessman Tom Steyer says he thinks of the American people as his teammates, and pledged he won't permit \"someone to run down the field and kick my teammate in the face .\" ------10:05 p.m. Democratic presidential hopeful Pete Buttigieg says he will keep up his effort to appeal to black voters, whose support will be vital to winning his party's nomination. The former mayor said during Tuesday night's debate in Des Moines, Iowa, that \"the black voters who know me best are supporting me,\" referencing local leaders in his hometown of South Bend, Indiana. Buttigieg has built up support in some of the early states but has struggled in South Carolina, where black voters comprise the majority of the Democratic primary electorate. It's the first state where candidates' mettle with black voters is tested. Buttigieg pointed Tuesday to his endorsement from U.S. Rep. <mark>Anthony Brown</mark> of Maryland, who earlier this month became the first member of the Congressional Black Caucus to back Buttigieg's campaign .------9:55 p.m. Minnesota Sen. Amy Klobuchar says the upcoming Senate trial on President <mark>Donald Trump</mark>'s impeachment \"is a decency check on our government .\" \"This is a patriotism check,\" she added at Tuesday night's Democratic presidential debate, noting the upcoming 2020 election is yet another check. Klobuchar and her fellow senators running for president will have to contend with the impeachment trial as the push to the Iowa caucuses enters its final days. Other candidates like former Vice President Joe Biden and former South Bend, Indiana, Mayor Pete Buttigieg will be able to continue campaigning freely as the Senate trial gets underway. Klobuchar also criticized her Senate Republican colleagues over reluctance to allow certain witnesses for the Senate trial, saying, \"We've asked for only four people .\" \"And if our Republican colleagues won't allow those witnesses, they may as well give the president a crown and a scepter. They may as well make him king,\" Klobuchar said .------9:45 p.m. Joe Biden says the outcome of a Senate impeachment trial against President <mark>Donald Trump</mark> won't affect his arguments against the Republican president in the 2020 campaign. And the former vice president said at Tuesday night's Democratic presidential debate that it's \"irrelevant\" whether <mark>Trump</mark> claims exoneration if the Republican-led Senate votes as expected and doesn't remove him from office. Biden said House Democrats had \"no choice\" but to impeach the president for <mark>Trump</mark>'s efforts to pressure Ukrainian officials to launch investigations into Biden's son Hunter's business dealings in the country and his own foreign policy engagement in Ukraine when he was vice president. <mark>Trump</mark>'s claims about the Bidens have been debunked. But Biden said he expects <mark>Trump</mark> and Republicans to continue to allege that the Bidens are corrupt. \"I did my job,\" Biden said at the debate .------9:35 p.m.. It all comes back to health care. Even after Democratic presidential candidates had an extended foreign policy discussion at Tuesday's presidential debate, they saved the fireworks for another fight over how to expand health insurance coverage. Joe Biden suggested that Bernie Sanders wasn't being \"candid\" with voters over the cost of his single-payer insurance idea. Amy Klobuchar said \"Medicare for All\" is so impractical that the \"debate isn't real .\" And Pete Buttigieg bristled at the suggestion that adding a \"public option\" plan to the existing market isn't a major step forward. Sanders said those more moderate candidates misrepresent a plan he said would indeed increase Americans' taxes but eliminate the \"absurdity\" of private insurance costs. Elizabeth Warren tried a bit of a twist. She defended single payer, but noted that Republicans want to roll back even existing coverage. \"I'll take our side of the argument any day,\" she said of the entire Democratic field .------9:25 p.m. Former Vice President Joe Biden says one of his top rivals needs to \"be candid\" with voters on the cost of his health care reform proposal. Biden said Tuesday during the Democratic presidential debate in Des Moines, Iowa, that Vermont Sen. Bernie Sanders should be more upfront with voters on how much it will cost to move the country to a single-payer \"Medicare for All\" system. Asked if voters deserved more information on the price of his signature proposal, Sanders maintained his argument that his proposal \"wouldn't bankrupt the country\" because it would end out-of-pocket and prescription drug prices. Biden proposes making fixes to the existing Affordable Care Act system, and former South Bend, Indiana, Mayor Pete Buttigieg proposes somewhat of a hybrid. Noting she would use executive power to cut prescription drug prices, Massachusetts Sen. Elizabeth Warren said her $20-plus trillion plan costs more than those ideas because they represent only incremental change .------9:10 p.m. Elizabeth Warren's argument that a woman is best suited to take on President <mark>Donald Trump</mark> led to a prolonged awkward dispute with Bernie Sanders. Sanders denied during Tuesday night's debate that he told Warren in 2018 that he didn't think a woman could beat <mark>Trump</mark>. Warren says he did and argued Tuesday night that she's the only candidate on stage who defeated an incumbent Republican candidate any time in the last 30 years. The Vermont senator disputed that, arguing that he defeated incumbent Republican <mark>Peter Smith</mark> in a 1990 congressional race. Warren then began counting quietly with her finger, asking, \"Wasn't it 30 years ago?\" Sanders noted his win again and then said the dispute isn't a pressing concern .------9:05 p.m. Bernie Sanders and Elizabeth Warren declined an opportunity to continue their recent campaign trail feud during Tuesday night's debate, but Warren still took on her progressive opponent. Sanders again denied that he told Warren in a private 2018 meeting that a woman couldn't win the presidency. He called it \"incomprehensible\" that he would believe such a thing and said he didn't want to \"waste a whole lot of time\" on the issue \"because this is what <mark>Donald Trump</mark>... wants .\" He also committed to doing \"everything in my power\" to making sure the eventual nominee wins. Warren has said Sanders did in fact tell her a woman can't win, and on the debate stage, she took on the issue of whether a woman can win head-on. Warren told the crowd that the male candidates on the stage collectively lost 10 races while she and Sen. Amy Klobuchar were \"the only people on this stage who have won every single election that they've been in .\" She also argued that female candidates have outperformed men, noting that female candidates and voters were pivotal in taking back the House and flipping statehouses during the last midterms. Warren pivoted to an implicit contrast with Sanders on electability, arguing that \"the real danger\" for Democrats \"is picking a candidate who can't pull our party together .\" ------9 p.m. Former Vice President Joe Biden and businessman Tom Steyer say they would not meet with North Korea's leader without \"preconditions,\" as President <mark>Donald Trump</mark> has done. Biden said at Tuesday night's Democratic presidential debate in Iowa that <mark>Trump</mark>'s meetings with <mark>Kim Jong Un</mark> gave the North Korean leader \"legitimacy,\" and he criticized <mark>Trump</mark> for weakening sanctions against the country. He said his approach to North Korea would include working with China and Japan. Biden also noted that <mark>Kim</mark> once described him as a \"rabid dog\" who \"must be beaten with a stick .\" Steyer, a billionaire businessman, said the U.S. would need to work with its allies in regard to North Korea. He said staff could meet \"and see how far we can get .\" ------8:55 p.m.. What has become a signature trade deal of President <mark>Donald Trump</mark>'s administration is a conflict point among the Democrats competing to replace him. Vermont Sen. Bernie Sanders said at Tuesday night's Democratic presidential debate at Drake University in Des Moines, Iowa, that he opposes the United States-Mexico-Canada trade agreement, or USMCA, in part because it \"does not incorporate very, very strong principles to significantly lower fossil fuel emissions in the world .\" Asked why she backed the deal, Massachusetts Sen. Elizabeth Warren said it was a \"modest improvement\" over existing agreements and could be a placeholder for future reform. Former Vice President Joe Biden said that, as president, he wouldn't push a trade deal that didn't include buy-in from environmentalists and unionists. Minnesota Sen. Amy Klobuchar said she backed the deal, as did former South Bend, Indiana, Mayor Pete Buttigieg, who said it \"has been improved. It is not perfect .\" ------8:35 p.m.. There's a divide in Tuesday night's Democratic presidential debate over the American military footprint abroad. The leading progressive candidates, Sens. Elizabeth Warren and Bernie Sanders, blasted the trillions of dollars that the U.S. has spent in Middle East wars since the Sept. 11 terror attacks. Warren said \"We have to stop this mindset\" and bring home \"combat troops .\" The more moderate candidates countered that a U.S. presence is necessary in the Middle East, though former Vice President Joe Biden, Sen. Amy Klobuchar and former Mayor Pete Buttigieg said the focus should be on small special forces. To some degree, the debate is about framing. Sanders and Warren don't go so far as to say they would never order military deployments. Biden, Klobuchar and Buttigieg are careful to express caution about large, extended missions of ground troops. But the differences highlight two distinct foreign policy camps within the Democratic Party .------8:25 p.m. Democratic presidential hopeful Bernie Sanders says he fears that President <mark>Donald Trump</mark>'s actions involving Iran could be leading the United States into a foreign policy quagmire of the highest level. The Vermont senator said at Tuesday night's Democratic candidate debate at Drake University in Des Moines, Iowa, that what he sees as the country's top foreign policy disasters - the wars in Vietnam and Iraq - were \"based on lies .\" Sanders accused <mark>Trump</mark> of being dishonest about the intelligence that led to the U.S. airstrike that killed Iranian Gen. Qassem Soleimani. Sanders pressed the need for an international coalition, adding, \"We cannot keep acting unilaterally .\" Defense Secretary Mark Esper said this week that he had seen no hard evidence that four American embassies had been under threat when <mark>Trump</mark> authorized the targeting of Iran's top commander, raising questions about the scale of the threat described by <mark>Trump</mark> last week .------8:15 p.m. Former Vice President Joe Biden wasted no time in the opening minutes of Democrats' presidential debate in calling his 2002 vote authorizing an Iraq invasion a mistake. It was an unusually matter-of-fact tone of contrition for Biden, especially as he tries to emphasize his long foreign policy record as a vice president and a six-term U.S. senator. The 77-year-old candidate has throughout his campaign mostly defended portions of his record that have come under criticism from his party's progressive flank. Vermont Sen. Bernie Sanders nonetheless tried to capitalize on the issue Tuesday night. He pointed out that he voted against the Bush administration's war powers request as a member of the House, and he called the war the \"worst foreign policy blunder in history .\" Biden maintained that he'd compare his \"record overall\" to any of his Democratic competitors, and he pointed to his role in the Obama administration in dramatically scaling back U.S. involvement in Iraq .------8 p.m. Six Democratic presidential candidates are taking the debate stage in Des Moines, Iowa, in a final showdown before primary voting begins. The half dozen candidates on stage Tuesday are all white and include four men. It's a stark winnowing of the Democratic field that was once the most diverse in history. The first debate of 2020 is starting with fresh tension between Vermont Sen. Bernie Sanders and Massachusetts Sen. Elizabeth Warren. Warren said Monday night that Sanders privately told her in 2018 that he didn't think a woman could defeat President <mark>Donald Trump</mark>. Sanders has vigorously denied making the comment. The dispute isn't likely to be the only one on stage. Sanders has ratcheted up his criticism of Vice President Joe Biden over his past support of the Iraq War and other issues. Minnesota Sen. Amy Klobuchar is looking to break out of the pack, building on strong debates and her arguments that former South Bend, Indiana, Mayor Pete Buttigieg doesn't have enough experience to be president. Billionaire Tom Steyer is expected to face criticism that he's trying to buy his way to the White House as he floods early voting states with campaign ads .------Catch up on the 2020 election campaign with AP experts on our weekly politics podcast, \"Ground Game .\" Copyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Facebook Twitter WhatsApp SMS Email Print Save Tags Government And Politics General Elections Political Debates Campaigns Elections Political Parties Political Organizations 2020 United States Presidential Election United States General Election United States Presidential Election Presidential Elections National Elections Political Conventions Foreign Policy International Relations Government Policy 2016 United States Presidential Election Trade Agreements Trade Policy International Trade Economy Business Economic Policy Government Business And Finance International Agreements Emissions Reduction Pollution Environmental Concerns Environment Environment And Nature Health Care Reform Health Care Policy Political Issues Health Care Costs Health Prescription Drugs Medication Diagnosis And Treatment Prescription Drug Costs Medicare Government-funded Health Insurance Government Programs Access To Health Care Trials Legal Proceedings Law And Order General News Political Corruption Legislature Impeachments Primary Elections Locations Des Moines Iowa United States North America Iran Middle East Iraq Indiana South Bend Vermont East Asia Asia North Korea Massachusetts Minnesota Welcome to the discussion. Keep it Clean. Please avoid obscene, vulgar, lewd, racist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another person will not be tolerated. Be Truthful. Don't knowingly lie about anyone or anything. Be Nice. No racism, sexism or any sort of - ism that is degrading to another person. Be Proactive. Use the \"Report' link on each comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness accounts, the history behind an article.", "articleID": "2020011504_00129028_W", "names": {"Peter Smith": ["Q12331731", "Q1344098", "Q16095881", "Q16221181", "Q16744426", "Q17140360", "Q2073575", "Q2078388", "Q21464247", "Q23418812", "Q2426347", "Q30106739", "Q30122591", "Q38053711", "Q42305788", "Q42842578", "Q43200108", "Q50042954", "Q56281118", "Q57984828", "Q7176991", "Q7176994", "Q7176996", "Q7176997", "Q7176998", "Q7176999", "Q7177003", "Q7177004", "Q7177005", "Q7177006"]}}, {"date": "2020-01-17", "url": "http://nwemail.co.uk/sport/national/18167695.saracens-facing-premiership-relegation-break-salary-cap---reports/", "content": "Sport National Sport Saracens facing Premiership relegation if they break salary cap again--reports By Press Association 2019 Saracens are facing relegation from the Premiership, according to a report 0 comment Saracens are set to be relegated from the Gallagher Premiership unless they can prove they will not break the salary cap again this season, it was reported on Friday. According to reports in a number of national newspapers, the defending champions were issued the ultimatum following a summit of Premiership Rugby Limited chief executives in London on Tuesday. Saracens were docked 35 points and dealt a £ 5.36 million fine last November after they were found to have broken the £ 7million salary cap for the past three seasons. Saracens could be relegated from the Premiership, according to reports (Tess Derry/PA) The same report indicates that the Hertfordshire club are also struggling to keep within the salary cap this season. The club, however, are working to find a solution. Ed Griffiths has been re-appointed chief executive to oversee the necessary changes and he will be assisted by Neil Golding, who has taken over as non-executive chairman. Golding is described as a \"highly experienced and respected lawyer\" and specialises in disputes, litigation and arbitration at Freshfields Bruckhaus Deringer. \"I am joining the club at a time of significant change,\" said Golding earlier this month. <mark>Liam Williams</mark> is one player who is set to leave Saracens as they bid to cut their wage bill (David Davies/PA) \"We, as a board, are strongly committed to introducing new robust processes and working together with other Premiership Rugby stakeholders in the best interests of Saracens and English rugby .\" Griffiths has confirmed that Saracens must reduce their wage bill and, alongside director of rugby Mark McCall, is identifying players to be trimmed from the squad. Wales full-back <mark>Liam Williams</mark>' departure for Scarlets that is due to happen at the end of the season is set to be brought forward, while Richard Wigglesworth, George Kruis, Juan Figallo and <mark>Michael Rhodes</mark> face uncertain futures. Saracens host Racing 92 in the Champions Cup at the Allianz Arena on Sunday. 0 comment", "articleID": "2020011708_00123785_W", "names": {"Liam Williams": ["Q19578254", "Q23306997", "Q56421819", "Q6539846"], "Michael Rhodes": ["Q16735162", "Q42225233", "Q55085840", "Q6833829"]}}, {"date": "2020-01-17", "url": "http://www.asianimage.co.uk/sport/national/18168239.andy-murray-comeback-claims-leading-hip-specialist/", "content": "Sport National Sport <mark>Andy Murray</mark> comeback could be over, claims leading hip specialist By Press Association 2019 <mark>Andy Murray</mark> has been told his comeback could be over if he fails to recover from his latest injury 0 comment <mark>Andy Murray</mark>'s comeback will effectively be over if he fails to recover from his latest injury setback, a leading hip specialist has warned. <mark>Murray</mark>, 32, who has not played since November, announced on Thursday that he is withdrawing from two events next month with the pelvic problem which forced him out of the Australian Open. Giles Stafford, a consultant orthopaedic surgeon who has closely monitored <mark>Murray</mark>'s return, told the PA news agency: \"If it doesn't get better then it might be the end of what <mark>Andy</mark> is hoping to achieve. Grinding .???? #Work #Training #AMC pic.twitter.com/mn2ymLTaxw--<mark>Andy Murray</mark> (@ andy_murray) January 16, 2020\" It will limit his comeback. He might be able to play doubles but singles could be too much for him. So it is obviously a concern going forward. \"With regards as to how things develop, if the injury doesn't improve, or when he returns to playing and the problem comes back, then obviously he has to think about where he goes from there .\" It was first felt that <mark>Murray</mark>'s injury, which surfaced at November's Davis Cup finals, was only minor. But the three-time major winner sparked concern when he withdrew from the opening grand slam of the year before then revealing he would play no part in next month's tournaments in Montpellier and Rotterdam. <mark>Andy Murray</mark> has won three grand slams but his comeback is in doubt (Mike Egerton/PA) And Stafford believes the bone bruising is linked to <mark>Murray</mark>'s hip resurfacing surgery at the start of 2019. \"It is claimed that <mark>Andy</mark>'s hip implant has a better range of motion than a standard conventional replacement and it actually doesn't,\" said Stafford. \"One of the problems with it is that it has a reduced range of motion because you save the native neck of the femur just under the ball. That can dig into the prosthetic metal cup earlier than a normal hip replacement would .\" I am guessing the issue with <mark>Andy</mark> is that he is pushing a lot of force through the hip, and I imagine what is happening is that his native femoral neck is hitting up against the metal cup and causing a lot of bruising on the thigh bone. Sliding into the weekend like...⛸ #AMC pic.twitter.com/cOyC70POHd--<mark>Andy Murray</mark> (@ andy_murray) December 20, 2019 \"The problem is that over time the metal cup can carve a notch in the bone just under the ball, and if that carries on it can predispose the bone to breaking .\" If that is the case, he will have to change certain aspects of the way he moves, and getting down to the ball and things like that could become an issue. They are just waiting for the bruising to improve but that could take months. \"Speaking on Thursday, <mark>Murray</mark>, who won his first ATP title following hip surgery in Antwerp in October, said:\" The bone bruising is taking longer to heal than first thought, so I won't be playing in Montpellier or Rotterdam in February. \"I don't want to rush anything or put a timeline on my recovery. I'm going to listen to my body and step back on the court to compete when the time is right .\" 0 comment", "articleID": "2020011711_00128902_W", "names": {"Andy Murray": ["Q10125", "Q526811"]}}, {"date": "2020-01-17", "url": "http://www.squamishchief.com/oops-radio-reporter-calls-wrong-robert-shapiro-on-air-1.24055024", "content": "LONDON--Will the real <mark>Robert Shapiro</mark> please take the microphone? BBC radio presenter Evan Davis was left in an embarrassing situation Thursday while introducing a segment on a proposal to allow cameras to record sentencing remarks in U.K. courts. article continues below Trending Stories UPDATED: Quest University granted financial protection Province seeking to seize properties associated with Squamish cannabis dispensary Squamish police briefs Former executive vice-president sues Quest University During a live telephone interview on \"PM,\" an evening public affairs program, Evans thought producers had called <mark>Robert Shapiro</mark>, a Los Angeles-based attorney who represented ex-football star O.J. Simpson in one of the most famous televised trials in U.S. history. Instead, Davis found himself speaking to another American with the same name but made his mark by advising Presidents Bill Clinton and Barack Obama on economic policy. A round of giggles could be heard in the background as the man was wrongly introduced as the lawyer who in 1995 was part of the team that successfully defended Simpson during his murder trial. Davis said: \"<mark>Robert Shapiro</mark>, I am fascinated in what you think about these rather tentative steps that have been taken here to show court on television and whether we are moving on the right track .\" An amused <mark>Shapiro</mark> replied: \"First of all, it's an honour to be on with Lord (Jonathan) Sumption. Second, let me say that I am <mark>Robert Shapiro</mark>, an adviser to Democratic presidents, not the lawyer. You called the wrong <mark>Robert Shapiro</mark>.\" Sumption is a former senior judge. Davis said: \"Oh my goodness, what a mistake we made. You are obviously in our Rolodex. I am surprised we didn't pick that up in the pre-conversation .\" \"I am surprised too,\" <mark>Shapiro</mark> said. Despite the blunder, <mark>Shapiro</mark> knew something about the topic, and was able to provide his views on the new draft laws. Read Related Topics", "articleID": "2020011711_00164349_W", "names": {"Robert Shapiro": ["Q446561", "Q7349716", "Q7349717"]}}, {"date": "2020-01-17", "url": "https://www.energylivenews.com/2020/01/17/hinkley-point-b-hits-300twh-milestone/", "content": "Infrastructure Hinkley Point B hits 300TWh milestone This means the facility, which originally came online in 1976, now holds the UK record for generating more electricity than any other nuclear power station in the country Friday 17 January 2020 Image: jgolby / Shutterstock EDF's Hinkley Point B nuclear power station in Somerset has this week hit the milestone of generating 300TWh of low carbon electricity in its lifetime. This means the facility, which originally came online in 1976, now holds the UK record for generating more electricity than any other nuclear power station in the country. Its owner notes 300TWh of electricity is enough to power every home in the county for almost three years whilst avoiding the production of 105 million tonnes of greenhouse gases--this is equivalent to removing all cars from the UK's roads for one and a half years. The facility was the UK's twelfth operational commercial nuclear power station and currently employs more than 700 staff. <mark>Peter Evans</mark>, Hinkley Point B's Station Director, said: \"Achieving the 300TWh milestone is a fantastic achievement and really signifies the huge contribution Hinkley Point B power station has made to low carbon generation in the UK over the years .\" ", "articleID": "2020011712_00047684_W", "names": {"Peter Evans": ["Q17523824", "Q2074761", "Q2534758", "Q39089656", "Q52888475", "Q57986136", "Q7173890"]}}, {"date": "2020-01-18", "url": "http://newstimes.com/entertainment/article/Eminem-s-Music-to-Be-Murdered-By-Album-14985439.php", "content": "https: //variety.com/2020/music/reviews/eminem-music-to-be-murdered-by-album-review-1203471710/ Eminem's \"Music to Be Murdered By': Album Review Take away the Las Vegas massacre shock-bait number and Eminem's latest is a passable, forgettable meandering through popular hip-hop sounds. Jemayel Khawaja, provided by Published 10:32 pm EST, Friday, January 17, 2020 Photo: Courtesy Interscope Photo: Courtesy Interscope Image 1 of / 1 Caption Close Image 1 of 1 Photo: Courtesy Interscope Eminem's\" Music to Be Murdered By': Album Review 1 / 1 Back to Gallery Click here to read the full article. Eminem's surprise album release may bear the Hitchcock-referencing title \"Music to Be Murdered By,\" but, yes, as you'd expect, \"Music to Murder To\" might be a more apt description. The 20-track LP, his tenth since soundtracking the turn of the millennium with 1999's \"The Slim Shady LP,\" finds the Detroit rap legend in an alternately rancorous and pensive mood while showcasing his still obliterative rhyming skills, penchant for controversy and even a provocative turn of questionably executed advocacy for gun safety. Featuring everyone from Q-Tip to Ed Sheeran, Anderson. Paak and the gone-too-soon emo-rap icon Juice Wrld, the album poses the question: When you've been raging against the world for a half-century, is there anything left unscathed? Eminem takes listeners on a tour of gripes familiar and occasionally new, ranging in theme from domestic abuse to copious opiate use, various rap feuds, staying culturally relevant, euthanized childhood pets and a preoccupation with mass shootings. More from Variety Eminem Reenacts Las Vegas Massacre in Anti-Gun Video, Jokes About Manchester Bombing in Separate Track Eminem Pays Homage to Alfred Hitchcock With \"Murdered' Album Cover and Title Eminem's Violent 2009 Lyric About Rihanna Leaks Related Stories Eminem Reenacts Las Vegas Massacre in Anti-Gun Video, Jokes About Manchester Bombing in Separate Track Eminem Pays Homage to Alfred Hitchcock With\" Murdered' Album Cover and Title Eminem's Violent 2009 Lyric About Rihanna Leaks Although Eminem's impish affectation has been replaced over time with a far more grouchy demeanor, don't let the Hitchcock references, dad beard or Simon and Garfunkel samples fool you with illusions of maturity or subtlety. He wants you to know that he very much still does not give a f--, as promised way back in \"99. Some of Eminem's references in his diss-topian rhymes--JonBenet Ramsey and Ayatollah Khomeini, for example--may have been best left in the last century, but it's his commentary on a far more persistent phenomenon that has the Internet ablaze. Most of the early attention on the record has been on the controversial video for the single\" Darkness, \"a\" Stan \"- esque dirge that places Em in the shoes of the 2017 Las Vegas massacre shooter. The track intertwines Eminem's own struggles with alcohol, pharmaceuticals, anxiety and depression with the final moments of <mark>Stephen Paddock</mark>'s life, a macabre blur of semiautomatic weapons, booze and a blood-soaked hotel room spliced with moody shots of Eminem pacing around a blue-tinged minimalist set. As the protagonist un-hoods, revealing not Eminem but a <mark>Paddock</mark> lookalike, he rains machine gun fire down on the Strip below before shooting himself in the mouth. It's a bleak and startling affair, arresting in its sheer lack of subtlety and grim shock factor all familiar Eminem tropes, just without any semblance of his usual humor. The video fades with clips of media coverage of mass shootings forming the shape of the contiguous United States and a public service announcement:\" Make Your Voice Heard and Help Change Gun Laws in America. \"Many have lauded the rap veteran for the video's political message. It's a sign of the alternate reality we have warped into that Eminem--the lovable scamp who made his career motor-mouthing fantasies of murdering his ex-wife, shooting up clubs and assaulting strippers--is now pitching gun safety legislation and get-out-the-vote drives .\" Darkness \"is wedged between tracks that gleefully quip about the Manchester Arena and Columbine shootings, so the continuity of messaging barely lasts a couple minutes. Even in this post-truth age, the lack of accountability is galling. But this is where we find ourselves .\" This is America, \"it ain't, but we'll take our advocates where we can get\" em. Eminem has always used imagery of violence and guns, even if under the guise of extremist satire, to sell millions of records that have perpetuated a culture in which gun violence is normalized. Depending on your perspective, that makes his turn on \"Darkness\" either all the more valiant or deeply hypocritical and exploitative. If it makes even one individual vote or one middle American angry boy consider mental health and gun safety in a different way, do we join the chorus of consternated applause? The album has its less topical highlights. \"Godzilla\" and \"Yah Yah\" are memorable uptempo bangers with notable featured performances from Juice Wrld and the Roots' Black Thought, respectively, that show Eminem's often-astounding flow still carries water over various niches of hip-hop. Longtime collaborator Royce Da 5' 9 \"brings a fresh energy to all three tracks on which he appears. And after doffing his baseball cap to Tyler, the Creator on\" No Regrets \"while highlighting lesbian rapper Young MA on\" Unaccommodating, \"it seems that Eminem's rampant homophobia may be in remission. Elton will be pleased. Then again, on the regrettable\" Those Kinda Nights \"collab with Ed Sheeran (can we call EdandEm a thing?), Eminem eagerly opines on the joys of sexual harassment, so there's clearly still plenty of room for improvement on the wokeness scorecard. All the hullabaloo around\" Darkness \"will likely obscure too much rumination on the rest of\" Music to Be Murdered By. \"Perhaps that's a good thing for Eminem. While his talent for head-spinning flow and cutting barbs is still very much in effect, the album is a passable but ultimately forgettable meandering through popular hip-hop sounds of today. It's usually a bad sign when an artist opens an album with a track berating you about how relevant he is. But if Eminem has found a way to turn his perennial talent for shock-baiting into an even infinitesimally safer America, it might be possible to chalk it up as a win anyway. Sign up for Variety's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram. Most Popular 1 CT could see 4 to 8 inches of snow Saturday 2 Man attacked with baseball bat in downtown Danbury 3 Police: Sherman woman charged after domestic incident 4 Ex-Newtown man charged in child porn investigation 5 After missing nearly 1 month, CT teen found safe 6 New Haven teen fatally shot by state police after apparent...7 Danbury police investigate second shooting in less than a week View Comments © 2020 Hearst Communications, Inc. .", "articleID": "2020011804_00138025_W", "names": {"Stephen Paddock": ["Q41529365", "Q41711871"]}}, {"date": "2020-01-19", "url": "https://www.dailyrecord.co.uk/news/scottish-news/burnt-out-stolen-car-found-21311986", "content": "Sign up to FREE daily email alerts from Daily Record - daily Subscribe We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights Thank you for subscribing We have more newsletters Show me See our privacy notice Invalid Email Police are appealing for information after gunshots were fired at a home in Glasgow. The incident happened in Salmona Street in the Hamiltonhill area of the city around 11.30 pm on Thursday, January 16. Shots were fired by people who got out of a dark-coloured four door car before returning to the waiting vehicle. The suspects fled in the direction of Auckland Street (Image: Google) Read More Related Articles Fatcat council boss in £ 800k payoff asked for payback They then fled the scene towards nearby Auckland Street. Officers probing the incident believe the motor involved was a stolen purple Nissan Pulsar. The car, registration SE66 KNN, was swiped from Kilwinning on Thursday, December 5. The stolen car was found burnt out in Manse Street, Coatbridge on January 17 (Image: Google) Read More Related Articles Bus on fire at Glasgow Fort was brand new eco bus \"torched by yobs with flare' It was found burnt out on Manse Road in Coatbridge on Friday. No one was injured and that enquiries are ongoing as cops scour CCTV footage and go door to door in the area. Officers are appealing for anyone who might have seen the stolen vehicle between December 5 and January 17 to get in touch. Police are now appealing for information (Image: Stuart Vance) Read More Related Articles Rugby Union boss is paid £ 933,000 while front-line staff get less than living wage Detective Inspector <mark>John Morrison</mark> said:\" We believe that the purple Nissan Pulsar may have been used by those who discharged the firearm and are appealing for anyone who may have seen the vehicle to get in touch. \"I would also ask anyone who has private CCTV or who was in the area and may have dashcam footage to check the footage for anything of significance which may assist in our enquiries .\" Anyone with information should contact Police Scotland on 101, quoting incident 3870 of January 16. Information can also be passed anonymously to Crimestoppers by calling 0800555111. Read More Top news stories today New hope for missing Scot <mark>Lisa Brown</mark> The Judge wins £ 14k <mark>Thomas Cook</mark> compo Row over rugby boss' £ 930k wage King Kenny's Hoops transfer prediction", "articleID": "2020011911_00167854_W", "names": {"John Morrison": ["Q16116030", "Q22763081", "Q259180", "Q3182183", "Q33133894", "Q5397323", "Q56274458", "Q6249511", "Q6249515", "Q6249517", "Q6249521", "Q6249523"], "Lisa Brown": ["Q11347967", "Q1827717", "Q47071859", "Q6557848", "Q6557850", "Q6557852", "Q6557853"], "Thomas Cook": ["Q16205324", "Q47452628", "Q53952787"]}}]