[{"date": "2020-01-19", "url": "https://www.dailystar.co.uk/sport/football/jamie-carragher-aims-sly-dig-21314096", "content": "Sign up to FREE daily email alerts from Daily Star - Football Subscribe We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights Thank you for subscribing See our privacy notice Invalid Email Jamie Carragher has thrown a sly dig at <mark>Harry Maguire</mark> after Virgil van Dijk put Liverpool 1-0 up. The Dutchman jumped highest to head home from a corner in front of the Anfield Road end. Van Dijk was able to get the run and soared above <mark>Maguire</mark>, who has been blamed in part for the goal. The Manchester United defender usurped Van Dijk as the world's most expensive defender in the summer. Leicester held out for much of the summer before the Red Devils stumped up £ 80m to sign the Englishman. It came 18 months after Liverpool had parted with £ 75m to sign Van Dijk from Southampton - a transfer that has more than paid off for Jurgen Klopp. Read More Related Articles Gary Neville explains why Man Utd changed tactics to five defenders against Liverpool Read More Related Articles Roy Keane questions \"worrying' Luke Shaw selection for Man Utd against Liverpool And Carragher was quick to mock United when he said:\" The £ 75m man out jumps the £ 80m man. \"Gary Neville has also criticised his former team for being\" naive \"as they tried to stop the Reds scoring. <mark>Maguire</mark> was blocked off from getting to Van Dijk meaning the Liverpool colossus had to out jump <mark>Brandon Williams</mark> to score. United's task was already a tough one and it now looks even more challenging with the Reds looking relentless this season. Virgil van Dijk of Liverpool scores (Image: Getty Images) Read More Related Articles Man Utd manager Ole Gunnar Solskjaer provides Marcus Rashford injury update Ole Gunnar Solskjaer's side remain the only team to prevent Liverpool from winning this season when they managed to hold them to a 1-1 draw at Old Trafford. The Norwegian has gone with a back five at Anfield and Neville reckons he is trying to deny the home side space. He said:\" I think the reason that United are playing five at the back is purely to make sure the spaces in between the defenders are small. \"I think with a back five, yes it is a bit more defensive but it does leave the chance to leave [Daniel] James and [Anthony] Martial higher up the pitch .\" ", "articleID": "2020011917_00119348_W", "names": {"Brandon Williams": ["Q16232032", "Q24007026", "Q2923793", "Q4957141", "Q4957142", "Q4957143", "Q4957144", "Q4957145"], "Harry Maguire": ["Q165772", "Q5670856"]}}, {"date": "2020-01-19", "url": "https://www.sfgate.com/news/us/article/Bad-Boys-for-Life-debuts-so-good-with-box-14988009.php", "content": "BREAKING NEWS How the 49ers brought <mark>Steve Young</mark> back into the fold 8:52 AM 8:52 AM The Raiders left Oakland. The 49ers want to take it. Kittle causes descent into syrup-chugging madness on NFL Network 10:01 AM 10:01 AM Jimmy G's backpack says a lot about him, teammate explains 10:28 AM 10:28 AM Back in playoffs, 49ers fans get nostalgic for Candlestick https: //www.sfgate.com/news/us/article/Bad-Boys-for-Life-debuts-so-good-with-box-14988009.php \"Bad Boys for Life' debuts so good with box office top spot Jonathan Landrum Jr., Ap Entertainment Writer Updated 10:47 am PST, Sunday, January 19, 2020 LOS ANGELES (AP)--Two\" Bad Boys \"were too good for one\" Dolittle \"at the box office .\" Bad Boys for Life \"starring <mark>Will Smith</mark> and Martin Lawrence brought in $59 million in the U.S. and Canada to score a No. 1 debut entering the Martin Luther King Jr. holiday weekend. The action-packed, buddy comedy returned for the franchise's third installment after a 17-year hiatus with popular demand to outlast\" Dolittle, \"starring Robert Downey Jr., which opened at second with a mediocre $22.5 million. Sony Pictures predicted that\" Bad Boys \"<mark>will</mark> make around $68 million over the four-day weekend. The film exceeded expectations, building momentum with favorable reviews including an A Cinema Score and a 76% rating on Rotten Tomatoes .\" It's a great brand with two terrific stars, a beloved franchise and it feels like summertime in January, \"said Paul Dergarabedian, senior media analyst for Comscore. He said it was a smart move by Sony Pictures to release the film during January, an unusual month for blockbusters releases but it ultimately\" reaped huge benefits. \"\"Dolittle\" barely topped the World War I film \"1917,\" which claimed the top spot last week. The Sam Mendes-directed war film continues to hold strong with $22.1 million this weekend after going from 11 screens in its first weeks to more than 3,600. The Oscar-nominated epic wartime film has gained popularity after it won Golden Globes for best director and drama film a couple weeks ago. Saturday night, it won an award for theatrical motion picture at the Producers Guild Awards, which has gone on to win best picture Oscar 21 out of 30 times, including the past two years. \"' 1917' is really taking a lot of the oxygen and taking on a life of its own since the Oscar nominations and all of these awards,\" Dergarabedian said. \"If you haven't seen\" 1917,' you're totally out of the loop for awards season. \"Along with\" Bad Boys, \"Sony Pictures has two other films in the top 10 at the domestic box office including Oscar-contender\" Little Women \"and\" Jumanji: The Next Level, \"which crossed $700 million worldwide. In another blockbuster,\" Star Wars: The Rise of Skywalker \"topped $1 billion globally after five weeks. The Disney's film focusing on the final chapter of the Luke Skywalker saga has also earned more than $492 million domestically. Estimated ticket sales for Friday through Sunday at U.S. and Canadian theaters, according to Comscore. Where available, the latest international numbers for Friday through Sunday are also included. Final domestic figures <mark>will</mark> be released Monday. 1 .\" Bad Boys for Life, \"$59.1 million. 2 .\" Dolittle, \"$22.5 million. 3 .\" 1917, \"$22.1 million. 4 .\" Jumanji: The Next Level, \"$9.5 million. 5 .\" Star Wars: Rise of Skywalker, \"$8.3 million. 6 .\" Just Mercy, \"$6 million. 7 .\" Little Women, \"$5.9 million. 8 .\" Knives Out, \"$4.3 million. 9 .\" Like A Boss, \"$3.8 million. 10 .\" Frozen 2, \"$3.7 million. ___ Follow AP Entertainment Writer Jonathan Landrum Jr. on Twitter: http: //twitter.com/MrLandrum31 Most Popular 1 The Raiders left Oakland. The 49ers want to take it. 2 Adorable Bay Area home with ocean view only $800K--with a catch 3\" Unconditional love': Wife speaks after husband dies in avalanche 4 How the 49ers brought <mark>Steve Young</mark> back into the fold 5 \"Dopes and babies': Inside Trump's tirade against generals 6 Manteca school bus driver put on leave after frightening ride 7 Stanford University student found dead in campus residence 8 Conor McGregor blasts Cerrone in 40 seconds in UFC return 9 Person walking along I-280 in SF struck, killed 10 Minerva's Sunday Horoscope: 1/19/20 11 Berkeley police warn of increase in catalytic converter thefts 12\" Oh no, not again': Remembering SFO's epidemic of plane hijacking 13 Harry, Meghan to quit royal jobs, give up \"highness' titles 14 49ers QB Jimmy Garoppolo's backpack says a lot about him 15 The best place to eat in the Presidio is ending food service View Comments © 2020 Hearst Communications, Inc. .", "articleID": "2020011919_00030191_W", "names": {"Steve Young": ["Q16185674", "Q18818306", "Q30122679", "Q4356818", "Q55634010", "Q740086", "Q7614385", "Q7614386"], "Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}}, {"date": "2020-01-19", "url": "http://www.gamereactor.eu/fortnite/?sid=d3ca12781128fb71a08e079e90899f48", "content": "FORTNITE REVIEW. Written by Petter Hegevall on the 6th of April 2018 at 16 \"Fortnite for iPhone is something of a gem in terms of content and its free-to-play structure .\" NEWS. Written by <mark>Sam Bishop</mark> on the 16th of January 2020 at 09:32 The streamer has been virtually placed into the game, and you can find his gear in the item shop later today. NEWS. Written by <mark>Sam Bishop</mark> on the 6th of January 2020 at 14:36 It earned $1.8 billion USD, so it seems Epic's titan is showing no signs of slowing down anytime soon. NEWS. Written by <mark>Mike Holmes</mark> on the 3rd of January 2020 at 15:51 It might not have matched up to last year's total, but Epic's Battle Royale-inspired shooter is still head and shoulders above the rest. NEWS. Written by <mark>Sam Bishop</mark> on the 20th of December 2019 at 12:41 The feature has been enabled once again after being taken out, letting you play alongside a friend on the same console. NEWS. Written by <mark>Sam Bishop</mark> on the 17th of December 2019 at 09:00 To celebrate the Star Wars collaboration in Epic's game, the pair have partnered for a special something on Thursday. NEWS. Written by <mark>Sam Bishop</mark> on the 11th of December 2019 at 13:06 Epic is allegedly trying to skip the 30% cut Google gets from in-app purchases, while Google is staying firm with its own rules. NEWS. Written by <mark>Sam Bishop</mark> on the 10th of December 2019 at 13:30 Matt Gailer has allegedly asked Epic to stop offering the Pump It Up emote, and Epic wants to make clear that it's not an infringement of trademark or copyright.", "articleID": "2020011920_00178440_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}}, {"date": "2020-01-19", "url": "https://www.billboard.com/articles/columns/pop/8548430/michelle-obama-shares-2020-workout-playlist-featuring-lizzo-cardi-b", "content": "POP Michelle Obama Shares 2020 Workout Playlist Featuring Lizzo, Cardi B & More: Listen 1/19/2020 by <mark>Mitchell Peters</mark> FACEBOOK TWITTER EMAIL ME Monty Brinton/CBS via Getty Images Michelle Obama at The 61st Annual Grammy Awards in Los Angeles on Feb. 10, 2019. Michelle Obama is hoping to inspire lots of exercising in the new year by sharing her 2020 workout playlist. On Sunday (Jan. 19), the former first lady and dedicated health advocate shared some of her favorite tunes to listen to while hitting the gym. The 35-song playlist includes Lizzo's \"Soulmate,\" Cardi B's \"Press,\" The Carters' \"Apeshit,\" Bruno Mars' \"Perm,\" Nipsey Hussle, Ed Sheeran, and many more. It's about that time when New Year's resolutions get a bit harder to stick to. To offer a little inspiration, I want to share my go-to #WorkoutPlaylist with you. These songs always seem to give me that extra boost to get through my toughest workouts. What's on your playlist? pic.twitter.com/GFP56Yi9A6--Michelle Obama (@ MichelleObama) January 19, 2020 \"It's about that time when New Year's resolutions get a bit harder to stick to,\" Obama captioned the list on social media. \"To offer a little inspiration, I want to share my go-to #WorkoutPlaylist with you. These songs always seem to give me that extra boost to get through my toughest workouts. What's on your playlist?\" Over the years, Barack and Michelle Obama have regularly shared the music they're listening to. Last month, the former president shared his favorite songs of 2019, which included superstars like Beyoncé (\"Mood 4 Eva\" ), Rosalía (\"Con Altura\" ), Maggie Rogers (\"Burning\" ) and more. Stream Michelle Obama's full 2020 workout playlist below. FACEBOOK TWITTER EMAIL ME", "articleID": "2020012001_00060145_W", "names": {"Mitchell Peters": ["Q25208140", "Q6881343"]}}, {"date": "2020-01-20", "url": "http://www.bournemouthecho.co.uk/news/18172709.beales-announcement-appointed-administrators/", "content": "News Beales' announcement that it has appointed administrators IN FULL: Beales' announcement that it has appointed administrators 0 comment BEALES has this morning published an announcement that it has appointed administrators. The company is almost entirely owned by chief executive <mark>Tony Brown</mark>, but it has to publish announcements to the London Stock Exchange as a small minority of shares are in the hands of a public limited company. Its announcement this morning reads: \"Beale Limited (\"Beale\" or the \"Company\" ) announces that it has now appointed <mark>Will Wright</mark> & Steve Absolom of KPMG LLP as Joint Administrators to the Company. Any enquiries regarding the Company or its administration should be directed to Beales @ kpmg.co.uk. \"It has also been agreed with the Panel on Takeovers and Mergers that the formal sales process, announced on 17 December 2019, is terminated, and the Company is no longer considered to be in an\" offer period', as defined in the City Code on Takeovers and Mergers. Parties with a continuing interest in making a proposal should contact Mark Compton on Mark.Compton @ kpmg.co.uk. \"0 comment", "articleID": "2020012011_00112023_W", "names": {"Tony Brown": ["Q1178830", "Q1378254", "Q16229847", "Q17279916", "Q2412286", "Q27927614", "Q3531701", "Q3993203", "Q53709768", "Q7821961", "Q7821962", "Q7821964", "Q7821965", "Q7821967", "Q7821968", "Q7821969", "Q7821970", "Q971106"], "Will Wright": ["Q309493", "Q8003199"]}}, {"date": "2020-01-20", "url": "https://www.malaymail.com/news/world/2020/01/21/canada-court-starts-extradition-hearing-of-china-huawei-exec/1829939", "content": "Huawei Chief Financial Officer Meng Wanzhou leaves BC Supreme Court in Vancouver, British Columbia, Canada January 20, 2020 .--Reuters pic VANCOUVER, Jan 21--The Chinese telecommunications executive whose arrest in Vancouver badly strained Canada-China relations went to court yesterday to fight extradition to the United States. Meng Wanzhou, the chief financial officer of tech giant Huawei and eldest daughter of its founder Ren Zhengfei, is wanted by US authorities for alleged fraud. Meng made no comment as she rushed past journalists and protesters waving \"Free Meng\" and \"Trump stop bullying us\" placards outside the British Columbia Supreme Court. Her husband and Chinese consular officials sat in a packed gallery to watch the proceedings. In order to secure her freedom, Meng, known as the \"princess of Huawei,\" must convince a Canadian judge that the US charges--linked to alleged violations of US sanctions on Iran--would not stand up in Canada and are politically motivated. The US alleges Meng lied to HSBC Bank about Huawei's relationship with its Iran-based affiliate Skycom, putting the bank at risk of violating US sanctions against Tehran. \"Simply put, there is evidence she deceived HSBC in order to induce it to continue to provide banking services to Huawei,\" the Canadian justice department said in court filings. Meng has denied the allegations. She has been out on bail, living in one of her two Vancouver mansions for the past year. Earlier, China's foreign ministry called Meng's extradition case a \"grave political incident\" and urged Ottawa to release the Huawei executive in order to normalise relations. \"The US and Canada are abusing their bilateral extradition treaty,\" said foreign ministry spokesman Geng Shuang at a regular press briefing in Beijing. Canadian Deputy Prime Minister Chrystia Freeland said Ottawa would not interfere in the case, adding that Canada \"honours its extradition treaty commitments .\" The Canadian justice department has said it will justify extradition by arguing that the US accusations against Meng would be considered a crime in Canada if they had occurred there--a key test known as double criminality. Her lawyers, however, will counter that misrepresentations, if they occurred, do not amount to fraud, and that Canada has not matched the US sanctions against Iran. \"Sanctions drive this case,\" lead defence lawyer <mark>Richard Peck</mark> said in an opening statement. \"This case is founded on allegations of breach of US sanctions, which Canada has repudiated,\" he said. \"The US has cast (Meng's) alleged behaviour as a fraud against a bank. This is an artifice,\" <mark>Peck</mark> said. Canada is effectively being asked \"to enforce US sanctions .\" Caught up in US-China row Meng's arrest during a stopover of a Hong Kong-to-Mexico flight in December 2018 put the 47-year-old at the centre of the US and China's battle over the technology giant's growing global reach. It also stuck Canada in the middle of a trade row between the world's two largest economies, resulting in China restricting agricultural imports from Canada. In addition, China arrested two Canadians on what Canada said were vague and trumped-up charges of \"harming national security .\" China's \"arbitrary detentions,\" according to Ottawa, of former Canadian diplomat Michael Kovrig and businessman Michael Spavor, only days after Meng was taken into custody, have been widely interpreted as retribution by Beijing aimed at pressuring Canada to free Meng. The hearing in Vancouver is scheduled to last five days. But if the US accusations are found to also be a crime in Canada, a further phase will follow in June, with the defense arguing that authorities conspired to nab Meng as part of a \"covert criminal investigation .\" In court documents, Canadian prosecutors assert that Huawei controlled the operations of Skycom in Iran; that its staff used Huawei email accounts and security badges, and its bank accounts were controlled by Huawei. But Meng told HSBC executives in a presentation in 2013 that Huawei no longer owned Skycom and that she had resigned from that company's board. From 2010 to 2014, HSBC and its American subsidiary cleared more than US $100 million worth of transactions related to Skycom through the US. Stunting Huawei's rise Ren Zhengfei has suggested that the case is part of a US plot to crush Huawei, which it sees as a security risk. Prime Minister Justin Trudeau, who had hoped when he came to power in 2015 to deepen Canada's economic ties with China, earlier asked the US for help. He told broadcaster TVA last month that he urged US President Donald Trump not to finalise a trade deal with China \"that doesn't settle the question of Meng Wanzhou and the two Canadians .\" Trump went ahead, however, and signed a \"phase one\" trade deal with China last week. Former Canadian prime minister Jean Chretien and his ex-deputy <mark>John Manley</mark> have urged Trudeau to simply release Meng in a \"prisoner swap\" for Spavor and Kovrig to help restore relations with China. But extradition experts consulted by AFP argued that that would encourage what some called Beijing's \"hostage diplomacy\" tactics .--AFP", "articleID": "2020012101_00071840_W", "names": {"John Manley": ["Q1389967", "Q6246577"]}}]