[{"date": "2020-01-20", "url": "https://www.malaymail.com/news/world/2020/01/21/canada-court-starts-extradition-hearing-of-china-huawei-exec/1829939", "content": "Huawei Chief Financial Officer Meng Wanzhou leaves BC Supreme Court in Vancouver, British Columbia, Canada January 20, 2020 .--Reuters pic VANCOUVER, Jan 21--The Chinese telecommunications executive whose arrest in Vancouver badly strained Canada-China relations went to court yesterday to fight extradition to the United States. Meng Wanzhou, the chief financial officer of tech giant Huawei and eldest daughter of its founder Ren Zhengfei, is wanted by US authorities for alleged fraud. Meng made no comment as she rushed past journalists and protesters waving \"Free Meng\" and \"Trump stop bullying us\" placards outside the British Columbia Supreme Court. Her husband and Chinese consular officials sat in a packed gallery to watch the proceedings. In order to secure her freedom, Meng, known as the \"princess of Huawei,\" must convince a Canadian judge that the US charges--linked to alleged violations of US sanctions on Iran--would not stand up in Canada and are politically motivated. The US alleges Meng lied to HSBC Bank about Huawei's relationship with its Iran-based affiliate Skycom, putting the bank at risk of violating US sanctions against Tehran. \"Simply put, there is evidence she deceived HSBC in order to induce it to continue to provide banking services to Huawei,\" the Canadian justice department said in court filings. Meng has denied the allegations. She has been out on bail, living in one of her two Vancouver mansions for the past year. Earlier, China's foreign ministry called Meng's extradition case a \"grave political incident\" and urged Ottawa to release the Huawei executive in order to normalise relations. \"The US and Canada are abusing their bilateral extradition treaty,\" said foreign ministry spokesman Geng Shuang at a regular press briefing in Beijing. Canadian Deputy Prime Minister Chrystia Freeland said Ottawa would not interfere in the case, adding that Canada \"honours its extradition treaty commitments .\" The Canadian justice department has said it will justify extradition by arguing that the US accusations against Meng would be considered a crime in Canada if they had occurred there--a key test known as double criminality. Her lawyers, however, will counter that misrepresentations, if they occurred, do not amount to fraud, and that Canada has not matched the US sanctions against Iran. \"Sanctions drive this case,\" lead defence lawyer <mark>Richard Peck</mark> said in an opening statement. \"This case is founded on allegations of breach of US sanctions, which Canada has repudiated,\" he said. \"The US has cast (Meng's) alleged behaviour as a fraud against a bank. This is an artifice,\" <mark>Peck</mark> said. Canada is effectively being asked \"to enforce US sanctions .\" Caught up in US-China row Meng's arrest during a stopover of a Hong Kong-to-Mexico flight in December 2018 put the 47-year-old at the centre of the US and China's battle over the technology giant's growing global reach. It also stuck Canada in the middle of a trade row between the world's two largest economies, resulting in China restricting agricultural imports from Canada. In addition, China arrested two Canadians on what Canada said were vague and trumped-up charges of \"harming national security .\" China's \"arbitrary detentions,\" according to Ottawa, of former Canadian diplomat Michael Kovrig and businessman Michael Spavor, only days after Meng was taken into custody, have been widely interpreted as retribution by Beijing aimed at pressuring Canada to free Meng. The hearing in Vancouver is scheduled to last five days. But if the US accusations are found to also be a crime in Canada, a further phase will follow in June, with the defense arguing that authorities conspired to nab Meng as part of a \"covert criminal investigation .\" In court documents, Canadian prosecutors assert that Huawei controlled the operations of Skycom in Iran; that its staff used Huawei email accounts and security badges, and its bank accounts were controlled by Huawei. But Meng told HSBC executives in a presentation in 2013 that Huawei no longer owned Skycom and that she had resigned from that company's board. From 2010 to 2014, HSBC and its American subsidiary cleared more than US $100 million worth of transactions related to Skycom through the US. Stunting Huawei's rise Ren Zhengfei has suggested that the case is part of a US plot to crush Huawei, which it sees as a security risk. Prime Minister Justin Trudeau, who had hoped when he came to power in 2015 to deepen Canada's economic ties with China, earlier asked the US for help. He told broadcaster TVA last month that he urged US President Donald Trump not to finalise a trade deal with China \"that doesn't settle the question of Meng Wanzhou and the two Canadians .\" Trump went ahead, however, and signed a \"phase one\" trade deal with China last week. Former Canadian prime minister Jean Chretien and his ex-deputy <mark>John Manley</mark> have urged Trudeau to simply release Meng in a \"prisoner swap\" for Spavor and Kovrig to help restore relations with China. But extradition experts consulted by AFP argued that that would encourage what some called Beijing's \"hostage diplomacy\" tactics .--AFP", "articleID": "2020012101_00071840_W", "names": {"Richard Peck": ["Q7328338", "Q7328339"]}}, {"date": "2020-01-21", "url": "https://www.hindustantimes.com/cricket/sachin-tendulkar-courtney-walsh-to-don-coaching-hats-for-bushfire-cricket-bash/story-RuKNSYjcw50j7siUZaM2ZO.html", "content": "Home / Cricket / Sachin Tendulkar, Courtney Walsh to don coaching hats for Bushfire Cricket Bash Sachin Tendulkar, Courtney Walsh to don coaching hats for Bushfire Cricket Bash The charity match will be the curtain raiser to the Big Bash final on February 8, with the venue yet to be determined. Both matches, as well as Australia's women's T20 match against India at Junction Oval on the same day. cricket Updated: Jan 21, 2020 09:33 IST Indo Asian News Service File image of Sachin Tendulkar (Getty Images) Indian batting legend Sachin Tendulkar and West Indies fast-bowling great Courtney Walsh will coach the Ponting XI and Warne XI respectively in the Bushfire Cricket Bash set to be played on February 8. The bushfire relief cricket match is one of three headline acts on the cricket's day of giving \"The Big Appeal' with Tendulkar and Walsh joining former Australian captain Ricky Ponting and Shane Warne as leaders of the two sides .\" We are absolutely honoured to be welcoming Sachin and Courtney back to Australia, where they both enjoyed a lot of success as players, and we can't wait to have them involved in what is going to be a special day, \"said <mark>Kevin Roberts</mark>, Cricket Australia Chief Executive Officer .\" Both in the ICC Hall of Fame, Sachin is the greatest run-scorer of all time in international cricket, and we all remember what Courtney could do with the ball, taking more than 500 Test wickets. \"We're looking forward to our people at CA and the entire Australian cricket family coming together for the Big Appeal .\" The charity match will be the curtain raiser to the Big Bash final on February 8, with the venue yet to be determined. Both matches, as well as Australia's women's T20 match against India at Junction Oval on the same day. Former Australian cricketers confirmed to play include Ponting, Warne, Justin Langer, Adam Gilchrist, Brett Lee, <mark>Shane Watson</mark>, <mark>Alex Blackwell</mark> and <mark>Michael Clarke</mark>. Steve Waugh and <mark>Mel Jones</mark> will be involved in a non-playing capacity. The remaining players and further details about The Big Appeal will be announced in the next two weeks. All match profits and funds raised on the day will go to the Australian Red Cross Disaster Relief and Recovery Fund. Get Latest Cricket Updates, Live scores and Top news on HT Cricket. tags", "articleID": "2020012104_00053176_W", "names": {"Alex Blackwell": ["Q3526026", "Q3610633"], "Kevin Roberts": ["Q10408794", "Q28421791", "Q28510868", "Q30122050", "Q6397367", "Q6397368", "Q6397369", "Q6397371"], "Mel Jones": ["Q47122859", "Q6810744"], "Michael Clarke": ["Q1428440", "Q16203034", "Q16227744", "Q57942480", "Q6829291", "Q6829292"], "Shane Watson": ["Q2732224", "Q7488319"]}}, {"date": "2020-01-21", "url": "https://www.bandt.com.au/jcdecaux-installs-giant-sweatbands-to-mark-australian-open/", "content": "Media Posted 22 January, 2020 By Rochelle Burbury SHARE THIS Outdoor advertising company JCDecaux has thrown its support behind one of tennis' biggest tournaments, the Australian Open, by installing giant sweatbands across several of its large-scale Melbourne Citylight signs. In a tribute to the iconic Australian sporting event, the sweatband panels will be on-display in the lead-up and throughout the tournament at four locations in Melbourne, including two at Southern Cross Station, one at the busy corner of Flinders and Swanston streets, and one at Batman Avenue, close to the Open's Melbourne Park hub. The sweatbands, which are made of towelling material with the Australian Open logo embroidered on them, have been attached to Australian Open ads via custom clamping, designed to keep them in place for the entirety of the campaign and not obscure the panels. They have also been weather-proofed to ensure they stand up to Melbourne's notorious \"four seasons in one day\" weather patterns. Tennis Australia Chief Marketing and Insights Officer, Josie Brown, said: \"The Australian Open is known globally as the\" happy slam' and we wanted to find a way to demonstrate our playful personality to everyone in the city of Melbourne. We hope this fun outdoor installation raises a smile and encourages people to get involved in the summer of tennis. \"JCDecaux Head of Creative Solutions, <mark>Ashley Taylor</mark>, said:\" We really wanted to create something memorable for commuters, and something that would play directly into the personality of this great tournament. We've placed the panels in high foot traffic areas in Melbourne's CBD to ensure they receive maximum exposure and we're really encouraging sports fans to come and check them out--it's a great photo opportunity. \"This is the first-time that JCDecaux has created something like this for the Australian Open and we are so excited to be involved with such an important event on the national sporting calendar .\" The panels will be on display until February 4. Advertise with us Connect with: LinkedIn Please login with linkedin to comment Australian Open JCDecaux Posted 1 week Ago Posted 1 month Ago Posted 1 month Ago Posted 1 month Ago Posted 1 month Ago Posted 1 month Ago", "articleID": "2020012122_00140716_W", "names": {"Ashley Taylor": ["Q21066454", "Q24298239", "Q2866560", "Q56087179"]}}, {"date": "2020-01-22", "url": "https://ottawasun.com/news/world/china-coronavirus-deaths-hit-17-heightening-global-alarm/wcm/ab2c28a1-c8ee-4099-a69f-1d85420c2632", "content": "BEIJING/SHANGHAI--Deaths from China's new virus rose to 17 on Wednesday with more than 540 cases confirmed, increasing fears of contagion from an infection suspected to originate from illegally-traded wildlife. The previously unknown, flu-like coronavirus strain is believed to have emerged from an animal market in central Wuhan city, with cases now detected as far away as the United States. Contrasting with its secrecy over the 2002-03 Severe Acute Respiratory Syndrome (SARS) that killed nearly 800 people, China's communist government has this time given regular updates to try to avoid panic as millions travel for the Lunar New Year. \"The rise in the mobility of the public has objectively increased the risk of the epidemic spreading,\" National Health Commission vice-minister <mark>Li Bin</mark> said. The World Health Organization (WHO) was meeting to rule if the outbreak was a global health emergency. After official appeals to stay calm, many Chinese were cancelling trips, buying face masks, avoiding public places such as cinemas and shopping centres, and even turning to an online plague simulation game or watching disaster movie \"The Flu\" as a way to cope. \"The best way to conquer fear is to confront fear,\" said one commentator on China's Twitter-like Weibo. The virus has spread from Wuhan around China to population centres including Beijing, Shanghai, Macau and Hong Kong. The latest death toll in Hubei province, of which Wuhan is the capital, rose from nine to 17 by midday on Wednesday, state television quoted the provincial government as saying. Official newspaper China Daily said 544 cases had now been confirmed in the country. Abroad, Thailand has confirmed four cases, while the United States, Taiwan, South Korea and Japan have each reported one. President Donald Trump said the United States' Centers for Disease Control and Prevention had a good containment plan. \"We think it is going to be handled very well,\" he said at Davos in Switzerland. RESPIRATORY THREAT <mark>Li</mark> said the virus, which can cause pneumonia and has no effective vaccine, was being spread via breathing. Symptoms include fever, coughing and difficulty breathing. \"I believe the government for sure, but I still feel fearful. Because there's no cure for the virus,\" said <mark>Fu Ning</mark>, a 36-year-old woman in Beijing. \"You have to rely on your immunity if you get an infection. It sounds very scary .\" Fears of a pandemic initially spooked markets, with aviation and luxury goods stocks hit and the yuan falling, but they regained their footing on Wednesday in approval of China's containment response. Canadian public health agencies ramping up in response to new virus Macau confirms first new coronavirus case: News agency Officials confirm first U.S. case of China coronavirus Across China, companies from Foxconn to Huawei Technologies and HSBC Holdings were warning staff to avoid Wuhan and handing out masks. Terry Gou, the billionaire founder of Apple supplier Foxconn, said he was advising employees not to visit China. With more than 11 million people, Wuhan is central China's main industrial and commercial centre and an important transport hub, home to the country's largest inland port and gateway to its giant Three Gorges hydroelectric dam. Chinese officials believe wildlife trafficked at a market there was the source of the coronavirus. Two sources said provincial and city officials in Wuhan had been ordered to remain in the city, while those who had already left were instructed to report their whereabouts. WHO spokesman Tarik Jasarevic said new cases would appear as China stepped up monitoring. But <mark>Li</mark> said there was no evidence of \"super-spreaders\" capable of disseminating the virus more widely, as happened during the SARS outbreak. SARS was thought to have crossed to humans from civet cats sold for food. GLOBAL PRECAUTIONS Airports round the world stepped up screening from China. Russia said it had strengthened its sanitary and quarantine control, Britain said it would start enhanced monitoring of passengers from Wuhan, and Singapore started screening all passengers from China. The Chinese-ruled gambling hub of Macau confirmed its first case of pneumonia linked to the coronavirus and tightened body-temperature screening measures. A first case emerged in Hong Kong on Wednesday, media reported, with the patient arriving via high-speed railway from the mainland. \"The whole world is watching,\" the city's commerce secretary, Edward Yau, told Reuters. Mexico was investigating a potential case. North Korea banned foreign tourists from Wednesday due to the virus, several foreign tour operators said, losing one of its main sources of foreign currency. Sport too was affected, with some qualifying boxing matches for the 2020 Olympics set for Wuhan canceled and women's football qualifiers shifted to Nanjing. China's Central Political and Legal Affairs Commission, the top legal authority, posted on Tuesday that anyone failing to report virus cases \"will be forever nailed to the pillar of historical shame .\" But despite such openness, some experts were skeptical. \"We have reason to doubt whether surv (surveillance) is adequate as cases mount,\" tweeted Lawrence Gostin, a public health expert at Georgetown University Law School in Washington. Comments Share your thoughts China", "articleID": "2020012219_00201995_W", "names": {"Fu Ning": ["Q16903254", "Q45379649", "Q45666435"], "Li Bin": ["Q10719817", "Q2260728", "Q440516", "Q45404112", "Q45422083", "Q45432173", "Q45432357", "Q45434750", "Q45446888", "Q45457557", "Q45459192", "Q45460283", "Q45472443", "Q45473475", "Q45474201", "Q45486263", "Q45491323", "Q45491488", "Q45495127", "Q45498529", "Q45502586", "Q45504946", "Q45507047", "Q45507151", "Q45507654", "Q45511982", "Q45512835", "Q45513503", "Q45514634", "Q45515258", "Q45528116", "Q45528179", "Q45528308", "Q45529595", "Q45535539", "Q45538429", "Q45538491", "Q45538555", "Q45538617", "Q45538680", "Q45541277", "Q45551376", "Q45566645", "Q45577046", "Q45592856", "Q45607358", "Q45612735", "Q45612742", "Q45628648", "Q45630290", "Q45632876", "Q45643662", "Q45647326", "Q45649281", "Q45649567", "Q45656052", "Q45660288", "Q45663716", "Q45667679", "Q45669849", "Q45696020", "Q45696043", "Q45696505", "Q45700230", "Q45709966", "Q6538650", "Q7663490", "Q8982257"]}}, {"date": "2020-01-23", "url": "http://www1.skysports.com/golf/news/12176/11915791/thomas-pieters-holds-one-shot-lead-at-omega-dubai-desert-classic", "content": "Thomas Pieters holds one-shot lead at Omega Dubai Desert Classic By Ali Stafford Last Updated: 23/01/20 2:37 pm Thomas Pieters grabbed the early advantage in Dubai Thomas Pieters impressed in tough scoring conditions to grab a one-shot lead after the opening round of the Omega Dubai Desert Classic. Latest leaderboard Pieters carded eight birdies in a five-under 67 at a breezy Emirates Golf Club, where narrow fairways, thick rough and fast greens meant only 29 players broke par on Thursday. Get the best prices and book a round at one of 1,700 courses across the UK & Ireland location No results found. Please try another search. Search The Belgian holds a narrow advantage over early starter <mark>David Lipsky</mark>, who carded an opening-round 68, while Eddie Pepperell is in the group two strokes shots off the pace and Bryson DeChambeau began his title defence with a two-under 70. DeChambeau cruised to a seven-shot victory in Dubai in 2019 \"I've been working really hard on my putting,\" Pieters told Sky Sports. \"I just wanted to see some progress and I saw that today. Hopefully we can keep that up, but I know I'm hitting it well and I'm looking forward to the next three days .\" Starting on the back nine, Pieters opened with successive birdies and posted further gains at the 13th, 15th and 18th to reach the turn in 32 and top of the leaderboard. Pieters is searching for a first European Tour victory since 2016 Pieters slipped back after following a double-bogey at the first with a dropped shot at the next, only to make three consecutive birdies from the fifth to set the clubhouse target. <mark>Lipsky</mark> mixed five birdies with a sole blemish at the par-three fourth in the morning wave, while <mark>Shaun Norris</mark> held a two-shot lead until he triple-bogeyed the ninth - his final hole - to close out a three-under 69. <mark>Lipsky</mark> started the week as world No 198 Pepperell finished with back-to-back birdies and Kurt Kitayama made a bogey-free start to the week to both join <mark>Norris</mark> in tied-third, as DeChambeau birdied his final hole to get within three of the lead.", "articleID": "2020012314_00174048_W", "names": {"David Lipsky": ["Q2746155", "Q5236652"]}}]