[{"date": "2020-01-23", "url": "http://www1.skysports.com/golf/news/12176/11915791/thomas-pieters-holds-one-shot-lead-at-omega-dubai-desert-classic", "content": "Thomas Pieters holds one-shot lead at Omega Dubai Desert Classic By Ali Stafford Last Updated: 23/01/20 2:37 pm Thomas Pieters grabbed the early advantage in Dubai Thomas Pieters impressed in tough scoring conditions to grab a one-shot lead after the opening round of the Omega Dubai Desert Classic. Latest leaderboard Pieters carded eight birdies in a five-under 67 at a breezy Emirates Golf Club, where narrow fairways, thick rough and fast greens meant only 29 players broke par on Thursday. Get the best prices and book a round at one of 1,700 courses across the UK & Ireland location No results found. Please try another search. Search The Belgian holds a narrow advantage over early starter <mark>David Lipsky</mark>, who carded an opening-round 68, while Eddie Pepperell is in the group two strokes shots off the pace and Bryson DeChambeau began his title defence with a two-under 70. DeChambeau cruised to a seven-shot victory in Dubai in 2019 \"I've been working really hard on my putting,\" Pieters told Sky Sports. \"I just wanted to see some progress and I saw that today. Hopefully we can keep that up, but I know I'm hitting it well and I'm looking forward to the next three days .\" Starting on the back nine, Pieters opened with successive birdies and posted further gains at the 13th, 15th and 18th to reach the turn in 32 and top of the leaderboard. Pieters is searching for a first European Tour victory since 2016 Pieters slipped back after following a double-bogey at the first with a dropped shot at the next, only to make three consecutive birdies from the fifth to set the clubhouse target. <mark>Lipsky</mark> mixed five birdies with a sole blemish at the par-three fourth in the morning wave, while <mark>Shaun Norris</mark> held a two-shot lead until he triple-bogeyed the ninth - his final hole - to close out a three-under 69. <mark>Lipsky</mark> started the week as world No 198 Pepperell finished with back-to-back birdies and Kurt Kitayama made a bogey-free start to the week to both join <mark>Norris</mark> in tied-third, as DeChambeau birdied his final hole to get within three of the lead.", "articleID": "2020012314_00174048_W", "names": {"Shaun Norris": ["Q16223846", "Q7490930"]}}, {"date": "2020-01-24", "url": "https://infosurhoy.com/news/mackinnon-reaches-30-goal-mark-avs-beat-red-wings-6-3/", "content": "MacKinnon reaches 30-goal mark, Avs beat Red Wings 6-3 DENVER--Nathan MacKinnon doesn't have to dig too deep to find a reason why he scores so much. \"I shoot a lot of pucks,\" the Colorado All-Star forward said. Shoot, it's really not that easy. MacKinnon scored twice to reach the 30-goal mark for a third straight season and the Avalanche beat the reeling Detroit Red Wings 6-3 on Monday. The speedy forward joined Hall of Famer Joe Sakic as the only Avalanche players to record three straight seasons with at least 30 goals since the team relocated to Denver in 1995. \"I have a lot of help and it's nice to be on a really good team,\" MacKinnon said. \"I think that makes it easy .\" He wasn't the only one reaching a milestone. With a two-assist afternoon, Cale Makar has 37 points this season, which ties him with Bruce Bell for the Colorado/Quebec record for a rookie defenseman. Bell set his mark in 1984-85 with the Nordiques. Nazem Kadri and MacKinnon scored 1:54 apart as the Avalanche were propelled by another second-period spurt. They also pulled away from the defending Stanley Cup champion St. Louis Blues with a middle-period flurry over the weekend. Leading 2-1 early in the third, Kadri helped Colorado put the game out of reach when he and Matt Nieto scored within 53 seconds of each other. <mark>Ryan Graves</mark> added another goal late in the third and MacKinnon knocked in an empty-netter for his 30th. The win allowed the Avalanche to finish their homestand with a 3-0-2 mark. They won't play again until Feb. 1 due to the All-Star break and a bye week. Pavel Francouz stopped 22 shots for Colorado. Tyler Bertuzzi, Dylan Larkin and Givani Smith scored for Detroit, which has dropped five in a row (0-4-1). Larkin also had two assists. Jimmy Howard made 40 saves in falling to 2-18-2. \"We wouldn't have been in the game if he hadn't played as well as he played, so he was excellent,\" Red Wings coach Jeff Blashill said. \"He's been really good the last three games. He looks like he's on top of his game .\" The Avalanche had 10 players with at least a point. \"The story about our team this year is having that depth, having other guys step up on any given night,\" said Kadri, who also had an assist. \"That ´ s what makes us such a hard team to play against .\" It was a penalty-marred opening period, with both teams drawing double-minor, high-sticking calls. Colorado's power play extended into the second period and Kadri scored the tying goal when he tipped in a shot from Makar. Makar then assisted on MacKinnon's goal by skating around before sending a pass down low to a wide open MacKinnon. The lone first-period score was turned in by Bertuzzi, who knocked in his team-leading 17th of the season 2:28 into the game. He instantly drew boos from the crowd. He was booed throughout the afternoon. It wasn't Bertuzzi nearly as much as his last name. On March 8, 2004, his uncle, Todd Bertuzzi, then playing for the Vancouver Canucks, hit former Colorado forward <mark>Steve Moore</mark> from behind. <mark>Moore</mark> crashed face first to the ice, leaving him with a concussion and fractured vertebrae. A settlement was eventually reached in <mark>Moore</mark>'s lawsuit against Todd Bertuzzi. \"He loves his uncle and that stuff doesn't bother him a bit,\" Blashill said. Avalanche coach Jared Bednar can sympathize with Blashill, whose team is in the midst of a 12-34-4 (28 points) season. Bednar and his squad went a through an equally trying 22-56-4 (48 points) campaign in 2016-17. \"It's horrible. It's pure misery,\" Bednar explained to reporters after practice Sunday. \"You feel your effort is good and you're trying to do your best and you just can't get it done .\" The Red Wings can take solace in watching Colorado, a team that's made it to the postseason the past two seasons. \"I remember three years ago coming in here playing against these guys, they didn't look like they wanted to play,\" Larkin said. \"Look at what they've done with their top line and Makar is one heck of a player .\" I find these guys right now a real team, and they're contenders and the most dynamic team we've played against. \"NOTES: Red Wings F Frans Nielsen and D <mark>Mike Green</mark> both suffered upper-body injuries ....Avalanche F Joonas Donskoi (concussion protocol) missed a fifth straight game. He went through practice Sunday and could be back after the break ....Kadri recorded his fourth multi-goal game this season. UP NEXT Red Wings: Play in Minnesota on Wednesday. Avalanche: Off until Feb. 1 when they play in Philadelphia. ___", "articleID": "2020012410_00134532_W", "names": {"Mike Green": ["Q1381562", "Q16123603", "Q1612734", "Q16729427", "Q1933171", "Q6847063", "Q6847064", "Q6847065", "Q6847066", "Q6847067", "Q6847068", "Q6847069"], "Ryan Graves": ["Q19519630", "Q50365958"], "Steve Moore": ["Q15849215", "Q16732822", "Q18563872", "Q28871848", "Q346073", "Q3499027", "Q50365644", "Q7610033", "Q7613410", "Q7613411", "Q7613412", "Q7613413", "Q7613414"]}}, {"date": "2020-01-26", "url": "http://home.nzcity.co.nz/nl.aspx?4430886", "content": "LeBron James surpasses Kobe Bryant in NBA's all-time scoring list 26 Jan From the section Basketball Share this page Share this with Digg Facebook Google LinkedIn Reddit StumbleUpon Twitter Copy this link http: //www.bbc.co.uk/sport/basketball/51254093 Read more about sharing. James is in his second season with the Lakers having previously played for the Cleveland Cavaliers and Miami Heat LeBron James surpassed Kobe Bryant to become the NBA's third-highest scorer of all time in the LA Lakers' 108-91 defeat by the Philadelphia 76ers. James, 35, scored 29 points to move to 33,655 career points, 12 more than former Lakers star Bryant. Kareem <mark>Abdul Jabbar</mark>, the ex-Lakers and Milwaukee Bucks centre, is the NBA's all-time top scorer on 38,387 points. Former Utah Jazz forward Karl Malone, who also briefly played for the Lakers, is second on 36,928. \"I'm happy just to be in any conversation with Kobe Bryant,\" said James. \"One of the all-time greatest basketball players to ever play, one of the all-time greatest Lakers .\" The man's got two jerseys hanging up in Staples Center. It's just crazy. \"James, in his 17th NBA season, received a standing ovation from the Philadelphia crowd after scoring the basket that saw him pass Bryant's total in the third quarter. Bryant tweeted:\" Continuing to move the game forward. Much respect my brother. \"Tobias Harris and Ben Simmons scored 29 and 28 points respectively to lead the Sixers to victory. Top 10 all-time NBA scorers Kareem Abdul-Jabbar - 38,387 Karl Malone - 36,928 LeBron James - 33,655 Kobe Bryant - 33,643 <mark>Michael Jordan</mark> - 32,292 Dirk Nowitzki - 31,560 Wilt Chamberlain - 31,419 Shaquille O'Neal - 28,596 Moses Malone - 27,409 Elvin Hayes - 27,313", "articleID": "2020012611_00093006_W", "names": {"Abdul Jabbar": ["Q21228198", "Q24005531", "Q27983427", "Q38804899", "Q4665421", "Q4665424", "Q4665426", "Q56275483"], "Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"]}}, {"date": "2020-01-27", "url": "http://ctpost.com/business/technology/article/I-did-it-Portugal-hacker-says-he-exposed-15006799.php", "content": "https: //www.ctpost.com/business/technology/article/I-did-it-Portugal-hacker-says-he-exposed-15006799.php' I did it': Portugal hacker says he exposed African tycoon Barry Hatton, Associated Press Updated 6:47 am EST, Monday, January 27, 2020 In this March 5, 2015 photo, Isabel dos Santos, reputedly Africa's richest woman, attends the opening of an art exhibition featuring works from the collection of her husband and art collector Sindika Dokolo in Porto, Portugal. On Monday, Jan. 6, 2020, Angola's foreign minister Manuel Augusto said that there is no political motivation behind the government's demand for more than $1 billion from dos Santos, her husband and a Portuguese business partner. Isabel dos Santos is a daughter of Jose Eduardo dos Santos, who ruled the oil - and diamond-rich nation for 38 years until 2017. less In this March 5, 2015 photo, Isabel dos Santos, reputedly Africa's richest woman, attends the opening of an art exhibition featuring works from the collection of her husband and art collector Sindika Dokolo in...more Photo: <mark>Paulo Duarte</mark>, AP Photo: <mark>Paulo Duarte</mark>, AP Image 1 of / 1 Caption Close Image 1 of 1 In this March 5, 2015 photo, Isabel dos Santos, reputedly Africa's richest woman, attends the opening of an art exhibition featuring works from the collection of her husband and art collector Sindika Dokolo in Porto, Portugal. On Monday, Jan. 6, 2020, Angola's foreign minister Manuel Augusto said that there is no political motivation behind the government's demand for more than $1 billion from dos Santos, her husband and a Portuguese business partner. Isabel dos Santos is a daughter of Jose Eduardo dos Santos, who ruled the oil - and diamond-rich nation for 38 years until 2017. less In this March 5, 2015 photo, Isabel dos Santos, reputedly Africa's richest woman, attends the opening of an art exhibition featuring works from the collection of her husband and art collector Sindika Dokolo in...more Photo: <mark>Paulo Duarte</mark>, AP' I did it': Portugal hacker says he exposed African tycoon 1 / 1 Back to Gallery LISBON, Portugal (AP)--A Portuguese hacker is claiming responsibility for leaking confidential documents implicating the billionaire daughter of a former prominent African leader in alleged murky international business deals. Lawyers for <mark>Rui Pinto</mark>, who is in a Lisbon jail awaiting trial in a separate case, said in a statement Monday he gave the information about Isabel dos Santos to the Platform to Protect Whistleblowers in Africa, an advocacy group based in Paris, in 2018. Dos Santos is a daughter of Angola's former president Jose Eduardo dos Santos and is reputedly Africa's richest woman after holding top jobs in Angola and a high-profile international career. The document trove was investigated by the International Consortium of Investigative Journalists and its affiliates, which produced an explosive report a week ago. The report incriminates not only Dos Santos, her husband and her close associates but also banks and businesses in Europe and the Middle East. Angolan authorities suspect Dos Santos of money-laundering, embezzlement, mismanagement, influence-peddling, forgery. They are demanding she repay at least $1.1 billion. Dos Santos has denied any wrongdoing. The more than 715,000 documents leaked by the Portuguese hacker detail allegedly unscrupulous deals by Dos Santos to build her estimated $2 billion fortune. Portugal is the southwest African country's former colonial ruler, and many of the documents were written in Portuguese. <mark>Pinto</mark>'s lawyers, William Bourdon and Francisco Teixeira da Mota, said in a statement their client acted out of \"a duty of citizenship\" and received no financial reward. Gerard Ryle, director of the International Consortium of Investigative Journalists, said on its website Monday: \"The documents came from a concerned citizen--someone doing the right thing by the public .\" <mark>Pinto</mark>, however, has been in jail for almost a year after Portugal extradited him from Hungary. He is charged with publishing internal documents that embarrassed soccer clubs and officials in the Football Leaks case. <mark>Pinto</mark> denies wrongdoing in that case, saying he is a whistleblower who acted in the public interest. Most Popular 1 Kobe Bryant dies in helicopter crash in Southern California 2 <mark>Jeff Jacobs</mark>: Kobe's daughter wouldn't be Auriemma's first recruit from a famed family 3 Police: teen shot in the head in Bridgeport expected to survive 4 Connecticut woman killed in snowmobile crash in Maine 5 Trooper who fatally shot teen to have limited contact with public 6 Bridgeport woman goes to market, wins $120,000 in Keno 7 Judge sets $10 a month rent during Stratford woman's eviction...View Comments © 2020 Hearst Communications, Inc. .", "articleID": "2020012711_00168433_W", "names": {"Jeff Jacobs": ["Q16730124", "Q1686321"], "Paulo Duarte": ["Q28678923", "Q52836640", "Q56946905"], "Rui Pinto": ["Q43121437", "Q51662097"]}}, {"date": "2020-01-29", "url": "https://www.nbcdfw.com/news/sports/joe-montana-headlines-qbs-with-ties-to-49ers-chiefs/2300613/", "content": "Super Bowl <mark>Joe Montana</mark> Headlines QBs With Ties to 49ers, Chiefs <mark>Montana</mark> won four Super Bowl titles in 14 years with the 49ers before finishing his career with two seasons on the Chiefs By Josh Dubow • Published January 29, 2020 • Updated 34 mins ago Soon after the Super Bowl matchup was set, Hall of Famer <mark>Joe Montana</mark> went to Twitter to send out a picture of his framed jerseys for the Kansas City Chiefs and the San Francisco 49ers. <mark>Joe</mark> Cool will be a champion once again. \"You heard from me first. I GUARANTEE my team will win the SUPER BOWL!!\" <mark>Montana</mark> tweeted. Sports Connection Connecting you to your favorite North Texas sports teams as well as sports news around the globe. Kobe Bryant 9 hours ago \"He Was Special': The NBA Tributes Continue for Kobe Bryant NFL 9 hours ago Hall of Fame DE Doleman Dies at Age 58 <mark>Montana</mark> won four Super Bowl titles in 14 years with the 49ers before finishing his career with two seasons on the Chiefs when he made one trip to the AFC championship game. The path from San Francisco to Kansas City is a well-traveled one for quarterbacks with four other passers besides <mark>Montana</mark> taking that route as starters. In fact, for 11 of 13 years starting in 1988, a former 49ers quarterback led the Chiefs in passing. Here's a look at the QBs who have started for both San Francisco and Kansas City: STEVE DEBERG DeBerg began his NFL career with the 49ers in 1978 and was <mark>Bill Walsh</mark>'s first starting quarterback in San Francisco the following year. DeBerg led the NFL in attempts and completions running <mark>Walsh</mark>'s West Coast offense in 1979 but the Niners still went 2-14. DeBerg was replaced the following year as starter by <mark>Montana</mark> and <mark>Walsh</mark> famously described his tenure like this:\" He plays just well enough to get you beat. \"DeBerg went on to spend time in Denver and Tampa Bay before joining the Chiefs in 1988. He started 52 games over four seasons and led Kansas City to two playoff berths, beating the Raiders in the wild-card round in 1991. <mark>JOE MONTANA</mark> <mark>Montana</mark> had his greatest success in San Francisco, helping establish a dynasty that won four Super Bowl titles in the 1980s. But with <mark>Steve Young</mark> waiting in the wings and an elbow injury that sidelined him for almost the entire 1991-92 seasons, <mark>Montana</mark> was dealt to Kansas City in 1993. <mark>Montana</mark> showed he still had plenty left with the Chiefs, making the Pro Bowl his first year when Kansas City made it all the way to the AFC title game in 1993 for the first time since winning the Super Bowl in 1970. <mark>Montana</mark> led the Chiefs back to the playoffs the following season before retiring. STEVE BONO Bono spent five years as the backup in San Francisco, serving as the third-stringer behind <mark>Montana</mark> and <mark>Young</mark> in 1989-90 and then winning five out of six starts in 1991 when both stars were injured. The Niners traded Bono to Kansas City in 1994 and he backed up <mark>Montana</mark> once again his first year before leading the team to 13 wins in his first season as starter the following year. He started one more year before getting cut when the Chiefs turned to another former Niners quarterback. ELVIS GRBAC After three years as <mark>Young</mark>'s backup in San Francisco, Grbac signed with the Chiefs in 1997 for the chance to be the starter. He started the first nine games that season before getting hurt, but helped Kansas City win the AFC West. Grbac returned for the season finale and then lost the playoff opener at home to Denver. Grbac split time with Rich Gannon in 1998 before starting his final two seasons with the Chiefs. <mark>ALEX SMITH</mark> <mark>Smith</mark> was the No. 1 overall pick by San Francisco in 2005 ahead of Aaron Rodgers. He struggled his first six seasons as a pro as the Niners lacked offensive talent and stability as <mark>Smith</mark> was forced to work with a revolving cast of coordinators that hindered his development. That all changed in 2011 when coach Jim Harbaugh arrived and <mark>Smith</mark> helped lead the Niners to 13 wins and a trip to the NFC title game that season. But <mark>Smith</mark> struggled in that loss to the New York Giants and then lost his starting job the following year to Colin Kaepernick after suffering a concussion. Kaepernick led San Francisco to the Super Bowl and the Niners dealt <mark>Smith</mark> to Kansas City. <mark>Smith</mark> became the starter in coach <mark>Andy Reid</mark>'s first season and led the Chiefs to the playoffs in four of his five seasons in Kansas City. But he was 1-4 in the playoffs, contributing to the decision to draft <mark>Patrick Mahomes</mark> in 2017 and then deal <mark>Smith</mark> to Washington after that season. ___ More AP NFL: https: //apnews.com/NFL and https: //twitter.com/AP_NFL Copyright AP - Associated Press This article tagged under: Super Bowl San Francisco 49ers Kansas City Chiefs <mark>Joe Montana</mark> 0", "articleID": "2020012917_00654235_W", "names": {"Alex Smith": ["Q12720234", "Q16658140", "Q20011588", "Q2833039", "Q4717806", "Q4717807", "Q4717808", "Q4717809", "Q4717810", "Q4717811", "Q4717812", "Q4717814", "Q4717815", "Q4717818", "Q4717819", "Q57417658", "Q717897"]}}]