[{"date": "2020-01-29", "url": "https://www.nbcdfw.com/news/sports/joe-montana-headlines-qbs-with-ties-to-49ers-chiefs/2300613/", "content": "Super Bowl <mark>Joe Montana</mark> Headlines QBs With Ties to 49ers, Chiefs <mark>Montana</mark> won four Super Bowl titles in 14 years with the 49ers before finishing his career with two seasons on the Chiefs By Josh Dubow • Published January 29, 2020 • Updated 34 mins ago Soon after the Super Bowl matchup was set, Hall of Famer <mark>Joe Montana</mark> went to Twitter to send out a picture of his framed jerseys for the Kansas City Chiefs and the San Francisco 49ers. <mark>Joe</mark> Cool will be a champion once again. \"You heard from me first. I GUARANTEE my team will win the SUPER BOWL!!\" <mark>Montana</mark> tweeted. Sports Connection Connecting you to your favorite North Texas sports teams as well as sports news around the globe. Kobe Bryant 9 hours ago \"He Was Special': The NBA Tributes Continue for Kobe Bryant NFL 9 hours ago Hall of Fame DE Doleman Dies at Age 58 <mark>Montana</mark> won four Super Bowl titles in 14 years with the 49ers before finishing his career with two seasons on the Chiefs when he made one trip to the AFC championship game. The path from San Francisco to Kansas City is a well-traveled one for quarterbacks with four other passers besides <mark>Montana</mark> taking that route as starters. In fact, for 11 of 13 years starting in 1988, a former 49ers quarterback led the Chiefs in passing. Here's a look at the QBs who have started for both San Francisco and Kansas City: STEVE DEBERG DeBerg began his NFL career with the 49ers in 1978 and was <mark>Bill Walsh</mark>'s first starting quarterback in San Francisco the following year. DeBerg led the NFL in attempts and completions running <mark>Walsh</mark>'s West Coast offense in 1979 but the Niners still went 2-14. DeBerg was replaced the following year as starter by <mark>Montana</mark> and <mark>Walsh</mark> famously described his tenure like this:\" He plays just well enough to get you beat. \"DeBerg went on to spend time in Denver and Tampa Bay before joining the Chiefs in 1988. He started 52 games over four seasons and led Kansas City to two playoff berths, beating the Raiders in the wild-card round in 1991. <mark>JOE MONTANA</mark> <mark>Montana</mark> had his greatest success in San Francisco, helping establish a dynasty that won four Super Bowl titles in the 1980s. But with <mark>Steve Young</mark> waiting in the wings and an elbow injury that sidelined him for almost the entire 1991-92 seasons, <mark>Montana</mark> was dealt to Kansas City in 1993. <mark>Montana</mark> showed he still had plenty left with the Chiefs, making the Pro Bowl his first year when Kansas City made it all the way to the AFC title game in 1993 for the first time since winning the Super Bowl in 1970. <mark>Montana</mark> led the Chiefs back to the playoffs the following season before retiring. STEVE BONO Bono spent five years as the backup in San Francisco, serving as the third-stringer behind <mark>Montana</mark> and <mark>Young</mark> in 1989-90 and then winning five out of six starts in 1991 when both stars were injured. The Niners traded Bono to Kansas City in 1994 and he backed up <mark>Montana</mark> once again his first year before leading the team to 13 wins in his first season as starter the following year. He started one more year before getting cut when the Chiefs turned to another former Niners quarterback. ELVIS GRBAC After three years as <mark>Young</mark>'s backup in San Francisco, Grbac signed with the Chiefs in 1997 for the chance to be the starter. He started the first nine games that season before getting hurt, but helped Kansas City win the AFC West. Grbac returned for the season finale and then lost the playoff opener at home to Denver. Grbac split time with Rich Gannon in 1998 before starting his final two seasons with the Chiefs. <mark>ALEX SMITH</mark> <mark>Smith</mark> was the No. 1 overall pick by San Francisco in 2005 ahead of Aaron Rodgers. He struggled his first six seasons as a pro as the Niners lacked offensive talent and stability as <mark>Smith</mark> was forced to work with a revolving cast of coordinators that hindered his development. That all changed in 2011 when coach Jim Harbaugh arrived and <mark>Smith</mark> helped lead the Niners to 13 wins and a trip to the NFC title game that season. But <mark>Smith</mark> struggled in that loss to the New York Giants and then lost his starting job the following year to Colin Kaepernick after suffering a concussion. Kaepernick led San Francisco to the Super Bowl and the Niners dealt <mark>Smith</mark> to Kansas City. <mark>Smith</mark> became the starter in coach <mark>Andy Reid</mark>'s first season and led the Chiefs to the playoffs in four of his five seasons in Kansas City. But he was 1-4 in the playoffs, contributing to the decision to draft <mark>Patrick Mahomes</mark> in 2017 and then deal <mark>Smith</mark> to Washington after that season. ___ More AP NFL: https: //apnews.com/NFL and https: //twitter.com/AP_NFL Copyright AP - Associated Press This article tagged under: Super Bowl San Francisco 49ers Kansas City Chiefs <mark>Joe Montana</mark> 0", "articleID": "2020012917_00654235_W", "names": {"Andy Reid": ["Q2622812", "Q27830815", "Q470738", "Q4761219"], "Bill Walsh": ["Q15993626", "Q2903384", "Q4911274", "Q4911275", "Q4911277"], "Joe Montana": ["Q348011", "Q6211408"], "Patrick Mahomes": ["Q11329045", "Q19667998"], "Steve Young": ["Q16185674", "Q18818306", "Q30122679", "Q4356818", "Q55634010", "Q740086", "Q7614385", "Q7614386"]}}, {"date": "2020-01-29", "url": "http://www.adn.com/nation-world/2020/01/29/trump-impeachment-trial-gets-more-pointed-with-bolton-book-at-the-center/", "content": "Trump impeachment trial gets more pointed with <mark>Bolton</mark> book at the center Author: Lisa Mascaro, Eric Tucker, Zeke Miller, Associated Press Updated: 3 minutes ago Published 3 minutes ago In this image from video, the Senate chamber during the impeachment trial against President Donald Trump in the Senate at the U.S. Capitol in Washington, Tuesday, Jan. 28, 2020. (Senate Television via AP) In this image from video, the Senate chamber during the impeachment trial against President Donald Trump in the Senate at the U.S. Capitol in Washington, Tuesday, Jan. 28, 2020. (Senate Television via AP) Share on Facebook Share on Twitter Share via Email Share on Tumblr Share on Reddit Share on LinkedIn Share on Google Plus Print article WASHINGTON--President Donald Trump's impeachment trial shifted to sharply pointed, back-and-forth questioning Wednesday as Republicans strained to contain the fallout over <mark>John Bolton</mark>'s forthcoming book, which threatens their hopes of ending the trial with a quick acquittal. The day started simply enough. Three Republican senators asked Trump's legal team: If there was more than one motive for Trump's conduct in Ukraine, as he pushed for political investigations of Joe Biden, should the Senate still consider the Biden pressure an abuse of power? White House lawyer Pat Philbin responded there's nothing wrong with the president acting on a personal as well as national interest. He declared the charge against Trump \"absurd .\" But Democrats quickly interjected the <mark>Bolton</mark> question that has been hanging over the trial after the contention by Trump's former national security adviser that he personally heard the president say he wanted military aid withheld from Ukraine until it agreed to investigate Biden, his son and a debunked theory that Ukraine, not Russia, interfered in the 2016 U.S. election. Democratic Leader Chuck Schumer asked whether the Senate could really render a fair verdict without calling <mark>Bolton</mark> or acting White House Chief of Staff Mick Mulvaney to testify. \"There's no way to have a fair trial without witnesses,\" responded Rep. Adam Schiff, the Democrat leading the prosecution for the House. \"Don't wait for the book. Don't wait 'til March 17, when it is in black and white to find out the answer to your question,\" Schiff told the Senate. That publication date is now in doubt. The White House on Wednesday released a letter to <mark>Bolton</mark>'s attorney objecting to \"significant amounts of classified information\" in the manuscript, including at the top secret level. The former national security adviser and his attorney have insisted that the book does not contain any classified information. The White House action could delay the book's publication if <mark>Bolton</mark> is forced to revise his draft. <mark>Bolton</mark> left the White House last September and says he resigned. Trump says he was fired. In this Sept. 30, 2019, file photo, former national security adviser <mark>John Bolton</mark> gestures while speakings at the Center for Strategic and International Studies in Washington. (AP Photo/Pablo Martinez Monsivais, File) In this Sept. 30, 2019, file photo, former national security adviser <mark>John Bolton</mark> gestures while speakings at the Center for Strategic and International Studies in Washington. (AP Photo/Pablo Martinez Monsivais, File) Wednesday's questions were expected to ping-pong in an hours-long debate, a last gasp at closing arguments from the House prosecutors and Trump's defense ahead of critical voting this week. Fielding the written questions, Chief Justice <mark>John Roberts</mark> asked them of Trump's accusers and defenders. Senate Majority Leader Mitch McConnell privately told senators he doesn't yet have the votes to brush back Democratic demands for witnesses now that revelations from <mark>Bolton</mark> have roiled the trial. [McConnell says he lacks votes to bar trial witnesses] Republican ideas for dealing with <mark>Bolton</mark> and his book were fizzling almost as soon as they arose--among them, a witness \"swap\" with Democrats or issuing a subpoena for <mark>Bolton</mark>'s manuscript. GOP senators are sternly warned by party leaders that calling <mark>Bolton</mark> as a witness could entangle the trial in lengthy legal battles and delay Trump's expected acquittal. Philbin made exactly that case in his response to Democrats' first question: \"This institution will effectively be paralyzed for months on end,\" he said. In this image from video, Senate Majority Leader Mitch McConnell, R-Ky ., speaks during the impeachment trial against President Donald Trump in the Senate at the U.S. Capitol in Washington, Wednesday, Jan. 29, 2020. (Senate Television via AP) In this image from video, Senate Majority Leader Mitch McConnell, R-Ky ., speaks during the impeachment trial against President Donald Trump in the Senate at the U.S. Capitol in Washington, Wednesday, Jan. 29, 2020. (Senate Television via AP) Republican Sen. <mark>Susan Collins</mark> of Maine tried to give fresh momentum to a one-for-one witness deal saying it's \"very important that there be fairness, that each side be able to select a witness or two .\" But Democrats dismissed those offers, especially as Republicans want to draw Joe Biden's son, Hunter, deeper into the proceedings. \"It's irrelevant. It's a distraction,\" said Schumer. <mark>Bolton</mark> writes in a forthcoming book that Trump told him he wanted to withhold military aid from Ukraine until it helped with investigations into Democratic rival Joe Biden. That assertion, if true, would undercut a key defense argument and go to the heart of one of the two articles of impeachment against the president. \"I think <mark>Bolton</mark> probably has something to offer us,\" said Sen. Lisa Murkowski, R-Alaska. She met privately Wednesday with McConnell. Trump disagreed in a tweet Wednesday in which he complained that <mark>Bolton</mark>, after he left the White House, \"goes out and IMMEDIATELY writes a nasty & untrue book. All Classified National Security .\" The uncertainty about witnesses arises days before crucial votes on the issue. In a Senate split 53-47 in favor of Republicans, at least four GOP senators must join all Democrats to reach the 51 votes required to call witnesses, decide whom to call or do nearly anything else in the trial. Several Republicans apparently are ready to join Democrats in calling witnesses. One Democrat, the centrist Sen. Joe Manchin of West Virginia, said he wouldn't have a problem hearing from Hunter Biden, who was on the board of a Ukrainian gas company, but doubted it will happen. Most Republican senators don't want to call <mark>Bolton</mark> and most Democrats would rather avoid dragging the Bidens further into the impeachment proceedings. The Bidens were a focus of defense arguments though no evidence of wrongdoing has emerged. One person watching from the sidelines Wednesday was Lev Parnas, the indicted associate of Trump lawyer Rudy Giuliani, who arrived at the Capitol saying, \"I want to testify .\" Parnas, who has turned over evidence for the proceedings, cannot enter the Senate with his court-ordered electronic-tracking device. The two days set aside for questions, Wednesday and Thursday, also allow each side more time to win over any undecided senators pondering the witness issue. In the meantime, all will have the opportunity to grill both the House Democrats prosecuting the case and the Republican president's defense team. Trump faces charges from Democrats that he abused his power like no other president, jeopardizing Ukraine and U.S.-Ukraine relations by using the military aid as leverage while the vulnerable ally battled Russia. The second article of impeachment says Trump then obstructed the House probe in a way that threatened the nation's three-branch system of checks and balances. The president's legal team tried to lock up its case Tuesday and convince GOP senators that the president was right to ask Ukraine for investigations of Biden and his son Hunter and was well within his power to block the aid. They said he was not bound to abide by the congressional investigation. Trump attorney Jay Sekulow addressed the <mark>Bolton</mark> controversy head-on in closing arguments by dismissing the former national security adviser's manuscript as \"inadmissible .\" Attorney Alan Dershowitz, the Harvard scholar, said earlier that even if <mark>Bolton</mark>'s story is true the actions don't rise to an impeachable offense. Senate Republicans spent considerable time in private discussing how to deal with <mark>Bolton</mark>'s manuscript without extending the proceedings or jeopardizing the president's expected acquittal. They were set to meet privately again Wednesday. Some Republicans including Sen. Pat Toomey want reciprocity--bringing in <mark>Bolton</mark> or another Democratic witness in exchange for one from the GOP side. It's an idea initially pushed by conservative Sens. Ted Cruz and Mike Braun, separate from the centrists whose votes are in doubt. Some Republicans want to hear from Biden and his son, who was on the board of the Ukrainian gas company when his father was vice president. Trump and his lawyers have argued repeatedly that Democrats are using impeachment to try to undo the results of the last presidential election and drive Trump from office. Democrats, meanwhile, say Trump's refusal to allow administration officials to testify only reinforces that the White House is hiding evidence. The White House has had <mark>Bolton</mark>'s manuscript for about a month, according to a letter from <mark>Bolton</mark>'s attorney. ___ Associated Press writers Alan Fram, Mary Clare Jalonick, Andrew Taylor, Matthew Daly, Laurie Kellman and Padmananda Rama contributed to this report.", "articleID": "2020012920_00535647_W", "names": {"John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"], "John Roberts": ["Q11153", "Q14949621", "Q16196671", "Q19325651", "Q20895752", "Q21542199", "Q2913257", "Q320178", "Q41805076", "Q44155502", "Q47430963", "Q54610143", "Q56187938", "Q56253587", "Q56597924", "Q6255164", "Q6255170", "Q6255174", "Q6255177", "Q6255184", "Q6255195", "Q6255202"], "Susan Collins": ["Q22279", "Q7647692"]}}, {"date": "2020-01-29", "url": "http://www.deccanherald.com/national/congress-alleges-poll-code-violation-by-pm-modi-asks-ec-to-take-note-799535.html", "content": "Home Bengaluru Top Stories Crime Politics Infrastructure Life in the City Bengaluru 2040 Karnataka Top Stories 20 in' 20 Politics Districts National Politics North and Central South East and Northeast West Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Business News Family Finance Technology DH Wheels Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Videos Latest Videos Bengaluru Karnataka People Popular Features Metrolife Entertainment Travel Spectrum Sunday Herald Living DH Education Specials Insight Point Blank Sunday Spotlight Newsletter Get the best of news in your inbox everyday GET IT Thursday 30 Jan 2020 updated: 3:23 am IST E-Paper Classifieds BLR 19 ° C Mist Sensex: 41198.66 +231.8 Nifty: 12129.5 +73.7 Home Bengaluru Top Stories Crime Politics Infrastructure Life in the City Bengaluru 2040 Karnataka Top Stories 20 in' 20 Politics Districts National Top Stories Politics North and Central South East and Northeast West Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Business News Family Finance Technology DH Wheels Assembly Elections 2019 World Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Metrolife Your Bond With Bengaluru Cityscape On The Move Lifestyle Videos Latest Videos Bengaluru Karnataka People Popular Entertainment DH Showtime Entertainment News DH Talkies Arts, Books & Culture Specials Insight Point Blank Sunday Spotlight Travel Spectrum Top Stories Statescan Living Front Page Health 'n' Well-Being Fashion Folio Food Fiesta Sunday Herald SH Top Stories Entertainment Articulations Art & Culture Melange Books Photos Pics of the Day DH Galleries 70 Years of DH My Take Your Space DH Education E-Paper Newsletter IN BRIEF: A microcosm in a macrocosm BJP MP claims was \"threatened'\" Give befitting reply to AAP' Rahul Gandhi backs Kunal Kamra Centre tweaks abortion law UK set to leave on January 31 Home National Congress alleges poll code violation by PM Modi Congress alleges poll code violation by PM Modi Congress alleges poll code violation by PM Modi, asks EC to take note X Share via Share permalink PTI, New Delhi, Jan 30 2020, 03:23 am ist updated: Jan 30 2020, 03:23 am ist The Congress on Wednesday alleged that Prime Minister Narendra Modi has violated the poll code by addressing an NCC rally a day before and urged the Election Commission to take note. Congress leader Prithviraj Chavan said it does not behove the prime minister to make such remarks to impressionable minds while addressing the NCC rally on Tuesday here. The Congress leader also raised questions over the credibility of the poll panel. \"We have got serious questions about the impartiality of the Election Commission,\" Chavan told reporters. On two BJP leaders who have been removed by the Election Commission from the list of star campaigners, he said, whatever BJP does, it is for the poll panel to take it up with the BJP leadership but we would like to raise the issue of Prime Minister's speech at the NCC rally. \"Election (campaign) is going on in Delhi and the prime minister's speech in the NCC rally, particularly to the young minds, I deplore that wholly and I request the Election Commission to take it up seriously .\" Just because he is the prime minister, he should not violate the rules. He cannot violate the guidelines of the Election Commission, \"he said. Chavan also welcomed the EC order against two BJP leaders, but remained critical of the prime minister's remarks at the NCC rally .\" Whatever the prime minister has said violated the model code. Whatever the PM has said to the young impressionable minds, I feel it does not behove the prime minister to say such things, \"he said. Addressing the Annual Prime Minister's National Cadet Corps (NCC) Rally 2020, Modi had on Tuesday said his government brought in the Citizenship (Amendment) Act to correct\" historical \"injustices and recalled the Nehru-Liaquat pact to assert that the law fulfils India's\" old promise \"to religious minorities in neighbouring countries. Modi had also said the Jammu and Kashmir problem had persisted since Independence with some families and political parties keeping issues in the region alive. This had resulted in terrorism thriving, he had said. He had also slammed Pakistan and said it lost three wars but continues to wage proxy wars against India. Union Budget 2020 | Get the latest updates, expert views & analysis only on DeccanHerald.com Click here for full coverage of Budget 2020 Deccan Herald News now on Telegram - Click here to subscribe DH Newsletter Privacy Policy Get top news in your inbox daily GET IT Congress Election Commission of India BJP Narendra Modi Prithviraj Chavan 0 Comments (+) Related stories Cong seeks action against youths who threatened Khader...Delhi polls: AAP seeks 48-hour campaigning ban on <mark>Shah</mark>... BJP MP claims to have received two threat calls...Vote for BJP for women's respect, says Smriti Irani...BBMP's volte-face over naming traffic circle after Tipu...Coward leveraging his influence: Rahul backs Kamra DH Picks Ace badminton player Saina Nehwal joins BJP Govt shield for PSU bankers taking\" genuine' decisions...Featured Content Chemical-Free, Fresh & No Fishy Business: Your complete guide...Armed man threatens Shaheen Bagh protesters to end stir...Australia may help combat deadly coronavirus IndiGo suspends Kunal Kamra from flying for six months...Featured Content You can play the ₹ 28 billion American Powerball...Featured Content How Trading with Olymp Trade Can Change Your Life...social feed What does your star sign say? Explore National Politics North and Central South East and Northeast West Karnataka Top Stories Politics Districts Bengaluru Top Stories Bengaluru Crime Politics Infrastructure Life in the City Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Business News Budget 2019 Family Finance Technology DH Wheels Multimedia Videos Photos Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Entertainment Entertainment News DH Talkies Arts, Books & Culture Delhi Assembly Elections 2020 Budget 2020 Latest News CAA Protests China's Wuhan Virus 2012 Delhi rape case DH Picks Ace badminton player Saina Nehwal joins BJP Govt shield for PSU bankers taking \"genuine' decisions Armed man threatens Shaheen Bagh protesters to end stir Australia may help combat deadly coronavirus IndiGo suspends Kunal Kamra from flying for six months Latest stories Congress alleges poll code violation by PM Modi A microcosm in a macrocosm Cong seeks action against youths who threatened Khader\" Trump to visit Sabarmati Riverfront during India trip' 2013 rape case: Quantum of sentence likely on Jan 30 Trending news History will spit on this animal: Kashyap to <mark>Amit Shah</mark> Bengaluru: Dead lines of Namma Metro Nagpur woman raped, rod inserted in her private parts NPR causes panic among Muslim bank customers in TN Republic Day: What is its significance? Services About Epaper Newsletter Archives Sitemap Classifieds Contact Our group sites Printers Mysore Prajavani Sudha Mayura Privacy Policy Terms Disclaimer © 2020 The Printers (Mysore) Private Ltd.. X Share via Share permalink We use cookies to understand how you use our site and to improve user experience. This includes personalising content and advertising. By continuing to use our site, you accept our use of cookies, revised Privacy Policy. Learn more I agree X We use cookies. Learn more X", "articleID": "2020012922_00001054_W", "names": {"Amit Shah": ["Q19946588", "Q4746875", "Q4746876"]}}, {"date": "2020-01-31", "url": "http://www.msn.com/en-us/news/other/amazon-value-set-to-top-dollar1-trillion-and-wall-street-says-more-to-come/ar-BBZvXMv?srcref=rss", "content": "Amazon.com Inc. was on course to exceed $1 trillion in market value again after results beat expectations, with analysts applauding the popularity of the e-commerce giant's one-day shipping initiative and the performance of its cloud-computing business. © Pablo Blazquez Dominguez--Getty Images undefined The shares surged 8.7% in U.S. pre-market trading after reporting what Robert W. Baird & Co. analysts called an \"impressive quarter from top to bottom .\" Goldman Sachs analysts pointed out that it was the first time the company beat the upper end of its revenue guidance since the first quarter of 2018. The results sparked a rush on Wall Street to raise price targets for the stock, with RBC Capital Markets analysts giving it a new Street-high target of $2,700, implying 44% upside from Thursday's close. In surpassing the $1 trillion mark--something it also did briefly back in 2018--Amazon will be joining Apple Inc., Microsoft Corp. and Google-parent Alphabet Inc. on an exclusive list of U.S. tech giants to have reached that valuation. © Bloomberg Amazon on course to reach $1 trillion market cap after results Here's a roundup of what analysts had to say. Morgan Stanley, Brian Nowak (Overweight, price target raised to $2,400 from $2,200) Results and guidance showcase how one-day delivery is driving faster-than-expected share gains, while an even more bullish point is that one-day is also driving faster Fulfillment by Amazon (FBA) adoption. FBA is another incremental revenue stream to fuel profits and ability to invest to attack new markets such as grocery, logistics and healthcare. Meanwhile, investments in the Amazon Web Services (AWS) salesforce are driving better enterprise customer adoption, \"particularly bullish as AWS continues to attack the $500 billion-plus addressable market for public cloud .\" BMO, <mark>Daniel Salmon</mark> (Outperform, price target raised to $2,450 from $2,150) One-day shipping costs were lower than expected while volume acceleration remained robust and downside margin risk is now considerably lower. AWS revenue beat BMO's estimate, and BMO said that unit can continue to grow meaningfully despite competition as the overall market expands. Investors should also feel confident that the investment phase has peaked. Baird, Colin Sebastian (Outperform, price target raised to $2,275 from $2,080) Amid investor concern around infrastructure investments, AWS competition and a shorter holiday shopping window, the results showcased the benefits of Amazon's increasingly diversified business model and one-day roll-out. Broader adoption of fulfillment service, stable AWS trends, and ad revenue growth were key highlights, although a softer margin outlook likely reflects ongoing logistics investments. Goldman Sachs, Heath Terry (Buy, price target raised to $2,600 from $2,200) Notes AWS operating margins saw first quarter-on-quarter expansion since the third quarter of 2018. With concern about deceleration in AWS business allayed, at least for the moment, revenue growth driven by investments in fulfillment and infrastructure is likely to spur significant share-price outperformance. RBC Capital Markets, Mark Mahaney Outperform, price target raised to $2,700 from $2,500 One-day delivery is proving out, Prime memberships are growing rapidly and international retail is poised to accelerate thanks to multi-year investments. Raises 2020 operating income estimate 4% amid fundamentals that were \"reasonably solid,\" though notes that organic revenue growth decelerated amid tough comparables .--With assistance from Lisa Pham and William Canny. Read More", "articleID": "2020013112_00142751_W", "names": {"Daniel Salmon": ["Q47471836", "Q9201431"]}}]