[{"date": "2020-01-31", "url": "https://www.seattletimes.com/business/company-looking-to-build-mill-embroiled-in-internal-dispute/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all", "content": "FRANKFORT, Ky. (AP)--An aluminum company planning to build a $1.7 billion plant in Appalachia announced a management shakeup as it tries to complete financing for a long-promised Kentucky project staked to millions in taxpayer money, but the company's top executive later disputed that he had stepped down. The boardroom drama began when Braidy Industries said Thursday that its chairman and CEO, Craig Bouchard, would step down from that role but remain a member of the company's board of directors. The company offered no reason for the change, which comes at a crucial time for efforts to build the mill near Ashland. Bouchard disputed the company announcement Friday, saying on social media that he did not authorize the company release and had not relinquished his job. The company said in the release that its current president, Tom Modrowski, had been named interim CEO and current board member Charles Price would serve as board chairman. The company didn't immediately respond to Bouchard's comments disputing the shakeup. Braidy said in the Thursday release that the shakeup comes as the company enters \"its final fundraising stage .\" \"Tom and the board will continue to focus our efforts on completing fundraising and planning for construction of the Ashland mill,\" Price said in the Thursday release. Advertising Despite those assurances, the Kentucky Senate's top leader expressed uncertainty Friday when asked if he remains confident the project will come to fruition. \"Until it gets built, you always have to have concerns,\" Senate President <mark>Robert Stivers</mark>, a Republican, told reporters. Bouchard had been the public point man for the project--long touted to bring a badly needed infusion of jobs to a struggling region. The company has said it will create 1,500 construction jobs and more than 650 full-time jobs once the plant starts production. The mill is to be built not far from where Ohio, Kentucky and West Virginia meet on the Ohio River. The Bluegrass State also has a financial stake in the project. In a rare move, former Republican Gov. Matt Bevin persuaded the state legislature to approve a $15 million investment in the project, making taxpayers partial owners of the planned mill. The state investment sparked a legal fight, led by the Courier-Journal, for records detailing the company's finances. Gov. Andy Beshear's administration recently released those records. Advertising Word of the company's shakeup brought responses from the top levels of state government. \"We were previously advised of these changes and it is our understanding they do not impact the current status of the project .\" Beshear spokesman Sebastian Kitchen said in a statement before Bouchard's social media post disputing the company announcement. The governor's office later said it didn't have any additional information to share. Beshear ousted Bevin in last year's election. Republican House Speaker <mark>David Osborne</mark> noted that local officials near the planned mill remain confident that the project is moving forward and will be completed. \"I know this governor's office is committed to seeing it through,\" the speaker said. \"It's a project that's going to mean generational change for that area .\" <mark>Osborne</mark> also spoke before Bouchard's social media comments. Braidy's Kentucky project drew widespread attention when the company forged a partnership with Russian aluminum giant Rusal, which previously faced U.S. sanctions for connections to a Russian oligarch. BRUCE SCHREINER", "articleID": "2020013120_00077151_W", "names": {"David Osborne": ["Q16733868", "Q57819678"], "Robert Stivers": ["Q18158878", "Q7350085"]}}, {"date": "2020-02-02", "url": "https://sports.inquirer.net/384345/nu-bullpups-near-uaap-juniors-elims-sweep", "content": "sports / Basketball Basketball NU Bullpups near UAAP juniors elims sweep By: Bong Lozada - Reporter / @ BLozadaINQ INQUIRER.net / 07:22 PM February 02, 2020 Photo from UAAP MANILA, Philippines--National University-Nazareth School moved on the verge of an elimination round sweep after it decimated hapless University of the Philippines Integrated School, 113-76, Sunday in the UAAP Season 82 high school boys' basketball tournament at Filoil Flying V Center in San Juan. <mark>Steve Nash</mark> Enriquez and Terrence Fortea led the defending champions, who hiked their record to 13-0, with 17 points apiece while Gerry Abadiano added 12 points and six assists. ADVERTISEMENT Big men Carl Tamayo and Kevin Quiambao did their work in the post with 10 points each and 18 rebounds combined. \"If we could get the sweep, then okay, but we're always focused on the game that we will play next,\" said NU head coach Goldwin Monteverde in Filipino. FEATURED STORIES SPORTS Standard bearer SPORTS Folayang thrown off his game by Dutch foe's height advantage SPORTS Lakers honor Kobe Bryant, Gianna in emotional pregame tribute Jordi Gomez de Liano paced UPIS with 27 points while Sean Torculas added 17 points, 22 rebounds but had nine turnovers. Meanwhile, Ateneo High School clinched a spot in the semifinals after brushing off De La Salle-Zobel, 79-52. Forthsky Padrigao had 19 points, six rebounds, three assists and four steals while LeBron Lopez added 17 points and had two blocks as the third-running Blue Eaglets improved to 8-5 record. Ranz Uniza led La Salle with 14 points. Adamson University grabbed sole possession of the fourth seed with a 124-68 humiliation of University of the East while second seed Far Eastern University-Diliman held off University of Santo Tomas, 81-73. The Baby Tamaraws (12-1) still have a chance to claim the top seed if they beat the Bullpups by 16 or more points on Feb. 5. ADVERTISEMENT For the complete collegiate sports coverage including scores, schedules and stories, visit Inquirer Varsity. Read Next Taduran keeps IBF belt after technical draw vs Mexican EDITORS' PICK SM continues to send relief assistance to remote towns in Batangas A Chinese national, the second confirmed coronavirus case in PH, dies; the first death outside China IN DETAIL: Duterte's temporary travel ban on visitors from China, Hong Kong, Macau Beyond Lifetimes: Sun Life Philippines celebrates 125 years of making life brighter for Filipinos Smart's Siklab Saya invigorates Mobile Legends scene this 2020 EDITORIAL: Irresponsible dithering MOST READ Man kills coworker who allegedly mocked him for being fat What remains of the day DOH confirms 2nd case of nCoV in PH, says patient died Saturday New Chinese city locked down over virus, first foreign death Don't miss out on the latest news and information. View comments Subscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70 + titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000. TAGS: Adamson University Baby Falcons, Ateneo Blue Eaglets, Far Eastern University Baby Tamaraws, FEU, Juniors, National University-Nazareth School Bullpups, NU, Sports, UAAP, UAAP Season 82 juniors' basketball tournament For feedback, complaints, or inquiries, contact us. EDITORS' PICK MOST READ globalnation SM continues to send relief assistance to remote towns in Batangas cebudailynews A Chinese national, the second confirmed coronavirus case in PH, dies; the first death outside China newsinfo IN DETAIL: Duterte's temporary travel ban on visitors from China, Hong Kong, Macau business Beyond Lifetimes: Sun Life Philippines celebrates 125 years of making life brighter for Filipinos technology Smart's Siklab Saya invigorates Mobile Legends scene this 2020 opinion EDITORIAL: Irresponsible dithering newsinfo Man kills coworker who allegedly mocked him for being fat February 02, 2020 opinion What remains of the day February 02, 2020 newsinfo DOH confirms 2nd case of nCoV in PH, says patient died Saturday February 02, 2020 newsinfo New Chinese city locked down over virus, first foreign death February 02, 2020 newsinfo Coldest weather recorded so far in Baguio, Manila February 02, 2020 sports Standard bearer February 02, 2020", "articleID": "2020020211_00130795_W", "names": {"Steve Nash": ["Q16137022", "Q192955", "Q42316961"]}}, {"date": "2020-02-03", "url": "http://hardware.itbusinessnet.com/2020/02/how-kate-katzman-found-her-true-calling-in-acting/", "content": "UTICA, MI / ACCESSWIRE / February 3, 2020 / How do you find your life's true calling? What do you want to achieve in life? While some people say career counseling is the way to, others recommend looking within. The fact is that the real answer comes from the inside. Most successful people introspect and even \"talk\" to themselves to get answers. It is only by doing you realize your potential, which in itself becomes a way of life. This is how actress Kate Katzman found her true calling. What started as a fun activity for Kate Katzman turned into a passion. Kate decided to try her luck in acting and enrolled in the prestigious Burt Reynolds Institute for Film and Theatre in Jupiter, Florida. She was trained by the superstar himself, who gave an immense boost to her confidence. After completing her master class, she went on to appear in numerous movies, including \"Walk Before Mickey', where she played Walt Disney's wife, Lillian. In 2019, she was also seen in\" Santa in Training' and \"A Christmas Carol .' This year, Katzman will be seen in\" Adverse,' a neo-noir film starring an ensemble cast of Mickey Rourke, Penelope Ann Miller, and Lou Diamond Phillips, among many more. Furthermore, she will also share the screen with Hollywood legends Robert De Niro, Morgan Freeman, and <mark>Tommy Lee Jones</mark> in the comedy film \"The Comeback Trail' directed by <mark>George Gallo</mark>. When asked about her projects in 2020, Kate replied,\" It was quite an experience rubbing shoulders and keeping up with the big boys in Hollywood. It has been exhilarating and enjoyable while learning a lot more about the craft \". Kate shuffles between Palm Beach County, Florida, and Bucks County, Pennsylvania, with her husband and two children. Just like Kate Katzman, all need to find their life's true calling. Some have the fire in them but not enough to do something about it. While some don't hesitate to change their paths, but sure it's worth the effort in the end. Contact Details Name: Karishma Mago Company Name: Facilius Inc.. Email: info @ faciliusinc.com Website: https: //faciliusinc.com/ SOURCE: Facilius Inc View source version on accesswire.com: https: //www.accesswire.com/572281/How-Kate-Katzman-found-her-True-Calling-in-Acting Continue Reading Previous Blue Lagoon Qualifies And Upgrades To Trade On The OTCQB", "articleID": "2020020309_00057821_W", "names": {"George Gallo": ["Q2075917", "Q30121962"], "Tommy Lee Jones": ["Q170587", "Q7819623"]}}, {"date": "2020-02-03", "url": "https://wobm.com/ocean-county-lawmakers-have-megans-law-expansion-bill-move-ahead/", "content": "Vin Ebenau Prison cell at the Monmouth County Correctional Institute. (Vin Ebenau, Townsquare Media New Jersey) Share on Facebook Share on Twitter A Megan's law legislative initiative (S-205) introduced by 9th District Ocean County Senator Chris Connors, Assemblyman Brian Rumpf and Assemblywoman <mark>Dianne Gove</mark> has advanced thru the Senate Law and Public Safety committee. The legislation would require the state attorney general to establish a means for providing e-mail notifications when a sex offender listed on the internet registry registers a new address in a different county or zip code from the offender's previous address. The 9th District Lawmakers issued a statement on their legislation moving ahead: \"Community notification is the core purpose of Megan's Law in the overall effort to safeguard our communities against sexual predators. To be more effective, we're proposing to upgrade Megan's Law by instituting the use of e-mail notifications which would help in addressing complications encountered by law enforcement due to the transient nature of sexual offenders. Residents could stay better informed if they received e-mail notifications in instances when a registered sex offender moves to a new address. Currently, notifications are mostly provided to persons living in high-risk zones who are likely to come in contact with a sex offender. Under our legislation, residents would be able to request notifications for up to two additional counties or zip codes, which they may not receive under current law .\" NJ child predator who says \"pedophiles are a persecuted minority' wins appeal Assemblyman Rumpf and Assemblywoman <mark>Gove</mark> said that they will be introducing the companion bill to S-205 in the coming weeks. The 9th District delegation is also sponsoring legislation that would amend Megan's Law which would require that the county prosecutors to determine an offender's risk of re-offense, or tier, prior to the inmate's release from incarceration .\" At present, many sex offenders are not tiered until they have been released into the community because the offender's residence is a factor that may be considered in determining the risk of re-offense, \"The 9th District Lawmakers said. There have been similar pieces of legislation introduced and passed in New Jersey to aim to tighten the policies of Megan's Law even further. In response to Governor <mark>Phil Murphy</mark> vowing to make New Jersey a sanctuary state and Attorney General Gurbir Grewal's Immigrant Trust Directive, Jersey Shore Assemblyman Ron Dancer introduced legislation in July of 2019 requiring anyone convicted of fleeing sex crime charges in foreign countries to register under Megan's law. Marlboro bus driver arrested for watching obscene material in front of students More Jersey Shore News: Enter your number to get our free mobile app Filed Under: 9th District, Brian Rumpf, child predators, Chris Connors, <mark>Dianne Gove</mark>, Megan's Law, Ocean County, Sex Offender Categories: Jersey Shore News, New Jersey News, News, News Briefs, Ocean County News, Your Town Comments Leave A Comment Back To Top", "articleID": "2020020311_00098192_W", "names": {"Dianne Gove": ["Q5269971", "Q57025996"], "Phil Murphy": ["Q260042", "Q3378818", "Q7182210", "Q7182211"]}}, {"date": "2020-02-03", "url": "https://www.wcbi.com/damien-williams-talks-attitude-after-chiefs-super-bowl-win/#respond", "content": "US & World News National Share on Facebook Tweet on Twitter The Kansas City Chiefs won their first Super Bowl in 50 years last night with a dramatic comeback. Down by 10, the team scored 21 points in the fourth quarter to beat the San Francisco 49ers 31-20. Running back Damien Williams had a huge part in that historic run, scoring two touchdowns in the fourth quarter. Appearing on \"CBS This Morning\" Monday, Williams was enjoying the moment. \"It feels great,\" he said. \"You know, I feel like it still hasn't kicked in yet [that] I'm a Super Bowl champion .\" - Advertisement - Kansas City Chiefs running back Damien Williams scores a touchdown during the second half of Super Bowl LIV against the San Francisco 49ers, Sunday, February 2, 2020, in Miami Gardens, Fla.. Charlie Riedel/AP Co-host Gayle King said, \"Patrick [Mahomes] said he never lost faith. I wonder how you don't lose faith after two interceptions, you're down in the fourth quarter. Watching at home, I think a lot of people lost faith. What do you say to yourself, what do you do to yourself, to say,\" We are going to pull this out and do it now'? \"\"Me personally, I was going up and down the sidelines because when you've got a guy like Pat who is our vocal leader--he's just our leader, period--and having a game that he was having, somebody has to, you know, step up and be that vocal leader and kind of let everybody know, you know,\" We're not out of this game. Keep fighting, keep pushing .' \"\"The type of persona Pat is, he's a competitor .\" \"Tyrann Mathieu said about you, you have a lot attitude on offense, you\" run angry,' \"King said .\" What does that mean? \"Oh yes, most definitely,\" Williams said. \"I have a lot of attitude, especially with this game. I love what I do. And also, I have a chip on my shoulder. I've always been overlooked, and I keep that in my back pocket .\" Kansas City Chiefs running back Damien Williams. CBS News Co-host <mark>Anthony Mason</mark> said, \"You entered the league as an undrafted free agent. You've become only the second undrafted player to rush for 100 yards in a Super Bowl. That's vindication if ever there was any .\" \"Goodbye, chip!\" laughed King. \"Nah, I gotta keep that chip!\" Williams replied. He was also asked about Chiefs coach <mark>Andy Reid</mark> and what the win meant to him. \"Oh, man,\" Big Red' gave me a big hug. Big, big, big hug, \"Williams said .\" He's excited. He got on the bus with that trophy and he didn't let it go. He held it tight. And that's what you want to see--he looked like a big kid in the candy shop! \"So, what is next for the 27-year-old running back?\" Oh, man, enjoy the moment. Live in the moment. Be the moment, \"he said .\" You know, I have three beautiful kids. I'm going to enjoy this moment with them and make sure they remember this for the rest of their lives. \"", "articleID": "2020020317_00026326_W", "names": {"Andy Reid": ["Q2622812", "Q27830815", "Q470738", "Q4761219"], "Anthony Mason": ["Q4773038", "Q4773043", "Q573600"]}}, {"date": "2020-02-04", "url": "http://bridportnews.co.uk/sport/national/18209988.jones-confirms-tuilagi-will-miss-englands-clash-niggly-scotland/", "content": "Sport National Sport <mark>Jones</mark> confirms Tuilagi will miss England's clash with \"niggly' Scotland By Press Association 2020 England Captains Run--2019 Rugby World Cup--Oita Stadium 0 comment <mark>Eddie Jones</mark> has branded Scotland\" niggly \"ahead of a Calcutta Cup showdown that will be missed by Manu Tuilagi. Tuilagi has been ruled out of the Guinness Six Nations trip to Edinburgh because of the groin injury sustained during last weekend's 24-17 defeat in France which kicked off their title quest in deflating fashion. <mark>Jones</mark> promised\" brutal physicality \"in Paris in comments that backfired because of the controversy they caused across the Channel and the tame performance delivered on the pitch. Undeterred, the head coach has taken early aim at Scotland by claiming that history shows they attempt to provoke England .\" Scotland are a niggly side. Our historical record against Scotland is interesting--over 80 per cent wins in England but only 50 per cent at Murrayfield, \"<mark>Jones</mark> said .\" It's about having good focus, good attention to the moment, good clarity about your game-plan, being well prepared. And we'll start with that today (Tuesday). \"Two years ago England were thumped 25-13 at Edinburgh in a defeat that exposed glaring breakdown deficiencies and launched a five-Test losing run that placed <mark>Jones</mark>' future in doubt. When the teams walked through tunnel to the changing rooms upon completing their warm-up, a brawl erupted that was provoked by Scotland number eight <mark>Ryan Wilson</mark> targeting <mark>George Ford</mark>, prompting Owen Farrell to defend his team-mate. Asked for an example of\" niggly \"conduct, <mark>Jones</mark> replied:\" The dressing-room scene two years ago when they tried to goad a couple of our players. And they were successful. \"Historically they've done that through the ages. That's the way they stay in the game and they're good at it .\" The Murrayfield environment helps them but you've got to be good enough to stay focused, be on task, do what you need to do. \"Composure is always important in rugby, but probably more so at Murrayfield .\" Although Tuilagi will be missing against the Scots, his likely one-match absence is positive news. Tuilagi lasted just 16 minutes against France to sounding alarm bells, given his career was once threatened by a serious groin problem and his recent setback with a similar issue that forced him to miss three games. But significant damage has been avoided and <mark>Jones</mark> is optimistic the Leicester man will return for the rest of the tournament. \"Manu had his MRI scan (on Monday night) and he has a slight, low-grade adductor strain. We're hopeful he'll be fit for Ireland. It's very good news, outstanding news,\" <mark>Jones</mark> said. Tuilagi's absence robs England of their most powerful player behind the scrum and his exit from the field resulted in a lack of firepower at the Stade de France, with Billy and Mako Vunipola already missing. <mark>Jonathan Joseph</mark> came on as his replacement and is competing with Ollie Devoto to deputise at outside centre. <mark>Anthony Watson</mark> was a late withdrawal from the team for the championship opener because of a calf issue but he is due to resume full training on Tuesday. 0 comment", "articleID": "2020020414_00381179_W", "names": {"Anthony Watson": ["Q16236647", "Q47546429", "Q4773680", "Q4773681", "Q48964969", "Q604801"]}}]