[{"date": "2020-02-04", "url": "http://bridportnews.co.uk/sport/national/18209988.jones-confirms-tuilagi-will-miss-englands-clash-niggly-scotland/", "content": "Sport National Sport <mark>Jones</mark> confirms Tuilagi will miss England's clash with \"niggly' Scotland By Press Association 2020 England Captains Run--2019 Rugby World Cup--Oita Stadium 0 comment <mark>Eddie Jones</mark> has branded Scotland\" niggly \"ahead of a Calcutta Cup showdown that will be missed by Manu Tuilagi. Tuilagi has been ruled out of the Guinness Six Nations trip to Edinburgh because of the groin injury sustained during last weekend's 24-17 defeat in France which kicked off their title quest in deflating fashion. <mark>Jones</mark> promised\" brutal physicality \"in Paris in comments that backfired because of the controversy they caused across the Channel and the tame performance delivered on the pitch. Undeterred, the head coach has taken early aim at Scotland by claiming that history shows they attempt to provoke England .\" Scotland are a niggly side. Our historical record against Scotland is interesting--over 80 per cent wins in England but only 50 per cent at Murrayfield, \"<mark>Jones</mark> said .\" It's about having good focus, good attention to the moment, good clarity about your game-plan, being well prepared. And we'll start with that today (Tuesday). \"Two years ago England were thumped 25-13 at Edinburgh in a defeat that exposed glaring breakdown deficiencies and launched a five-Test losing run that placed <mark>Jones</mark>' future in doubt. When the teams walked through tunnel to the changing rooms upon completing their warm-up, a brawl erupted that was provoked by Scotland number eight <mark>Ryan Wilson</mark> targeting <mark>George Ford</mark>, prompting Owen Farrell to defend his team-mate. Asked for an example of\" niggly \"conduct, <mark>Jones</mark> replied:\" The dressing-room scene two years ago when they tried to goad a couple of our players. And they were successful. \"Historically they've done that through the ages. That's the way they stay in the game and they're good at it .\" The Murrayfield environment helps them but you've got to be good enough to stay focused, be on task, do what you need to do. \"Composure is always important in rugby, but probably more so at Murrayfield .\" Although Tuilagi will be missing against the Scots, his likely one-match absence is positive news. Tuilagi lasted just 16 minutes against France to sounding alarm bells, given his career was once threatened by a serious groin problem and his recent setback with a similar issue that forced him to miss three games. But significant damage has been avoided and <mark>Jones</mark> is optimistic the Leicester man will return for the rest of the tournament. \"Manu had his MRI scan (on Monday night) and he has a slight, low-grade adductor strain. We're hopeful he'll be fit for Ireland. It's very good news, outstanding news,\" <mark>Jones</mark> said. Tuilagi's absence robs England of their most powerful player behind the scrum and his exit from the field resulted in a lack of firepower at the Stade de France, with Billy and Mako Vunipola already missing. <mark>Jonathan Joseph</mark> came on as his replacement and is competing with Ollie Devoto to deputise at outside centre. <mark>Anthony Watson</mark> was a late withdrawal from the team for the championship opener because of a calf issue but he is due to resume full training on Tuesday. 0 comment", "articleID": "2020020414_00381179_W", "names": {"Eddie Jones": ["Q1773628", "Q3047282", "Q5336166", "Q5336167", "Q5336170", "Q735730"], "George Ford": ["Q18686168", "Q21064450", "Q5539348"], "Jonathan Joseph": ["Q28672687", "Q6273512"], "Ryan Wilson": ["Q10524", "Q15581918", "Q2745188", "Q3943107", "Q47477514", "Q53660518", "Q7384652", "Q949777"]}}, {"date": "2020-02-05", "url": "https://www.mmafighting.com/2020/2/5/21119484/dominick-reyes-says-hes-ready-for-the-responsibility-of-being-a-role-model-as-ufc-champion", "content": "Filed under: News UFC Latest News Dominick Reyes says he's ready for the responsibility of being a role model as UFC champion New, 1 comment By Damon Martin @ DamonMartin Feb 5, 2020, 11:00 am EST Share this story Share this on Facebook Share this on Twitter Dominick Reyes Thomas Lakes, MMA Fighting Dominick Reyes has dreamed of winning a UFC title since the day he started fighting, but he knows there's a lot more to being champion than just having a belt wrapped around your waist. In the early days of the UFC, the fighters holding titles were almost as anonymous as the fans cheering for them from the crowd. There's a much different atmosphere in 2020 where recent champions have had entire parades thrown in their honor after a big win and others received a hero's welcome just stepping off the plane after capturing UFC gold. In addition to the attention being paid to UFC champions these days, athletes are also being held up as role models, especially to children who have almost always seen prominent sports figures as people they aspire to be like growing up. While reigning UFC light heavyweight champion <mark>Jon Jones</mark> has a complicated history when it comes to his own responsibilities as champion, Reyes believes he's going to set a much different example. He'll never claim he's infallible but the California native knew from his first day in the sport that he had to carry himself in a way that would reflect back positively on the people who raised him as well as admirers who choose to look up to him. \"No matter what, you're a role model,\" Reyes said when speaking to MMA Fighting. \"Kids are going to look up to you, no matter what. Whether you want to or not. I have nieces and nephews. I have a brother who's 10 years old. He looks up to me. These kids look up to me every day so I'm already in that role .\" I'm not perfect. I make mistakes. I drink from time to time. I go out but it's about being responsible and not being an assh * le about it. \"It's not fair to simply paint <mark>Jones</mark> as good or bad when it comes to his time as champion. He's donated winter coats to help needy families in his adopted hometown of Albuquerque, N.M.. He's led charity fundraising to benefit The Pediatric Cancer Foundation. <mark>Jones</mark> has spoken at schools as well as Boys and Girls Clubs while trying to pass on a message of inspiration to the youth looking up to him. On the other side of coin, <mark>Jones</mark> has also seen his name in headlines in the past for a DUI not to mention a hit-and-run accident in 2015 that could have easily landed him with a lengthy jail sentence. It did ultimately cost him the UFC light heavyweight title and almost a year of his career. Reyes isn't casting judgment on <mark>Jones</mark> for his successes or failures but he wants to set a different example as champion if he's victorious in the UFC 247 main event .\" I've been preparing to be at this level my whole life. I've kind of been preparing to be a famous athlete my whole life, \"Reyes said .\" For me, I'm not going to become champion at 23. I'm 30 years old now. I've been trained in the media stuff. I know how to act. I'm very classy with my approach to everything. I'm not going to go out and start doing crazy drugs and drinking everyday. I'm very professional about how I present myself and how I go about my life. \"I have family and really close friends around me. I have a very close circle of people around me. I still live in my hometown. I'm just happy being me. Being champion isn't going to change who I am. When I become champion, that's just added to the resume .\" Some fighters might want to shy away from those extra responsibilities but Reyes has learned to embrace them. He might even be a little excited about it. \"There's more responsibility, more public speaking, more outreach, there's more things that I'm going to be doing but I just see it as more opportunity to help my community,\" Reyes said. \"To help people that need help. To be a positive influence and force of good in this world .\" Get the latest gear Conor McGregor Autographed UFC 189 Mendes KO Photo Conor McGregor Framed Autograph From UFC 205 Rose Namajunas Reebok Namesake T-Shirt Stipe Miocic Heavyweight Champion T-Shirt Khabib Nurmagomedov UFC 229 Photo T-Shirt UFC Reebok USA Country Snapback Adjustable Hat UFC Single Fight Model Glove Display Case Most Read Morning Report: Joe Rogan believes that Dominick Reyes is the most dangerous fighter <mark>Jon Jones</mark> has faced since Daniel Cormier Khabib Nurmagomedov: Conor McGregor rematch depends on \"do I want that?' Khabib Nurmagomedov doesn't sound convinced that a Conor McGregor rematch is worth his time. Jessica Penne has six days to reach $40,000 GoFundMe goal for USADA arbitration Penne's rep says the anti-doping agency will effectively retire her if she doesn't fight her second potential anti-doping case. Leon Edwards thinks he upset Tyron Woodley by insulting his\" sh * t music' Tyron Woodley claims he's taking his bout with Leon Edwards more \"personally\" than most of his fights, and the U.K. frontrunner thinks he knows why. UFC 247 Embedded, Episode 2: \"It gets me up on a different level' It the second episode of UFC 247 Embedded, Dominick Reyes watches the Super Bowl, <mark>Valentina Shevchenko</mark> heads to the beach, Katlyn Chookagian explains her training, <mark>Jon Jones</mark> trains, and more.", "articleID": "2020020516_00117788_W", "names": {"Jon Jones": ["Q285450", "Q3183202"], "Valentina Shevchenko": ["Q238184", "Q4522047"]}}, {"date": "2020-02-05", "url": "http://chron.com/business/energy/article/Democrats-accuse-Energy-Department-of-15032005.php", "content": "https: //www.chron.com/business/energy/article/Democrats-accuse-Energy-Department-of-15032005.php Democrats accuse Energy Department of underspending on clean energy research By <mark>James Osborne</mark> Updated 10:34 am CST, Wednesday, February 5, 2020 The accusations of underspending follows efforts by the Trump administration to cut funding for the EERE office under former Energy Secretary Rick Perry. The accusations of underspending follows efforts by the Trump administration to cut funding for the EERE office under former Energy Secretary Rick Perry. Photo: AFP Contributor/AFP Via Getty Images Photo: AFP Contributor/AFP Via Getty Images Image 1 of / 1 Caption Close Image 1 of 1 The accusations of underspending follows efforts by the Trump administration to cut funding for the EERE office under former Energy Secretary Rick Perry. The accusations of underspending follows efforts by the Trump administration to cut funding for the EERE office under former Energy Secretary Rick Perry. Photo: AFP Contributor/AFP Via Getty Images Democrats accuse Energy Department of underspending on clean energy research 1 / 1 Back to Gallery WASHINGTON--The Department of Energy isn't distributing funding for clean energy research fast enough, House Democrats said Wednesday. At a hearing before the oversight panel of the House Science and Space Committee, Chairman Rep. <mark>Bill Foster</mark>, D-Ill ., said the department's Office of Energy Efficiency and Renewable Energy didn't spend $823 million in funding appropriated by Congress last year, more than a third of its budget. \"We want to make sure EERE manages its R & D investments in an efficient manner and in keeping with congressional intent,\" he said. \"If potential grantees do not think EERE is a reliable partner, they are less likely to engage with DOE in the future. I am concerned about the effect this could have on the United States' position as a global leader in clean energy .\" The criticism follows repeated efforts by the Trump administration to cut funding to the EERE office under former Energy Secretary Rick Perry. But Assistant Secretary for the EERE Daniel Simmons said that it was not the office's intention to withhold spending and that carrying over funding from one year's budget to the next was in line with the final years of the Obama administration. \"What matters at the end of the day is appropriated dollars. The president's proposed budget is the beginning of the process,\" he said. \"It takes a while to get the funding announcements out the door .\" At the same time, <mark>Foster</mark> said, staffing levels at the EERE office have \"severely dropped,\" despite increases in salaries and benefits for DOE staff. But Republicans on the science committee pushed back, arguing that it was the department's job to move cautiously in the distribution of more than $1.3 billion in outside research funding last year. \"After increases by the Obama administration, EERE is by far DOE's largest applied research program,\" Beaumont Republican Rep. Wandy Weber said. \"It is clear DOE has operated appropriately and within its mandate for grant funding review .\" U.S. will soon surpass Saudi Arabia in petroleum exports: Rystad Chazen: Wall Street thinks drillers will \"waste\" cash on...Trump's proposed steel tariffs could hammer Houston...OPEC, Russia seen beating expectations on output cuts Noble Energy selling its Gulf of Mexico business to Fieldwood Fuel Fix on Twitter Tweets by fuelfixblog Fuel Fix on Facebook FuelFix View Comments © 2020 Hearst Communications, Inc. .", "articleID": "2020020517_00088004_W", "names": {"Bill Foster": ["Q2903389", "Q4909019", "Q4909020", "Q4909021", "Q4909026"], "James Osborne": ["Q21068913", "Q6140669"]}}, {"date": "2020-02-08", "url": "http://www.gattonstar.com.au/news/how-mkr-became-dead-in-the-water/3940083/", "content": "Written off as an absolute failure, MKR has copped a series of humiliating blows this week thanks to a trend filtering through a lot of shows, says <mark>James Weir</mark>. TV How MKR became \"dead in the water' by <mark>James Weir</mark> 9th Feb 2020 7:36 AM 0 You know a TV show is dead in the water when people would literally rather watch footage of public transport. That's what happened to My Kitchen Rules this week when it returned to humiliating ratings. Its Monday night premiere pulled in just 517,000 people in capital cities and by Tuesday it sank to 402,000. Meanwhile, Married At First Sight premiered to 1,154,000. The final punch in the guts for MKR? Great Australian Railway Journeys over on SBS pulled in more viewers than the former juggernaut. What is Great Australian Railway Journeys? From what I gather, it's basically just some British guy who catches a train around Australia. It's a step above the\" slow TV \"movement where people tune in to watch a train slowly roll through the countryside for eight hours. Yep, it's actually a thing. Maybe that's how Gladys Berejiklian can get some money back on those old-timey trams no one asked for. None of us want to ride on them because it's not the 1940s. But she could strap a GoPro to the front and sell the footage to Seven to replace MKR with. It's a win for Sydney and a win for Seven and a win for us because apparently that's what we want to watch. We'd rather be locked on Gladys' slow trams than watch MKR. Anyway, the word from viewers is they miss the original MKR recipe. Seven has messed with the formula that made it a ratings smash in an attempt to rival the drama on Married At First Sight. Last year there was a storyline about two contestants hooking up. And while filming for this year's season was going on, reports surfaced that a crew member was accused of filming two contestants while they had sex on a couch. We've seen lots of insane stuff on MAFS over the years - cheating, a mild-choking, an attempted glassing. But we've never seen full-blown sex acts. You know something's inappropriate when even MAFS producers draw a line. People don't want hook ups with their cook ups! The only cheating scandals we want on MKR involve someone putting laxatives in another team's baked quail. All these TV shows are becoming the same and it's hard to tell them apart. MKR is morphing into MAFS with its sexiness and drunken dinner parties. Pretty soon Survivor will also probably introduce some kind of drunken tribal circle where someone gets a coconut thrown at their head .\" Any minute there's going to be sex on Survivor - some of those people are very, very attractive, \"columnist and author Kerri Sackville said on the Not Here To Make Friends podcast. And she's right - this week there was a wrestling challenge on Survivor that viewers compared to porn. If you missed it, I can send you my screenshots. Honestly, I'll probably start watching survivor now. Anyway, Kerri was a guest on the podcast with Sam Dastyari and we were talking about all these reality shows becoming the same and how they should just be rolled into one so we can save time .\" I do think we can bring them all together, \"she said .\" What we need to do is get all the MAFS couples onto the Survivor island. And then the MKR people come in and they cook them a meal. And they're all starving so, whatever the food is, they just think it's fantastic - so no one's crying which means they have to create drama in other ways. \"Even Dancing With The Stars, which returns tonight, is cashing in by casting one of MAFS' old cheaters. I just hope Great Australian Railway Journeys doesn't buckle to the trend and introduce a sex scandal. No one wants to see that. More screenshots of the Survivor porn from my archives. IT'S HARD TO RESPECT A BUSINESSMAN ON A RAZOR SCOOTER In big cities around Australia, professionals and business executives are whizzing around on Razor scooters and we're all pretending like that's normal. It's not. I can't respect a businessman on a scooter - it's like a visual oxymoron. Someone who's loving the scooter trend is Deborra-Lee Furness. She has been whizzing around Manhattan on a scooter for the past few months and I'm just obsessed with it. I've even set up a Google alert for\" Deb Lee Furness scooter \"so I don't miss an update. Whenever I'm feeling down, I just scroll through photos of Mrs Hugh Jackman hooning around the streets of SoHo and all is right in the world again. Me leaving work early before my boss notices. DIGGING THROUGH THE MAFS REJECT BIN About 15,000 Aussies applied to be on Married At First Sight this year and only 20 were successfully recruited into the mess. This begs the question: Where the hell are these 14,980 rejected applicants and who the hell are they? I've launched a Freedom Of Information request to get to the bottom of this and we're slowly getting answers. If you or someone you know was rejected, please get in touch. On this week's episode of the Not Here To Make Friends podcast, an asexual woman called in and told her story about being ghosted by the MAFS producers. Ouch, huh? You'd think producers would love to throw an asexual person in the mix. Then again, producers probably realised halfway through the interview process that - given this is basically a show about horny people cheating on each other - they probably wouldn't provide the level of drama required. On tonight's episode of the podcast, we'll hear from a man who is attracted to guys and girls but wanted MAFS producers to pair him with a wife. Why did producers say no? We'll find out. Download and subscribe to the podcast. Twitter and Facebook: @ hellojamesweir 0 editors picks Read More Login to follow <mark>james weir</mark> Read More Login to follow mkr Read More Login to follow my kitchen rules Read More Login to follow television Read More Login to follow editors picks <mark>james weir</mark> mkr my kitchen rules television", "articleID": "2020020821_00238273_W", "names": {"James Weir": ["Q19325090", "Q22969585"]}}, {"date": "2020-02-08", "url": "https://www.newsweek.com/msnbc-host-chris-matthews-ties-bernie-sanders-fears-socialist-executions-central-park-fidel-1486375", "content": "Share Politics <mark>Chris Matthews</mark> Msnbc Socialism Fidel castro MSNBC host <mark>Chris Matthews</mark> warned that if Vermont Senator Bernie Sanders wins the 2020 election there could be socialist-led executions in Central Park. <mark>Matthews</mark> offered his latest on-air rant against the Sanders campaign and his supporters after the Democratic presidential debate Friday night. The longtime MSNBC political analyst warned viewers what might have happened if Fidel Castro and \"the Reds\" had won the Cold War, suggesting Sanders would have supported public executions of the late Cuban leader's perceived enemies. <mark>Matthews</mark> demanded to know if Sanders supports Castro's style of communism or if he's truly a backer of democratic socialist-style governments such as Denmark. Here's the video of the moment...It really is something pic.twitter.com/uKS3vxuyX1--Kombiz Lavasany (@ kombiz) February 8, 2020 Visibly-shocked fellow MSNBC panel members <mark>Chris Hayes</mark> and <mark>Lawrence O'Donnell</mark> attempted to interject, as <mark>Matthews</mark> said he may have been executed in Central Park if capitalism hadn't defeated socialism during the Cold War. Related Stories Bernie Sanders Calls Out Pete Buttigieg And Mike Bloomberg Who Won the Eighth Democratic Debate in New Hampshire? Sanders Claims Victory in Iowa at CNN Town Hall, Says He's Not Frontrunner \"I have my own views of the word\" socialist' and I'd be glad to share them with you in private, \"<mark>Matthews</mark> said Friday night after the Democratic debate .\" They go back to the early 1950s. I have an attitude about them. I remember the Cold War, I have an attitude towards Castro. I believe if Castro and the Reds had won the Cold War there would have been executions in Central Park and I might have been one of the ones getting executed. And certain other people would be there cheering, okay? \"So I have a problem with people who took the other side. I don't know who Bernie has supported over these years, I don't know what he means by socialism--one week it's Denmark, we're going to be like Denmark. Okay, that's harmless. That's basically a capitalist country with good social welfare programs. Denmark .\" MSNBC panelist and host <mark>Joy Reid</mark> also expressed her fear about videos or comments Sanders may have made in the past \"praising the version\" of socialism which could be used against him in a general election. \"What does he think of Castro? That's a good question, what's he think of Fidelismo?\" <mark>Matthews</mark> continued. \"We all thought he was great when he first came out. I cheered like mad for him when he first went in and then he became a communist and started shooting every one of his enemies. You've got to make those judgments .\" <mark>Hayes</mark> interjected that Sanders is \"pretty clearly in the Denmark category\" of mixed capitalist and socialist-style policies, which <mark>Matthews</mark> promptly questioned: \"Is he? How do you know? Did he tell you that?\" During the recent Iowa caucuses, <mark>Matthews</mark> claimed the only reason Sanders could win the contest is because \"socialists love meetings,\" similar to the caucus process. He referred to an Oscar Wilde quote about how socialism is hard to sell because \"it takes too many meetings .\" Newsweek reached out to <mark>Matthews</mark>' representatives for comment Saturday. MSNBC analyst <mark>Chris Matthews</mark> demanded to know Bernie Sanders' stance on Fidel Castro, tying the Vermont Senator to \"executions in Central Park\" led by Cold War communists. Screenshot: MSNBC <mark>Matthews</mark> continued his rant against socialism as a term: \"Some people like it, younger people like it, but those of us like me, who grew up in the Cold War and saw some aspects of it, if there visiting places like Vietnam, like I have, [and seeing countries] like Cuba, being there, I've seen what socialism's like, I don't like it. It's not only not free, it doesn't fricking work!\" Request Reprint & Licensing, Submit Correction or view Editorial Guidelines", "articleID": "2020020906_00056296_W", "names": {"Chris Hayes": ["Q22944815", "Q5106834", "Q5106835", "Q5106836", "Q5106837", "Q541742", "Q55362566"]}}]