[{"articleID": "2014060322_00012365_W", "names": {"John Wise": ["Q1702197", "Q18385590", "Q21988583", "Q6218000", "Q6264668"]}, "date": "2014-06-03", "url": "http://insiderlouisville.com/lifestyle_culture/kentucky-mans-comic-book-bonanza/", "content": "Public perception of Churchill Downs is anything but rosy these days Kentucky man's comic-book bonanza up for auction; sale ends tonight! Superman features prominently in the <mark>John Wise</mark> collection. Paducah, Ky. insurance exec <mark>John Wise</mark> is about to see a lot of green from the sale of his astonishing!) collection of comic books. And we ain't talking about Kryptonite. We're talking cash, obvs, and Murray State-grad <mark>Wise</mark>, 62, may soon see $1 million, if not more, from the online auction of his great collection of Golden Age comics, says Vincent Zurzolo, the chief operating officer of Comicconnect.com, the online site auctioning <mark>Wise</mark>'s collection. The online auction is ongoing, and concludes thisÂ evening at 7 p.m. <mark>Wise</mark>'s collection of 175 choice books includes Action Comics No. 1, the first Superman, Detective Comics No. 27, the first Batman, Marvel Comics No. 1, the first Sub-Mariner and Human Torch, and Flash Comics No. 1, the first, wait for it, Flash. You could say he's got pretty much a murderers' row of the greatest hits of the greatest comic book heroes of all time. And the Flash. \"What makes his collection special is not only the value but the breadth,\" says Zurzolo. <mark>Wise</mark> really focused on high-quality books from the late '30s through the '50s, when many of the key heroes listed above were introduced. Few good quality copies of these books survive today, Zurzolo says. <mark>Wise</mark>'s Action No. 1, for example, is in very good shape for a book that was introduced in 1938, Zurzulo says. Only 100 of these books survive today, from the half-million or so that were originally printed. A great quality copy of Action No. 1 was sold, by Comicconnect.com, for $2.16 Â millionÂ the record. <mark>Wise</mark>'s book is not in that kind of condition, and condition is everything with comics, but even now it's got an $80,000 bid with time left on the auction clock. Zurzolo believes it will likely fetch close to $100,000, as should the first Batman. <mark>Wise</mark> bought many of his books in the 1990s, when they traded for a fraction of what they go for now. Even after Comicconnect.com takes its 10 percent auction commission he should still do quite well, Zurzolo says. The books' values have been boosted in recent years by the success of all the various comics-related movies that have set cinemas ablaze over the past decade."}, {"articleID": "2011051607_00043528_W", "names": {"David Ortiz": ["Q19402485", "Q28815032", "Q38332228", "Q448005", "Q54541573"], "Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"], "Carl Crawford": ["Q1037431", "Q26273593"], "Freddy Garcia": ["Q1321132", "Q2430240", "Q5496863", "Q5496869"], "Rafael Soriano": ["Q19842101", "Q28935967", "Q366928"]}, "date": "2011-05-16", "url": "http://patriotledger.com/sports/pros/x1291971398/Sox-hit-500-with-sweep-of-Yankees", "content": "despite being the preseason favorite to win the rugged al east, the boston red sox are finding that reaching .500 in may after an 0-6 start feels a-ok. kevin youkilis hit a tying three-run homer, <mark>david ortiz</mark> had a go-ahead drive and the red sox completed a sweep of a team in turmoil, beating the new york yankees with a 7-5 victory sunday night to even their record for the first time this season. \"actually feels good. hopefully this is a step in us moving forward,\" red sox manager terry francona said. \"it's not really what our goal is but we're making strides. we played a good series.\" jon lester (5-1) shrugged off a slow start to beat new york again and jarrod saltalamacchia hit his first homer with boston as the red sox swept a three-game series in the bronx for the first time since april 2004. \"that's what people expect us to do,\" <mark>ortiz</mark> said. \"when you combine good hitting with good pitching, as you saw, you're supposed to win.\" despite jumping out to a 4-1 lead, the yankees matched their longest losing streak since may 2009 by losing their fifth straight - all at home - a slump plagued by shaky defense, a lack of big hits - and a huge mess in the clubhouse. jorge posada was in the middle of the uproar saturday, pulling himself from the lineup about an hour before gametime, saying he needed a day to clear his head after being dropped to ninth in the batting order. the struggling designated hitter apologized sunday to yankees manager joe girardi and general manager brian cashman for his actions on what he characterized as \"a bad day.\" the yankees said they will not punish the five-time all-star and consider the matter closed. cashman said it was time to move on and focus on the red sox and righting the yankees, losers of nine of 12. \"it seems like when things are going bad, they're going bad,\" girardi said. \"we're going to turn it around.\" posada entered as a pinch-hitter to open the eighth and received a sustained ovation. he walked but daniel bard retired the next three batters. jonathan papelbon stopped twice to tie his shoes - much to the ire of the fans remaining - during a perfect ninth to finish for his seventh save. <mark>alex rodriguez</mark> let a ball roll through his legs in the seventh inning for an error, allowing the red sox to take a 6-4 lead - an insurance run they would need in the bottom half. <mark>carl crawford</mark> failed to cleanly pick up <mark>rodriguez</mark>'s double to left field for an error, which gave curtis granderson time to score from first. \"i don't know what the numbers say but we've almost made an error per game here over the last 15 games,\" <mark>rodriguez</mark> said. \"we've hurt ourselves over and over again with the glove and tonight was an example of me not making a very routine play.\" new york has made 13 errors in its past 10 games. but nick swisher struck out against bard with runners on first and second to drop to 0 for 17 with runners in scoring position and two outs this year. since may 2, the yankees are 21 for 95 (.221) with runners in scoring position overall. \"it has been frustrating,\" swisher said of the yankees' struggles, \"but, hey, man, we don't have much time to worry about this.\" even though posada was not in the starting lineup because he was 0 for 24 against lefthanders this season, the bleacher creatures finished their roll call with chants of \"jorge!\" that elicited a cheer from the crowd of 46,945. posada gave a wave from the dugout. posada was first to the top of the dugout steps to greet designated hitter andruw jones, who hammered a pitch from lester deep into the left-field seats leading off the second for a 2-1 lead. granderson connected for a two-run shot four batters later, the first homer lester has allowed against a lefty batter this season. but youkilis spoiled the good vibes at yankee stadium with a three-run shot off <mark>freddy garcia</mark> (2-3) in the third and <mark>ortiz</mark> broke his bat on his seventh homer in the fifth to make it 5-4. big papi was a triple shy of the cycle. \"we're just going out playing good ball right now,\" youkilis said. \"we've come a long way since 0-6.\" lester settled after a rocky start, giving up just one hit and striking out five after the second inning. he walked two in the sixth between strikeouts but got brett gardner to pop up to first for the third out. lester struck out seven and walked four in six innings to win his fifth straight decision this year and improve to 7-1 against the yankees. the red sox loaded the bases with none out in the second but only scored one run off <mark>garcia</mark>, on jed lowrie's sacrifice fly. saltalamacchia homered off joba chamberlain in the eighth for his first homer since aug. 2, 2009, for texas against seattle. setup man <mark>rafael soriano</mark> is nursing a sore elbow and was not available. he said postgame he plans to have a bullpen session monday and be available to pitch wednesday. notes: adrian gonzalez's streak of homering in four straight games - five homers total - came to an end ....<mark>garcia</mark> has not allowed a grand slam in his career, 1,966 1-3 innings ....marco scutaro (strained oblique) on the dl since may 8 will rejoin red sox in boston on monday to continue his rehab. he was not with the team during the five-game road trip."}, {"articleID": "2015012616_00061459_W", "names": {"John Crowley": ["Q1586867", "Q55987054", "Q6227781", "Q736447"], "Nick Hornby": ["Q313007", "Q7027324"]}, "date": "2015-01-26", "url": "http://feeds.latimes.com/~r/latimes/entertainment/news/music/~3/6K_85HbiN-8/la-et-mn-sundance-saoirse-ronan-20150125-column.html", "content": "A gifted cinematic presence since her Oscar-nominated \"Atonement\" debut at age 12, Saoirse Ronan has played everything from a young assassin raised among wolves in \"Hanna\" to a resident of \"Grand Budapest Hotel's\" imaginary Zubrowka. But \"Brooklyn,\" her new film debuting Monday in the Premiers section at Sundance, was something different. \"Playing someone normal was the biggest challenge,\" the now 20-year-old actress says. \"I wasn't used to it.\" An image from the documentary \"Meru,\" about three Americans climbing a perilous face of Mt. Meru in Nepal. It's directed by Jimmy Chin, one of the climbers, and E. Chai Vasarhelyi. \"3 1/2 Minutes,\" in the U.S. documentary section, is directed by Marc Silver. It examines how and why an unarmed black teenager in Florida was killed for playing rap music too loud. \"The Wolfpack,\" in the U.S. documentary competition, is directed by Crystal Moselle. It focuses on six movie-crazed brothers who spend their childhood making meticulous re-creations of films like \"Reservoir Dogs.\" U.S. documentary competitor \"Welcome to Leith,\" directed by Michael Beach Nichols and Christopher K. Walker. It looks at what happens when a hard-core white supremacist attempts to take over a tiny North Dakota town. \"The Summer of Sangaile,\" directed by Alante Kavaite, is in the world dramatic competition. A haunting, hypnotically shot story out of Lithuanian about a young woman in love with flying. Sundance Film Festival 2015 | Kenneth Turan's 25 films of note Los Angeles film critic Kenneth Turan's 25 Sundance films of note. Sundance Film Festival 2015 | Kenneth Turan's 25 films of note Los Angeles film critic Kenneth Turan's 25 Sundance films of note. Ask her how old she was when she began acting and she'll reply, with amusement and style, \"I was in the womb, Kenny. I was zero. It started when my mum and dad had a glimmer in their eye.\" Eilis is \"Brooklyn's\" protagonist, a young woman who emigrates from Ireland to that celebrated New York borough in 1952 and ends up contending with homesickness, culture shock and a variety of romantic involvements. Impeccably directed by <mark>John Crowley</mark> and elegantly adapted by <mark>Nick Hornby</mark> from a novel by Colm Tóibín, \"Brooklyn\" is classic filmmaking beautifully done, illustrating the power of restraint in dealing with emotional material. And as Ronan's first time \"telling an Irish story in an Irish film,\" it has special meaning. \"I get very emotional when I talk about it; I hope I'm not going to start crying,\" the actress says. \"I never had a film affect me like that. It was very much a passion project for all the people involved.\" It's not only that \"for generation after generation, the relationship has been so close between Ireland and the United States\" but there's a personal connection as well. \"My mom and dad made that journey,\" says Ronan, who was born in the New York area and moved back to Ireland with her parents when she was 3. \"The town we shot in in Ireland was close to where I grew up, where I spent my childhood. Every second scene knocked me over by how it affected me.\" So for the actress, another of the challenges of \"Brooklyn\" was \"trying to find a balance, giving the story color, but at the same time holding back, keeping control. It was hard. I was very aware I didn't want to do too many crying scenes, I didn't want to do too much blubbering. That gets very boring, unless you really need it.\" Helping her greatly with her performance was <mark>Crowley</mark>, a director with extensive experience in theater whose films include \"Boy A\" and \"Closed Circuit.\" \"<mark>John</mark> is a theater director at heart, it's all about community, about communicating with your actors,\" Ronan says. \"He was involved in everything, but when it came to the acting, he was so tied into every single thing you were doing, performance was absolutely everything to him.\" He gave you notes after a take, he constantly moved you around. In the time it took to do eight takes, you discovered more and more about what you were doing. He revealed to me so many different elements in my character I hadn't really considered before. He made me more present because of the way he works. \"Because Ronan is roughly the same age as Eilis, and in fact has just gotten a place of her own in London, elements of Eilis' situation ring especially true.\" Really, this film is about choice, about when you've gone through enough life experience to make a choice for yourself, \"Ronan says.\" Eilis is finally at the stage in her life where she knows not what she needs to do but what she wants. That's a really empowering thing. \"Part of the choice Eilis has to make involves two suitors, played by Domhnall Gleeson and Emory Cohen. The men do not meet in the film, but the cast did have an introductory dinner together, and Ronan jokes that\" once we got past the fact that the film wasn't real, they were able to chill out and have fun. \"Fun was a theme of Ronan's early years in New York, where her father was a working actor.\" My parents were both very expressive people, and exposure to American humor broadened their world, \"she says. Deus Ex Machina makes high-end motorcycles and loses money on each one Obama's renewed push to close Guantanamo prison is seen as promising Deus Ex Machina makes high-end motorcycles and loses money on each one"}, {"articleID": "2012041910_00054619_W", "names": {"Cecilia Villanueva": ["Q1906580", "Q57303460"]}, "date": "2012-04-19", "url": "http://iol.co.za/news/world/no-charges-in-death-of-girl-after-fight-1.1279663", "content": "april 19 2012 at 09:55 am by gillian flaccus ap a photo of joanna ramos, 10, with a note, is left at a memorial outside willard elementary school in long beach, calif. on monday feb. 27, 2012. ramos, who died after a fight with an 11-year-old in an alley near their elementary school underwent emergency surgery for a blood clot on her brain before her death, her sister said monday. (ap photo/nick ut) prosecutors declined to file charges on wednesday against an 11-year-old girl who fought with a 10-year-old schoolmate hours before the younger girl died. the death of joanna ramos came after a \"fight between two children that ended with unintended and tragic results,\" but no crime was committed, police said in a statement. police referred all inquiries to the district attorney's office. district attorney spokeswoman sandi gibbons said her office could not comment on the decision because the case involved a juvenile. joanna was pronounced dead on february 24, about six hours after she tussled with another girl in an alley near her california school when classes ended. her mother, <mark>cecilia villanueva</mark>, said officials met with the family wednesday morning, but she still knows few details about the fight and chose not to ask because it was too painful. \"there's nothing they can do that's going to bring my daughter back, nothing. there's nothing i can do,\" she said, choking back tears. <mark>villanueva</mark> said she felt for the other girl. \"her life is not the same anymore. i'm not angry because it could have happened to the girl instead of to joanna,\" she said. the name of the other girl has not been made public. joanna's family previously told the associated press that she underwent emergency surgery for a blood clot on her brain and was resuscitated several times before she died. joanna's older sister, vanessa urbina, said wednesday she was disappointed about the decision. the family knows little more about what prompted the fight than they did when it happened nearly two months ago, she said. \"there's nothing we can do, but i want charges on her,\" said urbina, 17. \"she killed my sister. she didn't mean to kill her, but she meant to hurt her.\" the fight near willard elementary school didn't appear to be especially violent, no weapons were used, and neither girl was knocked to the ground, police have said. joanna had a bloody nose when she returned to her after-school program, according to witnesses, and had to be picked up early by a relative because she didn't feel well. by the time joanna got home, she was complaining of a headache and vomiting. before she passed out on the family's couch, she told her mother an 11-year-old girl had punched her in the head but refused to say more, <mark>villanueva</mark> previously told the ap. comment guidelines. login and register, if you haven' t already .? copyright 1999 - 2011 independent online, a division of independent newspapers (pty) limited. the copyright in the literary and artistic works contained in this online news publication and its other related and connected websites, as well as in the published editions of group newspapers, their supplements and any other content or material, belongs exclusively to independent newspapers (pty) limited unless otherwise stated."}, {"articleID": "2017042412_00765371_W", "names": {"Bobby Ryan": ["Q4935535", "Q4935536", "Q561610"], "Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"]}, "date": "2017-04-24", "url": "http://10thousandcouples.com/2017/04/columbus-loses-top-defenseman-for-rest-of-playoffs/", "content": "Columbus loses top defenseman for rest of playoffs by Claude Wood | April 24, 2017 | 14:18 Facing elimination in their best-of-seven Eastern Conference first-round series, the Blue Jackets started aggressively and held off the Pittsburgh Penguins for a 5-4 victory on Tuesday night in Nationwide Arena. He was hurt in the second period when Pittsburgh Penguins' Phil Kessel shot the puck. Coach John Tortorella told reporters Monday that Werenski is done for the season. That's the way it happens after a loss. After a lackluster performance in a 3-1 loss in Game 3, the Rangers came out aggressive early in Game 4. \"I said to him,\" I'm proud to be your teammate \". The Blue Jackets have benefitted greatly from his services this year, and losing him is arguably one of the biggest blows they could suffer in the postseason. Nutivaara, a rookie, was making his playoff debut. It helped. They were able to maintain pressure pretty much all evening, and while the Penguins had their moments, they never seized momentum in the second and third periods the way they did in the first three games of the series.\" No matter what period we're in, we have to have the puck more \", Tortorella said.\" We just got to keep doing it \". He'll walk away from his rookie campaign with 11 goals and 47 points in 78 regular season games, good for sixth in scoring on the team and first among blue liners. BOSTON (AP) - <mark>Bobby Ryan</mark> scored on a tip-in on a power play 5:43 into overtime, and the Ottawa Senators recovered after giving up a three-goal lead to beat the Boston Bruins to take a 2-1 lead in the first-round series. Veteran goaltender Marc-Andre Fleury, replacing injured starter <mark>Matt Murray</mark>, has been sharp for the Penguins and made a critical mask save of a potential game-winning Brandon Dubinsky shot in overtime Sunday. Corey Perry scored 1:30 into overtime and Anaheim rallied from three goals down to take a 3-0 series lead in the first-round series.\" When they get closer, we end up with a shift and score a goal \". They lost that series in seven games to Vancouver. The Blue Jackets will be seeing some changes in their lineup. There was less luck involved when Anderson made it 2-0 with a little over minute left in the period. He was waiting to the right of the net to collect a rebound on a shot by Jenner and beat Fleury to the glove side. But Kuhnhackl found the back of the net on a rebound less than two minutes later to make it 4-3 before Jenner put Columbus back up by two. The Pittsburgh Penguins will be looking to go with what worked, keeping most of their lines in tact for game four. Even when they would win series, they would too often leave the door open for opponents or let series go an extra game or two. Related Articles"}, {"articleID": "2016081718_00049434_W", "names": {"David Barton": ["Q1173662", "Q19560044", "Q42354512"]}, "date": "2016-08-17", "url": "http://www.patheos.com/blogs/friendlyatheist/2016/08/17/david-barton-claims-you-just-dont-find-atheists-living-in-the-countryside/", "content": "At an Arkansas Tea Party conference last weekend, Christian pseudo-historian <mark>David Barton</mark> said that you don't find any atheists in the rural parts of America because, if we lived in the country, we would totally believe in God since evidence of His creation would be all around us. \"Do you know how hard it is to find an atheist in the country?\" <mark>Barton</mark> asked. \"You find atheists in the city. You find atheists in areas that don't get to see God. If you spend time looking at creation, you just don't find atheists out there.\" It's a strange statement for a number of reasons, the least of which is that we know atheists exist everywhere. If there are atheists in Saudi Arabia, I promise you it wouldn't be that hard to find them on a farm. Hell, you'd expect to find some atheists in rural areas given how much science is involved in agriculture and raising animals. <mark>Barton</mark> is also suggesting that evidence of God doesn't exist in big cities. I guess the diversity of people, and the incredible architecture, and the beautiful lakefronts don't count. If I were a pastor, it would be easy to point to examples of God's Creation in the city. <mark>Barton</mark> seems to think God limits himself to farmland and animals and open skies...which is an odd thing to hear from a cheerleader for Christ. <mark>Barton</mark> made a similar claim in 2014, and I'll paraphrase what I said then: If there are more religious people in the countryside, one reason for that could be that when you're more isolated from the world, as farmers tend to be, you're much less likely to encounter people whose different ideas may challenge you and cause you to change your mind. In the city, you come face to face with other opinions all the time. You live and work with people who disagree with you. It's a lot harder to be anti-gay in an urban area, for example, because you'll inevitably meet and know gay people and realize there's nothing to worry about. But none of that suggests you won't find devout Christians in big cities or atheists in the country. (via Right Wing Watch)"}, {"articleID": "2015101522_00065193_W", "names": {"Elizabeth May": ["Q16194189", "Q2289262", "Q42322461", "Q445620"], "Stephen Harper": ["Q206", "Q7609425"], "Nigel Wright": ["Q7032722", "Q7032726", "Q7032728", "Q7032729"]}, "date": "2015-10-15", "url": "http://www.cp24.com/news/a-look-at-some-of-the-more-popular-facebook-posts-from-the-election-campaign-1.2611883", "content": "Talk Shows A look at some of the more popular Facebook posts from the election campaign Liberal leader Justin Trudeau, Green Party leader <mark>Elizabeth May</mark> and New Democratic Party leader Thomas Mulcair listen as Conservative Leader <mark>Stephen Harper</mark> take part in the first leaders debate Thursday, August 6, 2015 in Toronto. THE CANADIAN PRESS/Frank Gunn Chris Herhalt, CP24. com Published Thursday, October 15, 2015 6:09 PM EDT Videos and Facebook Q & A s dominate the list of leading posts by federal party leaders on Facebook during the 2015 campaign, according to the company's analysis. In no particular order, here are the posts that sparked public interest: Tom toasts his beer policy: On Aug. 7, International Beer Day, NDP leader Tom Mulcair's campaign posted an image of Mulcair toasting with a glass of beer. It touted the party's plan to offer tax credits to small brewers. <mark>Harper</mark>'s first interactive Facebook Q & A: On Sept. 8, Conservative leader <mark>Stephen Harper</mark> conducted a live question-and-answer session on his Facebook page. The first three questions people asked him revolved around the Conservatives plan to deal with the Syrian refugee crisis, their stance on Israel and what it is like to be prime minister. Trudeau releases campaign platform in Facebook livestream: On Oct. 5, Liberal leader Justin Trudeau released his party's 88-page campaign platform document via a live video broadcast, combined with a question-and-answer period on Facebook. <mark>Harper</mark> reiterates debate stance on Niqab: On Sept. 27, <mark>Harper</mark> posted an image with a quote reiterating a statement he made during a debate, where he said he would \"never tell my young daughter that a woman should cover her face because she is a woman. That's not our Canada.\" The niqab is a face-covering veil worn by a small minority of Muslim women. The niqab, it's admissibility at citizenship ceremonies and elsewhere has generated considerable debate and controversy during the campaign. Greens post Rick Mercer urging young Canadians to vote: The Green Party posted a Rick Mercer \"rant\" urging young Canadians to get off the couch and vote. It was viewed 495,000 times. Tom Mulcair hosts a Facebook Q & A: Mulcair hosted a Facebook question and answer session at the company's Toronto headquarters on Aug. 27. The first three questions he fielded concerned the cancelled women's issues debate, whether he was serious about repealing the Conservatives' counter-terrorism/surveillance legislation (Bill C-51), and his party's plans for the CBC. Justin Trudeau's Eid al-Adha message: A recorded video message released on Sept. 23 expressing greetings to Canadian Muslims on Eid al-Adha was viewed 423,000 times. Tom Mulcair expresses best wishes to Muslims celebrating Eid al-Adha: A recorded video message posted to Facebook on Sept. 26 from Mulcair wishing Canadian Muslims a special Eid al-Adha \"saw unusually high engagement,\" according to Facebook. It was viewed 282,000 times. <mark>Harper</mark> says armed intervention crucial to stopping ISIS: A clip of a speech <mark>Harper</mark> made in Markham posted to Facebook on Aug. 10 showed <mark>Harper</mark> arguing for continued airstrikes and training of local forces to combat the Islamic State. Trudeau pens a letter to <mark>Harper</mark> about Mike Duffy: A letter by Trudeau outlining his concerns about Senator Mike Duffy during his fraud trial in Ottawa rounds out the list of most significant posts by party leaders on Facebook. In the letter, Trudeau asks <mark>Harper</mark> when he knew about the arrangement for <mark>Harper</mark>'s former chief of staff <mark>Nigel Wright</mark> to repay Duffy's improperly claimed expenses, as well as whether <mark>Harper</mark> stayed in contact with <mark>Wright</mark> after <mark>May</mark> 2013."}, {"articleID": "2009081920_00006019_W", "names": {"Ben Chapman": ["Q30122130", "Q4885411", "Q4885412", "Q4885414", "Q54817514"]}, "date": "2009-08-19", "url": "http://wirralglobe.co.uk/news/4552942.EXCLUSIVE__PRESSURE_MOUNTS_TO_RELEASE_TOP_SECRET_LIBRARY_DOCUMENT/", "content": "exclusive: pressure mounts on wirral council to release top secret library document (from wirral globe) want to share your opinion, leave a tribute or comment on a news story? it's easy! here and comment on any of our stories. your news, your views. exclusive: pressure mounts on wirral council to release top secret library document 9:18 am wednesday 19th august 2009 pressure is growing on council leaders to release a top secret report into the borough's controversial library closures. for it has emerged this week that \"senior members\" of wirral's labour and liberal democrat administration have read the document, which contains the fate of the borough's 11 threatened libraries. \"as the drip, drip, drip of various hints continues there is an overwhelming case for publication of the report. cllr phil gilchrist an email sent to veteran wirral councillor phil gilchrist by the authority's legal department says the report has been shared with a limited number of senior members of the administration. and it adds:\" having regard to the need for absolute confidentiality and that this is a draft report...it would not be appropriate for there to be a wider distribution. \"now cllr gilchrist is demanding town hall chiefs end the speculation and let the public in on the secret. his call came at the same time as a letter sent to an mp by under secretary of state at the department for culture, media and sport barbara follett, says\" a clear perception \"is being formed that the council failed to consult sufficiently on library closures. cllr gilchrist said:\" as the drip, drip, drip of various hints continues there is an overwhelming case for publication of the report. \"ideally, this must be within days, not weeks, so the public have every right and opportunity to see what's being done in their name.\" wirral south mp <mark>ben chapman</mark> received the letter from barbara follett. she wrote: \"as you know, ms (sue) charteris, who is leading the inquiry into wirral metropolitan borough council's proposed library closures has now considered all the evidence presented and is now finalising her report.\" regrettably, a clear perception is emerging that the consultation in the wirral has been insufficient, especially in the case of eastham library. \"wirral council sparked a wave of controversy when it ruled that 11 libraries plus leisure centres, swimming pools and public halls should close. eastham library was a surprise late addition to the closure list. a local inquiry was held in july and a top secret draft copy of the inspector's report has been sent to wirral council and the dcms for fact checking. mr <mark>chapman</mark> said:\" eastham has indeed been given a rough deal and i am glad that this has been recognised by the department. \"i have made my feelings known on this particular aspect of the closures since it was first announced that eastham was on the list.\" but there is, of course, the issue at higher bebington and new ferry which are just as vital to those local communities. \"the campaign needs to continue and i will be seeking further clarification from the secretary of state.\" but given the response to my letter, it baffles me further as to why the local government ombudsman discontinued her inquiry \". liscard conservative cllr leah fraser said:\" for a junior minister to comment, instead of the secretary of state, suggests that there is going to be some criticism of the labour-led council within the report. \"this perhaps explains why the leaders in the town hall have adopted a\" bunker' mentality and are refusing to release their copy of the report or comment on the findings of sue charteris. \"it is not acceptable that people in seacombe and wallasey village, and users of the libraries across wirral, are being kept dangling instead of being given the same access to the report.\" interesting that they have let the \"cabinet' see it. they are the dopes who approved it! poorer than hoped for\" a' level results will not mean the end of the road for wirral pupils, says govt minister david lammy in an article for the globe"}, {"articleID": "2015113016_00041344_W", "names": {"Daniel Bernstein": ["Q5216558", "Q92865"]}, "date": "2015-11-30", "url": "http://www.jpost.com/Opinion/Our-World-The-American-war-against-the-Jews-435853", "content": "Our World: The American war against the Jews Our World: The American war against the Jews Opinion 11/30/2015 18:15 Our World: The American war against the Jews Despite the substantial funds that have been devoted to fighting anti-Israel forces on campuses, they have not been diminished. Anti-Israel demonstrators stage a rally outside New York City Hall. (photo credit: LUCAS JACKSON / REUTERS) Share on FacebookShare on Twitter The foundations of American Jewish life are under assault today in ways that were unimaginable a generation ago. Academia is ground zero of the onslaught. The protest movements on campuses are first and foremost anti-Jewish movements. For the past decade or so, Jewish communal leaders and activists have focused on just one aspect of this anti-Jewish campaign. Jewish leaders have devoted themselves to helping Jewish students combat the direct anti-Semitism inherent to the anti-Israel student movements. Despite the substantial funds that have been devoted to fighting anti-Israel forces on campuses, they have not been diminished. To the contrary, with each passing year they have grown more powerful and menacing. Consider a sampling of the anti-Jewish incidents that took place over the past two weeks. Two weeks ago, <mark>Daniel Bernstein</mark>, a Jewish student at University of California Santa Cruz and a member of the university's student government was ordered not to vote on a resolution calling for the university to divest from four companies which do business with Israel. <mark>Bernstein</mark> represents UCSC's Stevenson College at the university student government. He is also vice president of his college's Jewish Student Union. Ahead of the anti-Israel vote, <mark>Bernstein</mark> received a message from a member of his college's student council ordering him to abstain from the vote on Israel divestment. The student council, <mark>Bernstein</mark> was informed, had determined that he was motivated by \"a Jewish agenda,\" and therefore couldn't be trusted to view the resolution fairly. In the same message, <mark>Bernstein</mark>'s correspondent gave him a friendly \"heads up\" that his fellow students are considering removing him from office because he is a Jew supported by the Jewish community. To his credit, <mark>Bernstein</mark> ignored his orders. He voted to oppose the anti-Israel resolution. Following the incident <mark>Bernstein</mark> published a statement decrying the anti-Jewish discrimination and hatred now rampant on his campus. Among other things, he wrote, \"I wish that [my] being subjected to anti-Semitism was a shocking new occurrence. But the truth is that I'm not shocked. I'm not shocked because this hatred and ignorance has followed me everywhere. I'm not shocked because Jewish students have been targeted with this vile racism all over the [University of California] UC system for years, and especially since BDS became a major issue of discussion. Anti-Semitism...has...become an inseparable part of campus politics right here at UC Santa Cruz and across the UC system.\" Then there is the growing movement of professional associations that boycott Israel. Last week the National Women's Studies Association passed a resolution to join the BDS movement. The resolution, written in turgid, incomprehensible prose, proclaimed that the only state in the Middle East that provides full and equal rights to women is so evil that it must be singled out and boycotted, sanctioned and divested from. Whereas <mark>Bernstein</mark> was personally targeted, and the NWSA criminalizes Israel, at CUNY, on November 12, a group of protesters targeted the Jewish community as a whole. That day, as part of a national \"million student march,\" where students demanded free tuition, anti-Jewish students at CUNY rallied at Hunter college and introduced a new demand: the expulsion of all Israel supporters from campus. Congregating in the center of the campus, some 50 students chanted in unison, \"Zionists out of CUNY!\" Aside from an anodyne statement in favor of \"freedom of expression,\" CUNY administrators had nothing to say about the affair. For their part, Hunter's administrators issued a statement \"condemning the anti-Semitic comments,\" made by the rally participants. But no disciplinary measures were taken against any of them. Speaking to the Algemeiner, StandWithUs's northeast regional director Shahar Azani said that the Hunter incident \"is another example of the hijacking of various social causes by the anti-Israel movement.\" In making this claim, Azani was merely repeating the position taken by Jewish communal leaders and activists involved in the fight to defend Jews and Israel on university campuses. Unfortunately, this position is incorrect. According to the prevailing wisdom guiding Jewish communal responses to the onslaught against Jewish students on campuses, the anti-Israel and anti-Jewish movements are distinct from the wider anti-liberal forces now disrupting campus life throughout the US. As Jewish leaders see things, there is no inherent connection between the protesters embracing victimhood and demanding constraints on freedom of expression, inquiry and assembly (and free tuition), and those who seek to drive Jews out of the public sphere on college campuses. In other words, they believe that Zionists can be crybullies too. But they can't. The crybully movement, which demands that universities constrain freedom to cater to victim groups, is necessarily hostile to Jews. This is the reason that at the same time that \"victims\" from blacks to transgenders are coddled and caressed, Jews have emerged as the only group that is not protected. Indeed, the BDS movement requires universities to discriminate against Jewish students. The inherent conflict between the tenets of the \"progressive\" movement and Jewish rights is exposed in a guide to racial \"microaggressions\" published earlier this year by the University of California. Students and faculty must avoid committing these \"microagressions\" if they want to stay on the right side of campus authorities and the law. The UC defines \"microagressions\" as, \"brief, subtle verbal or non-verbal exchanges that send denigrating messages to the recipient because of his or her group membership (such as race, gender, age or socio-economic status).\" Transgressors can expect to be accused of engendering a \"hostile learning environment,\" an act that can get you expelled, fired and subjected to criminal probes. As law professor Eugene Voloch reported in last June, among other things, the list of offenses includes embracing merit as a means of advancing in society. A statement along the lines of \"I believe the most qualified person should get the job\" can destroy a person's academic career. So too, statements rejecting race as a significant factor in judging a person's competence are now deemed racist. For instance statements to the effect of, \"There is only one race, the human race,\" \"America is a melting pot\" or \"I don't believe in race\" can land a student or instructor in hot water. In a column last week, Dennis Prager noted that the list castigates as racism all the pillars of liberal society in America. The list, he wrote, shows that \"the American university is now closer to fascism than to traditional liberty.\" Prager is right, of course. But the fascist takeover of American academia will not affect all Americans equally. Jews are the greatest victims of this state of affairs. For the better part of the past hundred years, the upward mobility of American Jewry has been directly correlated with America's embrace of meritocratic values. The more Americans have looked past race and ethnicity and judged people by their talents, characters and professional competence, the higher Jews have risen. Conversely, where qualities other than competence, talent and professionalism have determined social and professional status, Jews have suffered. They have faced discrimination and their opportunities to advance have been limited. Academia is but a small component of American society. But to earn a place in America's middle, upper-middle and upper classes, you need at least an undergraduate degree. Moreover, university graduates go on to populate and head the state and federal governing bureaucracies, the business world, the entertainment sector and every other major area of human endeavor in American society. Academia's simultaneous rejection of core liberal principles and legitimization of anti-Semitic forces is not a coincidence. Jews are a constant reminder that human agency--rather than race and other group identities--has everything to do with a person's ability to excel in academics and beyond. For fascist principles to hold, Jews must be demonized and hated. The intrinsic link between anti-Semitism and fascism and their simultaneous embrace by a key American institution means that the equal rights and freedoms of Jews are far more threatened in America today than most Jewish leaders and activists have realized. The Jewish community's failure to date to successfully defeat the anti-Semitic forces on campuses owes at least in part to its failure to recognize or contend with the dual nature of the problem. The Washington PostShare on Facebook"}, {"articleID": "2015092510_00005389_W", "names": {"Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"]}, "date": "2015-09-25", "url": "http://times-series.co.uk/leisure/national/13784361.Sam_Smith_s_new_Bond_song__The_lyrics_and_why_it_sounds_like_Michael_Jackson_s_Earth_Song/", "content": "-- <mark>SAM SMITH</mark> (@ samsmithworld) September 25, 2015 And then there are the lyrics, a few of which are: \"I'm prepared for this, I never shoot to miss,\" If I risk it all, Could you break my fall? \"How do I live? How do I breathe?, When you're not here I'm suffocating.\" But mostly people really think it has hints of the Earth Song in it: Anyone else think #WritingsOntheWall has an Earth Song sound to it in parts?"}]