[{"date": "2020-02-08", "url": "https://www.newsweek.com/msnbc-host-chris-matthews-ties-bernie-sanders-fears-socialist-executions-central-park-fidel-1486375", "content": "Share Politics <mark>Chris Matthews</mark> Msnbc Socialism Fidel castro MSNBC host <mark>Chris Matthews</mark> warned that if Vermont Senator Bernie Sanders wins the 2020 election there could be socialist-led executions in Central Park. <mark>Matthews</mark> offered his latest on-air rant against the Sanders campaign and his supporters after the Democratic presidential debate Friday night. The longtime MSNBC political analyst warned viewers what might have happened if Fidel Castro and \"the Reds\" had won the Cold War, suggesting Sanders would have supported public executions of the late Cuban leader's perceived enemies. <mark>Matthews</mark> demanded to know if Sanders supports Castro's style of communism or if he's truly a backer of democratic socialist-style governments such as Denmark. Here's the video of the moment...It really is something pic.twitter.com/uKS3vxuyX1--Kombiz Lavasany (@ kombiz) February 8, 2020 Visibly-shocked fellow MSNBC panel members <mark>Chris Hayes</mark> and <mark>Lawrence O'Donnell</mark> attempted to interject, as <mark>Matthews</mark> said he may have been executed in Central Park if capitalism hadn't defeated socialism during the Cold War. Related Stories Bernie Sanders Calls Out Pete Buttigieg And Mike Bloomberg Who Won the Eighth Democratic Debate in New Hampshire? Sanders Claims Victory in Iowa at CNN Town Hall, Says He's Not Frontrunner \"I have my own views of the word\" socialist' and I'd be glad to share them with you in private, \"<mark>Matthews</mark> said Friday night after the Democratic debate .\" They go back to the early 1950s. I have an attitude about them. I remember the Cold War, I have an attitude towards Castro. I believe if Castro and the Reds had won the Cold War there would have been executions in Central Park and I might have been one of the ones getting executed. And certain other people would be there cheering, okay? \"So I have a problem with people who took the other side. I don't know who Bernie has supported over these years, I don't know what he means by socialism--one week it's Denmark, we're going to be like Denmark. Okay, that's harmless. That's basically a capitalist country with good social welfare programs. Denmark .\" MSNBC panelist and host <mark>Joy Reid</mark> also expressed her fear about videos or comments Sanders may have made in the past \"praising the version\" of socialism which could be used against him in a general election. \"What does he think of Castro? That's a good question, what's he think of Fidelismo?\" <mark>Matthews</mark> continued. \"We all thought he was great when he first came out. I cheered like mad for him when he first went in and then he became a communist and started shooting every one of his enemies. You've got to make those judgments .\" <mark>Hayes</mark> interjected that Sanders is \"pretty clearly in the Denmark category\" of mixed capitalist and socialist-style policies, which <mark>Matthews</mark> promptly questioned: \"Is he? How do you know? Did he tell you that?\" During the recent Iowa caucuses, <mark>Matthews</mark> claimed the only reason Sanders could win the contest is because \"socialists love meetings,\" similar to the caucus process. He referred to an Oscar Wilde quote about how socialism is hard to sell because \"it takes too many meetings .\" Newsweek reached out to <mark>Matthews</mark>' representatives for comment Saturday. MSNBC analyst <mark>Chris Matthews</mark> demanded to know Bernie Sanders' stance on Fidel Castro, tying the Vermont Senator to \"executions in Central Park\" led by Cold War communists. Screenshot: MSNBC <mark>Matthews</mark> continued his rant against socialism as a term: \"Some people like it, younger people like it, but those of us like me, who grew up in the Cold War and saw some aspects of it, if there visiting places like Vietnam, like I have, [and seeing countries] like Cuba, being there, I've seen what socialism's like, I don't like it. It's not only not free, it doesn't fricking work!\" Request Reprint & Licensing, Submit Correction or view Editorial Guidelines", "articleID": "2020020906_00056296_W", "names": {"Chris Matthews": ["Q15735939", "Q25189328", "Q5107375", "Q5110828", "Q5112832", "Q948687"], "Joy Reid": ["Q16499823", "Q5403050"], "Lawrence O'Donnell": ["Q6504428", "Q962974"]}}, {"date": "2020-02-09", "url": "https://www.onenewspage.com/n/Entertainment/1zlqhn9p4t/Susan-Rice-tells-Snoop-Dogg-to-back-the.htm", "content": "One News Page <mark>Susan Rice</mark> tells Snoop Dogg to \"back the **** off' Gayle King after rapper's profane video; he later denies making threat Sunday, 9 February 2020 (31 minutes ago) Former national security adviser <mark>Susan Rice</mark> Friday told rapper Snoop Dogg to\" back the **** off \"of CBS journalist Gayle King after the rapper slammed her for an interview she did about Kobe Bryant last week. Bill Cosby thanks Snoop Dogg for going after Gayle King, Nicki Minaj is saying,\" Yikes \"with her new song and Meghan Trainor covers Harry Style's\" Adore You. \"These are the top stories in music for Friday, February 7th. You Might Like SKIPPACK TOWNSHIP, PA--Snoop Dogg made it abundantly clear how he felt about Oprah Winfrey and Gayle King earlier this week. On Thursday (February 6), Uncle Snoop blasted the two media heavyweights. . Credit: HipHopDX Duration: 02:49 Published Snoop Dogg attacked Gayle King for bringing up Kobe Bryant's sexual assault case and added,\" Free Bill Cosby. \"Credit: HuffPost NOW News Duration: 01:32 Published 2 days ago Recent related news from verified sources Hip-hop star made a number of explicit comments about the journalist after an interview in which she addressed the rape case against late NBA star Kobe Bryant Independent 22 hours ago Jailed TV icon Bill Cosby is riding with Snoop Dogg. The former Hollywood superstar has social media's attention after making a rare Twitter appearance to...SOHH Tweets about this pop. finna #f 4f76412d8e952ceb09ad678f8116f08 #foxnewsentertainmentmedia <mark>Susan Rice</mark> tells Snoop Dogg to\" back the **** off' Gay...https: //t.co/k9lXi632Yc 1 minute ago <mark>SPORTZCODetroit Susan</mark> Rice tells Snoop Dogg to \"back the **** off' Gayle King after rapper's profane video; he later denies making...https: //t.co/bxWt3TBqa8 1 minute ago Drake The Type <mark>To\"</mark> Susan Rice tells Snoop Dogg to \"back the **** off' Gayle King after rapper's profane video; he later denies making...https: //t.co/mPuhFeusp1 3 minutes <mark>ago Andrea</mark> Wells Susan Rice Tells Snoop Dogg to\" Back the **** Off \"Attack on Gayle King for Kobe Bryant Question https: //t.co/dFhwwXGUZY 8 <mark>minutes ago</mark> Nalanda Library Susan Rice tells Snoop Dogg to\" back the f *** off' after he lashed out at Gayle King for Kobe Bryant rape questions...https: //t.co/TkjjiVklRy 50 <mark>minutes ago</mark> Natural Born Sinner Susan Rice Tells Snoop Dogg to \"Back The F ** k Off\" Gayle King https: //t.co/XtrCgmwzYM 3 hours ago Larry Winston = Amigo, this is serious. She bravely stood up for a friend, something we must ALWAYS <mark>do</mark>, plus the fact that Susan b <mark>... https: //t.co/aGX7pVjLxs</mark> 3 hours ago Kaboon_Viper Susan Rice tells snoop dogg to back the f #@ $k off. #rkelly #snoopdog #gayle #Oprah https: //t.co/pWjZvNZTZA 3 hours ago", "articleID": "2020020909_00056340_W", "names": {"Susan Rice": ["Q23848423", "Q50612"]}}, {"date": "2020-02-05", "url": "http://feeds.foxnews.com/~r/foxnews/entertainment/~3/KOlWNT1t-fE/audrey-hepburn-oscar-winner-roman-holiday-inspire-hollywood-stars-expert", "content": "close Video Audrey Hepburn, Oscar-winner for \"Roman Holiday,' continues to inspire Hollywood stars, expert says Audrey Hepburn, Oscar-winner for\" Roman Holiday,' continues to inspire Hollywood stars, says pop culture expert Maude Garrett. The beloved classic film is currently available for streaming on Tubi to coincide with the Academy Awards. Audrey Hepburn became a movie star when she won the Oscar for best actress in 1953's \"Roman Holiday\" --and there's no denying the icon is still inspiring Hollywood today. In the beloved romance, Hepburn plays a princess who runs away from her duties but soon finds herself falling in love with a journalist, played by Gregory Peck. Viewers were immediately \"enchanted by her combination of grace, elegance and high spirits,\" the New York Times reported. Hepburn, who also become a fashion muse, made her mark in both the \"50s and\" 60s, captivating audiences with films like 1954's \"Sabrina,\" 1957's \"Funny Face,\" and 1961's \"Breakfast at Tiffany's .\" The actress also became a special ambassador for Unicef, the United Nations Children's Fund, in 1988 and dedicated the rest of her life traveling the world raising money and awareness for the U.N. organization. She passed away in 1993 at age 63 from cancer. LOU DIAMOND PHILLIPS RECALLS RITCHIE VALENS' SISTER BREAKING DOWN ON THE SET OF \"LA BAMBA'\" TOO CLOSE FOR COMFORT' STAR LYDIA CORNELL RECALLS OVERCOMING ALCOHOLISM: \"A RIVER OF TEARS JUST FLOWED' In honor of the Academy Awards, which is taking place on Feb. 9, free streaming service Tubi is highlighting some of the most influential Oscar-winning films, including\" Roman Holiday. \"Fox News spoke with pop culture expert Maude Garrett about why\" Roman Holiday \"continues to be timeless, what really made Hepburn so special, and how she's influencing today's Hollywood stars, including Kim Kardashian. Fox News: What is it about\" Roman Holiday \"that's so Oscar-worthy? Maude Garrett: Oh, my goodness, this movie had everything that embodies what a classic film is supposed to be. It features Audrey Hepburn, who is an icon of the times there .\" FACTS OF LIFE' STAR LISA WHELCHEL EXPLAINS WHY SHE DIDN'T RELEASE MORE MUSIC AFTER HER ’80S SOLO ALBUM Actress Audrey Hepburn affectionately holding Oscar award she won for her performance in the movie \"Roman Holiday' at the Academy Awards ceremony in New York City. (Photo by Ralph Morse/Life Magazine/The LIFE Picture Collection via Getty Images)\" REBEL WITHOUT A CAUSE' STAR SAL MINEO WAS \"ON A GOOD ROAD' BEFORE HORRIFIC MURDER, AUTHOR SAYS And this kind of story I think is the height of Audrey's career, especially because [back then], you still had the men dominating and it was the women that were always in the shadow. That wasn't the case in this movie. So I think that knowing back in the '50s that this was going to be sort of like the template of what an Academy Award-winning movie looked like, it really paved the path. FORMER TEEN IDOL LEIF GARRETT EXPLAINS DESCENT INTO HARD DRUGS:\" THERE HAS ALWAYS BEEN MORE TO MY STORY' Audrey Hepburn gleefully drives a motorscooter on the set of \"Roman Holiday .' <mark>RONNIE WOOD</mark>'S EX-WIFE <mark>JO WOOD</mark> RECALLS PHOTOGRAPHING THE ROLLING STONES OVER THE YEARS:\" THEY DIDN'T NOTICE' Fox News: How do you think Audrey continues to influence Hollywood today? Garrett: It's funny, with that classic look, even big stars that often aren't known for their class, like Kim Kardashian, have borrowed from Audrey's looks before. That infamous photoshoot she did with the champagne popping over her holding the glass, that is actually inspired by Audrey Hepburn. I'm not sure too many people will notice that. She is the queen of the LBD, the little black dress. She's the one that doesn't show much but makes that look incredibly powerful and, to me, sexy. So, I think that she is a style icon that people borrow from every single day. CURLY HOWARD'S GRANDSON DESCRIBES LEARNING HE WAS RELATED TO THE THREE STOOGES ICON: \"NO ONE WOULD BELIEVE US' Kim Kardashian on the cover of Paper magazine. RISQUÉ STORIES WRITTEN BY ED WOOD REVEALED DECADES AFTER FILMMAKER'S TRAGIC DEATH Fox News: Just by this film alone, what makes Audrey so different and special? Garrett: I think that Audrey really understood what star power was. I mean in the '50s, you had Clark Gable, Cary Grant--it was always about the men. And then some women really stepped up in the spotlight, like Katharine Hepburn as well as Marilyn Monroe. They realized what star power was all about, and these women [held] their own against their male counterparts. [Audrey] had this demure look, a look that was very, very innocent. But it was a gaze that held so much power. HUMPHREY BOGART'S EX-WIFE MAYO METHOT STRUGGLED TO BOUNCE BACK IN HOLLYWOOD AFTER DIVORCE, BOOK CLAIMS Audrey Hepburn is still celebrated as a film and style icon. (Getty) <mark>DEAN MARTIN</mark>'S DAUGHTER DEANA RECALLS GROWING UP WITH\" THE KING OF COOL,' THE RAT PACK AND <mark>JERRY LEWIS</mark> Fox News: It's been said that the filmmakers wanted an unknown for Audrey's role. Do you think this was a huge gamble for Hollywood at the time? Garrett: Yes. They didn't know anything about her [but] when she walked in the doors and delivered the lines, they said that on the spot there was no one else. They couldn't envision anything else happening there. She just blew them away. JUDY GARLAND'S EX-LOVER <mark>JOHN MEYER</mark> RECALLS THE STAR'S FINAL TUMULTUOUS MONTHS Audrey Hepburn plays cards with Gregory Peck in a scene from the film \"Roman Holiday,\" 1953. ((Photo by Paramount/Getty Images)) \"30S STAR THELMA TODD\" WAS BECOMING' TIRED \"OF HOLLYWOOD' BEFORE HER MYSTERIOUS DEATH, BOOK CLAIMS When she walked in, they basically booked her on the spot, and they wanted to make her a star. And the fact that she was up against a massive actor and held her own says everything about her. That's why she had such a long-standing career. Fox News: What can you tell us about the Oscar-winning costumes in\" Roman Holiday? \"Garrett: We are talking road trip demure decor here. It is the headscarf. It is the neck scarf. It is getting from A to B looking as fabulous as possible. Even in that era, the clothes were so perfect. But I think that the fact that it's\" Roman Holiday \"and it is traversing over different coastlines, those holiday-esque looks are just beautiful. And Audrey also perfected the updo with the glasses, and so all of that's in there as well .\" 30S STAR GRACIE FIELDS ENDURED PRESSURE TO LOOK GLAMOROUS, \"HAD ALL HER TEETH PULLED OUT,' BOOK CLAIMS American actor Gregory Peck (1916 - 2003) and Belgian-born actress Audrey Hepburn (1929 - 1993) embrace in a still from director William Wyler's film,\" Roman Holiday'. ((Photo by Hulton Archive/Getty Images)) \"40S STAR ROSALIND RUSSELL REFUSED TO PLAY SECOND FIDDLE TO CARY GRANT IN\" HIS GIRL FRIDAY,' BOOK SAYS Fox News: What's your favorite scene from the film and why? Garrett: The kiss! It's always so funny watching classic movies because they have to be very family-conscious with those sorts of moments. And I always love the fact that it's a very family-friendly moment, but they have a lot of chemistry behind it. [When it comes to classics it's] not usually about getting hot and heavy. It's about the moments that they share, and that's what you have in this film. So when it all comes together, that for me is the cherry on the top. ADVERTISEMENT", "articleID": "2020020911_00031548_W", "names": {"Dean Martin": ["Q5246331", "Q5246333", "Q5246334"], "Jerry Lewis": ["Q294927", "Q472199", "Q6183975"], "Jo Wood": ["Q39956380", "Q6204445"], "John Meyer": ["Q6248589", "Q6248590", "Q6248592"], "Ronnie Wood": ["Q211094", "Q7366031"]}}, {"date": "2020-02-10", "url": "https://www.oneindia.com/india/gargi-college-molestation-case-students-hold-protest-delhi-police-launches-probe-3030751.html?utm_source=/rss/news-india-fb.xml&utm_medium=2.23.97.70&utm_campaign=client-rss", "content": "For Quick Alerts Subscribe Now Here are your evening stories View Sample For Quick Alerts ALLOW NOTIFICATIONS For Daily Alerts Just In 8 min ago Explained: How Opposition, BJP allies cornered govt over SC order on SC/ST quota 1 hr ago Delhi Assembly Elections 2020: Key candidates to watch out for in AAP-BJP-Congress battle 2 hrs ago \"Water matters' exhibition opens in Chennai Must Watch Don't Miss Sports India's Jaiswal, Bishnoi, Tyagi named in ICC U-19 WC Team of Tournament Movies Taapsee Pannu Reacts To Smriti Irani's Praise For Thappad:\" Happy We All Connect On This Issue' Lifestyle 19 Best Herbal Teas For Reducing Stress And Anxiety Technology Oppo Reno 3 Vitality Edition Unveiled: Price, Specifications And More Automobiles Honda Dio BS6 Models Launched In India Starting At Rs 59,990: Dio’ing The New Way! Finance First Salary Account: Know List of Things to do Travel 10 Best Places To Visit In North India In February Education CBSE Exam Centre Locator App: Why Class 10 & 12 Students Should Download? News India Gargi college molestation case: Students hold protest; Delhi Police launches probe India oi-PTI By PTI | Published: Monday, February 10, 2020, 14:42 [IST] New Delhi, Feb 10: Scores of students of the all-women Gargi College on Monday held a protest against the alleged molestation of students by a group of men who had gatecrashed a cultural festival. The Delhi Police said it has launched a probe into the incident and is scanning CCTV footage. Police, however, have not received a complaint in this regard, a senior officer said. Over 100 students held a protest outside the gate of Gargi College on Monday. Students and teachers posted on social media about the incident. As per their posts, during the college festival, \"Reverie', around 6:30 pm on Sunday, groups of unruly, drunk men mobbed the entrances of the college and forced their way in. The students alleged that Rapid Action Force and Delhi Police personnel were deployed close to the gate from where the men allegedly entered .\" There was a complete lapse of security. NEWS AT 3 PM, FEB 10th, 2020 My skirt was lifted: Gargi College fest turns ugly, girls allege mass molestation The students were groped, molested and even assaulted by the men who all appeared to be in their mid-30s. The college had claimed to set up security but I don't think there must have been such an incident in any college campus across the country, \"a student said on condition of anonymity. Delhi Commission for Women (DCW) chief Swati Maliwal reached the spot to take stock of the situation. Deputy Commissioner of Police (South) <mark>Atul Kumar</mark> Thakur said appropriate action will be taken in the matter .\" We have not received a complaint in this regard yet. But we have began a sou-moto enquiry into the incident, \"the DCP said. Police are scanning footage of CCTV cameras to collect evidence and speaking to students to ascertain facts, he added. The enquiry is being conducted by Additonal DCP (South) Geetanjali Khandelwal, Thakur said. More STUDENTS News 3 Delhi metro stations shut as man opens fire at Jamia Student Bidar school faces sedition charge for\" portraying PM Modi in poor light' Visa for foreign students: Task force soon Pariksha Pe Charcha 2020: Modi urges students to have technology-free hour everyday JNU extends semester registration date yet again NHRC team visits Jamia Millia, 35 to 45 students ready to record statements TMC students' wing continues anti-CAA demonstration for fifth consecutive day JNU administration asks teachers to resume classes, issues advisory Rejected in polls, Left now uses students: Javadekar JNU violence video: Prasar Bharti junks claims by fact checkers JNU violence: 70 administrators of WhatsApp groups under scanner JNU protests: Yechury, Sharad Yadav join citizens' march at Mandi House For Breaking News and Instant Updates Allow Notifications You have already subscribed", "articleID": "2020021018_00288206_W", "names": {"Atul Kumar": ["Q41790058", "Q4818789", "Q57090004", "Q58207751"]}}]