[{"date": "2020-02-11", "url": "http://www.dailypioneer.com/2020/state-editions/amanatullah-wins-okhla-with-huge-margin.html", "content": "Home State Editions Delhi Amanatullah wins Okhla with huge margin Wednesday, 12 February 2020 | Staff Reporter | NEW DELHI Share T T T T 0 Amanatullah wins Okhla with huge margin Wednesday, 12 February 2020 | Staff Reporter | NEW DELHI The Aam Aadmi Party's (AAP) Amanatullah Khan won the Okhla seat by over 71,827 votes after defeating Bharatiya Janata Party's (BJP) Braham Singh. In the initial trends, Singh was leading by 194 votes, but <mark>Khan</mark> later took a huge lead and till the end of the counting retained the lead and won it with a huge margin. The city's Shaheen Bagh and Jamia Nagar fall under the Okhla constituency. Shaheen Bagh has become the epicentre of protest against the Citizenship (Amendment Act) as women with young children have been on a sit-in protest there for nearly two months. \"It is the victory of all of us. We all elected Amanat bhai (Amanatullah Khan) as our leader. He has helped the women and youth of this area in every sphere, that is, from health to education, infrastructure to jobs. He got many youth from this area employed,\" Shamima Bano from Shaheen Bagh said. Women protesters erupted in joy with loud rounds of applause as they hugged each other. \"The AAP truly brought development to an aam aadmi (common man). My kids go to a nearby Government school. We all go to the AAP government's Mohalla clinic for treatment. My mother-in-law is being treated for her knee problem since four years,\" Mehjabeen Qureshi said at the protest site. \"AAP understands the needs of its citizens,\" she added. There was also a wave of excitement in Batla House, Noor Nagar, Abu Fazal Enclave, Zakir Nagar and the adjoining areas when the news of the AAP winning big emerged. <mark>Asim Khan</mark>, a garment dealer said, \"We have seen Jamia Nagar change in the last five years. We voted for AAP's honesty and transparent policies. Not only Jamia Nagar, the entire Delhi voted for real\" vikas' (development) which is Arvind Kejriwal \". Sharvari (75) of Shaheen Bagh said,\" Amanatullah is like our son and his victory is not by chance. The AAP has understood the pulse of Delhi. Today we want to distribute \"biryani' to all those politicians who called our protest politically motivated and accused us of eating sponsored Biryani .\" The elections in the national capital took place in the midst of massive protests in the city and elsewhere over the new citizenship law, an issue which was strongly raised by the BJP top leadership during the campaigning which often turned bitter and vitriolic. Trending News Mallya arrives for High Court appeal against extradition to India Iran's Rouhani says Islamic Revolution \"unbearable' for US At least five dead in suicide attack in Kabul: officials Amazon wants to depose Trump over loss of military contract Guterres to visit Gurdwara Kartarpur Sahib during trip to Pakistan Coronavirus death toll in China crosses 1,000 Gunman dead, 2 officers hurt in shooting at Arkansas Walmart Elon Musk tweets #DeleteFacebook, says\" it's lame' Oscar Awards 2020: Complete list of Winners China praises PM Modi's letter to XI on coronavirus assistance Bong Joon Ho creates Oscar history with best picture win for \"Parasite' Iran satellite launch fails, in blow to space programme more State Editions Cabinet approves UP Groundwater Protection Bill 12 February 2020 | PNS | Lucknow CM stresses need for awareness on women empowerment 12 February 2020 | PNS | Lucknow 3-year-old girl raped, murdered in Sitpaur 12 February 2020 | PNS | Lucknow BJP MLA accused of raping widow 12 February 2020 | PNS | Lucknow Father of rape survivor shot dead by rapist 12 February 2020 | PNS | Lucknow Power Corporation Trust moves NCLT to recover dues from DHFL 12 February 2020 | PNS | Lucknow Delhi, Bhopal, Bhubaneswar, Ranchi, Lucknow, Chandigarh, Dehradun, Raipur Sunday Edition Eat safe to live well 09 February 2020 | Kavita Devgan | Agenda Time to love 09 February 2020 | Navneet Mendiratta | Agenda The art of ageing gracefully 09 February 2020 | Suparna Trikha | Agenda Astroturf | Astrology and destiny indications 09 February 2020 | <mark>Bharat Bhushan</mark> Padmadeo | Agenda Talktime |\" I'll never compromise on individuality' 09 February 2020 | Pioneer | Sunday Pioneer Kia ora with new connect 09 February 2020 | Shalini Saksena | Sunday Pioneer E-mail this link to a friend. Email of your friend: Your Name (Sender's): Your Email (Sender's): Subject: Home About Us Contact Us Advertise with us Archives © 2020 The Pioneer. All Rights Reserved. Site Designed and Developed by: Infomedia Web Solutions", "articleID": "2020021119_00099070_W", "names": {"Asim Khan": ["Q45845593", "Q4806970"], "Bharat Bhushan": ["Q30541659", "Q42119414", "Q42884182", "Q4901100", "Q57332897"]}}, {"date": "2020-02-11", "url": "http://www.irishnews.com/magazine/entertainment/2020/02/11/news/justin-bieber-gives-explicit-insight-into-marriage-to-hailey-baldwin-1840201/", "content": "Justin Bieber gives explicit insight into marriage to Hailey Baldwin The singer celebrated the imminent launch of his fifth album Changes with a performance in London. 11 February, 2020 22:51 Justin Bieber offered an explicit insight into his marriage to Hailey Baldwin during an intimate concert in London. The pop star, 25, told fans gathered inside the Indigo venue at the O2 Arena that he and his wife liked to \"Netflix and chill\" during their downtime. Asked by a fan what he did to relax, he said: \"It depends who I am with. When I am with my wife we...You guys can guess what we do all day. It gets pretty crazy sometimes, I can tell you that. Hailey Baldwin Bieber (Ian West/PA)\" Yeah, that's pretty much all we do, to be honest. We like to watch movies--to Netflix and chill. We do more of the chilling part. \"I play a lot of sports, as you guys know. I have been playing sports. Hockey and soccer. I have been playing a lot of hockey, which I really like .\" Justin and Hailey were first married in a secret ceremony in New York in September 2018, but exchanged vows for the second time in South Carolina in October. They have known each other for several years and started dating in 2016. They later split but rekindled their relationship in May 2018. Dressed in jeans, a black sweater and orange beanie, Bieber celebrated the imminent release of his fifth album Changes by performing a five-song set backed by two acoustic guitarists. Justin Bieber in London ahead of the concert (Yui Mok/PA) He paid tribute to Hailey, saying: \"I'm telling you, being married is so awesome. But don't get it twisted, marriage is not easy .\" It is something you have got to work for. If marriage was easy everybody would just do it really fast. \"If you guys want to be serious and get married just know it is not just something...It takes work .\" Every day you have to love that person, be kind to that person. It takes work because when you do it is powerful. It's just incredible. \"His set included the new tracks Yummy, Intention and Changes, as well as the 2015 song Love Yourself, during which he read lyrics from a phone. View this post on Instagram 3 days til #Changes A post shared by Justin Bieber (@ justinbieber) on Feb 11, 2020 at 8:59 am PST Bieber addressed how his experience of depression, drug use and Lyme disease had influenced the album. He said:\" The past couple of years have been, I'm not sure have you seen my new docu-series, but it has been a rough couple of years, just going through a lot of different changes. \"It has been interesting but I think this music really reflects the past few years--some of the hardships, some of challenges, some of the changes .\" I got married over the past few years to a beautiful beautiful lady, who I miss a lot. \"Asked which famous person he would like to meet, dead or alive, he replied:\" <mark>Muhammad Ali</mark>. \"Changes is released on February 14. Enjoy reading the Irish News? Subscribe from just £ 1 for the first month to get full access Subscribe Topics Showbiz Bieber UK Featured Hailey Baldwin Justin Bieber PA story composite Categories Entertainment 11 February, 2020 22:51 Entertainment", "articleID": "2020021123_00121536_W", "names": {"Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}}, {"date": "2020-02-12", "url": "https://www.mirror.co.uk/sport/football/news/mauricio-pochettino-pictured-ed-woodwards-21480036", "content": "Sign up to FREE daily email alerts from Mirror - Manchester United FC Subscribe We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights Thank you for subscribing We have more newsletters Show me See our privacy notice Invalid Email Mauricio Pochettino was pictured at Griffin Park alongside Ed Woodward's new advisor, Neil Ashton, on Tuesday night - after admitting his desire to return to work in the Premier League. Pochettino has been out of work since being sacked by Tottenham in November but has remained linked with the Manchester United job. With Ole Gunnar Solskjaer's struggling to get his rebuild off the ground, the Red Devils have been linked with a summer move for the Argetinian. As he continues to enjoy his downtime, Pochettino opted to take in Brentford's Championship clash with Leeds on Tuesday night. He was spotted on Sky Sports footage walking to his seat alongside Neil Ashton, recently employed by United's executive vice-chairman as a PR consultant. Mauricio Pochettino was pictured alongside Ed Woodward's new advisor at Griffin Park Read More Related Articles Anthony Martial lifts lid on relationship with Jose Mourinho after Man Utd tensions Read More Related Articles Mauricio Pochettino's dig at Arsenal as he declares pride over Tottenham tenure Pochettino was accompanied by assistant <mark>Jesus Perez</mark> as he watched the 1-1 draw at Griffin Park, although they are believed to have sat several rows away from Ashton. He is close friends with Leeds boss Marcelo Bielsa, whilst he was also spotted chatting to former Newcastle and Brighton boss Chris Hughton. Pochettino admitted he \"would love to work in the Premier League\" again as he eyes his next job. He told the In The Pink podcast: \"To be honest, I would love to work in the Premier League. Pochettino admits he would\" love \"to return to management in the Premier League (Image: Getty Images) Read More Related Articles Man Utd told not to play new signing <mark>Bruno Fernandes</mark> in No10 position\" It's going to be difficult, I know, and for now it's a moment to wait and we'll see what happens. \"It's a moment of recovery, to think about yourself a little bit, and to be ready because in football always something can happen and you need to be ready .\" I'm ready and waiting for a new challenge. I have the belief and confidence that the next challenge will be fantastic. \"Read More Mirror Football's Top Stories Pochettino issues come-get-me plea Why Wilder should beat Klopp to award Coutinho's honest Liverpool assessment Man Utd confident of signing Sancho Pochettino has long been linked with the United job, including when Spurs successor Jose Mourinho was sacked last December. Ole Gunnar Solskjaer eventually got the job and it is believed his job is not under immediate threat. But reports have claimed the club may reconsider his position if they miss out on the top four, with the looming presence of Pochettino meaning they could be tempted into action.", "articleID": "2020021208_00163623_W", "names": {"Bruno Fernandes": ["Q4979203", "Q4979316", "Q767698"], "Jesus Perez": ["Q1688453", "Q6188607"]}}, {"date": "2020-02-12", "url": "https://www.kmuw.org/post/after-iowa-debacle-lefts-tech-experts-say-dems-need-strategic-shakeup", "content": "After Iowa Debacle, Left's Tech Experts Say Dems Need A Strategic Shakeup By Laurel Wamsley • 55 minutes ago Share Tweet Email After the messy reporting of the Iowa caucus results, some who build tech for progressive causes say the approach to software development in this space needs rethinking. Daniel Acke / Bloomberg via Getty Images Democrats could avoid another tech meltdown like the one that afflicted the Iowa caucuses with a better strategy for building the tools they need, progressive technology specialists say. The origins of the Iowa debacle are in a boom-and-bust cycle that places technology in competition with other priorities as time-crunched campaigns grapple with how best to spend as they hurtle toward an election. \"The easy way to spend money, that's reliable, is on advertising,\" says Evan Henshaw-Plath, a technologist who has built applications for progressive causes and was an early employee at Twitter. \"Spending money on technology is riskier and may or may not pay off .\" When campaigns commence, they hire staff, open offices, buy ads. When the campaign ends, the contracts end and the offices close. Code that is written is often abandoned and forgotten. \"We're rebuilding everything from scratch each cycle for everything that isn't finance and compliance,\" Henshaw-Plath says. \"We aren't funding organizations that can survive from one cycle to the next,\" he adds. \"We aren't funding the technology to be maintained from one cycle to the next. And we aren't releasing the code in a maintainable way and picking up again on the next cycle .\" Light falls on Shadow After the Iowa caucus, the spotlight swung to Shadow, the small tech company that built the glitchy application precinct chairs were supposed to use to report results. Shadow's primary business is operating two applications for the progressive movement: a messaging product and a data integration tool. The caucus app's lackluster performance brought scrutiny of the connections between Shadow, its main investor Acroynm, and various figures and campaigns in the Democratic Party. Such connections are no surprise in this corner of the tech world: It's common practice for Democratic candidates and Democratically-aligned causes to use political tools and technologies developed specifically for the left. There are essentially separate, parallel universes of tech vendors that develop tools for either Democrats or Republicans--but not both. \"It is a pretty deeply held value within the progressive community that you want to put your money where your values are,\" says Brady Kriss, the founder and executive director of Ragtag, a company that corrals tech workers who want to volunteer their skills to help progressive causes. \"It's not just about political competition. You don't want your money in any way, directly or indirectly, to go towards supporting issues or candidates that you find morally problematic .\" Some tech experts have pointed out that popular mainstream applications like Google Forms might have been a better choice for Iowa, rather than relying on a custom-designed app built on a small budget under time pressure. Using products already in wide commercial use has another benefit: they're likely to be supported and maintained. \"If you're building on top of that, you don't have to worry about that infrastructure,\" Kriss says. \"That really helps with the cyclical nature of campaigns and campaign tech. Because it's very, very hard to keep a small application like a phone app or a large database base application updated when every other year, no one cares .\" Building beyond the campaign cycle Advocates and entrepreneurs have tried to target the boom-bust dynamic. Higher Ground Labs--a venture capital firm with the mission of supporting progressive tech companies \"for experimentation and iteration that's no longer dependent on election dates\" --was an investor in the company went on to become Shadow. But <mark>Ann Lewis</mark>, chief technology officer for MoveOn.org, says that cyclical fundraising cycles continue to affect progressive tech vendors. One particular challenge she's noticed: A lot of the money for tech arrives in September, just two months before a November election. \"That's often not enough time to really take advantage of the surge of funding in software teams,\" she says. What more money often buys is more staff--but adding engineers to a tech project only a few months before launch actually can hinder the team's speed and efficiency, <mark>Lewis</mark> says. Recurring donations can smooth out spiky funding. But when it comes to structural change, <mark>Lewis</mark> has one big request: open source software, frameworks, and collaboration spaces. Open source software means anyone can access and build on the code. The most common place for developers to share their code and collaborate is the online platform Github. If political tech developers did make more software open source, <mark>Lewis</mark> says they might be able to break free from election-driven peaks and valleys--and sustain applications long enough to make them relevant for more than one campaign cycle. \"Not all projects will be successful and not all projects will live forever. There's a constant evolution in the frameworks and tools that we use to build any kind of software,\" she says. \"But I think investing in open source early is a way to let the best software rise to the top and live past that campaign horizon .\" Copyright 2020 NPR. To see more, visit https: //www.npr.org. Share Tweet Email", "articleID": "2020021216_00292035_W", "names": {"Ann Lewis": ["Q2850402", "Q4766506", "Q58416597"]}}, {"date": "2020-02-12", "url": "https://www.libdemvoice.org/tag/welsh-culture", "content": "<mark>John Marriott</mark> 12th Feb - 4:11 pm I have to hand it to all those \"recent' Lib Dem members for their enthusiasm. It's always fascinating when people keep trying to reinvent the...<mark>William Francis</mark> 12th Feb - 3:33 pm @ Toby Keynes @ William:\" I would add that you aren't actually proposing that consumers own 50% of the utility: if you can't sell your shares, you...Michael 1 12th Feb - 3:29 pm In general electoral pacts with one party standing down for another in particular seats do not work in British FPTP politics if that's what is...<mark>William Francis</mark> 12th Feb - 3:10 pm @ Innocent Bystander \"But this is for customers not employees and in this scenario the customers who have invested nothing (in a 51% case) get to...<mark>William Francis</mark> 12th Feb - 3:09 pm @ Innocent Bystander\" If the company expands and has more customers, does the govt have to buy more of the traded shares to supply the ...", "articleID": "2020021216_00335981_W", "names": {"John Marriott": ["Q18342977", "Q6246820"], "William Francis": ["Q42319715", "Q8009298"]}}, {"date": "2020-02-13", "url": "http://basildonrecorder.co.uk/news/18234023.nile-ranger-unfinished-business-southend-united-honestly-play-nothing/", "content": "News Nile Ranger: I have unfinished business with Southend United, I'll honestly play for nothing By <mark>Chris Phillips</mark> @ cjphillips1982 Chief sports reporter Wanting a return - Nile Ranger is keen to come back to Southend United 0 comment NILE Ranger is willing to return to Southend United for free. The 28-year-old striker has not played since leaving the Shrimpers in January 2018. But the former Newcastle United forward is eager to come back to Blues and willing to play without being paid. \"I would love to come back to Southend and I'll play for free,\" Ranger told Echosport. \"I feel like I owe it to the fans because they've been so loyal to me .\" I've never known a player have three songs but they had that for me when I was there. \"They would sing them back-to-back and it meant a lot to me .\" I class myself as a Southend fan now myself and seeing the results coming in this season has been horrible so I want to help. \"It didn't finish properly with Southend either so I feel like I have unfinished business as well .\" The former Newcastle United striker scored 10 goals in 49 games for Blues but was regularly fined for poor timekeeping. And Ranger now regrets how he behaved at Roots Hall. \"I took the mick really being late all the time but I've learnt from that and I'm so hungry to play,\" said Ranger. \"I've had offers coming in to play but nothing my heart is in but my heart is definitely in Southend so it's different .\" I didn't even want to get paid, I just want to play and I need a door to open for me really. \"Ranger has been hit by off the field controversies throughout his career. But he insists that is no longer a problem .\" I'm 28 now and I don't have time to be messing around like that anymore, \"said Ranger .\" I know maybe the manager Sol Campbell might look at me and think he can't trust me because of what's happened off the field but that's all in the past. \"I want to help Southend and whether or not it's too late I want to help us get up the table .\" Plus if I don't even want to get paid, why would you say no? \"And Ranger also feels fit enough to play .\" I've kept myself ticking over and would just need that match sharpness back, \"said Ranger .\" I could come off the bench and then be fully fit in three weeks. \"I could definitely come in and do a job .\" I'm not messing around anymore, I want to play and I want to play for Southend. \"0 comment", "articleID": "2020021316_00267755_W", "names": {"Chris Phillips": ["Q1077658", "Q15994688", "Q48516835", "Q5107750", "Q5107753", "Q55119851"]}}, {"date": "2020-02-14", "url": "http://radionz.co.nz/news/ldr/409563/blenheim-business-hub-concerns-raised-in-new-report", "content": "Blenheim business hub concerns raised in new report 31 minutes ago Chloe Ranford,, Local Democracy Reporter Business leaders in Marlborough fear \"competition\" and looking like a \"council puppet organisation\" if they worked together under one roof. Business groups in Blenheim are in talks over a business hub. Photo: LDR / Chloe Ranford A report detailing the pros and cons of a business hub has been released by four of the region's business groups and the Marlborough District Council - who have christened themselves \"Marlborough Inc'. The idea was first pitched during last year's annual plan, when the Marlborough Chamber of Commerce asked the council to fund a feasibility study into a business hub. The council instead offered to run meet-ups to pinpoint how to better support local businesses. It had since held three meetings with Destination Marlborough, Marlborough Chamber of Commerce, Business Trust Marlborough and the Blenheim Business Association (BBA), the report said. Council strategic planning and economic development manager <mark>Neil Henry</mark> said the organisations had supported an investigation into possible business hub costs, and creating a more\" cohesive \"business model. But their report showed the organisations were concerned that setting up a hub would cause a loss of brand identity and independence,\" community confusion \", and difficulties over who owned the building and its data. Written under the\" cons' section were people's worries, including: \"[the] bad performance of one partner effecting all\" , \"[being] tarred with the same brush\" and \"dominant personalities winning out\". Business Trust Marlborough also queried the potential cost of renting a space in the hub, as their current lease was $285 a month. Benefits of a business hub included reductions in duplication, a potential reduction in costs, and a \"vibrant work environment\". \"[It could allow] cover while I am on holiday,\" one person wrote. Marlborough Chamber of Commerce CEO Hans Neilson pitched the idea of a business hub to the Marlborough District Council last year. Photo: LDR / Chloe Ranford <mark>Henry</mark> said a hub would also prove Marlborough was \"open for business', and could entice central government agencies to set up. The organisations noted under an\" insights' prompt that the business hub might need to be located outside Blenheim's town centre, and that moving in together could encourage a lower infrastructure footprint. <mark>Henry</mark> pointed out that a business hub was not needed to build a more cohesive business system, which the organisations were working on. The proposed system, which could be put down instead of or before a business hub's establishment, encouraged the organisations to discuss each other's services to clients and share reporting. Business Trust Marlborough manager and councillor <mark>Brian Dawson</mark>, who could not vote on the report due to conflict of interest, said to keep or scrap the business hub was a \"big decision\". He went with Marlborough Chamber of Commerce chief executive Hans Neilson to Hawkes Bay in September last year to pilfer ideas from its business hub, which covered a region, like Marlborough. \"Like all things, there's advantages and disadvantages,\" he said. Hawkes Bay's business hub was \"no doubt\" the go-to place for businesses, but there was also \"an air of very stiff competition\". \"This is fine for bigger corporations, but the smallers ones have to constantly carve out a space in a client's mind,\" <mark>Dawson</mark> said. \"All events have multiple organisations attached to them. Sponsors don't know whether to sponsor one organisation or all of them .\" <mark>Henry</mark> said the organisations would decide whether to submit a funding request to the council's 2020-21 annual plan in April, and would consider opening the meetings to others in future. Until then, they aimed to complete several \"quick wins', like streamlining event calendars to\" remove duplication \", and publishing each other's business pitch to their personal websites to\" helped present a united \"Marlborough Inc' face\" , he said in his report. The organisations would continue to meet monthly to \"improve collaboration\". Local Democracy Reporting is a public interest news service supported by RNZ, the Newspaper Publishers' Association and NZ On Air. Share this", "articleID": "2020021405_00171029_W", "names": {"Brian Dawson": ["Q15992895", "Q18378941", "Q4963533"]}}]