[{"date": "2020-02-14", "url": "http://radionz.co.nz/news/ldr/409563/blenheim-business-hub-concerns-raised-in-new-report", "content": "Blenheim business hub concerns raised in new report 31 minutes ago Chloe Ranford,, Local Democracy Reporter Business leaders in Marlborough fear \"competition\" and looking like a \"council puppet organisation\" if they worked together under one roof. Business groups in Blenheim are in talks over a business hub. Photo: LDR / Chloe Ranford A report detailing the pros and cons of a business hub has been released by four of the region's business groups and the Marlborough District Council - who have christened themselves \"Marlborough Inc'. The idea was first pitched during last year's annual plan, when the Marlborough Chamber of Commerce asked the council to fund a feasibility study into a business hub. The council instead offered to run meet-ups to pinpoint how to better support local businesses. It had since held three meetings with Destination Marlborough, Marlborough Chamber of Commerce, Business Trust Marlborough and the Blenheim Business Association (BBA), the report said. Council strategic planning and economic development manager <mark>Neil Henry</mark> said the organisations had supported an investigation into possible business hub costs, and creating a more\" cohesive \"business model. But their report showed the organisations were concerned that setting up a hub would cause a loss of brand identity and independence,\" community confusion \", and difficulties over who owned the building and its data. Written under the\" cons' section were people's worries, including: \"[the] bad performance of one partner effecting all\" , \"[being] tarred with the same brush\" and \"dominant personalities winning out\". Business Trust Marlborough also queried the potential cost of renting a space in the hub, as their current lease was $285 a month. Benefits of a business hub included reductions in duplication, a potential reduction in costs, and a \"vibrant work environment\". \"[It could allow] cover while I am on holiday,\" one person wrote. Marlborough Chamber of Commerce CEO Hans Neilson pitched the idea of a business hub to the Marlborough District Council last year. Photo: LDR / Chloe Ranford <mark>Henry</mark> said a hub would also prove Marlborough was \"open for business', and could entice central government agencies to set up. The organisations noted under an\" insights' prompt that the business hub might need to be located outside Blenheim's town centre, and that moving in together could encourage a lower infrastructure footprint. <mark>Henry</mark> pointed out that a business hub was not needed to build a more cohesive business system, which the organisations were working on. The proposed system, which could be put down instead of or before a business hub's establishment, encouraged the organisations to discuss each other's services to clients and share reporting. Business Trust Marlborough manager and councillor <mark>Brian Dawson</mark>, who could not vote on the report due to conflict of interest, said to keep or scrap the business hub was a \"big decision\". He went with Marlborough Chamber of Commerce chief executive Hans Neilson to Hawkes Bay in September last year to pilfer ideas from its business hub, which covered a region, like Marlborough. \"Like all things, there's advantages and disadvantages,\" he said. Hawkes Bay's business hub was \"no doubt\" the go-to place for businesses, but there was also \"an air of very stiff competition\". \"This is fine for bigger corporations, but the smallers ones have to constantly carve out a space in a client's mind,\" <mark>Dawson</mark> said. \"All events have multiple organisations attached to them. Sponsors don't know whether to sponsor one organisation or all of them .\" <mark>Henry</mark> said the organisations would decide whether to submit a funding request to the council's 2020-21 annual plan in April, and would consider opening the meetings to others in future. Until then, they aimed to complete several \"quick wins', like streamlining event calendars to\" remove duplication \", and publishing each other's business pitch to their personal websites to\" helped present a united \"Marlborough Inc' face\" , he said in his report. The organisations would continue to meet monthly to \"improve collaboration\". Local Democracy Reporting is a public interest news service supported by RNZ, the Newspaper Publishers' Association and NZ On Air. Share this", "articleID": "2020021405_00171029_W", "names": {"Neil Henry": ["Q15442583", "Q6988735"]}}, {"date": "2020-02-14", "url": "https://www.truthdig.com/articles/panicked-over-sanders-elites-turn-to-bloomberg/", "content": "Feb 14, 2020 Print Bookmark Opinion | TD originals Panicked Over Sanders, Elites Turn to...Bloomberg? comments Share on Facebook Share on Twitter Share on Reddit Email this link Michael Bloomberg, the former mayor of New York and Democratic presidential candidate, is having a moment. After polling at only a few single digits last year, he is now emerging as a top-tier candidate, pushing past former Vice President Joe Biden to claim a spot far closer to the top of the polls. One could attribute this rise to the insane amount of cash he has spent on his campaign--more than $200 million so far--out of his own bottomless pockets to blast commercials on every platform as he sells himself to the public. Now, liberal pundits are contemplating things like, \"It is time to earnestly consider the possibility that Bloomberg will be the Democratic nominee for president .\" But are we honestly considering him a serious candidate? Bloomberg's main stint with politics was as mayor of New York City from 2002 to 2013, during which time he pushed aggressively to criminalize and racially profile people of color under the guise of the \"stop and frisk\" policing model. The idea was simple: Preemptively arrest poor Black and Latino men, and crime rates would magically drop. Thousands of men were ruined in Bloomberg's dragnet, and the policy persisted until legal challenges forced the city to end the program with a judge declaring it unconstitutional. In launching his bid for the White House last year, Bloomberg stood in front of black congregants at a church and said, \"I want you to know that I realize back then I was wrong .\" Perhaps the billionaire candidate simply expected that his money would wash the stench of racism away. But then, this week, the audio of a speech he gave just five years ago at the Aspen Institute defending \"stop-and-frisk\" became public. The recording, posted by independent journalist Benjamin Dixon, reveals Bloomberg saying: Ninety-five percent of your murders--murderers and murder victims--fit one M.O.. You can just take the description, Xerox it and pass it out to all the cops. They are male, minorities, 16 to 25. That's true in New York, that's true in virtually every city. And that's where the real crime is ....You want to spend the money, put a lot of cops in the streets. Put the cops where the crime is, which means minority neighborhoods. And the way you get the guns out of the kids' hands is to throw them up against the wall and frisk them. Bloomberg likely knew soon after he said this that his comments were unconscionable--he asked the Aspen Institute not to distribute the video footage of his speech. The words are on par with the type of racism President <mark>Donald Trump</mark> has spewed and shows a shocking disdain for the Constitution on par with that of a radical right-wing extremist (after all, Bloomberg won his self-funded race for mayor of New York City as a Republican). As part of the damage control over the devastating audio clip, Bloomberg said in a statement, \"I inherited the police practice of stop-and-frisk, and as part of our effort to stop gun violence it was overused. By the time I left office, I cut it back by 95%, but I should've done it faster and sooner .\" But Bloomberg left his mayoral office in 2013. Two years later, he was still defending his racist policy in public. The Intercept's Lee Fang delved into the actual numbers and found that, far from cutting back the program by 95%, Bloomberg actually increased arrests by seven times during his tenure. Bloomberg has been caught in a lie. Aren't we done electing liars? Perhaps Bloomberg hopes white liberals can set aside any misgivings about his racism simply because they are fantasizing about the unlimited access to his campaign cash to defeat <mark>Trump</mark>. Bloomberg is currently the ninth richest person on the entire planet. In a sincere sounding op-ed in the New York Times, he explained how \"the rewards of the economy are far too concentrated at the top,\" and that he is \"making the system fairer and more progressive, including by increasing taxes on wealthy people like me .\" But only three years ago, Bloomberg--in a conversation with the then-head of the International Monetary Fund, Christine La Garde--explained that he was in favor of regressive taxation because it helped socially engineer poor people's habits: Taxes are regressive, yes they are. That's the good thing about them because the problem is in people that don't have a lot of money and so higher taxes should have a bigger impact on their behavior and how they deal with themselves. So I listen to people saying, \"Oh we don't want to tax the poor .' Well, we want the poor to live longer so that they can get an education and enjoy life. And that's why you do want to do exactly what a lot of people say you don't want to do.... If you raise taxes on full sugary drinks, for example, they will drink less and there's no question that full sugared drinks are one of the major factors in obesity and obesity is one of the major factors to heart disease. While this clip has not received as much attention as Bloomberg's defense of\" stop-and-frisk, \"it is just as instructive about his attitude toward low-income people. A multibillionaire's opinion of those on the bottom rung of society is--unsurprisingly--utterly distorted by his obscene wealth. How exactly can a racist, classist billionaire be favored by Democrats? As Vermont Sen. Bernie Sanders continues to build momentum, the liberal establishment is in full panic mode. All of the superficial criticism they have cast at Sanders--that he's an old white man who has been a Democrat for barely a minute--apply just as equally to Bloomberg. But what is most critically important to Bloomberg's backers is that his politics are the polar opposite of Sanders. Just days after the disastrous Iowa caucuses, the Washington Post's <mark>Eugene Robinson</mark> bizarrely declared Bloomberg\" the biggest winner, \"even though he skipped the caucuses. <mark>Robinson</mark>'s reasoning was that\" the chaos in the Democratic Party and <mark>Trump</mark>'s White House are making Bloomberg's argument for him. \"The New York Times' Thomas Friedman this week opined that Bloomberg\" has the best chance to carry the day \"in a match-up against <mark>Trump</mark> and that he is\" a moderate progressive with a heart of gold but the toughness of a rattlesnake. \"The words\" moderate progressive \"are code for\" not a Democratic Socialist like Bernie Sanders. \"Defenders of the establishment are terrified that in a bid to sweep away <mark>Trump</mark> and his policies, too many Americans will want to strip wealthy liberals of their power and money as well. For all the fears that Democrats have about a Sanders' nomination, the worst that <mark>Trump</mark> could accuse Sanders of doing is sticking to a set of economic, racial and gender justice principles for 40 years. He could harp on Sanders' avowed socialism, but polls show Americans are actually quite receptive to socialism. He could lie and call Sanders a communist, but the Senator could retort, as he has already done,\" Obviously I am not a communist, \"even if <mark>Trump</mark>\" maybe doesn't know the difference. \"In demonizing Sanders and all he represents, <mark>Trump</mark> is siding with the likes of former Goldman Sachs CEO Lloyd Blankfein, who is so terrified of Sanders he worried the senator would\" ruin the economy \"as president. By that comment, Blankfein of course means that Sanders plans to upend an economy that is working very well for him and terribly for the rest of us. <mark>Trump</mark>, Wall Street executives and wealthy elites like Blankfein and Bloomberg are all arrayed against threats to the corporate stranglehold on America. They are all part of the same team, and yet establishment Democrats claim there is a difference between <mark>Trump</mark> and Bloomberg. As Biden and Sen. Elizabeth Warren dip in the polls, Bloomberg's numbers are rising. In a head-to-head matchup with <mark>Trump</mark>, one poll showed him beating the president by the widest margin of all Democratic candidates. But Bloomberg has so far benefitted from scant media coverage and as journalists dig deeper, his many skeletons are tumbling out of the closet. He has also not yet faced his challengers on a debate stage. If he does cinch the nomination, picture <mark>Trump</mark> ripping him apart over his comments about crime in minority neighborhoods and his patronizing attitudes toward poor people. Sanders surrogate Nina Turner, in a recent interview on MSNBC, dared to call Bloomberg an\" oligarch \"and raised the ire of liberal pundits. But the word\" oligarch \"is defined as a member of a nation's economic elite unfairly using their status and money to wield power. Former Labor secretary and popular progressive author Robert Reich explained that, yes, at this stage, anyone is better than <mark>Trump</mark> and that\" [o] ligarchy is better than tyranny. \"But, he added,\" neither is as good as democracy. \"Bloomberg's immense wealth allows him to bypass the traditional reins of accountability that the public has over a candidate running for election. Bloomberg doesn't need the public to donate to his campaign, and therefore there is no guarantee that as president he would care about serving the public. Already with <mark>Trump</mark> in the White House, we are suffering the ill effects of an unaccountable wealthy person who cares more about his money than his country. How can anyone who wants to defeat <mark>Trump</mark> want to replace him with someone not unlike him? Sonali Kolhatkar Columnist Sonali Kolhatkar is a columnist for Truthdig. She also is the founder, host and executive producer of\" Rising Up With Sonali, \"a television and radio show that airs on Free Speech TV (Dish Network, DirecTV,...In this article: 2020 aspen institute bernie sanders bloomberg democrat <mark>donald trump</mark> election gop michael bloomberg racism republican stop and frisk taxes thomas friedman comments Share on Facebook Share on Twitter Share on Reddit Email this link", "articleID": "2020021417_00238542_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Eugene Robinson": ["Q5407694", "Q5407695"]}}, {"date": "2020-02-12", "url": "http://yasstribune.com.au/story/6626997/birdlife-australia-urges-residents-to-keep-their-eyes-on-the-skies/?cs=1554", "content": "Birdlife Australia urges residents to keep their eyes on the skies whatsapp FOWL: Birdlife Australia has urged members of the community to contribute to science by counting birds. Photo: Hannah Neale. Everyday people have been encouraged to grab their binoculars and take out their phones to help scientists record bird population numbers after recent fires. Birdlife Australia has urged members of the community to contribute to science by counting birds. The observations will be critical to inform post-bushfire recovery planning. READ ALSO: Food, fun and dancing at Goulburn Multicultural Festival Budding citizen scientists can download the Birdata app or head to the web page to get involved with the project. Goulburn Field and Naturalist Society president Frank Antram, known as the \"Bird Man', said the full effects of bushfires to the bird population were not yet known .\" A lot of their habitat has been destroyed and it'll take a couple of years before we understand the impact, \"he said .\" If there is no habitat and food they are not going to survive, it will take years to come back. \"Despite this Mr Antram said birds were quite resourceful. The Goulburn Field and Naturalist Society has been involved with survey work for NSW Parks and Wildlife and other organisations .\" We [donate our time] because we like to do it,' Mr Antam said. CHECK OUT: Public schools maintain $4m A preliminary study by Birdlife Australia revealed 19 species of bird had more than half of their habitat heavily impacted by fire, and another 58 had lost more than a third. Head of research <mark>James O'Connor</mark> said \"the number of threatened Australian birds may rise by over 25 per cent in a matter of months, it's staggering and tragic .\" \"We're picking ourselves up and dusting ourselves off for the challenges ahead .\" Once we've completed these assessments, the next steps are to get people out there to see what is left, find the refuges fire has spared, and start working to protect them. \"These birds are going to need a lot of help on the ground, whether that be translocating birds, providing emergency food resources, or working with fire managers to improve protection from future fires .\" Birdlife Australia urged people to only enter bushfire affected areas when it was safe to do so. Head to birdata.birdlife.org. au for more information and to record numbers. READ MORE: Why global warming is such a turn-off for Canberra's favourite bir d While you're with us...Did you know the Goulburn Post is now offering breaking news alerts and a weekly email newsletter? Keep up-to-date with all the local news: sign up here.", "articleID": "2020021520_00299038_W", "names": {"James O'Connor": ["Q1992813", "Q2203638", "Q30147930", "Q6140465", "Q6140467"]}}, {"date": "2020-01-21", "url": "http://news.rutgers.edu/jonathan-holloway-named-21st-president-rutgers-state-university-new-jersey/20200121#.Xid6nUc3mUl", "content": "<mark>Jonathan Holloway</mark> Named 21st President of Rutgers, The State University of New Jersey <mark>Jonathan Holloway</mark> Named 21st President of Rutgers, The State University of New Jersey <mark>Holloway</mark> to begin presidency on July 1 after successful tenures at Northwestern, Yale January 21, 2020 <mark>Jonathan Holloway</mark>, provost of Northwestern University and an eminent historian, has been appointed the university's 21st president. Photo: Courtesy of Northwestern University dory.devlin @ rutgers.edu <mark>Jonathan Holloway</mark>, provost of Northwestern University and an eminent historian, has been appointed the 21st president of Rutgers, The State University. The Rutgers Board of Governors, with the advice and consent of the Rutgers Board of Trustees, today approved <mark>Holloway</mark>'s appointment at a joint meeting of the two boards. The Board of Governors also appointed <mark>Holloway</mark> as a University Professor and Distinguished Professor. <mark>Holloway</mark> will begin serving as president on July 1, 2020, succeeding President Robert Barchi, who began his tenure in September 2012. <mark>Holloway</mark>, 52, has served as Northwestern University provost since 2017. He is Northwestern's chief academic officer, overseeing educational policies and academic priorities, preparation of the annual budget and faculty appointments and promotions at the Big Ten institution which includes a highly ranked medical school and numerous other nationally and internationally recognized educational programs. Before moving to Northwestern, <mark>Holloway</mark> was the dean of Yale College and Edmund S. Morgan Professor of African American Studies, History, and American Studies at Yale University. At Northwestern, he also is a professor of History and African American studies, specializing in post-emancipation social and intellectual United States history. \"<mark>Jonathan Holloway</mark> is an extraordinarily distinguished scholar with an outstanding record as an academic administrator at Northwestern and Yale. He is thoughtful, visionary, inclusive and decisive. He leads with remarkable integrity, and is just the right person to build upon Rutgers' long tradition as an academic and research powerhouse,\" said Rutgers Board of Governors Chair Mark Angelson who also chaired the presidential search committee. \"Selecting our university president is perhaps the Board of Governors' most important responsibility. We are confident that we have chosen the best person to lead Rutgers into the future,\" he said. President-Designate <mark>Jonathan Holloway</mark> gives remarks after his appointment as the 21st president of Rutgers University. Rutgers University/Nick Romanenko <mark>Holloway</mark> received a bachelor's degree with honors in American Studies from Stanford University and a Ph.D. in History from Yale University. He began his academic career at the University of California, San Diego, before joining the faculty at Yale in 1999. \"I was drawn to the opportunity at Rutgers University because of its amazing history, its foundation of excellence in teaching and its ambition to continue conducting life-changing research that improves our communities, our country and our world,\" <mark>Holloway</mark> said. \"Bob Barchi's extraordinary leadership has helped place Rutgers among the preeminent public universities in the world,\" he added. \"I cannot wait to help write the next chapter in the history of this magnificent institution .\" <mark>Holloway</mark> is the author of Confronting the Veil: Abram Harris Jr., E. Franklin Frazier, and Ralph Bunche, 1919-1941 (2002) and Jim Crow Wisdom: Memory and Identity in Black America Since 1940 (2013), both published by the University of North Carolina Press. He edited Ralph Bunche's A Brief and Tentative Analysis of Negro Leadership (NYU Press, 2005) and coedited Black Scholars on the Line: Race, Social Science, and American Thought in the 20th Century (Notre Dame University Press, 2007). He wrote the introduction for the 2015 edition of W.E.B. Du Bois's Souls of Black Folk (Yale University Press), has submitted a survey tentatively titled \"The Cause of Freedom: A Concise History of the African American Past\" for Oxford University Press and is working on a new book, A History of Absence: Race and the Making of the Modern World. He serves on boards of the Chicago Botanic Garden, Illinois Humanities, the National Humanities Alliance, the Society for United States Intellectual History and the Organization of American Historians. <mark>Holloway</mark> is an elected member of the prestigious American Academy of Arts and Sciences and the Society of American Historians. <mark>Holloway</mark> is married to Aisling Colón. They have a daughter, Emerson, and son, Ellison. The 23-member presidential search committee, comprising broad representation from the universitywide community, including students, alumni, faculty, staff and members of university boards, received more than 200 nominations and applications. Vice chairs of the committee, convened in September 2019, are Deborah Gray White, Board of Governors Professor of History and professor of women's and gender studies in the School of Arts and Sciences at Rutgers University-New Brunswick, and William Best, a Board of Governors member, former chair of the Board of Trustees and an emeritus trustee. Watch President-Designate <mark>Jonathan Holloway</mark>'s full remarks to the boards Media Contact", "articleID": "2020021718_00004490_W", "names": {"Jonathan Holloway": ["Q21662983", "Q6273415"]}}, {"date": "2020-02-18", "url": "http://www.gamereactor.eu/mafia-tactics-game-empire-of-sin-held-back-until-autumn/?sid=9819c80aabbe905ad51e1f0eef2c9473", "content": "Empire of Sin Mafia tactics game Empire of Sin held back until autumn Romero Games' Prohibition-era strategy title is being held behind bars until it has well and truly learned its lesson. 2020-02-18 12:03 <mark>Mike Holmes</mark> We've just heard that Empire of Sin, the Prohibition-era strategy game by Romero Games, has been delayed, with the planned spring launch window now looking more like autumn 2020. \"The challenges in making a game like no-one has made before is exactly that - making a game no-one has made before. It takes time to get everything right and presents us with some unique opportunities. I am grateful we are taking the additional time to polish\" , game director Brenda Romero said of the delay. We got our hands on Empire of Sin at Gamescom and our impression at the time was the gangster-filled strategy title had a lot of promise but needed polish and bit more variety. That being the case, news of this slight delay isn't hugely surprising, yet we remain excited at the prospect of playing the finished article once it's done. Empire of Sin is heading to PC, PS4, Switch, and Xbox One. You watching", "articleID": "2020021903_00094723_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}}, {"date": "2020-02-19", "url": "http://www.whitsundaytimes.com.au/news/contract-up-soon-for-snakes-coach-of-the-year/3948469/", "content": "MELBOURNE, AUSTRALIA--FEBRUARY 16: <mark>Mike Kelly</mark> of the Taipans poses with the award for Coach of the Year during the 2020 Andrew Gaze MVP and Awards Night at Crown Palladium on February 16, 2020 in Melbourne, Australia. (Photo by Graham Denholm/Getty Images) Basketball Contract up soon for Snakes' coach of the year by Jordan Gerrans 19th Feb 2020 3:00 PM premium_icon Subscriber only 0 <mark>Mike Kelly</mark> is a basketball coach in a unique situation. Over the past week, the second-year Snakes mentor has lifted his club into the finals and won the coach of the year trophy in a landslide. But, if his club are sent packing by the Perth Wildcats in a few weeks time, the smiling <mark>Kelly</mark> has no certainty around his coaching future, with his two-year contract set to expire at the end of the 2019-20 NBL campaign. All season, the 52-year-old has said negotiations between he and the club are positive. But, it does present a curious circumstance: arguably the best coach in the NBL right now is not locked up into season 2020-21 and beyond. MELBOURNE, AUSTRALIA--FEBRUARY 13: Taipans head coach <mark>Mike Kelly</mark> reacts during the round 20 NBL match between Melbourne United and the Cairns Taipans at Melbourne Arena on February 13, 2020 in Melbourne, Australia. (Photo by Daniel Pockett/Getty Images) <mark>Kelly</mark>, who was 26 votes clear in voting for the Lindsay Gaze Trophy - Coach of the Year ahead of Sydney's Will Weaver, is not too fussed about his potential future deal with a semi-final just around the corner. \"I am not going to talk about contract stuff...I love it here and everything is going great with the club,\" <mark>Kelly</mark> said following training on Wednesday. \"Everything is looking great for myself and the club. MELBOURNE, AUSTRALIA--FEBRUARY 16: <mark>Mike Kelly</mark> of the Taipans speaks after being awarded Coach of the Year during the 2020 Andrew Gaze MVP and Awards Night at Crown Palladium on February 16, 2020 in Melbourne, Australia. (Photo by <mark>Kelly</mark> Defina/Getty Images)\" I appreciate everything that we have been through as a club and for me it has been a great learning experience and a great way to come out at the end of the regular season, winning the award. \"It is all positive right now .\" Stretch forward Majok Deng missed training on Wednesday morning with the flu. With Deng not at the session, local training player Mason Khalu saw game time in the scrimmage to finish practice. The young combo-guard did not look out of place playing against the professional Snakes roster. Meanwhile, the total attendance for the 2019-20 NBL regular season increased by 21 per cent, with all clubs enjoying bigger crowds as the league continues to grow. The Cairns Taipans had 61,917 fans attend games at the Cairns Convention Centre, a two per cent increase on last season as they rose from bottom of the ladder to the finals. More Stories Aussie superstar calls out rude NBA fan premium_icon Taipans' superb Serb smiling premium_icon The two losses that cost Bullets shot at NBL title premium_icon Wright: I'm to blame for Sixers woes United secure last-gasp NBL finals spot Show More More Stories Aussie superstar calls out rude NBA fan premium_icon Taipans' superb Serb smiling premium_icon The two losses that cost Bullets shot at NBL title premium_icon Wright: I'm to blame for Sixers woes United secure last-gasp NBL finals spot Show More 0 basketball Read More Login to follow cairns taipans Read More Login to follow <mark>mike kelly</mark> Read More Login to follow nbl Read More Login to follow basketball cairns taipans <mark>mike kelly</mark> nbl", "articleID": "2020021906_00066428_W", "names": {"Mike Kelly": ["Q1431761", "Q3857414", "Q543294", "Q6378243", "Q6847486", "Q6847487", "Q6847488", "Q6847490", "Q6847491", "Q6847492", "Q6847493"]}}, {"date": "2020-02-19", "url": "https://dallasvoice.com/bloomberg-holds-campaign-event-at-cathedral-of-hope/", "content": "Mike Bloomberg Texas LGBT Director <mark>Mike Webb</mark>, left, and supporters and those thinking of supporting Bloomberg in the Texas primary at Cathedral of Hope on Feb. 19. (David Taffet/Dallas Voice) Democratic presidential candidate Michael Bloomberg's campaign held an event at Cathedral of Hope this morning, Wednesday, Feb. 19. The rally was organized by <mark>Adam Phillips</mark>, Bloomberg's national faith advisor, and <mark>Mike Webb</mark>, Bloomberg's Texas LGBT director. Although <mark>Phillips</mark> is straight, he said he was kicked out of his denomination over his support of LGBT issues. <mark>Phillips</mark> said Bloomberg has a pluralistic vision for America and that Trump \"is run roughshod over our neighborhoods,\" and attacked the president's policies on climate change, border control and gun violence issues. While acknowledging Bloomberg's stop and frisk policy that was declared unconstitutional, he said the former mayor who took office just months after September 11 defended the 9-11 mosque that opened blocks from the World Trade Center attack. <mark>Webb</mark> said Bloomberg's policies and proposals include ways to curb violence against the trans community. He said as president, Bloomberg would encourage education on trans issues and have police learn to protect the trans community. His positions also include education to prevent bullying in schools. \"So many campaigns overlook Texas,\" <mark>Webb</mark> said, but Bloomberg has opened 19 centers across the said. Among the questions was concern that someone could come in and buy the seat. Addressing money, another responded, \"Do you want 10 people to put their money together or do one to spend his own?\" One woman, who identified herself as a black Pentecostal, said that while members of her denomination overwhelmingly vote Democratic, they're overlooked by the party. One woman who immigrated from Cameroon said she thought Bloomberg would be the best candidate for Africa and Africans. Bloomberg's philanthropic work in Africa has included economic development and AIDS care. Another woman said she saw \"grit in his fight .\" She said Trump and Bloomberg are from the same town, know the same people and have the same wealth. \"Let them fight it out .\" --David Taffet", "articleID": "2020021916_00187317_W", "names": {"Adam Phillips": ["Q4679606", "Q4679607", "Q4679608", "Q55375239", "Q57431744"], "Mike Webb": ["Q3313577", "Q6849232"]}}, {"date": "2020-02-18", "url": "https://hypervocal.com/items/3250282", "content": "Bernard Kerik Trump Issues Pardon for Ex-NYPD Commissioner Bernard Kerik Kerik was police commissioner during the 9/11 attacks but later went to federal prison on tax and other charges Published February 18, 2020 • Updated on February 19, 2020 at 12:05 am NBCUniversal, Inc.. What to Know President Donald Trump announced he has pardoned Bernard Kerik, the former NYPD commissioner who later went to federal prison for tax fraud and lying to the government Kerik, a confidant of Trump lawyer and former mayor Rudy Giuliani, was released from prison in 2013 The informant who helped bring Kerik down was himself recently charged with sex trafficking President Donald Trump announced he has pardoned Bernard Kerik, the former NYPD commissioner who later went to federal prison for tax fraud and lying to the government. Trump also commuted former Illinois Gov. Rod Blagojevich. The news comes mere hours after Trump pardoned Edward DeBartolo Jr., the former San Francisco 49ers owner convicted in a gambling fraud scandal who built one of the most successful NFL teams in the game's history. Kerik, a one-time nominee to be the nation's homeland security chief, served three years in federal prison before his 2013 release. The former NYPD commissioner and 9/11 hero spent more than three years in federal prison for tax fraud and lying to the government, but was pardoned by President Trump on Tuesday. Others granted clemency include Rod Blagojevich, junk bond king Michael Milken and former 49ers owner Eddie DeBartolo. NBC New York's Jonathan Dienst reports. Hailed as a hero for leading the NYPD during the 9/11 attacks, Kerik fell from grace when he became the first New York City police commissioner ever imprisoned on federal crimes. His legal problems clouded the political fortunes of other elected officials, especially that of his mentor, former Mayor Rudy Giuliani. While departing the White House Tuesday afternoon, Trump said he \"pardoned\" Kerik \"a man who had many recommendations from a lot of good people .\" Thank you President @ realDonaldTrump. pic.twitter.com/nnDGa55Hgo--Bernard B. Kerik (@ BernardKerik) February 18, 2020 Following his pardon, Kerik took to Twitter to thank the president writing that \"there are no words to express my appreciation and gratitude to President Trump,\" adding that \"with the exception of the birth of my children, today is one of the greatest days in my life .\" Also thanking President Trump was Giuliani, who called Kerik a \"true patriot\" and said Trump's pardon was a \"wise decision .\" Bernie Kerik and I faced 9/11 together. I can tell you he is a brave man through and through and a brother. He's a true patriot and has learned so much from what happened to him. He has helped, and will continue to help, others. @ realDonaldTrump made a wise decision .--Rudy W. Giuliani (@ RudyGiuliani) February 18, 2020 Kerik went on to describe going to prison as \"dying with your eyes open,\" citing the \"collateral consequences and the permanent loss of many of your civil and constitutional rights are personally devastating .\" Trump also mentioned he pardoned Michael Milken, who became a face of the insider trading financial scandals of the 1980s. Trump cited the \"incredible job\" that Milken has done in the \"world with all of his research on cancer,\" adding that Milken suffered \"greatly\" and paid a \"big price .\" The two had met when Kerik volunteered to chauffeur Giuliani and provide security during his first unsuccessful race for mayor. Once elected in 1993, Giuliani promoted Kerik, a high school dropout, to the highest levels of city government. The mayor eventually tapped his former bodyguard as the city's 40th police commissioner in 2001, despite his attaining only the lowest rank for a detective and failing to earn a college degree--a requirement for officers above the rank of sergeant. Crime and Courts Feb 12 \"Unspeakable Abuse': Informant Who Helped Arrest Ex-NYPD Boss Faces Sex Trafficking Charges Nov 1, 2013 NYPD Chief-Turned-Felon Kerik: Prison System\" Broken \"Kerik nearly became President <mark>George Bush</mark>'s homeland security secretary in 2004, but his name was abruptly withdrawn as the nominee. Two days later, The Daily News reported that Larry Ray, who had been the best man at Kerik's wedding, had come forward with evidence that Kerik failed to report thousands of dollars in gifts he'd received while working for the city. A the time, Ray was under indictment in a $40 million stock scam. During his failed presidential bid in 2008, Giuliani had to admit that he erred in recommending Kerik to President <mark>Bush</mark>. Kerik was in the news earlier this month when Ray was arrested on sex trafficking charges. Blagojevich, who was impeached and removed from office in 2009 on corruption charges, was also commuted by the president. Blagojevich, 63, was found guilty of corruption charges related to his solicitation of bribes in an attempt to\" sell \"the Senate seat Barack Obama left open after being elected president. He was sentenced in 2011 to 14 years in federal prison. On Tuesday, Trump said he commuted Blagojevich's sentence\" so he'll be able to go home to his family after serving eight years in jail, \"calling Blagojevich's sentence\" ridiculous \"and that\" many people disagree with the sentence. \"Blagojevich was a contestant on Trump's reality TV show\" The Celebrity Apprentice \"in 2010. NBC New York / The Associated Press This article tagged under: Bernard Kerik NYPD President Trump Pardons 0", "articleID": "2020021917_00157185_W", "names": {"George Bush": ["Q207", "Q23505"]}}]