[{"date": "2020-02-18", "url": "https://hypervocal.com/items/3250282", "content": "Bernard Kerik Trump Issues Pardon for Ex-NYPD Commissioner Bernard Kerik Kerik was police commissioner during the 9/11 attacks but later went to federal prison on tax and other charges Published February 18, 2020 • Updated on February 19, 2020 at 12:05 am NBCUniversal, Inc.. What to Know President Donald Trump announced he has pardoned Bernard Kerik, the former NYPD commissioner who later went to federal prison for tax fraud and lying to the government Kerik, a confidant of Trump lawyer and former mayor Rudy Giuliani, was released from prison in 2013 The informant who helped bring Kerik down was himself recently charged with sex trafficking President Donald Trump announced he has pardoned Bernard Kerik, the former NYPD commissioner who later went to federal prison for tax fraud and lying to the government. Trump also commuted former Illinois Gov. Rod Blagojevich. The news comes mere hours after Trump pardoned Edward DeBartolo Jr., the former San Francisco 49ers owner convicted in a gambling fraud scandal who built one of the most successful NFL teams in the game's history. Kerik, a one-time nominee to be the nation's homeland security chief, served three years in federal prison before his 2013 release. The former NYPD commissioner and 9/11 hero spent more than three years in federal prison for tax fraud and lying to the government, but was pardoned by President Trump on Tuesday. Others granted clemency include Rod Blagojevich, junk bond king Michael Milken and former 49ers owner Eddie DeBartolo. NBC New York's Jonathan Dienst reports. Hailed as a hero for leading the NYPD during the 9/11 attacks, Kerik fell from grace when he became the first New York City police commissioner ever imprisoned on federal crimes. His legal problems clouded the political fortunes of other elected officials, especially that of his mentor, former Mayor Rudy Giuliani. While departing the White House Tuesday afternoon, Trump said he \"pardoned\" Kerik \"a man who had many recommendations from a lot of good people .\" Thank you President @ realDonaldTrump. pic.twitter.com/nnDGa55Hgo--Bernard B. Kerik (@ BernardKerik) February 18, 2020 Following his pardon, Kerik took to Twitter to thank the president writing that \"there are no words to express my appreciation and gratitude to President Trump,\" adding that \"with the exception of the birth of my children, today is one of the greatest days in my life .\" Also thanking President Trump was Giuliani, who called Kerik a \"true patriot\" and said Trump's pardon was a \"wise decision .\" Bernie Kerik and I faced 9/11 together. I can tell you he is a brave man through and through and a brother. He's a true patriot and has learned so much from what happened to him. He has helped, and will continue to help, others. @ realDonaldTrump made a wise decision .--Rudy W. Giuliani (@ RudyGiuliani) February 18, 2020 Kerik went on to describe going to prison as \"dying with your eyes open,\" citing the \"collateral consequences and the permanent loss of many of your civil and constitutional rights are personally devastating .\" Trump also mentioned he pardoned Michael Milken, who became a face of the insider trading financial scandals of the 1980s. Trump cited the \"incredible job\" that Milken has done in the \"world with all of his research on cancer,\" adding that Milken suffered \"greatly\" and paid a \"big price .\" The two had met when Kerik volunteered to chauffeur Giuliani and provide security during his first unsuccessful race for mayor. Once elected in 1993, Giuliani promoted Kerik, a high school dropout, to the highest levels of city government. The mayor eventually tapped his former bodyguard as the city's 40th police commissioner in 2001, despite his attaining only the lowest rank for a detective and failing to earn a college degree--a requirement for officers above the rank of sergeant. Crime and Courts Feb 12 \"Unspeakable Abuse': Informant Who Helped Arrest Ex-NYPD Boss Faces Sex Trafficking Charges Nov 1, 2013 NYPD Chief-Turned-Felon Kerik: Prison System\" Broken \"Kerik nearly became President <mark>George Bush</mark>'s homeland security secretary in 2004, but his name was abruptly withdrawn as the nominee. Two days later, The Daily News reported that Larry Ray, who had been the best man at Kerik's wedding, had come forward with evidence that Kerik failed to report thousands of dollars in gifts he'd received while working for the city. A the time, Ray was under indictment in a $40 million stock scam. During his failed presidential bid in 2008, Giuliani had to admit that he erred in recommending Kerik to President <mark>Bush</mark>. Kerik was in the news earlier this month when Ray was arrested on sex trafficking charges. Blagojevich, who was impeached and removed from office in 2009 on corruption charges, was also commuted by the president. Blagojevich, 63, was found guilty of corruption charges related to his solicitation of bribes in an attempt to\" sell \"the Senate seat Barack Obama left open after being elected president. He was sentenced in 2011 to 14 years in federal prison. On Tuesday, Trump said he commuted Blagojevich's sentence\" so he'll be able to go home to his family after serving eight years in jail, \"calling Blagojevich's sentence\" ridiculous \"and that\" many people disagree with the sentence. \"Blagojevich was a contestant on Trump's reality TV show\" The Celebrity Apprentice \"in 2010. NBC New York / The Associated Press This article tagged under: Bernard Kerik NYPD President Trump Pardons 0", "articleID": "2020021917_00157185_W", "names": {"President Bush": ["Q207", "Q23505"]}}, {"date": "2020-02-20", "url": "http://salisburyjournal.co.uk/news/national/18249661.jmw-turner-20-banknote-enters-circulation/", "content": "News National JMW <mark>Turner</mark> £ 20 banknote enters circulation By Press Association 2020 New 20 pound note 0 comment A new £ 20 banknote featuring artist JMW <mark>Turner</mark> will start to appear in ATMs and tills from Thursday as it enters circulation. The new polymer £ 20 note will replace the paper £ 20 note featuring economist <mark>Adam Smith</mark> and has been hailed by the Bank of England as its most secure banknote yet. It includes two see-through windows and a two colour foil to help thwart counterfeiters. The Bank expects half of all ATMs across the UK to be dispensing polymer £ 20 banknotes in just two weeks' time. The son of a barber and a wig maker, Joseph Mallord <mark>William Turner</mark> (1775-1851) became renowned as one of the great masters of painting. He first exhibited at the Royal Academy in 1790 aged just 15. (PA Graphics) <mark>Turner</mark> produced more than 550 oil paintings, 2,000 watercolours, and 30,000 sketches and drawings. He became known as \"the painter of light\" and had a keen interest in depicting nature such as extreme weather conditions and the violent power of the sea. Features on the new <mark>Turner</mark> note include:--A large see-through window with a blue and gold foil on the front depicting Margate lighthouse and <mark>Turner</mark> Contemporary. The foil is silver on the back. The shape of the large window is based on the shape of the fountains in Trafalgar Square. Just 2 days to go until the launch of the new £ 20 note and we have another fact for you: all together, the £ 20 notes currently in circulation weigh 1,780 tons. That's the same as 141 buses! https: //t.co/9IkPHceWKN #TheNew 20 pic.twitter.com/L4it9shL0S--Bank of England (@ bankofengland) February 18, 2020--<mark>Turner</mark>'s self-portrait, painted around 1799 and currently on display in Tate Britain .--One of <mark>Turner</mark>'s most celebrated paintings The Fighting Temeraire--a tribute to the ship HMS Temeraire which played a distinguished role in Nelson's victory at the Battle of Trafalgar in 1805. It was voted the nation's favourite painting in a BBC Radio 4 poll .--A metallic hologram which changes between the word \"twenty\" and \"pounds\" when the note is tilted .--A purple foil patch containing the letter \"T\" and based on the staircase at Tate Britain .--A quote \"Light is therefore colour\" from an 1818 lecture by <mark>Turner</mark> referring to the use of light, shade, colour and tone in his pictures .--<mark>Turner</mark>'s signature from his will, in which he bequeathed many of his paintings to the nation. The paper £ 20 notes can still be used as normal and the Bank will give six months' notice ahead of their legal tender status being withdrawn. The new £ 20 note arrives in 3 days. Did you know that there are currently two billion £ 20 notes in circulation? If you laid them in a line, you could wrap them around the world nearly seven times! https: //t.co/M9EpX6x1qd #TheNew 20 pic.twitter.com/LNFxutrupz--Bank of England (@ bankofengland) February 17, 2020 There are over two billion £ 20 notes in circulation. Laid end to end, two billion polymer £ 20 notes would stretch around the world almost seven times and weigh the equivalent of more than 141 double decker buses, the Bank said. The note will join the Sir Winston Churchill £ 5 and the Jane Austen £ 10 in the Bank of England's first series of polymer notes. A new polymer £ 50 featuring Bletchley Park codebreaker Alan Turing will be issued next year. Speaking at Tate Britain, which houses the <mark>Turner</mark> Bequest, Bank of England Governor Mark Carney said: \"Our banknotes celebrate the UK's extraordinarily rich and diverse heritage and highlight the contributions of its greatest citizens. <mark>Turner</mark>'s art was transformative .\" I am delighted that the work of arguably the single most influential British artist of all time will now appear on another two billion works of art--the new £ 20 notes that people can start using today. \"<mark>Turner</mark>'s self-portrait, as featured on the new £ 20 note, is on display at Tate Britain alongside the banknote. Home to the <mark>Turner</mark> Bequest which includes 300 oil paintings and many thousands of sketches and watercolours, Tate Britain will present a major new exhibition dedicated to <mark>Turner</mark> later this year--<mark>Turner</mark>'s Modern World. The new £ 20 note is the first to feature the signature of Sarah John, the Bank's chief cashier. She said:\" Moving the £ 20 note to polymer marks a major step forward in our fight against counterfeiting. I am very grateful to everyone across the cash industry who has made this transition possible and I hope the public enjoy using their new <mark>Turner</mark> £ 20s. \"The Royal National Institute of Blind People (RNIB) has been working with the Bank to make money accessible for people with sight loss. The new note has tactile markings on it with three separate clusters of dots along the short edge to differentiate it from the £ 10 note, which has two clusters of dots. It is larger than both the £ 10 and £ 5 notes. <mark>David Clarke</mark>, RNIB director of services, said:\" Handling cash can often be a challenge if you're blind or partially sighted, because it can be difficult to tell the difference between the different notes and coins. We hope the creation of these notes will help enable people with sight loss to use money more easily and with confidence. \"By incorporating tactile features on money, we are closer to creating a more inclusive society; it's the small changes that can make a big difference to independent living .\" The Bank has said that polymer notes last longer than paper notes and remain in better condition. But a previous freedom of information request by the PA news agency found that nearly 50 million plastic £ 5 and £ 10 notes have had to be replaced since they were launched by the Bank of England due to wear and damage. Around 20 million of the Bank's new polymer £ 5 notes were replaced in the first three years since they were introduced. And about another 26 million £ 10 notes were replaced in the two years since they were launched in September 2017. Alex Farquharson, director of Tate Britain, said: \"We are thrilled that <mark>Turner</mark> is featured on the new £ 20 banknote .\" As one of Britain's greatest artists--perhaps even the greatest--<mark>Turner</mark> is a key figure in the history of art. \"0 comment", "articleID": "2020022013_00031903_W", "names": {"Adam Smith": ["Q14950467", "Q16255210", "Q20023132", "Q22121229", "Q33035156", "Q350916", "Q350920", "Q42763651", "Q4679545", "Q4679802", "Q4679803", "Q4679807", "Q4679808", "Q48976986", "Q52116879", "Q5539790", "Q56997269", "Q57451408", "Q58051258", "Q58219052", "Q59065"], "David Clarke": ["Q1174015", "Q16728080", "Q21165907", "Q29642480", "Q3017681", "Q3703144", "Q47091771", "Q51952713", "Q5232396", "Q5232398", "Q5232401", "Q5232402", "Q5232403", "Q5232404", "Q5232405", "Q5239350", "Q54153120", "Q7248140"], "William Turner": ["Q51584412", "Q54634429"]}}, {"date": "2020-02-24", "url": "https://leadership.ng/2020/02/24/northern-leaders-fault-pandef-on-state-of-the-nation-comment/", "content": "Leaders from the Northern and the Southern part of the country have again clashed over the state of the nation. This is just as the Buhari Media Organisation (BMO), yesterday faulted the position ex-federal commissioner of Information and Elder statesman, Chief Edwin Clark over the state of affairs in Nigeria, noting that it was wrong to blame President Buhari for the reluctance to restructure the polity since it is a constitutional issue which falls within the purview of the National Assembly. Clark had in an interview titled ’N igeria sitting on a key of gunpowder,' with a national daily, (not LEADERSHIP) said, \"I fear that Nigeria is moving towards anarchy and if nothing is done and quickly too nobody is safe. The fear has also been expressed by many people, by other well meaning Nigerians. Let us not pretend, we must do the restructuring of this country .\" The elder statesman also said with regards to elections and court judgements, that \"president Buhari has not shown statesmanship given his actions. There is political deception and Nigeria has never been badly divided as it is today. Some people and groups are treated as scared cows as if they own Nigeria.... you cannot be sponsoring injustice and expect unity .\" The apex Igbo socio-cultural organisation, Ohaneze Ndigbo, while reacting to Clarks lamentations, said the elder statesman is too experienced not to know what he is talking about. Deputy national publicity secretary of Ohanaeze Ndigbo, Chuks Ibegbu, told LEADERSHIP that, \"Edwin Clark is too experienced to know what he is talking. I think he is concerned by the insecurity in Nigeria and the level of corruption and nepotism in the system .\" In same vein, the apex Yoruba socio-cultural organisation, Afenifere, said Clark was right on his views about the present state of the country, adding that only enemies of Nigeria would say things are fine. The spokesman of Afenifere, Mr Yinka Odumakin, who spoke in support of the Clark's disposition noted that the senate president, Ahmed Lawan, had also recently lamented the deplorable conditions in the country. \"The old man is damn right. It was the same observation that made the Senate President to say we have reached a tipping point. Only enemies of Nigeria would say things are okay .\" But the secretary general of Arewa Consultative Forum (ACF), Anthony Sani, while stating position of the Forum, noted that Nigeria's problems could not be solved by restructuring, adding that the country have been restructured several times. ACF said Nigerians need change of attitude and not restructuring or constitutional amendment. \"It is against these backdrops that we think our problems have to do more with our attitudes and how we do things than the structure, the form of government and economic models,\" Sani said. According to him, many believed that the Constitution review embarked upon by the National Assembly will give room for restructuring. \"But by way of examples, the country has been restructured several times politically, geopolitically or economically. Nigeria started with three regions under confederate arrangement and later moved to four regions and now have 36 states attained through gradual split from 12 states,19 states, 21states and 30 states .\" The country started with parliamentary system of government, went through military dictatorship which abolished the confederation in favour of unitary system, then followed by federalism which is a compromise between confederation with weak center and unitary system with very strong center. \"The current federalism is a situation where the national government is balanced by appropriate state level power. Even the economy has gone through several remodeling with indigenization tagged mixed economy .\" There was the International Monetary Fund (IMF's) inspired Structural Adjustment Programs tagged SAP under the former military president, <mark>Ibrahim Babangida</mark>, which sought to reduce government's hold of the economy. \"Nigeria also had former president, Olusegun Obasanjo's privatization which sold government holdings in the economy to private sector expected to drive the economy and bring about reduction of poverty that comes with employment with many Nigerians still left in difficult situation. Meanwhile, chairman of BMO, Niyi Akinsuju, who noted Clark's call for restructuring however said it is a constitutional matter which has its roots in the legislature. Speaking to LEADERSHIP, he decried an attempt by the elder statesman to hold President Muhammadu Buhari responsible for the national reluctance to restructure, saying such notion is misplaced. Akinsuju said,\" I understand the call for restructuring by Elder Statesman Edwin Clark in this context, but then, there seems to be a misalignment in the option he sustained for the realisation of his call for restructuring. \"Restructuring is primarily a constitutional issue, and to that extent, it has its roots in the legislature. I observe an attempt by the elder statesman to hold President Muhammadu Buhari responsible for the national reluctance to restructure but I submit that the sentiments is misplaced .\" There are many paths to commencing the process of legislation or constitution amendments, as the case may be, in the National Assembly which is the representation of the nation's legislative arm of government. \"\"The presidential system works in America, the parliamentary system is working well in Britain while a combination of the two works successfully in France with Nigeria left still guessing .\" America's constitution is few pages, Britain does not have a written constitution while Nigeria has a book in form of a constitution that is observed more in the breach. \"As to cost of government, America has about 25 ministers, Britain has about 17 while France has about 15 ministers while Nigeria has a crowd called government .\" In America, the vice president is the president of the senate which pundits say the drafters of the Constitution envisage it to be a way of reducing cost of governance. \"State capitalism works in China but Nigeria, haven tried many structures, forms of government that include military dictatorship and many economic models, pundits say the problems of Nigeria have more to do with collapse of national ideals and moral values that have affected the sense of what is right and what is evil .\" Those who hanker for resource control and yet agitate for return to 1963 constitution feign ignorance of the fact that Oil, Gas and Solid Minerals have been on the exclusive list of all our constitutions, \"Sani said. He added that,\" those who now say Nigeria should be restructured in such a way that each sections be allowed to develop at its own pace are those who wish Nigerians should live as if they are in different continents. \"This is inclusive of private members of the National Assembly and, of course, the President. I recall that the President had invited any Nigerian that feels strongly about restructuring to approach the National Assembly and commence the process there .\" Thankfully, the Senate recently inaugurated the Senator Ovie Omo-Agege Constitution Amendment Committee which in turn declared its intent to reference both the 2014 Constitutional Conference report and the Governor Nasir El-Rufai APC's report on restructuring even as the same committee called on Nigerians to come forward and submit their memoranda on areas they desired amended in the constitution. \"To me, this is how to go about the realisation of our passion for restructuring, in an orderly, constitutional and cost effective manner. I am sure Chief Clark is not suggesting another conference so I invite the respected Elder Statesman to avail himself of this Omo-Agege committee to present his thoughts on restructuring Nigeria .\" On Clark's reaction to the Buhari's disposition to elections and court judgements, Akinsuju said it was obvious that Chief Clark is determined to find a role for President Buhari in the sentiments he expressed. The BMO chair said the President had expressed and continue to show an insistence on not interfering in the electoral and judicial processes. He said, \"Nigerians are all witnesses to how judicial rulings, for the first time ever in the history of democracy in Nigeria, have taken away States won by the ruling party and directly gave them to the main opposition PDP. In another case, the ruling APC was barred from contesting in a statewide election .\" The President refused to intervene even where party members wondered why, in the normal Nigerian practice, he did not make to manipulate the process as the PDP would have done when they were in power at the Federal level. \"The truth of the matter is that this President is constant in his determination to build institutions rather than advancing selfish interests. The same way he is creating level playing ground for all Nigerians .\" Akinsiju states that if anybody is complaining of sacred cows in contemporary Nigeria, it's those that believed they used to own Nigeria and are now being sidelined in preference for the masses. He this current reality is exemplified by the \"recent employment of more than 1000 graduate trainees by the NNPC with testimonies by the employed testifying that they didn't know or have connections of any sorts with anybody in government .\" Before this NNPC's well applauded recruitment there was much commendation from Nigerians without contacts or connections that got selected into the NPower scheme. This is the new Nigeria we are talking about, the Nigeria where anybody is somebody and can access privileges of state without knowing any big man or woman anywhere, \"he said. VICTORY!! ABUJA MAN REVEALS (FREE) SECRET FRUITS THAT INCREASES MANHOOD & LASTING POWER IN 7DAYS...CLICK HERE TO GET IT RIGHT NOW!! Related Topics: Up Next Lagos Shuts Down 20 Sub-standard Health Centres Don't Miss CBN Clarifies Position On Operation Of Domiciliary Accounts Advertisement You may like MOST POPULAR HEALTH 22 hours ago 10 Reasons Why Coconut Oil Is A Must-have ARTS 22 hours ago Chimamanda Ngozi Adichie Makes History Again POLITICS 22 hours ago Edo: We Are Working Towards A Consensus Candidate--Ize-Iyamu SPORTS 20 hours ago JUST IN: Fury Batters Wilder, Reclaims World Heavyweights Title NEWS 9 hours ago I Didn't Forge My Certificate--Bayelsa Deputy Governor WORLD 22 hours ago Chinedu Echeruo--US-Based Nigerian Computer Scientist AFRICA 22 hours ago Africa's Female Ex-presidents NEWS 14 hours ago APC Alleges Plot To Swap NYSC Certificates Of Bayelsa Deputy Gov", "articleID": "2020022403_00100241_W", "names": {"Ibrahim Babangida": ["Q333415", "Q35539224", "Q4521833"]}}, {"date": "2020-02-24", "url": "https://abc17news.com/news/politics/national-politics/2020/02/24/trumps-cherish-an-iconic-moment-touring-the-taj-mahal/", "content": "National Politics By CNN Published February 24, 2020 9:39 am It's the most popular tourist attraction in India, but for a few moments on Monday evening, all was still while the first couple of the United States took a romantic, sunset stroll outside the <mark>Taj Mahal</mark>. President Donald Trump, joined by first lady Melania Trump and at times a tour guide, spent more than an hour touring the grounds, including winding down on a path in front of the majestic white marble building and posing for countless pictures during the Indian golden hour. Despite naming his Atlantic City hotel after the iconic landmark, it was the President's first visit to the real <mark>Taj Mahal</mark>, a symbol of lasting love built in the 17th century by Mughal Emperor Shah Jahan to honor his third wife, Mumtaz <mark>Mahal</mark>, who died giving birth to the couple's fourteenth child. Today, it is among the busiest tourist sites in the world; in 2018, almost 6.5 million people visited the <mark>Taj Mahal</mark>, according to statistics from the Indian Ministry of Tourism. The tour came hours after the President arrived in India for a visit marked by pomp and circumstance, the quiet <mark>Taj Mahal</mark> standing in stark contrast to a \"Namaste Trump\" campaign-style rally earlier Monday afternoon in Ahmedabad, where Trump was greeted by more than 100,000 spectators. \"Do you want to do a press conference now?\" Trump joked to the traveling reporters. \"Have any questions about anything?\" He called the the <mark>Taj Mahal</mark> \"truly incredible\" before turning around to observe its majesty, holding hands with the first lady, who called it \"lovely, beautiful .\" \"One of you is going to get a Pulitzer for this,\" Trump said to photographers as he posed for a photo in front of the reflecting pool with a smiling Melania Trump. Like many of the stops along Trump's brief trip, officials took extreme care in preparations for his <mark>Taj Mahal</mark> visit. Fresh water was funneled into the adjacent Yamuna River to dilute its usual smell, according to local reports. Roads between the <mark>Taj Mahal</mark> and the nearby airport were cleared, pavements were leveled, footpaths \"beautified,\" walls painted a uniform color, and the roads sprinkled with water to ensure that dust didn't fly up when Trump's convoy drives past, said Rajiv Rathi, executive engineer at the environment department of Agra Municipal Corporation. \"We have also put in barricades for people to stand behind and flower pots for decoration,\" he said, adding that authorities are \"expecting around 30,000 people on the road to <mark>Taj Mahal</mark> when Trump arrives .\" Despite an initial local report of concerns regarding aggressive monkeys near the memorial, there were no apparent presidential primate interruptions during an overall peaceful trip. Trump also received a key to the city of Agra. \"This is a long standing tradition, whenever any dignitary comes to the city we give them a key to the city and he is the mayor of the city for the day, we will be giving a key to President Trump as well,\" Rathi said. The Trumps paused for several moments as they walked along the <mark>Taj Mahal</mark>'s reflecting pool and spent more than 15 minutes inside the marble mausoleum, according to reporters traveling with the President. Other presidents and first ladies have made a pilgrimage to the iconic structure; Jackie Kennedy held a solo photo opportunity at the <mark>Taj Mahal</mark>, President George H. W. Bush and his wife Barbara visited, and first lady Hillary Clinton visited with daughter Chelsea during a 12-day tour of South Asia. The Obamas cancelled a planned trip to the iconic landmark, cutting their Indian visit short after the death of Saudi Arabian King Abduhllah.", "articleID": "2020022416_00024386_W", "names": {"Taj Mahal": ["Q353023", "Q59627566"]}}, {"date": "2020-02-28", "url": "http://macleayargus.com.au/story/6654252/kids-haunted-by-nsw-bookies-brutal-death/?cs=7", "content": "Kids haunted by NSW bookie's brutal death National Wealthy bookmaker Charles Skarratt was murdered in his Sydney home in 1989. Their father was bound, beaten and stabbed to death in his Sydney home during a robbery gone wrong. More than 30 years later, a \"never-ending nightmare\" of thoughts about Charles Skarratt's killing continues to haunt the bookmaker's children. Terry <mark>John Gordon</mark> Hickson, 60, was in December found guilty of the brutal murder of the wealthy bookie after a day at the Dapto greyhound races in 1989. Peter Skarratt and Victoria Frerer choked up as they told the NSW Supreme Court about the impact of their father's death. \"Like a never-ending nightmare, thoughts of how he died will never go away,\" Peter Skarratt said at Hickson's sentencing hearing on Friday. He said his father's ordeal \"over a few dollars\" was beyond his comprehension. \"What is truly horrifying are the thoughts I have of what it must have been like for dad being left to die without the ability to move, care for himself or seek help,\" he said. \"I do not know a life without these...thoughts .\" Mr Skarratt's wife found his body surrounded by blood on the garage floor of his Woolwich home in December 1989. Her victim impact statement was handed to the judge but not read to the court. Ms Frerer told the court she remembered her father as a shy, intelligent and proud man. \"The violent way his life ended - tortured, taped, gagged, stabbed and alone - just breaks my heart,\" she said. \"I have never felt anger, however there is a sadness that visits me every day .\" Hickson's defence barrister argued the judge should sentence his client on the basis Mr Skarratt died during the course of the armed robbery, not because Hickson intended to kill him. Philip Young SC rejected the Crown's claim Mr Skarratt was tortured, saying he was seriously injured in a violent scuffle with Hickson and then bound and gagged. But crown prosecutor Craig Everson argued multiple stab wounds - one ferocious enough to fracture the victim's ribs - showed Hickson intended to do more than stop Mr Skarratt's resistance. \"If his intention was not to kill, it is just outrageous that he didn't do anything to summon some assistance,\" he told the court. Justice <mark>David Davies</mark> was also asked to consider Hickson's extensive criminal history and ill health in his sentencing. Australian Associated Press", "articleID": "2020022802_00090731_W", "names": {"David Davies": ["Q16539083", "Q21387484", "Q2487274", "Q2673903", "Q296797", "Q364890", "Q5230426", "Q5232847", "Q5232852", "Q5232855", "Q5232856", "Q5232859", "Q5237175", "Q56596932", "Q56596943", "Q56604597"], "John Gordon": ["Q1473021", "Q15435114", "Q1700239", "Q1700241", "Q19325356", "Q27827642", "Q28016800", "Q43393024", "Q43394029", "Q43910950", "Q55724969", "Q57899079", "Q6235757", "Q6235763"]}}, {"date": "2020-02-29", "url": "https://lethbridgeherald.com/sports/national-sports/2020/02/29/canadian-speedskater-dubreuil-captures-silver-at-world-sprint-championships/", "content": "Canadian speedskater <mark>Dubreuil</mark> captures silver at world sprint championships Poll Are you happy, for the most part, with the new Alberta budget unveiled on Thursday? Yes Follow @ Leth_Herald on twitter By The Canadian Press on February 29, 2020. HAMAR, Norway--Canada's <mark>Laurent Dubreuil</mark> captured a silver medal at the ISU world sprint and allround speedskating championships on Saturday. The 27-year-old from Levis, Que ., is only the fourth Canadian to climb the medal podium at the world sprint championships, joining Jeremy Wotherspoon, who won nine medals, <mark>Gaetan Boucher</mark> (five) and Mike Ireland (four). <mark>Laurent</mark> earned second-place results in both the 500 and 1,000 metres on Saturday to clinch second in the overall standings. He was first in the 500 and fifth in the 1,000 on Friday. \"My two 500 and my 1000 today were exceptional races for me,\" <mark>Dubreuil</mark> said. \"I was able to manage everything around me to finish second at the world sprint championships, my favourite competition and the hardest and more stressful competition of the season, by far .\" His combined time of 137.700 put him second in the overall standings by 0.47 seconds behind Japan's Tatsuya Shinhama. Min Kyu Cha of Korea won bronze. Calgary's Kaylin Irvine was Canada's top-ranked woman, finishing a career-best ninth. This report by The Canadian Press was first published Feb. 29, 2020. Share this story:", "articleID": "2020022917_00182633_W", "names": {"Gaetan Boucher": ["Q16186991", "Q494831"], "Laurent Dubreuil": ["Q3219194", "Q4038571"]}}]