[{"date": "2020-03-02", "url": "http://andoveradvertiser.co.uk/sport/national/18274254.zinchenko-already-looking-ahead-manchester-citys-latest-cup-success/", "content": "Sport National Sport <mark>Zinchenko</mark> already looking ahead after Manchester City's latest cup success By Press Association 2020 <mark>Oleksandr Zinchenko</mark> helped Manchester City to another trophy success 0 comment <mark>Oleksandr Zinchenko</mark> says Manchester City are already thinking about their next challenge after getting their hands on the Carabao Cup yet again. City won the competition for a third year in succession, and a fifth time in seven years, as they beat Aston Villa 2-1 in a hard-fought final at Wembley on Sunday. It was also the 11th major trophy of the modern City era, the first of which was the FA Cup triumph of 2011, and they have their sights set on more. Our 6 ️ ⃣ th consecutive English trophy!?? ⚽ ️ @ QNetOfficial?? #ManCity #CarabaoCup pic.twitter.com/5SjNPP4dTp--Manchester City (@ ManCity) March 1, 2020 A third successive Premier League title looks beyond them but the FA Cup and Champions League are still very much on the radar. Left-back <mark>Zinchenko</mark> said: \"It is so important for us to win every title. We are so happy. We have an unbelievable squad and we fight for all titles .\" So everyone is happy, but we should think about the next game because we have one or two other challenges. We want to fight. \"We have to show our class in our performance every single game and then at the end of the season we are going to speak about if it was a good season for us or if it was successful or not. The Captain. The Man of the Match. #EFL #CarabaoCup #CarabaoCupFinal #ManCity #MCFC pic.twitter.com/eYtRxTJY3t--PepTeam (@ PepTeam) March 1, 2020\" We have Champions League and FA Cup as well. We are going to fight for these titles and see what happens. Everyone is focused on the next game and that is it. \"City are back in action on Wednesday as they travel to Sheffield Wednesday in the FA Cup fifth round. They then have Premier League games against Manchester United and Burnley before their Champions League quest resumes with the second leg of their last-16 tie against Real Madrid at the Etihad Stadium on March 17. City hold a 2-1 aggregate lead from the first leg at the Bernabeu last week. City had to earn their latest success as relegation-threatened Villa fought back after conceding to Sergio Aguero and Rodri in the first half an hour. Mbwana Samatta pulled one back and it took a brilliant late save from <mark>Claudio Bravo</mark>, tipping a Bjorn Engels header onto a post, to prevent the match going to extra time .???? Otro título más?????? otro día mágico en mi memoria. Gracias a todos por sus mensajes???????? ✌?? @ ManCity #Wembley #CarabaoCupFinal???? pic.twitter.com/tUpdWks8Td--<mark>Claudio Bravo</mark> Muñoz (@ C1audioBravo) March 1, 2020 It was not the first time <mark>Bravo</mark> had excelled in the competition. Twice in the 2017-18 run he was the hero in penalty shootouts, against Wolves and Leicester, and after missing most of last season through injury, he has played throughout this year's challenge. <mark>Zinchenko</mark> said:\" One year ago someone said we have to change the name of the cup, so not Carabao Cup, we should say it is the <mark>Claudio Bravo</mark> Cup. \"He did it again for us. Thanks a lot to him. Everyone was talking about him in the dressing room .\" It was a battle. Big respect to Aston Villa. They were well organised defensively and it was not too easy. \"0 comment", "articleID": "2020030212_00011804_W", "names": {"Claudio Bravo": ["Q313161", "Q491787", "Q56239393", "Q58372288"], "Oleksandr Zinchenko": ["Q1803666", "Q19636859"]}}, {"date": "2020-03-03", "url": "http://www.ipswichadvertiser.com.au/news/the-month-that-has-authorities-worried/3958197/", "content": "Health The month that has authorities worried by Shannon Molloy 3rd Mar 2020 10:38 AM 0 The risk of the deadly coronavirus spreading in Australia will increase over coming months as the mercury drops and instances of colds and flu spike, official modelling shows. West Australian Premier <mark>Mark McGowan</mark> has revealed that authorities are bracing for the worst, as the number of countries battling the virus passes 60 and the death toll hits 3000. \"The modelling indicates that potentially, in late April or May, there may be greater spread of the illness here in Australia, and at that point in time obviously we would need to ramp up some of our activities,\" Mr <mark>McGowan</mark> told reporters. \"The peak would then hit us in potentially August, which is obviously not a great month because our coldest months with the highest level of flu .\" The emergency response to the virus entered a worrying new phase yesterday, with confirmation of the first human-to-human infection. It's likely the government will enter an escalated phase of containment efforts in a bid to slow the spread. Australian chief medical officer Professor <mark>Brendan Murphy</mark> said an outbreak in Australia was likely inevitable, stating \"it's no longer possible to absolutely prevent new cases coming in\". Western Australia will host a meeting to assess its preparedness for a potential COVID-19 outbreak tomorrow, in the wake of the death of an elderly man in a Perth hospital. The 78-year-old contracted the virus while on board the Diamond Princess cruise ship with his wife and the pair was transported back to Australia for treatment. Sadly, he passed away yesterday. His wife, 79, remains in hospital in a stable condition. <mark>Andrew Miller</mark>, president of the WA branch of the Australian Medical Association, told the ABC that the death should be \"a wake-up call\". \"I guess we're used to being warned about things, and as Australians we tend to say,\" She'll be OK and it will work out on the day', but in this instance we really do need to take a call to prepare very seriously. \"Dr Miller likened the coronavirus to the deadly Spanish flu, a pandemic that killed 50 million people globally in the early part of the 20th Century .\" The truth is we probably haven't seen a virus like this one since 1918 with the Spanish flu, so I understand why it's been a little slow to get the wheels going, \"he said. Although, he said the focus should be on preparing - not panicking .\" It's not a time to panic. It's not a time to be moving to the hills. It is a time to be thinking about what will we do if this hits, how will it affect our life and what can we do to help others. \"A traveller from China at the International Airport in Brisbane. Picture: AAP Last week, Australia activated its emergency response plan for pandemics and the Commonwealth is working with states and territories to prepare for potential outbreaks. Professor Robert Booy from the National Centre for Immunisation Research and Surveillance told the ABC that Australia needed to focus on older people living in aged care and the elderly still living at home, as they were most at risk .\" People with chronic medical conditions of the lung or the heart also need to be closely monitored, \"he said. More than 87,000 people worldwide have been infected, with the virus appearing on every continent but Antarctica. More Stories Six coronavirus facts you need to know Queensland's 10th coronavirus case confirmed Aldi mums react to virus\" madness' premium_icon \"Non-urgent' medical care to be delayed due to coronavirus premium_icon Why fist bumps are becoming all the rage Indonesia confirms first coronavirus infection Show More More Stories Six coronavirus facts you need to know Queensland's 10th coronavirus case confirmed Aldi mums react to virus\" madness' premium_icon \"Non-urgent' medical care to be delayed due to coronavirus premium_icon Why fist bumps are becoming all the rage Indonesia confirms first coronavirus infection Show More 0 coronavirus Read More Login to follow covid-19 Read More Login to follow editors picks Read More Login to follow health Read More Login to follow outbreak Read More Login to follow coronavirus covid-19 editors picks health outbreak", "articleID": "2020030301_00019382_W", "names": {"Andrew Miller": ["Q1455614", "Q17385571", "Q21535598", "Q25929397", "Q2846688", "Q2846690", "Q4758025", "Q4758026", "Q4758027", "Q4758028", "Q4758029", "Q4758032", "Q580927", "Q720306"], "Brendan Murphy": ["Q4961012", "Q4961017", "Q4961018", "Q58447534", "Q59545990"], "Mark Mcgowan": ["Q16197112", "Q5981811", "Q6768808"]}}, {"date": "2020-03-04", "url": "http://townhall.com/columnists/anncoulter/2020/03/04/bernie-is-still-trumps-nightmare-n2563214", "content": "Bernie Is Still Trump's Nightmare Share The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com. Source: AP Photo/Charles Krupa The Democrats' sudden discovery of 77-year-old éminence grise Joe Biden has the electric feeling of Republicans settling on George H.W. Bush in 1992. (The Iowa Republican Party actually canceled the caucuses that year so as not to embarrass President <mark>Bush</mark>.) It's Democrats convincing themselves in 2004 that <mark>John Kerry</mark> was the \"safe\" choice. Proposed Biden campaign slogan: OK, I Guess He'll Do. This is good news for Trump. Bernie Sanders is his greatest nightmare. True, the media, the donors and the Democratic Party are convinced that Sanders is a sure loser--just as, four years ago, Fox News, the donors and the Republican Party knew that Trump was a sure loser. What made both Trump and Sanders unique in their respective primaries was their voluble opposition to Wall Street, war and immigration. I'm beginning to suspect that Americans hate Wall Street, hate war and hate mass, low-wage immigration. I take no position on these preferences. I am simply stating facts. Recall that, in 2016, Trump and Sanders were the only presidential candidates opposed to the mass importation of low-wage workers immiserating our working class. Sadly, they both moved left on the issue at about the same time: Bernie when he went from being a Socialist to a Democrat, and Trump when he went from the campaign to the White House. On war, Sanders is certainly consistent. Good war, bad war, necessary war, stupid war--he's against 'em all! As he recently tweeted about Trump's assassination of Iranian Maj. Gen. Qassem Soleimani, raising the prospect of war with Iran: \"I was right about Vietnam. I was right about Iraq. I will do everything in my power to prevent a war with Iran. I apologize to no one .\" At this moment in time, 20 years into a war without end in Afghanistan--unless Trump really does end it in the fourth year of his presidency--with foreign policy experts constantly demanding military intervention against some faraway tribe, Sanders' anti-war sentiments are a balm to the country's weary soul. Four years ago, Bernie probably beat Hillary Clinton--minus the finagling of the Democratic National Committee--by slogging her for her Iraq War vote. Also, four years ago, Trump destroyed Jeb! <mark>Bush</mark> during a debate in the most pro-military state in the union, South Carolina, by calling the Iraq War a \"big, fat mistake\" and saying Jeb!'s brother had \"lied\" us into it. The media heralded this as another Trump gaffe, \"his riskiest departure from the party line,\" as Fortune magazine put it. A week later, Trump swept the South Carolina primary, walking away with all 50 delegates. Trump bragged so much about his opposition to the Iraq War that media \"fact-checkers\" worked overtime to prove that he was an Iraq War supporter. I think they were wrong and Trump was right, but the point is: Both Trump (the candidate) and the media knew that the anti-war position was wildly popular with voters. Then Trump became president, and the only people working overtime on his war stance became his own voters, constantly on edge that he's about to start a war with Syria or Iran. Sanders has also shown remarkable consistency in his contempt for Wall Street. (There's a reason poor Mike Bloomberg was running .) To great acclaim, Sanders says things like, \"The billionaire class is scared and they should be scared .\" He vows to break up banks and impose a wealth tax. \"We're prepared to be their worst nightmare,\" he says. Similarly, back when he was running, Trump alone among Republicans kept harping about the absurd carried interest tax break that allows hedge fund managers (and private equity and venture capital managers) to pay a tax rate of 20 percent on their income, rather than the 39.6 percent the rest of us pay. Trump complained endlessly about the loophole, saying, \"the hedge fund guys are getting away with murder .\" He said some of these people \"are making a tremendous amount of money and paying virtually no tax, and I think it's unfair .\" Clueless as ever, a shocked New York Times reported: \"Defying Republican political gravity, after his heresy of proposing a tax increase, Mr. Trump's popularity among Republicans rose .\" The sad ending to this story is that then Trump became president and hired half of Goldman Sachs. More Goldman Sachs employees work in the Trump administration than worked for Presidents Obama and <mark>Bush</mark> combined. <mark>Gary Cohn</mark>, one of these patriotic, salt-of-the-earth Goldman guys, told Trump not to eliminate the carried interest loophole, so he didn't. And Warren Buffett continues to pay a lower tax rate than his secretary. Maybe a Fidel-admiring revolutionary was never the best champion of even the most popular ideas--just as a vulgar reality TV star wasn't. Maybe Bernie is dead. But the universal popularity of hating Wall Street, war and immigration will never die. It could be that a \"safe\" choice is all the Democrats need. But I think Trump just dodged a bullet.", "articleID": "2020030421_00014624_W", "names": {"Gary Cohn": ["Q5524866", "Q5524867", "Q5524868"], "John Kerry": ["Q22316", "Q6242998"], "President Bush": ["Q207", "Q23505"]}}, {"date": "2020-03-05", "url": "http://tweeddailynews.com.au/news/cats-captain-waiting-on-four-quarter-performance/3960681/", "content": "<mark>Melissa Hickey</mark> of the Cats attempts to mark the ball during the Round 3 AFLW match between the Geelong Cats and the Adelaide Crows at GMHBA Stadium in Geelong. AFL Cats captain waiting on four-quarter performance callum dick callum dick Full Profile Login to follow 5th Mar 2020 8:00 PM premium_icon Subscriber only 0 GEELONG skipper <mark>Melissa Hickey</mark> is not one for cliches, but she says the team's ability to \"stick to the processes\" is what will give it the best chance of playing finals football this season. After going winless through the first three rounds, the Cats righted the ship with a 22-point win over Conference A rivals Richmond at the weekend. <mark>Hickey</mark> said the big win over the Tigers \"took the pressure off a little bit\" after the Cats previously dropped \"pretty gettable\" games to Fremantle, Brisbane and Adelaide. \"Our leanings from the first season were you can't get too up and down throughout the season. You shouldn't be able to tell week to week whether we've won or lost and I feel like we've been good at doing that,\" the skipper said. \"Our first three games were all pretty gettable--we just haven't been able to put together that four-quarter performance just yet .\" Even against Richmond the Cats held a game-high 41-point lead midway through the third term before allowing the Tigers to kick four straight goals and claw back into the contest. \"If I'm being honest we probably walked off against Adelaide (the week before) feeling more content than we did on the weekend, because we had such a lapse in the third quarter,\" <mark>Hickey</mark> said. Geelong AFLW captain <mark>Melissa Hickey</mark>. Photo: Dylan Burns But the 2017 All-Australian has seen enough from her side in year two to know it has risen \"to the next level\" and a four-quarter showing is not far away. \"People outside the club (are) saying the way we move the ball is some of the best across the league,\" <mark>Hickey</mark> said. \"We've got a really young midfield group that has been able to dominate teams and a backline that has stood up well--and I think we're playing some really good, attacking footy .\" Though the pressure valve was released slightly with the win over Richmond, a loss to the Suns tomorrow night would quickly tighten the screws once again as the season comes to a close. <mark>Hickey</mark> said the Cats were well aware of what was at stake and had primed themselves to put in their best performance of the season against the Suns in Mackay. \"It's crucial I think. (A loss) probably doesn't rule us out, but (a win) obviously helps our chances,\" she said. \"It's a pretty even ladder in our conference I think. From third to us (in sixth) there is only one game difference .\" 0 aflw round 5 Read More Login to follow geelong cats Read More Login to follow gold coast suns Read More Login to follow great barrier reef arena mackay Read More Login to follow <mark>melissa hickey</mark> Read More Login to follow aflw round 5 geelong cats gold coast suns great barrier reef arena mackay <mark>melissa hickey</mark>", "articleID": "2020030509_00034129_W", "names": {"Melissa Hickey": ["Q22687840", "Q28812989"]}}, {"date": "2020-03-05", "url": "https://www.morningstaronline.co.uk/article/b/scotland-to-reconsider-closure-of-nhs-laundry-services-due-to-coronavirus-spread", "content": "Thursday, March 5, 2020 Scotland to reconsider closure of NHS laundry services due to coronavirus spread × You can read 9 more articles this month Please help support the Morning Star by subscribing here THE decision to close NHS laundry services in Scotland will be reconsidered as part of planning to deal with a coronavirus pandemic following pressure from Labour today. Scottish party leader <mark>Richard Leonard</mark> secured a commitment from First Minister Nicola Sturgeon at Holyrood after he raised concerns about the closure of half of the sites serving hospitals north of the border. Discussions are ongoing about whether mainland Scotland should be left with just four laundries. Mr <mark>Leonard</mark> called on Ms Sturgeon to \"give an undertaking to ensure the necessary funding and resources are available to councils and the NHS\" and to \"place a moratorium\" on the plans to reduce the number of laundries. In response, the First Minister said no decision would be taken on the laundries which could adversely affect the Scottish government's response to coronavirus. She added that no final options had been presented to ministers on the potential closures, which would affect dozens of staff in Tayside and Fife. Ms Sturgeon was also asked to given councils the necessary resources to ensure that hygiene levels are maintained. Mr <mark>Leonard</mark> added that he had spoken to council leaders who were worried about the capacity of social-care services across Scotland. He asked Ms Sturgeon how the government planned to meet its Coronavirus Action Plan commitment to \"support early discharge from hospital,\" given that Scotland's NHS is struggling to discharge patients on time. She responded by pointing to increased resources for local government in the 2020-21 budget to cover cleaning services. The news coincided with the government warning that the number of confirmed cases of coronavirus in Scotland could rise \"very rapidly\" in the coming days. Ms Sturgeon also made clear that the Department for Work and Pensions must ensure that universal credit claimants who have to self-isolate are not sanctioned for following medical advice. With some workers not eligible for sick pay if they are affected, she said the British government should set up immediate hardship grants for people in this situation. Others liked Tuesday 03rd Mar 2020 Russell Group \"running scared' of reputational damage from UCU strike Wednesday 04th Mar 2020 British state linked to yet another set of killings in the north of Ireland Wednesday 04th Mar 2020 Red ambition: the Connolly Youth Movement in 2020 Wednesday 04th Mar 2020 Chairman of local Tory association resigns after telling SNP MEP to\" go back to the country of your birth' Tuesday 03rd Mar 2020 INTERVIEW From Bakers Oven worker to trade union leader Join the 501 Club You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by joining the 501 club. Just £ 5 a month gives you the opportunity to win one of 17 prizes, from £ 25 to the £ 501 jackpot. By becoming a 501 Club member you are helping the Morning Star cover its printing, distribution and staff costs--help keep our paper thriving by joining! Join here \"Buy Shares You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by become a member of the People's Printing Press Society. The Morning Star is a readers' co-operative, which means you can become an owner of the paper too by buying shares in the society. Shares are £ 1 each--though unlike capitalist firms, each shareholder has an equal say. Money from shares contributes directly to keep our paper thriving. Some union branches have taken out shares of over £ 500 and individuals over £ 100. Buy here\" Donate to the Fighting Fund You can't buy a revolution, but you can help the only daily paper in Britain that's fighting for one by donating to the Fighting Fund. The Morning Star is unique, as a lone socialist voice in a sea of corporate media. We offer a platform for those who would otherwise never be listened to, coverage of stories that would otherwise be buried. The rich don't like us, and they don't advertise with us, so we rely on you, our readers and friends. With a regular donation to our monthly Fighting Fund, we can continue to thumb our noses at the fat cats and tell truth to power. Donate today and make a regular contribution. Donate here \"", "articleID": "2020030516_00029207_W", "names": {"Richard Leonard": ["Q24039896", "Q50365677", "Q7327335"]}}]