[{"date": "2020-03-05", "url": "http://wftv.com/news/politics/latest-sanders/GH5SZURDZQ2ZL4SNOB72J2WPNI/", "content": "The Latest: Klobuchar going to Michigan to stump for Biden Share Share Share Updated: March 5, 2020 - 2:47 PM WASHINGTON--(AP)--The Latest on the 2020 presidential election (all times local): 2:45 p.m. Amy Klobuchar is going to Michigan to campaign for her former Democratic presidential rival Joe Biden. Content Continues Below The Minnesota senator dropped out of the 2020 race on the eve of Super Tuesday and endorsed Biden. Fellow former candidates Pete Buttigieg, Beto O'Rourke and Mike Bloomberg soon followed. Klobuchar will visit with union members in Detroit on Friday before hosting a Women for Biden event in Southfield, Michigan. On Saturday, Klobuchar will speak at a get-out-the-vote event in Grand Rapids. Biden won 10 of 14 states on Super Tuesday, including delegate-rich Texas. Vermont Sen. Bernie Sanders captured four states, including the biggest prize of all, California. ___ 12:50 p.m. Elizabeth Warren says she will not be running for president in 2020 but guarantees that she will stay in the fight. Speaking to reporters Thursday outside her home in Cambridge, Massachusetts, Warren said she'd likely endorse one of the two major candidates left in the race, Joe Biden or Bernie Sanders, but \"not today .\" \"I need some space and I need a little time right now,\" she said, standing next to her husband, <mark>Bruce Mann</mark>, and golden retriever, Bailey. Warren's voice cracked when she talked about meeting so many little girls while campaigning around the country for the past year and knowing they \"are going to have to wait four more years,\" at least, to see a woman in the White House. The Massachusetts senator was the Democratic presidential primary's last top female candidate. She suspended her campaign Thursday, two days after a disappointing Super Tuesday that included a third-place finish in her home state. Warren added: \"I have no regrets at all. This has been the honor of a lifetime .\" ___ 10:50 a.m. Elizabeth Warren has ended her Democratic presidential bid after a disappointing finish in Super Tuesday states. That's according to a person familiar with her plans who wasn't authorized to speak about Warren's intentions and talked to The Associated Press on Wednesday on the condition of anonymity. The Massachusetts senator's campaign had the markers of success: robust poll numbers, impressive fundraising, a national organization. But she was squeezed out by Bernie Sanders, who had an immovable base of voters she needed to advance. In the end, she didn't even win her home state--she finished third behind Joe Biden, who won it, and Sanders. Her exit from the race on Thursday came days after Amy Klobuchar dropped out. It leaves the Democratic field with just one remaining female candidate: Hawaii congresswoman Tulsi Gabbard .--AP writer Will Weissert FILE - In this Feb. 27, 2020 file photo, Democratic presidential candidate Sen. Elizabeth Warren, D-Mass ., addresses supporters during a town hall in San Antonio. (AP Photo/Eric Gay) (Eric Gay) Sen. Amy Klobuchar, D-Minn ., endorses Democratic presidential candidate former Vice President Joe Biden at a campaign rally Monday, March 2, 2020 in Dallas. (AP Photo/Eric Gay) (Eric Gay) © 2020 Copyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.", "articleID": "2020030520_00068674_W", "names": {"Bruce Mann": ["Q18379159", "Q4977945", "Q4977948"]}}, {"date": "2020-03-05", "url": "https://www.bostonglobe.com/2020/03/05/sports/astros-left-their-stars-home/", "content": "FORT MYERS, Fla.--The villains didn't show. Yet no one among the sellout crowd of 9,472 Thursday at JetBlue Park for the first Red Sox-Astros encounter of the spring seemed to mind. When the Red Sox clubhouse opened at 8 a.m., the lineup cards for both teams were posted just inside the door. Familiar names filled out the Red Sox' side--Xander Bogaerts (at shortstop for the first time this spring), J.D. Martinez, Rafael Devers. It was not far from the lineup they'll wield on Opening Day March 26 in Toronto. The Astros' side was a different matter. Manager Dusty Baker's batting order included relative obscurities with the last names Dawson (Ronnie, not Andre), Stubbs (Garrett, not Franklin or Drew), and Mayfield (Jack, definitely not Baker). Advertisement Alex Bregman did not make the two-plus-hour trip from the Astros' camp in Kissimmee. Neither did Jose Altuve, <mark>Carlos Correa</mark>, or <mark>George Springer</mark>. There was not a single Astro that baseball-reference. com considered a starter from last year's team. Aledmys Diaz, who had 247 plate appearances last year as <mark>Correa</mark>'s understudy, was the most experienced Astro in the lineup. The entire lineup combined for 640 plate appearances in the majors last season, or 50 fewer than Bregman alone. The most notable member of the champion 2017 Astros to put in an appearance at JetBlue Thursday was pitcher Collin McHugh, who stopped in to sign a one-year contract with the Red Sox. The absence of any Astro with legitimate name recognition was naturally a cause of suspicion given the events of the offseason. The Astros were busted in a sign-stealing scandal that cost general manager Jeff Luhnow and manager A.J. Hinch their jobs and has led many fans to put a mental asterisk on their 2017 World Series title. The collateral damage reached Boston, too, with former Astros bench coach Alex Cora losing his managerial job with the Red Sox for his role as a mastermind of the Astros' cheating. The Red Sox, accused of a sign-stealing scheme of their own during Cora's tenure, are still waiting to learn the consequences. Advertisement For now, the Astros are the sole wearers of the black hats, baseball's bad guys, the sport's most collectively disliked franchise in recent memory. They've been booed lustily in opposing territory this spring, and seven Houston batters were hit by pitches through the first week of spring training games. Perhaps it's wise for preservation purposes to keep theelite players away from road crowds for a while. But manager Dusty Baker, Hinch's replacement and a calming presence who each day must face questions about a scandal he had nothing to do with, said he left his stars home for case-by-case reasons. \"You've got Altuve who is sick,\" said Baker, holding court in the Astros' dugout two hours before the game. \"You've got [Yordan] Alvarez who is dealing with his knee. Bregman and Altuve went to Lakeland [to play the Tigers Wednesday]. I try to play them every other day. So no, it's not out of the ordinary at all .\" Baker did acknowledge that his roster was a little short of recognizable major league talent. Teams are supposed to bring a minimum of four regulars to each road game. \"The hardest part is having four regulars that can go, because we don't have a utility-type team,\" said Baker. \"We were told Diaz didn't count, and he has four years in the big leagues .\" Advertisement Baker was asked who actually does count. \"Bregman,\" he deadpanned. \"Altuve...\"So this starless sky of a lineup he brought with him had nothing to do with avoiding a potentially loud and aggravated reception from Boston fans?\" Hell, no, \"said Baker .\" That was the furthest thing from my mind. \"Perhaps it was because all of the familiar names and suspected trash-can bangers were not in attendance, but it turned out that there was no obvious negative response to the Astros anyway. There were no boo birds among the snowbirds. No hoots or verbal jabs were aimed at leadoff hitter Myles Straw when he dug in. A foul pole to foul pole walk through the concourse in the first inning revealed not a single anti-Astros sign in the crowd. Signs are not technically prohibited in JetBlue's ballpark rules (don't try to bring in beach balls, flag poles, lawn chairs, firearms, or knives of any size, however). Three ticket takers working Gate B told me that they hadn't seen a single sign all day. Of course, maybe Red Sox fans should be hesitant to let the Astros have it quite yet since any punishment for their own team's alleged sign-stealing scheme is pending, and has been pending for a somewhat alarming amount of time. To totally hate on the Astros before knowing your own team's consequences would be akin to playing baseball in a glass house, something Baker subtly noted before the game. Advertisement\" Better be careful of the reception they're giving, \"he said .\" It could be here, too. \"Chad Finn can be reached at chad.finn @ globe.com. Follow him on Twitter @ GlobeChadFinn.", "articleID": "2020030522_00169586_W", "names": {"Carlos Correa": ["Q2754588", "Q57055498", "Q58499542", "Q82518", "Q9696967"], "George Springer": ["Q1508274", "Q5544750"]}}, {"date": "2020-03-06", "url": "http://www.nhregister.com/news/world/article/Great-Barrier-Reef-enters-crucial-period-in-coral-15110190.php", "content": "https: //www.nhregister.com/news/world/article/Great-Barrier-Reef-enters-crucial-period-in-coral-15110190.php Great Barrier Reef enters crucial period in coral bleaching Rod Mcguirk, Associated Press Updated 6:26 am EST, Friday, March 6, 2020 FILE - This Sept. 10, 2001, file photo shows Agincourt Reef, located about 30 miles off the coast near the northern reaches of the 1,200-mile long Great Barrier Reef. The Great Barrier Reef is facing a critical period of heat stress over the coming weeks following the most widespread coral bleaching the natural wonder has ever endured, scientists said Friday, March 6, 2020. less FILE - This Sept. 10, 2001, file photo shows Agincourt Reef, located about 30 miles off the coast near the northern reaches of the 1,200-mile long Great Barrier Reef. The Great Barrier Reef is facing a critical...more Photo: Randy Bergmann, AP Photo: Randy Bergmann, AP Image 1 of / 1 Caption Close Image 1 of 1 FILE - This Sept. 10, 2001, file photo shows Agincourt Reef, located about 30 miles off the coast near the northern reaches of the 1,200-mile long Great Barrier Reef. The Great Barrier Reef is facing a critical period of heat stress over the coming weeks following the most widespread coral bleaching the natural wonder has ever endured, scientists said Friday, March 6, 2020. less FILE - This Sept. 10, 2001, file photo shows Agincourt Reef, located about 30 miles off the coast near the northern reaches of the 1,200-mile long Great Barrier Reef. The Great Barrier Reef is facing a critical...more Photo: Randy Bergmann, AP Great Barrier Reef enters crucial period in coral bleaching 1 / 1 Back to Gallery CANBERRA, Australia (AP)--The Great Barrier Reef is facing a critical period of heat stress over the coming weeks following the most widespread coral bleaching the natural wonder has ever endured, scientists said Friday. David Wachenfeld, chief scientist at the Great Barrier Reef Marine Park Authority, the government agency that manages the coral expanse off northeast Australia, said ocean temperatures over the next month will be crucial to how the reef recovers from heat-induced bleaching. \"The forecasts...indicate that we can expect ongoing levels of thermal stress for at least the next two weeks and maybe three or four weeks,\" Wachenfeld said in a weekly update on the reef's health on Thursday. \"So this still is a critical time for the reef and it is the weather conditions over the next two to four weeks that will determine the final outcome,\" he said. Ocean temperatures across most of the reef were 0.5 to 1.5 degrees Celsius (0.9 to 2.7 degrees Fahrenheit) above the March average. In parts of the marine park in the south close to shore which avoided the ravages of previous bleachings, ocean temperatures were 2 to 3 degrees Celsius (3.6 to 5.4 degrees Fahrenheit) above average. The authority has received 250 reports of sightings of bleached coral due to elevated ocean temperatures during an unusually hot February. The 345,400-square kilometer (133,360-square mile) World Heritage-listed colorful coral network has been devastated by four coral bleaching events since 1998. The most deadly were the most recent, in consecutive summers in 2016 and 2017. Scientists fear the latest coral death rate could match those events. \"At the moment, it's definitely the most extensive bleaching event we've ever had,\" U.S. National Oceanographic and Atmospheric Administration Coral Reef Watch scientist <mark>William Skirving</mark> said Friday. \"It's certainly an end-to-end bleaching event with severe bits at each end and it's not looking good for the southern end, but it really depends on the weather in the next two weeks,\" he said. Ove Hoegh-Guldberg, a scientist from the Australian Research Council Center for Excellence in Coral Reef Studies, said how much of the bleached coral would recover and how much would die would not be known for weeks. \"I'm very worried about the situation given how warm the temperatures are on the Great Barrier Reef and what the projections are,\" Hoegh-Guldberg said. \"If it cools down a bit, they'll recover or, if not, we may head off into something not too different from 2016 and 2017. We're right at the fork in the road,\" he added. The Great Barrier Reef Marine Park Authority last year downgraded its outlook for the corals' condition from \"poor\" to \"very poor\" due to warming oceans. Its latest report, which is updated every five years, found the greatest threat to the reef remained climate change. The other threats are associated with coastal development, land-based water runoff and human activity such as illegal fishing. Most Popular 1 17-year-old reported missing from West Haven 2 Former West Haven police officer named \"Irishman of the Year' 3 Exclusive: At least 200 in CT monitored for coronavirus 4 New faces on tap for this year's West Haven\" Pizza Wars' 5 Yale student struck by vehicle in downtown New Haven 6 Student returning from Italy says she was not screened for...7 When Boris Yeltsin went grocery shopping in Clear Lake View Comments © 2020 Hearst Communications, Inc. .", "articleID": "2020030611_00106166_W", "names": {"William Skirving": ["Q43914240", "Q51180855"]}}, {"date": "2020-03-08", "url": "http://www.foxnews.com/politics/fauci-says-anything-is-possible-when-asked-about-widespread-coronavirus-quarantine", "content": "close Video Dr. Anthony Fauci on US response to coronavirus Coronavirus task force member Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, joins <mark>Chris Wallace</mark> on \"Fox News Sunday .' Dr. Anthony Fauci, the head of the National Institute of Allergy and Infectious Diseases, said on Sunday that while he hopes it doesn't come to it, the government could shut down certain sections of the country hit hard by the coronavirus. Speaking during an interview on\" Fox News Sunday, \"Fauci said that\" anything is possible \"when asked if measures like those currently being imposed in Italy could be enacted in the U.S. to help prevent the continued spread of the coronavirus .\" I don't think it would be as draconian as nobody in or nobody out, \"Fauci said .\" But if we continue to get cases like this, particularly at the community level, there will be what we call \"mitigation,' where we have to essentially do social distancing, keep people out of crowded places, take a look at seriousness, do you really need to travel, and I think it's particularly important among the most vulnerable .\" He added: \"You know, you don't want to alarm people, but given the spread we've seen, you know, anything's possible. And that's the reason why we've got to be prepared to take whatever action is appropriate to contain and mitigate the outbreak .\" CORONAVIRUS: EVERYTHING YOU NEED TO KNOW Fauci's comments shortly after Italian Minister <mark>Giuseppe Conte</mark> signed a decree restricting the movements of about a quarter of the country's population in a bid to limit contagions at the epicenter of Europe's outbreak. Video \"For Lombardy and for the other northern provinces that I have listed there will be a ban for everybody to move in and out of these territories and also within the same territory,\" <mark>Conte</mark> said. \"Exceptions will be allowed only for proven professional needs, exceptional cases and health issues .\" Around the world, more and more countries were bracing for a big increase in virus cases. Western countries have been increasingly imitating China--where the virus first emerged late last year, and which has suffered the vast majority of infections--by imposing travel controls and shutting down public events. CLICK HERE FOR COMPLETE CORONAVIRUS COVERAGE While the global death toll has risen past 3,400, more people have now recovered from the virus than are sickened by it. As of Saturday, nearly 90,000 cases have been reported in Asia; more than 8,000 in Europe; 6,000 in the Mideast; about 450 in North America, Latin America and the Caribbean, and fewer than 50 cases reported so far in Africa. Video While many scientists say the world is clearly in the grips of a pandemic--a serious global outbreak--the World Health Organization isn't calling it that yet, saying the word might spook the world further. The virus is still much less widespread than annual flu epidemics, which cause up to 5 million severe cases around the world and up to 650,000 deaths annually, according to the WHO. CLICK HERE TO GET THE FOX NEWS APP The U.S. Centers for Disease Control and Prevention is urging older adults and people with severe medical conditions to \"stay home as much as possible\" and avoid crowds. Most people who get the virus have mild cases, though the elderly face greater risks. Among the many new cases in Europe on Saturday was a doctor in Slovenia who was in contact with more than 100 people in a nursing home after a ski trip to neighboring Italy. The Associated Press contributed to this report. Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox Arrives Weekdays Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter! ADVERTISEMENT", "articleID": "2020030815_00027827_W", "names": {"Chris Wallace": ["Q21256789", "Q2964884", "Q2964885", "Q37624906", "Q5108402", "Q5108404"], "Giuseppe Conte": ["Q3770348", "Q46756395", "Q53844829"]}}, {"date": "2020-03-09", "url": "http://www.deccanherald.com/international/world-news-politics/germany-coronavirus-cases-cross-1000-812031.html", "content": "Home Bengaluru Top Stories Crime Politics Infrastructure Life in the City Bengaluru 2040 Karnataka Top Stories 20 in' 20 Politics Districts National Politics North and Central South East and Northeast West Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Budget 2020 Business News Family Finance Technology DH Wheels Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Videos Latest Videos Bengaluru Karnataka People Popular Features Metrolife Entertainment Travel Spectrum Sunday Herald Living DH Education Specials Insight Point Blank Sunday Spotlight Newsletter Get the best of news in your inbox everyday GET IT Monday 9 Mar 2020 updated: 8:40 pm IST E-Paper Classifieds BLR 28 ° C Clouds Sensex: 35634.95 -1941.67 Nifty: 10451.45 -538 Home Bengaluru Top Stories Crime Politics Infrastructure Life in the City Bengaluru 2040 Karnataka Top Stories 20 in' 20 Politics Districts National Top Stories Politics North and Central South East and Northeast West Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Budget 2020 Business News Family Finance Technology DH Wheels World Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Metrolife Your Bond With Bengaluru Cityscape On The Move Lifestyle Videos Latest Videos Bengaluru Karnataka People Popular Entertainment DH Showtime Entertainment News DH Talkies Arts, Books & Culture Specials Insight Point Blank Sunday Spotlight Travel Spectrum Top Stories Statescan Living Front Page Health 'n' Well-Being Fashion Folio Food Fiesta Sunday Herald SH Top Stories Entertainment Articulations Art & Culture Melange Books Photos Pics of the Day DH Galleries 70 Years of DH My Take Your Space DH Education E-Paper Newsletter IN BRIEF: No selfies during SA series? 86 dolphins dead in Namibia Iran COVID-19 toll touches 237 Bolsonaro needs new surgery Press freedom has taken a hit More COVID-19 labs in K'taka Home International World News & Politics Germany coronavirus cases cross 1,000 Germany coronavirus cases cross 1,000 Germany coronavirus cases cross 1,000 X Share via Share permalink AFP, Berlin, Mar 09 2020, 15:18 pm ist updated: Mar 09 2020, 20:43 pm ist The number of coronavirus cases in Germany has passed 1,000, official data from the <mark>Robert Koch</mark> Institute disease control centre showed on Monday. There are now a total of 1,112 confirmed cases in Europe's biggest economy, with the region of North Rhine-Westphalia (NRW) reporting 484 infections--the highest number among Germany's 16 states. In a bid to slow contagion, Health Minister Jens Spahn has called for gatherings of more than 1,000 people to be scrapped across Germany, which could affect many events including Bundesliga football matches. NRW state premier Armin Laschet said he planned to follow Spahn's advice in scrapping large gatherings in the state, meaning that several football games, including Saturday's derby between Dortmund and Schalke could be played in empty stadiums. Wednesday's game between Borussia Moenchengladbach and Cologne would also be affected, said NRW health minister Karl-Josef Laumann. \"I will let the clubs decide if they want to play without spectators or if they prefer to not play at all,\" he told public broadcaster ARD. Also based in the region, second-division club VfL Bochum said Monday it has stopped selling tickets for upcoming matches. German Football League chief Christian Seifert has said the season must end by mid-May, in a sign that matches would likely be played behind closed doors in a bid to keep to the schedule. With measures taken to halt the virus hitting the economy hard, leaders of Chancellor Angela Merkel's right-left coalition agreed an aid package. The coalition \"is taking action in the corona-crisis. Besides medical protection measures, we have agreed on a big aid package for the German economy,\" tweeted Markus Soeder, leader of Merkel's Bavarian allies CSU, calling the package \"comprehensive\". Deccan Herald News now on Telegram - Click here to subscribe DH Newsletter Privacy Policy Get top news in your inbox daily GET IT Germany Coronavirus COVID-19 0 Comments (+) Related stories COVID-19: No selfie, fan interaction during SA series?...Coronavirus: B'luru primary schools shut indefinitely COVID-19: All DTC, Delhi Metro to be disinfected daily...Bengaluru confirms 1st coronavirus case in Whitefield How the coronavirus has hit global sports IMF calls for \"substantial' stimulus against COVID-19 DH Picks Bengaluru confirms 1st coronavirus case in Whitefield MP govt in crisis? Scindia and 17 MLAs\" untraceable'...Coronavirus live updates: Karnataka reports first positive case; Total...Live Who is UK-based Bihar CM aspirant Pushpam Priya?...Yes Bank Crisis Live: ED scanner on big loans...Live social feed What does your star sign say? Explore National Politics North and Central South East and Northeast West Karnataka Top Stories Politics Districts Bengaluru Top Stories Bengaluru Crime Politics Infrastructure Life in the City Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Business News Budget 2019 Family Finance Technology DH Wheels Multimedia Videos Photos Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Entertainment Entertainment News DH Talkies Arts, Books & Culture Coronavirus Outbreak YES Bank Crisis Madhya Pradesh govt in crisis? Infy staffers caught taking Rs 15L bribe DH Picks Bengaluru confirms 1st coronavirus case in Whitefield MP govt in crisis? Scindia and 17 MLAs \"untraceable' Coronavirus live updates: Karnataka reports first positive case; Total number of India cases rises to 45 Who is UK-based Bihar CM aspirant Pushpam Priya? Yes Bank Crisis Live: ED scanner on big loans issued by Yes Bank, Kapoor's foreign assets Latest stories J & K: ED raids real estate cos, seizes Rs 25 c assets COVID-19: No selfie, fan interaction during SA series? Sudan PM unharmed in assassination attempt: Aide Coronavirus: B'luru primary schools shut indefinitely Delhi riots similar to 2002 Gujarat riots: Congress Trending news No discovery of 3,000-tonne gold deposits in UP: GSI\" Let her rot in jail, let police break her bones' Lord Shiva gets his own berth in Kashi Mahakal Express Fire breaks out behind Prestige Lakeview in Bengaluru Trump is coming to boost his economy, not ours: Swamy Services About Epaper Newsletter Archives Sitemap Classifieds Contact Our group sites Printers Mysore Prajavani Sudha Mayura Privacy Policy Terms Disclaimer © 2020 The Printers (Mysore) Private Ltd.. X Share via Share permalink We use cookies to understand how you use our site and to improve user experience. This includes personalising content and advertising. By continuing to use our site, you accept our use of cookies, revised Privacy Policy. Learn more I agree X We use cookies. Learn more X", "articleID": "2020030915_00067916_W", "names": {"Robert Koch": ["Q1114522", "Q18844133", "Q2798377", "Q823423"]}}, {"date": "2020-03-10", "url": "http://www.maldonandburnhamstandard.co.uk/news/national/18295083.pc-andrew-harper-killed-truly-shocking-circumstances-court-told/", "content": "News National News Pc Andrew Harper killed in \"truly shocking circumstances', court told By Press Association 2020 Pc Andrew Harper Police officer Andrew Harper was dragged for more than a mile along a road and killed in\" truly shocking circumstances \", a court has heard. Prosecutor Brian Altman QC told the Old Bailey on Monday that the alleged murder of the 28-year-old constable was\" a completely senseless killing \". Pc Harper died from multiple injuries when he was pulled along behind a car after responding to the reported theft of a quad bike from a home near the village of Sulhamstead in Berkshire. One witness mistakenly thought he had seen a bloodied deer attached to the car before realising it was a man being dragged along, the jury heard. Henry Long, 18, from Mortimer, Reading, and two 17-year-olds, who cannot be named for legal reasons, all deny murdering the Thames Valley Police officer in August last year. Court artist sketch of Henry Long, 18 (left) (Elizabeth Cook/PA) Mr Altman told jurors:\" Late at night, on Thursday August 15 of last year, in Berkshire, 28-year-old Andrew Harper, a serving police constable of Thames Valley Police, was killed in truly shocking circumstances. \"With his ankles caught in a strap that was trailing behind a car being driven at speed along a country lane, he was dragged for over a mile along the road surface, swung from side to side like a pendulum in an effort to dislodge him, losing items of his police uniform along the way, with the rest of his uniform being quite literally ripped and stripped from his body .\" When, at last, he became disentangled, he was left with the most awful injuries, from which he died there on the road, surrounded by colleagues who tried in vain to save him. \"Mr Harper, left wearing only his socks and boots, suffered injuries that were unsurvivable, the court heard. The jury was told:\" This was a completely senseless killing of a young police officer in the line of duty. \"Long has admitted manslaughter, which the younger boys deny, and all three have pleaded guilty to conspiracy to steal a quad bike. Several members of Pc Harper's family were in court as the prosecution case opened. Police and flowers left at the scene where Thames Valley Police officer Pc Andrew Harper, 28, died. (Dominic Lipinski/PA) Pc Harper, known as\" Harps \"to his colleagues, was part of Thames Valley's Roads Policing Unit, and had been due to work a 10am to 7pm shift that day. He was still on duty with crew mate Pc <mark>Andrew Shaw</mark> at 11.17 pm, and they were driving in an unmarked police BMW fitted with emergency lights. The pair, who were both wearing uniform, answered the call to the reported theft of the quad bike although it was past the end of their shift. Mr Altman said:\" Despite it being well beyond the end of their shift, because they were close and thought they could help, they responded to the call. It was a decision that was to cost Andrew Harper his life. \"Prosecutors claim that the three defendants had planned the theft, visiting the home of owner Peter Wallis earlier that day and taking steps to avoid being caught by police. It is alleged that having been challenged by Mr Wallis earlier in the day, they returned with items that could be used as weapons if they were challenged, including crowbars, an axe and a hammer. Mr Altman said:\" They were ready, as part of their planning, if necessary, to use the items they had brought with them as weapons if anyone stood in their way. \"Sensibly, Mr Wallis did not stand in their way this time .\" Pc Harper did try to stand in their way, and he paid the ultimate price for it. \"The court heard that the officers were driving along a country lane, Lambdens Hill, on their way to the call when they met a Seat Toledo, driven by Long, coming the other way. One of the 17-year-olds was in the passenger seat, and the other was riding the quad bike which was being towed behind the car, attached to the boot lid hinge with a crane strap that formed a loop. As the cars met, the teenager on the quad bike dismounted, disconnected the strap from the bike and tried unsuccessfully to get into the passenger door of the Seat, as Long began to drive off. Pc <mark>Shaw</mark> turned the BMW's emergency lights on, and the teenager ran to jump through the back passenger window of the Seat. As Pc Harper tried to stop him, the officer's feet were encircled in the crane strap, and he was dragged along as Long drove off. The court heard that Long drove at an average speed of 42.5 mph, leaving a snaking trail of tyre marks, blood and clothing as he swerved across the country lane. A driver who had to slam on his brakes to avoid hitting the Seat as it crossed the A4 mistakenly thought Pc Harper was an injured deer. Mr Altman said:\" At first he thought there was a bloodied deer attached to the car, but quickly realised it was a person, trapped by both ankles, being dragged around the road and striking the kerb. \"Pc Harper was barely alive when he was found by his crew mate, and had suffered\" absolutely catastrophic, unsurvivable injuries \", the court heard.", "articleID": "2020031015_00027515_W", "names": {"Andrew Shaw": ["Q4758557", "Q507379"]}}, {"date": "2020-03-11", "url": "http://express.co.uk/news/world/1253757/Coronavirus-update-EU-commission-Ursula-von-der-leyen-italy-lockdown-PM-Conte", "content": "Four confirmed cases of the virus have been recorded in the European Commission after a further three cases tested positive today according to Italian journalist David Carretta. The Commission has now cancelled training courses and other non-essential events until April 3. Nick Ferrari confronts Tory MP following Dorries' coronavirus news EU stats PROVE Europe will be worst hit continent A further three European Commission officials are awaiting their test results. On Tuesday, EU leaders agreed to step up their response to the outbreak following the continued spread across the continent. The 27 leaders held a teleconference on Tuesday evening focusing on containing the impact on the European economy. With Italy now in lockdown, Commission President Ursula von der Leyen announced a new € 25billion (£ 21.8 billion) investment fund. Coronavirus: Cases in EU Commission increase to four (Image: GETTY) Coronavirus: There will be more funding to deal with the virus (Image: GETTY) Ms von der Leyen said: \"We will use all of our means at our disposal to make sure that our economy can weather this storm .\" The spread of the virus takes place and will take place. \"The most important part right now is to slow down the spread to prolong the time before infection takes place .\" EU Council President <mark>Charles Michel</mark> insisted the markets must still function properly despite the outbreak. JUST IN: FTSE 100 risers and fallers: Which shares have gone up or fallen? Coronavirus update: <mark>Giuseppe Conte</mark> hits out at EU response (Image: GETTY) Man Utd forward Marcus Rashford sends coronavirus message to fans Bank of England WARNING: Interest rates could be cut to nearly ZERO He warned any \"unjustified obstacles\" need to be avoided in order not to hinder EU trade even more so. Italy has reported the highest amount of cases outside of China and currently stands at 10,149. There have been a further 631 mortalities causing the country to placed into lockdown. Due to the lockdown, all sporting events have been cancelled while schools and universities have also been shut until April 3. DON'T MISS Coronavirus: Are you at risk of death from the virus? [Latest] Nicola Sturgeon squirms as she is grilled on Scotland's COVID-19 plan [Latest] Coronavirus conspiracy: Ex-Iranian president claims virus was from lab [Latest] Coronavirus: A digital meeting was held earlier this week (Image: GETTY) Coronavirus: <mark>Charles Michel</mark> also claimed trade must not be disrupted by any fruther delays (Image: GETTY) Transport will remain operational but the movements of the public will be restricted to try and restrict the spread of the contagion. Only those with work or family needs will be allowed to travel. Italy's Prime Minister <mark>Giuseppe Conte</mark> said: \"Our habits must be changed, changed now. We all have to give up something for the good of Italy .\" We will succeed only if we all collaborate and we adapt right away to these more stringent norms. \"Coronavirus World Map Live (Image: Express) In light of the crisis spreading across the country, the Italian government has hit out at the EU for not coming to its aid quick enough. Although EU officials did hold a conference to address the outbreak of the contagion across the continent, Italy's ambassador to the EU, Maurizio Massari said Brussels needed to do more. He warned Brussels must\" go beyond engagement and consultations \"and devise\" emergency actions that are quick \". Mr Massari said:\" We must ensure, under EU coordination, the supply of the necessary medical equipment and its redistribution among those countries and regions most in need. Coronavirus: Workers spray tourist sites in Venice (Image: GETTY) \"Today, this means Italy; tomorrow, the need could be elsewhere. Italy has already asked to activate the European Union mechanism of civil protection for the supply of medical equipment for individual protection .\" But unfortunately not a single EU country responded to the commission's call. \"Only China responded bilaterally. Certainly this is not a good sign of European solidarity .\" ", "articleID": "2020031113_00113448_W", "names": {"Charles Michel": ["Q5080932", "Q56084814", "Q950958"], "Giuseppe Conte": ["Q3770348", "Q46756395", "Q53844829"]}}]