[{"date": "2020-03-11", "url": "http://thelancasterandmorecambecitizen.co.uk/sport/national/18299125.ellis-smith-enjoy-thrilling-first-day-yonex-england/", "content": "Sport National Sport Ellis and <mark>Smith</mark> enjoy thrilling first day at Yonex All England Marcus Ellis and <mark>Lauren Smith</mark> were in jubilant spirits after their scintillating pair of first round victories Marcus Ellis and <mark>Lauren Smith</mark> both powered to a pair of victories on a thrilling first day of the Yonex All England Championships in Birmingham. 2016 Olympic bronze medallist <mark>Smith</mark> booked his place in the last 16 of both the men's and mixed doubles in front of a raucous English crowd, joining forces with <mark>Smith</mark> and Chris Langridge to keep his hopes of a famous hometown glory alive. The decorated 30-year-old eased past Japanese mixed pair Takuro Hoki and Wakana Nagahara 21-9 21-15 alongside <mark>Smith</mark>, teeing up a second round clash with fourth seeds <mark>Yuta Watanabe</mark> and Arisa Higashino. And in the men's competition Ellis and Langridge beat Di Zijian and <mark>Wang Chang</mark> after a pulsating third game decider, coming through 21-16 to book a date with world No. 5s Fajar Alfian and Muhammad Rian Ardianto. \"Both of these matches in the first round were real banana skins, but at the same time they were really winnable,\" Ellis said. Great performance from @ C_Langridge and @ ellis_marcus111 today to match the great celebrations!! #YAE 20 pic.twitter.com/O60aWGVNrR--Badminton England (@ BadmintonEnglnd) March 11, 2020 \"It's been a challenging few weeks for me and Chris with a few issues that have meant we haven't been able to train together very much .\" This is really, really big for us, even just winning this game - it's not even just in regards to points, and it's just really, really important for our partnership in the doubles. \"And when <mark>Lauren</mark> and I are at our best we just make ourselves very, very hard to beat .\" Going from the mixed to the men's doubles varies from tournament to tournament - it sometimes depends on how your confidence levels are that day, but they are very, very different events. \"The game is very different and I really have to switch my mentality, which sometimes can be more challenging than on other days .\" <mark>Smith</mark> first helped Ellis breeze pasty Hoki and Nagahara on Wednesday afternoon, before also turning her attention to another format as she teamed up with Chloe Birch. Amazing moment for @ ellis_marcus111 & @ LaurenE_Smith to take match point in the first round at the @ YonexAllEngland pic.twitter.com/WM0VXGFlWl--Badminton England (@ BadmintonEnglnd) March 11, 2020 And that duo toppled German pairing Linda Efler and Isabel Herttrich 21-18 21-14 under the Arena Birmingham lights, lining up a tantalising date with destiny against world No. 1s Chen Qingchen and <mark>Jia Yifan</mark>. \"Performing in this tournament is important - it's one of the big ones and it's highly-regarded among the badminton community, and it's our home tournament, so I would absolutely love to perform well here,\" <mark>Smith</mark> said. \"I've grown up watching it so it's got a lot of prestige, but I think the important thing is not getting caught up in the occasion - you've got to focus on performing day by day, and controlling the controllables .\" It's about not thinking too much about the event and the occasion, and just enjoying being able to play at home. \"It was first round heartbreak for Chris and Gabrielle Adcock in the mixed doubles, however, as the world No. 13s lost a disappointing three game encounter with eighth seeds Hafiz Faizal and Gloria Emanuelle Widjaja. The experienced double act restored parity at one game apiece after a brilliant 21-17 victory in game two, but lost the decider 21-12 to dash their hopes of a triumph on home soil. But after a build-up to the tournament that has been blighted by injuries, the duo remained upbeat that they had opted to appear at their favourite tournament of all. 2 from 2 for @ LaurenE_Smith as fighting spirit pulled her and @ ChloeBirch95 through today! 21-9 21-15. #YAE 20 pic.twitter.com/RUi5ZMP0Ax--Badminton England (@ BadmintonEnglnd) March 11, 2020\" It's still massive playing in front of a home crowd - obviously it's our favourite tournament and we love playing here, \"Gabrielle said .\" We like playing here each year, and weirdly, even though we've lost I'm just happy that we've got on court and that we've got a tournament next week that I should be fine for, so I'm going to get ready for that. \"Chris added:\" The first time we actually stepped on court for a couple of weeks was yesterday, so we didn't expect anything here really unfortunately. \"We've been a bit plagued with injuries leading into this event which is a shame, but we couldn't really turn down the opportunity to step on court .\" Any other tournament we wouldn't have given a go, but it's obviously hard to turn down an event like this. \"The fact that we took a set off a top ten pair with zero preparation is actually quite surprising .\" Ben Lane and Sean Vendy also succumbed to first round defeat, losing 21-14 21-12 against sixth seeds Hiroyuki Endo and <mark>Yuta Watanabe</mark>. The inexperienced pairing battled hard, however, and were still pleased to turn out in front of such a supportive home crowd. \"Of course it's always an experience I'll enjoy playing here - it's amazing playing in England, and this is the only tournament we really get to play where the crowds all come and we've got our families here,\" Lane said .?? You can watch the action from home on @ BBCSport & @ btsport...Or you can be here to see moments like this live for yourself...https: //t.co/n7BPDLYVZx #YAE 20 pic.twitter.com/vCZCNoEzzE--?? Yonex All England Badminton Championships?? (@ YonexAllEngland) March 11, 2020 \"It's obviously really disappointing when you lose, but at the end of the day they were better than us out there .\" Vendy added: \"The preparation has all been decent really, so I can't put the loss down to any other circumstances - I thought they were just better than us today .\" It's always nice to play in front of our home crowd - I think this is the third time we've played here and it's our favourite tournament by a long way. \"At the moment it doesn't feel quite so good as we've only got to play one game in it, but in years to come we hope we're going to be towards the latter end of the tournament .\" Elsewhere, final English pair Jenny Moore and <mark>Victoria Williams</mark> were unable to progress in the women's doubles, being forced to retire against Ashwini Ponnappa and N. Sikki Reddy when 5-4 down in the first game. And among the top seeds, there were wins for defending champion Chen Yufei in the women's singles, world No. 7 Viktor Axelsen in the men's singles and 2019 winners Zheng Siwei and Huang Yaqiong in the mixed doubles, while men's doubles world No. 1s Marcus Fernaldi Gideon and Kevin Sanjaya Sukamuljo took all three games to progress. The Yonex All England Open continues tomorrow as the last 16 battles get underway, with Ellis and <mark>Smith</mark>, <mark>Smith</mark> and Birch and Ellis and Langridge flying the home flag on what promises to be another scintillating day of badminton action.", "articleID": "2020031123_00008237_W", "names": {"Jia Yifan": ["Q15108796", "Q25252608"], "Lauren Smith": ["Q1433661", "Q57915095"], "Victoria Williams": ["Q1593494", "Q19966607", "Q23418831", "Q56753795", "Q7927138"], "Wang Chang": ["Q45371683", "Q45443578", "Q45444521", "Q45455400", "Q45455675", "Q45457665", "Q45465601", "Q45465665", "Q45470071", "Q45473463", "Q45484704", "Q45492033", "Q45506733", "Q45516001", "Q45523085", "Q45536111", "Q45540506", "Q45543056", "Q45545380", "Q45546324", "Q45546389", "Q45560013", "Q45566167", "Q45568468", "Q45591431", "Q45619968", "Q45625146", "Q45626127", "Q45631300", "Q45632583", "Q45636000", "Q45640098", "Q45650008", "Q45653747", "Q45653924", "Q45656329", "Q45661269", "Q45671769", "Q45702354", "Q45703043", "Q52144733"], "Yuta Watanabe": ["Q17492383", "Q24326424"]}}, {"date": "2020-03-11", "url": "http://uspolitics.einnews.com/article/511757563/BNkqp25NZxubKc8k", "content": "Hillary Clinton at the \"Hillary\" premiere in New York. Picture: Dimitrios Kambouris/Getty Opinion Hillary Clinton still thinks she can be President by Miranda Devine 11th Mar 2020 7:33 AM premium_icon Subscriber only 0 1 Surprise, surprise. Hillary Clinton is trailing her coat to be Joe Biden's Vice President, if not the Democratic nominee for President. Considering the cognitive impairment Biden is labouring under on the campaign trail, the roles are one and the same. Voters concerned about \"Sleepy\" Joe's senior moments and inability to string a sentence together without a teleprompter would be reassured by the presence of a stand-in, ready to go. After all, Hillary almost was President, was Secretary of State and, after eight years as First Lady, knows her way around the White House. And, at 72, she's five years younger than Biden. That's her take, anyway. She hasn't quite come out and said, \"Pick me\" but, as she launched a glowing four-part documentary about her life on Friday, the hints were too heavy to ignore. She still isn't over losing the 2016 presidential election to <mark>Donald Trump</mark>, for all her claims to have found contentment in her garden in bucolic Chappaqua, New York. Her latest suggestion came in an interview with CNN on Sunday when she said she would \"love to have a woman on the ticket, finally, again,\" she said. \"Obviously, I'd like to keep that moving, and actually have it happen in this election that someone would be the first woman vice president .\" Hillary Clinton said she'd \"love to have a woman on the ticket\" for President. Picture: Monica Schipper/Getty \"Someone\". Hmmmm. Wonder who? Last month she told talk show host Ellen DeGeneres that she'd consider being the Democrats' vice-presidential candidate in the November election, if asked. \"I never say never because I believe in serving my country, but it's never going to happen,\" she said, coyly. She has been inserting herself into this election cycle in a way that cries out unfinished business. Now that two white septuagenarians are the last men standing, she sees her opening. The Democratic establishment can't abide socialist populist Bernie Sanders, and they can't keep Biden in witness protection forever. At some point he'll be caught without the teleprompter and Hillary plans to be there for the rescue. She does interviews describing <mark>Trump</mark> as an \"illegitimate president,\" and mere \"occupant of the Oval Office\". She finds new excuses every day to explain away her election loss - from the Kremlin, Sanders, misogyny and self-hating women, to her campaign staff and the deplorables. With a newly wrinkle-free forehead and plumped-up cheeks, she and daughter Chelsea have been pressing the flesh at bookstores with their eponymous The Book of Gutsy Women and the upcoming Grandma's Gardens. On Friday, the hagio-documentary, Hillary, premiered on streaming service Hulu. There are moments where Hillary is surprisingly likeable, particularly in the first episode when we see her as a geeky young woman with thick glasses in the early 1970s breaking the glass ceiling at Yale Law school, and then giving up her shining career prospects to follow a shaggy-haired Lothario named Bill Clinton back to Arkansas. It is to her credit that she persevered with the marriage through all his philandering. However, her greatest strength is also her Achilles heel. The most prominent feminist politician in America showed just how shallow her commitment to the sisterhood is after Bill revealed in Hillary that he had used Monica Lewinsky like a stress ball when he was President. In a gobsmacking moment in Episode three, Bill, 73, dismisses his 1995 affair with the 22-year-old White House intern by saying it was something he did \"to manage my anxieties .\" Hillary's response was to go on TV last week and tell Watch What Happens Live host Andy Cohen how \"romantic and sensitive\" Bill is. \"I will come home sometimes, and he'll have flowers for me because he knows I've had a bad day. He's really so thoughtful .\" Not great timing. But the greatest insight in the Hulu doco comes when Hillary describes her great defeat in 2016. She was so devastated when she realised <mark>Trump</mark> had won the election that she lay on her bed in her suite at the five-star Peninsula Hotel in Manhattan, feeling \"bewildered and astonished\" and later \"collapsed in the back of the van\". Instead of trying to alleviate the anguish of her devoted supporters gathered at the cavernous Javits Center nearby, wearing their \"I'm With Her' T-shirts, she refused to make a concession speech, as Barack Obama had urged her to do in a phone call .\" Obama called me and he said, \"I'm really sorry but you probably should concede .' And I said,' I can't concede 'til the morning .' He said,\" Well, you gotta call <mark>Trump</mark>', and I said, \"oh brother',\" Hillary recalls. At 2am she dispatched her campaign chairman John Podesta to tell the crowd at the Javits Center it was \"too close to call\". It wasn't until 2.30 am that she called <mark>Trump</mark> to concede. But worse is to come. She describes in the doco how she was immensely cheered by the despair of Democrat voters, \"people crying on the sidewalks, holding their children up. [It was] like a death...\"What I loved was the reaction to the loss and the Resistance that grew up because of it,\" she said. \"It began to sprout almost immediately. There was a very big silver lining which made me feel somewhat better .\" This is not the reaction of a person who should ever be president of anything, not even the local school P & F. It's sociopathic. The destructive political polarisation in America over the past four years owes a great deal to Clinton's gracelessness. She embarrassed women by being such a sore loser and poisons any Democratic candidate who emulates her. @ mirandadevine More Stories Picture that proves the Queen has failed premium_icon Calm down. This is about TV programming--not gender premium_icon OPINION: Toilet paper aside, there are more serious issues premium_icon Parents, we need to talk about coronavirus prepping premium_icon Scott Cam can't offer aspiring tradies anything premium_icon Virus panic has taken our common sense, and our manners premium_icon No one seriously looks to the US for leadership any more Show More More Stories Picture that proves the Queen has failed premium_icon Calm down. This is about TV programming--not gender premium_icon OPINION: Toilet paper aside, there are more serious issues premium_icon Parents, we need to talk about coronavirus prepping premium_icon Scott Cam can't offer aspiring tradies anything premium_icon Virus panic has taken our common sense, and our manners premium_icon No one seriously looks to the US for leadership any more Show More 0 1 hilary clinton Read More Login to follow jo biden Read More Login to follow opinion Read More Login to follow politics Read More Login to follow usa Read More Login to follow hilary clinton jo biden opinion politics usa", "articleID": "2020031204_00083288_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2020-03-12", "url": "https://lethbridgeherald.com/entertainment/entertainment-news/2020/03/12/tom-hanks-rita-wilson-in-australian-hospital-with-new-virus/", "content": "Tom Hanks, <mark>Rita Wilson</mark> in Australian hospital with new virus Poll Will you be changing your vacation or other travel plans because of coronavirus concerns? Yes Follow @ Leth_Herald on twitter By Moussa Moussa, The Associated Press on March 12, 2020. FILE - In this Feb. 9, 2020 file photo, Tom Hanks, left, and <mark>Rita Wilson</mark> arrive at the Oscars at the Dolby Theatre in Los Angeles. The couple have tested positive for the coronavirus, the actor said in a statement Wednesday, March 11. The 63-year-old actor said they will be \"tested, observed and isolated for as long as public health and safety requires .\" (Photo by Jordan Strauss/Invision/AP, File) SYDNEY, Australia--Tom Hanks and his wife <mark>Rita Wilson</mark> are isolated in stable condition in an Australian hospital Thursday after contracting the new coronavirus, the actor and Australian officials said. The two-time Oscar winner is easily the most famous person yet to disclose they have COVID-19, which the World Health Organization has declared a pandemic. Hanks said he and <mark>Wilson</mark> had felt tired, with colds, aches and slight fevers. \"To play things right, as is needed in the world right now, we were tested for the coronavirus and were found to be positive,\" he said, adding they'll be \"isolated for as long as public health and safety requires .\" \u009d Australian officials said the couple were being treated at a Queensland hospital. \"We wish them a very speedy recovery,\" state Premier Annastacia Palaszczuk told reporters. Hanks had been in Australia shooting an untitled Elvis Presley biopic directed by Baz Luhrmann. Hanks plays Presley's manager, Colonel <mark>Tom Parker</mark>. The film, slated for release in October 2021, has suspended production, Warner Bros. said. Hanks, after accepting the Cecil B. DeMille Award at the Golden Globes this year, spoke backstage about taking on the <mark>Parker</mark> role. \"I will then finally have an answer to all these stupid questions about why I never played a bad guy,\" \u009d he said as the room burst into laughter. Hanks and <mark>Wilson</mark>, both 63, were married in 1988. In 2013, Hanks disclosed he has Type 2 diabetes. Chet Hanks later posted on social media that his parents were doing fine and thanked fans for their concern. <mark>Wilson</mark> had performed at the Sydney Opera House on Saturday night and earlier last week in Brisbane. Queensland health authorities would not give specifics on their health due to privacy issues. But the state's update on its coronavirus infections describe a U.S. couple of their age both in stable condition. Palaszczuk said people who had been in close contact with Hanks and <mark>Wilson</mark> will have to self-quarantine but she cautioned that people who had taken selfies with Hanks recently should not panic about contracting the virus. She said she had spoken to Luhrmann and conveyed his reassurances that he would comply with the government's health restrictions. Australia has confirmed more than 120 cases of infection with the new coronavirus, with three deaths from COVID-19. For most people, the new coronavirus causes only mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia. The vast majority of people recover from the new virus. People with mild illness recover in about two weeks, while those with more severe illness may take three to six weeks to recover, WHO says. ___ AP Film Writer Jake Coyle in New York contributed to this report. ___ The Associated Press receives support for health and science coverage from the Howard Hughes Medical Institute's Department of Science Education. The AP is solely responsible for all content. Share this story:", "articleID": "2020031215_00037863_W", "names": {"Rita Wilson": ["Q234144", "Q58147291"], "Tom Parker": ["Q12059142", "Q16734160", "Q25564284", "Q2949822", "Q7817157", "Q7817158", "Q7817159"]}}, {"date": "2020-03-13", "url": "http://greenleft.org.au/content/one-day-without-us-mexican-women’s-strike-and-marches-make-history", "content": "Tamara Pearson Puebla March 13, 2020 Issue 1257 Mexico Mexican women's strike and march in Puebla. Photo: Tamara Pearson. Some 11 women were murdered in Mexico on March 8--International Women's Day--as hundreds of thousands mobilised around the country to protest the rampant violence women face. On March 9, a large proportion of the country's women participated in an action titled \"One day without us\" , and refused to work, shop, do housework, or be active on social media. The marches and the strike were effective in challenging the violence and abuse against women that has been normalised and cloaked in impunity in Mexico. Relatives of women who have disappeared or been murdered in Mexico. Photo: Tamara Pearson. Rage and momentum for the actions built up over February when a man murdered his partner, Ingrid Escamilla, then skinned her and removed her organs. Judicial authorities and the media colluded to print the photos of her body. Just days later, a 7-year-old girl was found in a plastic bag after being raped, tortured and having her organs removed. Women responded to the circulation of the exploitative and gory photos of Escamilla with an online campaign tagging Escamilla and posting photos and drawings of her face and of beautiful scenery, so that those would be the images she would be remembered by. Last year, 3825 women were murdered in Mexico, though only a third were formally classified as femicides. Two-thirds of women in Mexico have said they have been victims of some form of violence, and almost half said they were violently attacked in their most recent relationship. Women in Mexico earn 34% less than men for the same work, and 36% of women have unpaid home-based work as their main job. Isabel Maldonado. Photo: Tamara Pearson. Mexico's president, Andres Lopez Obrador's (AMLO) response to the calls for action was mixed. He supported striking women who work for the federal government, but also suggested the protests were aimed at destabilising his government. In Puebla, as in most parts of the country, relatives of victims of femicide led the march. Women on megaphones called out their names, and the march responded with chants of \"Justice!\" Since 2013, when the registry of femicides began in Puebla, only 20 of 434 femicides in the small state have resulted in sentences. \"Today is a day of protest at all the violence we face here in Mexico, but the violence is structural, so I think it is important to protest every day,\" Isabel Maldonado told Green Left. \"I'm marching today because I have the fortune of being alive\". Photo: Tamara Pearson. Organisers in Puebla, a city of 1.5 million, estimated that 40,000 people participated in the march. In Mexico City, the government estimated 80,000 people participated however, organisers and observers put the figure at upwards of 140,000. All of Mexico's major cities had huge turnouts, with 25,000 in Guadalajara and 15,000 in Monterrey. Ana Maria Smith, a university lecturer who attended the Mexico City march, told Green Left: \"These marches were historic, not just because there were hundreds and thousands of us, but because we stopped being indifferent to the profound pain of people closest to the victims .\" \"We put ourselves in their shoes and felt their pain and made it all of society's. This process has helped us understand how damaging the patriarchal and capitalist systems are .\" Mexican women's strike in Puebla. Photo: Tamara Pearson. The March 9 strike was originally called by the Veracruz feminist collective, Brujas del Mar (Witches of the Sea) with the goal of simulating the disappearance of women and their social invisibility as well as demonstrating the huge role women play in society. The strike was successful. The women's carriages of Mexico City's trains and metro buses (designated as such in order to prevent the sexual harassment--common on crowded transport) were empty. Other public spaces were also eerily absent of women--only men were present in stations, universities and shopping areas. Most schools were left without teachers, as most teachers are women, and likewise, metro stations were left without ticket vendors. Some banks and universities joined the strikes and most street stalls were absent or staffed by men. Some 90% of the 18,500 women who work for one of Mexico's biggest banks, BBVA, went on strike. People shared photos of their offices--empty of women, stating \"it's clear that without them, things wouldn't work .\" Mexican women's strike in Puebla. Photo: Tamara Pearson. \"I'm still in shock, I never imagined that one day I would see something like this, a city without women,\" <mark>Miguel Lozano</mark>, a human resources director in a bank told Animal Politico. He said it was a day of reflection for men about the types of violence women face. Women Zapatistas issued a statement in support of the strike, saying women \"should know they aren't alone\" and participated in it by not turning up in their communities, and by lighting thousands of candles. On Tuesday, AMLO responded to the actions saying that his government's strategy wouldn't change--he said he would continue dealing with the \"causes of the violence,\" and emphasising employment and youth programs. [Tamara Pearson is a long-time journalist based in Latin America, and author of The Butterfly Prison. Her writings can be found at her blog .] Feminism women's strike gender violence", "articleID": "2020031306_00040003_W", "names": {"Miguel Lozano": ["Q43853754", "Q58968707"]}}, {"date": "2020-03-15", "url": "https://www.vice.com/en_us/article/qjdnam/audio-recording-claims-neo-nazi-terror-group-is-disbanding", "content": "Audio Recording Claims Neo-Nazi Terror Group Is Disbanding <mark>James Mason</mark>, the well known American neo-Nazi is claiming Atomwaffen Division is no more. by Ben Makuch Mar 15 2020, 12:13 am Share Tweet Snap A past appearance by <mark>James Mason</mark> in an Atomwaffen Division propaganda video. The chief philosophical influence of an American neo-Nazi extremist group that is the subject of a nationwide FBI crackdown and is believed to be on the cusp of being declared a Foreign Terrorist Organization by the State Department, is claiming in an audio message obtained by Motherboard that the group is disbanding. In the recording, <mark>James Mason</mark>, a longtime figure within the U.S. neo-Nazi movement and the author of what's considered an important work in the racist canon of the far-right, claims to officially announce the demise of Atomwaffen Division, a group that has become synonymous in recent years with white nationalist terrorism and is linked to five murders. \"This is a press announcement from <mark>James Mason</mark> on the evening of March 9 of this year,\" said <mark>Mason</mark>, who is known to be an advisor to the group and has made personal appearances in some of its propaganda videos. \"I was approached by members of the group known as Atomwaffen Division with the request that I make the official announcement of that group's disbanding, effective at once .\" Motherboard spoke to sources familiar with <mark>Mason</mark>'s voice who believe it to be him on the recording, which is already circulating online. While the statement does not necessarily prove the group or its supporters are abandoning their activities, it does show the sustained pressure by federal authorities is having a negative effect on the militant neo-Nazi movement. In late February, the FBI arrested five members of the group, including its former leader <mark>John Cameron</mark> Denton, 26, who goes by the online alias \"Rape,\" for allegedly swatting journalists and members of the Trump Administration. A month earlier the FBI announced the arrest of six members of The Base, another neo-Nazi terror group linked to Atomwaffen Division, on charges of planning assassinations and mass shootings. Federal prosectors in Virginia where Denton is being tried recently alleged in court the former leader shared child pornography with another unnamed individual. In 1992, <mark>Mason</mark>, known for his writings advocating for a white ethnostate, pleaded guilty to two misdemeanor counts of possessing child pornography. <mark>Mason</mark> made it clear in the latest recording that the notice of disbanding comes on the heels of FBI pressure on the group. \"Over the course of past weeks and months, the level and degree of federal infiltration and the numerous arrests stemming from that have so severely hampered the group's ability to function as a group that it would be pointless to even pretend that anything resembling organizational activity could continue,\" he said. <mark>Mason</mark> went on to declare, \"anything found on the internet henceforth claiming to be or bearing the mark of Atomwaffen Division\" was to be considered an impostor. Last fall, a group claiming to be Atomwaffen Division released a widely circulated propaganda video, which was swiftly denounced by <mark>Mason</mark> as a fraud. Tagged: FBI Atomwaffen white supremecists The Base Subscribe to the VICE newsletter. Subscribe", "articleID": "2020031500_00074089_W", "names": {"James Mason": ["Q16151850", "Q27915132", "Q54100456", "Q5925812", "Q6132912", "Q6139038", "Q6139041", "Q6139043", "Q6140558", "Q6196661"]}}]