[{"date": "2020-03-15", "url": "https://www.vice.com/en_us/article/qjdnam/audio-recording-claims-neo-nazi-terror-group-is-disbanding", "content": "Audio Recording Claims Neo-Nazi Terror Group Is Disbanding <mark>James Mason</mark>, the well known American neo-Nazi is claiming Atomwaffen Division is no more. by Ben Makuch Mar 15 2020, 12:13 am Share Tweet Snap A past appearance by <mark>James Mason</mark> in an Atomwaffen Division propaganda video. The chief philosophical influence of an American neo-Nazi extremist group that is the subject of a nationwide FBI crackdown and is believed to be on the cusp of being declared a Foreign Terrorist Organization by the State Department, is claiming in an audio message obtained by Motherboard that the group is disbanding. In the recording, <mark>James Mason</mark>, a longtime figure within the U.S. neo-Nazi movement and the author of what's considered an important work in the racist canon of the far-right, claims to officially announce the demise of Atomwaffen Division, a group that has become synonymous in recent years with white nationalist terrorism and is linked to five murders. \"This is a press announcement from <mark>James Mason</mark> on the evening of March 9 of this year,\" said <mark>Mason</mark>, who is known to be an advisor to the group and has made personal appearances in some of its propaganda videos. \"I was approached by members of the group known as Atomwaffen Division with the request that I make the official announcement of that group's disbanding, effective at once .\" Motherboard spoke to sources familiar with <mark>Mason</mark>'s voice who believe it to be him on the recording, which is already circulating online. While the statement does not necessarily prove the group or its supporters are abandoning their activities, it does show the sustained pressure by federal authorities is having a negative effect on the militant neo-Nazi movement. In late February, the FBI arrested five members of the group, including its former leader <mark>John Cameron</mark> Denton, 26, who goes by the online alias \"Rape,\" for allegedly swatting journalists and members of the Trump Administration. A month earlier the FBI announced the arrest of six members of The Base, another neo-Nazi terror group linked to Atomwaffen Division, on charges of planning assassinations and mass shootings. Federal prosectors in Virginia where Denton is being tried recently alleged in court the former leader shared child pornography with another unnamed individual. In 1992, <mark>Mason</mark>, known for his writings advocating for a white ethnostate, pleaded guilty to two misdemeanor counts of possessing child pornography. <mark>Mason</mark> made it clear in the latest recording that the notice of disbanding comes on the heels of FBI pressure on the group. \"Over the course of past weeks and months, the level and degree of federal infiltration and the numerous arrests stemming from that have so severely hampered the group's ability to function as a group that it would be pointless to even pretend that anything resembling organizational activity could continue,\" he said. <mark>Mason</mark> went on to declare, \"anything found on the internet henceforth claiming to be or bearing the mark of Atomwaffen Division\" was to be considered an impostor. Last fall, a group claiming to be Atomwaffen Division released a widely circulated propaganda video, which was swiftly denounced by <mark>Mason</mark> as a fraud. Tagged: FBI Atomwaffen white supremecists The Base Subscribe to the VICE newsletter. Subscribe", "articleID": "2020031500_00074089_W", "names": {"John Cameron": ["Q10468938", "Q1699530", "Q18164439", "Q24817361", "Q56718151"]}}, {"date": "2020-03-16", "url": "https://www.hollywoodreporter.com/news/olga-kurylenko-tests-positive-coronavirus-1284787", "content": "MOVIES Actress Olga Kurylenko Tests Positive for Coronavirus 7:57 PM PDT 3/15/2020 by Patrick Brzeski FACEBOOK TWITTER EMAIL ME Borja B. Hojas/Getty Images Olga Kurylenko The \"Quantum of Solace' star shared the news on Instagram, saying\" I've actually been ill for almost a week now. Fever and fatigue are my main symptoms. Take care of yourself and do take this seriously! \"Ukrainian-born actress and model Olga Kurylenko revealed on Instagram Sunday that she has tested positive for coronavirus .\" Locked up at home after having tested positive for Coronavirus, \"she wrote for her 567,000 followers, posting a photo showing a view through a window of her home. She added:\" I've actually been ill for almost a week now. Fever and fatigue are my main symptoms. Take care of yourself and do take this seriously! \"Kurylenko joins a growing list of international entertainment figures who have contracted the coronavirus that is closing national borders and businesses the world over. Spouses Tom Hanks and <mark>Rita Wilson</mark> are among the most recognizable celebrities to have tested positive for the illness. In the executive ranks, Universal Music chairman and CEO Lucian Grainge was hospitalized for treatment of COVID-19 over the weekend. Canadian Prime Minister Justin Trudeau's wife has also tested positive for the new coronavirus. Kurylenko remains best known for her starring performances in Bond flick Quantum of Solace and opposite Tom Cruise in the 2013 sci-fi film Oblivion. More recently she appeared in Armando Iannucci's historical satire The Death of Stalin and Terry Gilliam's The Man Who Killed Don Quixote with Adam Driver. She recently wrapped production on The Bay Of Silence, a thriller from Paula van der Oest co-starring Claes Bang (The Square) and <mark>Brian Cox</mark> (Succession). View this post on Instagram Locked up at home after having tested positive for Coronavirus. I've actually been ill for almost a week now. Fever and fatigue are my main symptoms. Take care of yourself and do take this seriously! Сижу в изоляции дома с диагнозом Коронавирус. Уже почти неделю болею. Температура и слабость - мои основные симптомы. Будьте осторожны и принимайте это во всерьёз! #coronavirus #коронавирус A post shared by Olga Kurylenko (@ olgakurylenkoofficial) on Mar 15, 2020 at 10:42 am PDT FACEBOOK TWITTER EMAIL ME Patrick Brzeski THRnews @ thr.com @ thr", "articleID": "2020031603_00036015_W", "names": {"Brian Cox": ["Q19594790", "Q20669096", "Q34975", "Q463581", "Q48847660", "Q4963453", "Q4963454", "Q57571927"], "Rita Wilson": ["Q234144", "Q58147291"]}}, {"date": "2020-03-19", "url": "http://media.smh.com.au/sport/nrl/nrl-tells-players-to-self-isolate-in-preparation-for-full-calendar-20200319-p54bwt.html", "content": "Australian Breaking News Headlines & World News Online | SMH.com. au Australian Breaking News Headlines & World News Online | SMH.com. au \"We believe it's essential to take a further step to ensure we are no longer allowing anyone, unless they are a citizen or resident or direct family member, [to enter Australia],\" he said. 7 minutes ago by, <mark>Mary Ward</mark> and Latika Bourke Matt Bungard Add to shortlist Australian financial markets experienced another brutal session with equities, the Aussie dollar and longer-dated government bonds all selling off sharply despite RBA's moves. by David Scutt Police and border officials will crack down on people hoarding supermarket goods and re-selling them for profit. by Anthony Galloway Governor <mark>Philip Lowe</mark> said the RBA will also provide at least $90 billion at 0.25 per cent over three years to banks if they lend that cash to small and medium-sized businesses. 2 hours ago Nearly a million doctors, nurses, teachers, cleaners and carers are among the Australian workers who are regularly exposed to disease or infections while they do their jobs. 36 minutes ago The Chinese Communist Party knows that by the time the crisis is over the world's order could be altered. by Chris Zappone What is the thinking behind the decision to keep schools across Australia open? by Fergus Hunter The ground zero of NSW's bushfire emergency response has been commandeered to wage the state government's war against COVID-19. 56 minutes ago The sex offender, who died last year, had promised to pay her legal fees for any claims from the dozens of women who say she helped him recruit them. 2 hours ago By signing up you accept our privacy policy and conditions of use Advertisement Paracetamol and ventolin will be limited to one per customer, while children's paracetamol will be placed behind pharmacy counters, after panic buyers stripped shelves bare across the country. 2 hours ago by and Paul Sakkal Bianca Hall Add to shortlist The Prime Minister has warned private school funding could be at risk if schools defy government advice. by <mark>Jordan Baker</mark>", "articleID": "2020031905_00141656_W", "names": {"Jordan Baker": ["Q12983069", "Q16146320", "Q21620815", "Q23037368"], "Mary Ward": ["Q22662782", "Q42846167", "Q6780920"], "Philip Lowe": ["Q1981766", "Q27922677"]}}, {"date": "2020-03-19", "url": "http://www.burytimes.co.uk/news/national/18318932.uk-holidaymakers-face-stranded-weeks-due-coronavirus-shutdowns/", "content": "News National News UK holidaymakers face being stranded for weeks due to coronavirus shutdowns By Press Association 2020 An airplane flying 0 comment Hundreds of thousands of UK tourists could be stranded overseas for weeks as airlines ground planes and countries close borders due to the coronavirus. Holidaymakers in destinations such as Peru and Morocco are facing immense difficulty and cost to return home. Foreign Secretary Dominic Raab said it was \"very difficult\" for people to get out of those countries. He told the Commons' Foreign Affairs Committee: \"The challenge there is to make sure, first of all, the governments of those countries keep a route so British nationals can get out .\" Mr Raab said there were between 300,000 and \"closer to a million\" British nationals travelling abroad. \"That is a massive, massive scale,\" he admitted. Many airlines have started grounding the majority of their aircraft due to demand collapsing. ✈ ️ ✈ ️ ✈ ️ FLIGHTS UPDATE ✈ ️ ✈ ️ ✈ ️ @ TSAReilly ⚠ ️ ⚠ ️ ⚠ ️ All special flights departing from #Morocco???? to the #UK???? are scheduled for today. There will be no other flights after midnight tonight 0 ⃣ 0 ⃣:0 ⃣ 0 ⃣?? ⚠ ️ ⚠ ️ ⚠ ️ pic.twitter.com/hVaGGNGH0U--UK in Morocco (@ UKinMorocco) March 19, 2020 Peru has implemented a state of emergency, with a travel ban and curfew, leading to UK nationals expressing fear they will be unable to leave. Kasey Butler, from Oxford, wrote a message on Twitter stating that she was \"stranded\" in the capital Lima. She said the British embassy was closed and her hostel \"isn't letting us leave our rooms\". \"Peru is great but I'm ready to leave,\" she added .?? IMPORTANT Avianca is considering a charter flight to London. Please review the information below and register your interest into this form, before Thursday 19th, 8.00 hours ➡ ️ https: //t.co/FtXCd4pzPI pic.twitter.com/LrUNICTeqF--UK in Peru???????? (@ UKinPeru) March 18, 2020 The embassy posted a message stating that Colombian airline Avianca was considering operating a charter flight from Lima to London this weekend, but warned that tickets for the one-way trip were \"likely\" to cost between 3,000 and 3,500 US dollars (£ 2,600 to £ 3,000). Tourists in Morocco face a race against time to get home as the country is closing its airspace after Thursday. Bob Warburton, 62, from Manchester, told the PA news agency that the situation at Agadir airport was \"chaos\" , with hundreds of UK holidaymakers waiting for flights. He explained that he and his wife were unable to contact Ryanair, who they were booked to fly back with, and described the airline as \"appalling and negligent\". The pair eventually paid a £ 100 taxi fare to travel to Marrakech airport, where they were able to book themselves onto a flight. <mark>Thomas Reilly</mark>, the British ambassador to Morocco, said: \"It is chaotic. There is no way that evacuating over 85,000 people in less than a week was ever going to be anything other than chaotic .\" I am sorry. It is not just the UK which is bringing its citizens home. Every other nation is trying to as well. We are all doing our best. \"Grant Gibson, 65, from Lyminge, Kent, is stuck with his wife in Northern Cyprus, where a state of emergency has been declared. The pair were scheduled to return to the UK last week but were among the guests at the Salamis Bay Conti Hotel put into quarantine due to the coronavirus. We are asking @ DominicRaab about the @ foreignoffice's response to the #coronavirus outbreak. Watch live here: https: //t.co/9QOK686bOx pic.twitter.com/YXBZwGqcoz--Foreign Affairs Committee (@ CommonsForeign) March 19, 2020 Mr Gibson said:\" They've closed all the crossing points to British nationals so we're waiting to find out from the British embassy how they're going to get us out of here. \"Given that all the other tourists on the island went yesterday (Wednesday)--that was the cut off, curfew time--then I would expect that they'll be keen to get rid of us .\" The Foreign and Commonwealth Office (FCO) is advising travellers in Spain to return home before March 24 as the Spanish government has ordered all hotels to close from that date. Mr Raab told the committee the Government was asking airlines to operate flights on routes they did not normally serve, which \"takes some configuring\". He said any spare seats on rescue flights would be offered to other countries trying to bring their citizens home. He explained: \"We also want to be able to pick up the phone and say\" By the way, if you have any spare room can you help get the Brits out?' \"0 comment", "articleID": "2020031915_00249623_W", "names": {"Thomas Reilly": ["Q47540764", "Q57596686", "Q7793467", "Q7793469"]}}, {"date": "2020-03-21", "url": "https://www.nj.com/coronavirus/2020/03/new-jersey-lockdown-rules-what-residents-need-to-know-about-stay-at-home-order.html", "content": "Gov. <mark>Phil Murphy</mark> has ordered New Jersey residents to stay home. Michael Mancuso | NJ Advance Media for NJ.com By <mark>Brent Johnson</mark> | NJ Advance Media for NJ.com and Matt Arco | NJ Advance Media for NJ.com New Jersey will go into virtual lockdown mode starting Saturday night after Gov. <mark>Phil Murphy</mark> announced he is ordering all people to stay at home except for necessary travel and mandating that all non-essential retail businesses in the state close help to battle the spread of the coronavirus. Here's a look at what that means: SO I HAVE TO STAY IN MY HOME? People are limited to traveling for only essential needs, like groceries, food, or medicine, or if they are have to get to a job at a business that is still open. People can also go outside for walks or exercise. Except for the essential workers, the governor wants everyone off the roads, and specifically urged people not to go to the Jersey Shore If they have part-time residences there. \"We expect people to stay home,\" <mark>Murphy</mark> said during a news briefing Saturday at Rutgers-Newark. \"We want you off the roads. That's now 24 hours. We don't want you out there. Period .\" WHAT'S CLOSED? <mark>Murphy</mark> had already indefinitely shuttered a number of businesses amid the outbreak, including indoor malls, movie theaters, casinos, gyms, amusement parks, barber shops, salons, libraries and more. He also limited restaurants to takeout and delivery. Now it extends to the vast majority of retail businesses. WHAT CAN STAY OPEN? Retail businesses allowed to remain open include grocery stores, food banks, pharmacies, medical marijuana dispensaries, gas stations, auto mechanics and repair services, convenience stores, banks, hardware and home improvement stores, laundromats, dry cleaners, printing and office supply shops, pet stores, stores that sell supplies for young children, and mail and delivering shops. Restaurants, bars and liquor stores that provide takeout and delivery can also stay open. Manufacturing, industrial, logistics, ports, heavy construction, shipping, food production, food delivery, and other commercial operations may continue operating, but they must keep staff at a minimal level on site to make sure \"essential operations can continue .\" Medical facilities can continue to operate. Child day care centers will also remain open. <mark>Murphy</mark> has said many emergency and essential workers need a place to watch their children. Other businesses should allow people to work from home, if possible, the governor said. MORE: What is an essential retail business in N.J.? A list of places that can stay open in coronavirus shutdown. WHAT ABOUT PUBLIC GATHERINGS? <mark>Murphy</mark> has barred any public gatherings--parties, funerals, concerts, etc.. He first limited them to 250 people and then reduced it to 50 people. Now all are barred. \"This decision is not an easy one, and it pains me that important life moments will not be celebrated the way we are accustomed to,\" <mark>Murphy</mark> said. \"Our singular goal is to make sure we get through this emergency so you can safely gather with family and friends later and enjoy many more wedding and birthdays to come .\" WHO IS CONSIDERED AN ESSENTIAL WORKER? Health-care and medical-services workers, members of the media, law enforcement agencies, federal government workers, those who work at businesses that are allowed to remain open. WHEN DOES THIS GO INTO EFFECT? 9 p.m. Saturday. HOW LONG WILL IT LAST? That's unclear. <mark>Murphy</mark> said he expects the crisis will be \"measured in weeks to months. This is not next week .\" WHAT IF I DON'T COMPLY? <mark>Murphy</mark> didn't provide specifics on what the penalties would be, but he said: \"If folks are monkeying around, we will take action .\" He has also said any businesses that don't comply will be prosecuted for a disorderly person's offense at the local level. WHY TAKE THIS ACTION? Officials say the more people keep their distance from each other--otherwise known as \"social distancing\" --it will help slow the spread of the virus, which causes the illness COVID-19. \"Social distancing is the key to stopping this,\" state Health Commissioner Judy Persichilli said. \"There's nothing more sophisticated about it. We don't have a vaccine .\" An NJ Advance Media analysis of data from a Rutgers University study shows in a worst-case scenario, with the minimal amount of social distancing, 1 in 7 people could contract the virus. HOW MUCH HAS THE VIRUS ALREADY SPREAD? The coronavirus is a pandemic that has infected and killed thousands across the globe. In New Jersey, officials have confirmed at least 1,327 known cases, with 16 confirmed deaths. Officials say they expect that number to increase significantly in the coming days as testing expands and there is more evidence of \"community spread .\" The state has not released how many negative tests have come back or how many people have recovered from the virus. WHERE CAN I FIND MORE INFORMATION? The state has a new website devoted to its response to the pandemic: covid19. nj. gov / Sign up for text message alerts from NJ.com on coronavirus in New Jersey: If you would like updates on New Jersey-specific coronavirus news, subscribe to our Coronavirus in N.J. newsletter. <mark>Brent Johnson</mark> may be reached at bjohnson @ njadvancemedia.com. Follow him on Twitter @ johnsb01. Matt Arco may be reached at marco @ njadvancemedia.com. Follow him on Twitter @ MatthewArco or Facebook. Have a tip? Tell us. nj.com/tips Get the latest updates right in your inbox. Subscribe to NJ.com's newsletters. Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "articleID": "2020032121_00019668_W", "names": {"Brent Johnson": ["Q18705331", "Q4961442", "Q909756"], "Phil Murphy": ["Q260042", "Q3378818", "Q7182210", "Q7182211"]}}, {"date": "2020-03-21", "url": "http://www.greatlakesadvocate.com.au/story/6690659/all-non-essential-travel-should-be-cancelled/?cs=17267", "content": "All non-essential travel should be cancelled: Leaders move to stop travel as school holidays near Coronavirus Prime Minister <mark>Scott Morrison</mark> has now told Australians to cancel all non-essential travel. He also flagged \"far more draconian measures to enforce social distancing\" saying too many Australians did not seem to be getting the message. He had planned to consider more travel advice at a meeting of state and territory leaders on Tuesday evening, but on Sunday said the decision had been brought forward. \"After consulting with premiers and chief ministers overnight, we have decided that we are moving immediately to recommend against all non-essential travel in Australia,\" he said in Canberra. \"All non-essential travel should be cancelled,\" he said. The move will disrupt school holiday travel plans within Australia, with Australians already told not to travel overseas, and the borders already closed to arrivals of non-residents. The leaders will meet again on Sunday night to consider \"far more draconian measures to enforce social distancing\" , he said. \"More stronger measures will be coming,\" Mr <mark>Morrison</mark> said. \"What happened at Bondi beach yesterday was not OK. And served as a message to federal and state leaders that too many Australians are not taking these issues seriously enough,\" he said. \"So the measures that we will be considering tonight means that state premiers and chief ministers may have to take far more draconian measures to enforce social distancing, particularly in areas of outbreaks .\" More to come For information on COVID-19, please go to the ACT Health website or federal Health Department's website. You can also call the Coronavirus Health Information Line on 1800 020 080 If you have serious symptoms, such as difficulty breathing, call Triple Zero (000) We have removed our paywall from our stories about the coronavirus. This is a rapidly changing situation and we want to make sure our readers are as informed as possible. If you're looking to stay up to date on COVID-19, you can also sign up for our twice-daily digest here. If you would like to support our journalists you can subscribe here. Prime Minister <mark>Scott Morrison</mark> in Canberra. Picture: Dion Georgopoulos", "articleID": "2020032201_00019609_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"]}}]