[{"date": "2020-03-22", "url": "https://www.msn.com/en-us/news/elections-2020/is-it-tokenism-or-representation-how-to-think-about-joe-bidens-promises-to-nominate-women/ar-BB11v85G?srcref=rss", "content": "Former vice president Joe Biden fully committed in Sunday's debate to picking a woman as his vice presidential candidate if he is the Democratic Party nominee. And he made a commitment to nominate a black woman to the Supreme Court if he is elected president. © Matt Rourke/AP Democratic presidential candidate Joe Biden, accompanied by his wife, Jill, speaks to members of the media at the National Constitution Center in Philadelphia on March 10. In 1984, the Democratic Party became the first major political party to have a woman as the vice presidential candidate, in Geraldine Ferraro. But no president has ever nominated a black woman to the Supreme Court--a move that Biden hopes will make his candidacy more attractive to black women, one of the most influential demographics on the left. The legality of only considering women for these spots appears to be clear--it's permissible. But some critics have criticized the move as pandering and tokenism. The Democratic field started off with more diversity than any other in history, and some voters on the left expressed great disappointment that the last two candidates standing look like the overwhelming majority of individuals who have occupied the White House: straight, white men. Subscribe to the Post Most newsletter: Today's most popular stories on The Washington Post During the CNN debate this week, Biden said: I commit it that if I'm elected president and have an opportunity to appoint someone to the courts, I'll appoint the first black woman to the courts. It's required that they have representation, now it's long overdue. Secondly, if I'm elected president, my Cabinet, my administration will look like the country. And I commit that I'll pick a woman to be vice president. There are a number of women who are qualified to be president tomorrow, I would pick a woman to be my vice president. A moderator asked Sen. Bernie Sanders (I-Vt .) whether he would commit to doing the same. \"In all likelihood, I will,\" he said. \"For me, it's not just nominating a woman. It is making sure that we have progressive women and there are progressive women out there, so my very strong tendency is to move in that direction .\" There was plenty of praise for the news. Some, like conservative Washington Post opinion writer <mark>Jennifer Rubin</mark>, praised Biden for taking the lead on the issue. Keneshia Grant, a political science professor at Howard University, told The Fix that she thinks Biden making these commitments is a good thing if his goal is to win the support of more black voters. \"I think the party has to learn from 2016--or I hope it learns--is that you can't take turnout for granted, especially among black people,\" she said. \"When black people turn out, they will likely turn out for Democrats, but you actually have to work on the numbers .\" \"I can imagine it being about women, but I can also imagine it's about excitement, about giving something additional for voters to be excited about,\" Grant added. \"It's one thing to say turnout needs to be high against <mark>Donald Trump</mark>, but I think it will also be helpful to give people something new, historic and hopeful to turn out for--and I think this might do that .\" Others, including women, dismissed the conversation as pandering and pointed to conservative and moderate women in high places of leadership supporting policies that they believe harm other women. Ashley Ray-Harris, a comedian and freelance writer based in Los Angeles, told The Fix that Biden's commitment felt like pandering because it was obvious. \"Two candidates telling me that they're considering women isn't a shock to me,\" she said. \"They absolutely should be .\" \"We know women can do this,\" Ray-Harris added. \"To me, that Sanders was more concerned with policy and who would actually be the right woman or fit would be more of a concern than Joe Biden just saying he'd pick a woman .\" And others addressed the idea as tokenism with some suggesting that the move will subject the woman to accusations of being hired for their gender. Despite the varied responses, promising to nominate a woman to the Supreme Court is not unheard of--or unique to liberals. No less a conservative than Ronald Reagan did similar. While seeking the White House in 1980, Reagan sought to improve his chances with women voters and those who perceived that the GOP was becoming less welcoming to women by promising to nominate a woman to the Supreme Court. \"I am announcing today that one of the first Supreme Court vacancies in my administration will be filled by the most qualified woman I can possibly find,\" he said. \"It is time for a woman to sit among the highest jurists .\" He did follow through on that, nominating Arizona Court of Appeals Judge Sandra Day O’Connor. Reagan's nomination of O’Connor is a reminder that while controversial, promising to consider only members of one gender for such a powerful position is nothing new. Jamal Greene, a professor at Columbia Law School, whose scholarship focuses on the structure of legal and constitutional argument, told The Fix: There's no law, there's not statute that applies to this situation. The only questions would be: Is it unconstitutional for him to do it? And that's a question that's unlikely to reach a court because he has so much discretion in his decision-making that there'd be no person who can show he'd been injured by this act. The same goes for Biden's promise to name a woman as his vice presidential candidate, if he is the Democratic Party nominee. \"The vice president can make whatever promises he wants,\" Greene said. \"He's a private citizen. He doesn't work for the government. He can make any promise he wants without it running afoul of the Constitution, and there is no law that applies to people nominating their VP that I'm aware of .\" Legal experts have said it would not be legal to promise a specific person a job, as it could be considered a bribe. On the topic of tokenism, Greene said there are ways for Biden to add more women's voices to the highest levels of government without accusations of choosing someone solely because of her gender. What one considers to be tokenism is very subjective. I think a lot depends on how you frame this kind of decision. If it's framed as \"I don't care who the candidates are. I'm going to look for a black woman,\" I think that's different framing from \"There's a lot of qualified candidates for the Supreme Court and I think it's important to look at the kinds of people who have not been looked at in the past, so I'm going to focus on African American women knowing there's a range of qualified options\" is a different framing. Biden being direct in promising to nominate a woman is not that surprising to those who have been following the issue. I previously reported on the issue. At this point, perhaps the biggest question for voters on the left is: Who? Read More", "articleID": "2020032304_00035263_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Jennifer Rubin": ["Q434795", "Q6178769"]}}, {"date": "2020-03-24", "url": "https://www.news-mail.com.au/news/chilean-backpacker-stabbing-case-set-to-go-to-tria/3979601/", "content": "Chilean filmmaker Constanza (Kuki) Escudero, 26, was allegedly stabbed in a Cairns backpackers hostel. News Chilean backpacker stabbing case set to go to trial by Grace Mason 24th Mar 2020 7:16 AM premium_icon Subscriber only 0 PROSECUTORS have rejected a submission to reduce a charge against a man accused of trying to kill a Chilean backpacker at a Cairns hostel. Northern Territory man Raynard Gregory Moodoonuthi, 36, is accused of stabbing 26-year-old tourist Constanza \"Kuki\" Escudero in the neck at a Bunda St hostel in August last year, leaving her millimetres from death. She was just days into a dream Australian holiday. Defence barrister Tim Graw told the court last month he had made a submission to the Department of Public Prosecutions to have the charge dropped from attempted murder to grievous bodily harm in exchange for a guilty plea. The Cairns Supreme Court heard yesterday the DPP had rejected that offer and the matter would proceed to trial. Mr Graw said given the \"current circumstances\" with the impact of the coronavirus on court proceedings, it would be difficult to set a trial date at the moment. Crown prosecutor Eddie Coker said if found guilty, they would be submitting for a lengthy prison sentence and a serious violent offender declaration. \"So he is not in any danger this year of serving too much time,\" he said. Justice <mark>Jim Henry</mark> adjourned the matter for a mention on June 2. Ms Escudero returned to Chile soon after the alleged attack and continues to undergo medical treatment. Originally published as Chilean backpacker stabbing case set to go to trial More Stories premium_icon Chilean backpacker stab accused offers plea to lesser charge premium_icon Father's emotional tribute after hostel stabbing Support builds for Chilean stab victim More Stories premium_icon Chilean backpacker stab accused offers plea to lesser charge premium_icon Father's emotional tribute after hostel stabbing Support builds for Chilean stab victim 0 attempted murder Read More Login to follow backpacker Read More Login to follow case Read More Login to follow chile Read More Login to follow trial Read More Login to follow attempted murder backpacker case chile trial", "articleID": "2020032322_00087447_W", "names": {"Jim Henry": ["Q10457811", "Q39069871", "Q6195554", "Q6195556", "Q6195559", "Q6195561"]}}, {"date": "2020-03-25", "url": "http://www.winsfordguardian.co.uk/sport/national/18331858.golf-clubs-need-members-more-ever-coronavirus-crisis/", "content": "Sport National Sport Golf clubs need members \"more than ever' in coronavirus crisis By Nick Rodger Golf Correspondent Golf in lockdown Peebles Golf Club, like facilities throughout Scotland, is facing up to the harsh realities brought on by the coronavirus 0 comment It wasn't that long ago that health experts were championing golf as a soothing, morale-boosting haven away from the ravaging rigours of the coronavirus. Things move quickly amid this wretched situation we find ourselves in, though. The inevitable Government announcement of more stringent social distancing measures the other night shuddered round the golfing community like the appalling judder that rattles up the shaft after a violent shank. The shutters are coming down everywhere and for some already toiling clubs, they may never re-open again. The rearguard action begins. With the kind of call to arms that should come with a finger-jabbing Kitchener poster, it's a case of\" your club needs you \"as far as members are concerned .\" Now more than ever, members need to stick by their club, \"said <mark>Ross Duncan</mark>, a past captain at Peebles and a former development director at Scottish Golf, as he echoed sentiments that will be ringing round the game's cradle and beyond .\" A lot of clubs were clinging on to the idea that golf was this safe sport amid all this but that's been brought to an abrupt halt and it's back to the drawing board. \"It's about emergency planning now and how clubs can survive. Here at Peebles, like most clubs presumably, we're making a rallying call to members to keep paying their fees so that we still have a club to come back to when we get through this .\" There is no other income and large and small clubs will be severely hit. It's a huge concern for everybody. The likes of Dornoch, for instance, well rely massively on overseas income. \"We will maybe get £ 60,000 from visitor income but that will mainly get wiped out now while we'll have about £ 250,000 worth of membership income which we clearly need to keep ticking over .\" The latest guidelines allows greenkeepers to at least go and maintain the course. We won't be needing greens running at 10 on the stimp but at least we can do basic maintenance .?? | The message to all of us is clear, we must stay home and play our part in containing the spread of COVID-19. With this in mind, Scottish Golf asks that all golfers in Scotland refrain from golfing until further notice. Read more?? https: //t.co/OjacNedNMQ pic.twitter.com/R5PXuCXxrS--Scottish Golf (@ ScottishGolf) March 23, 2020 \"We can apply to the Government schemes and get 80 per cent of various wages paid to staff. Our pro is on a retainer but he's self-employed too. We need to look after all our staff as best we can .\" We'll also have to be creative about how we give members the best value for money when we do return. Hopefully it's short term pain for long term gain. \"While golfers were encouraged to keep playing last week as long as they adhered to the social distancing measures, <mark>Duncan</mark> could see that the writing was on the wall .\" You could see a complete closure coming, \"he said .\" We had 100 people playing at the weekend in a stableford. I went up by myself for nine holes but you saw pockets of people playing but playing as they normally would. You started to get concerned. \"I have a friend who is a club manager in Spain and they all closed very quickly. It was coming .\" Like most clubs, Peebles has its fair share of hardy perennials; those habitual creatures of great golfing routine and longevity. The onset of enforced isolation is a concerning reality, not just for golfers, but for all walks of life. \"We have a group we call the TAMS, the Thursday AM Seniors, who play every week and they've been going for years,\" said <mark>Duncan</mark>. \"One is 93 and plays three or four times a week. There are a couple in that age group .\" They play nine holes, then have two or three coffees. That kind of business keeps clubs going. The social interaction with their peers is a big thing for them. \"They keep each other company. They will really miss that routine. That's happening across great swathes of society .\" During his stint as club captain, <mark>Duncan</mark> was given plenty of food for thought. Nothing as seismic as this, though. \"We had catering issues and I seemed to spend two years interviewing caterers,\" he recalled. \"Now I think\" christ, I thought I had a tough time then?'. There will be plenty of tough times ahead. 0 comment", "articleID": "2020032505_00015003_W", "names": {"Ross Duncan": ["Q57312464", "Q7369298"]}}, {"date": "2019-03-14", "url": "https://catholicherald.co.uk/will-the-church-make-a-stand-for-canon-law/", "content": "The legal cases of three cardinals--Theodore McCarrick, George Pell and Philippe Barbarin--are a test of the Church's attitude towards her own canon law. Will she actually use it? The alternative is to abandon her own justice system, subjecting her prelates to the vagaries of secular justice. Which might just mean no justice at all. As Pope Francis marks his sixth anniversary, a pressing issue in the year ahead will be to defend the Church's canonical processes, an unexpected turn for a pope who famously lacks enthusiasm for legal precision. The case of Theodore McCarrick, the former cardinal now laicised, demonstrates that the Church's own canon law does not require the secular justice system to operate. From start to finish, the McCarrick case was entirely handled within the Church and, until the formal trial at the Congregation for the Doctrine of the Faith, proceeded largely under the lay review board in the Archdiocese of New York. Indeed, in McCarrick's case, it is unlikely that there will be any processes in either criminal or civil courts. Cardinal George Pell has been convicted on what is widely believed--by many including this writer--to be a gross miscarriage of justice, the product of police and prosecutorial bias. Should Pell's appeal fail, there will be enormous pressure for the Church's canonical system to arrive at the same verdict. But what if the canonical process finds Pell not guilty, as would be likely? Will the Church abide by her own justice system? The case of Cardinal Philippe Barbarin adds another twist. Cardinal Barbarin has long acknowledged that he mishandled a case of priestly abuse. Those facts are not in doubt. The relevant prosecutor declined to criminally prosecute, finding that there was not the necessary criminal intent. In a quirk of the French system, the criminal case was brought anyway, and a panel of judges convicted Barbarin while acquitting all his co-defendants. Barbarin intends to appeal the verdict, but has also said that he will resign as Archbishop of Lyons. Should Barbarin's future depend on the French criminal justice system? If he had been acquitted presumably he would not offer his resignation. So the decision to resign depends on the French courts, but not a Church canonical process. It is likely that Barbarin quickly announced that he would resign because of the experience of <mark>Philip Wilson</mark>, the Archbishop of Adelaide. Convicted of not reporting sexual abuse last July, he announced that he would appeal and remain in office. Enormous pressure--in the Church and from wider Australian society--forced him to offer his resignation, which the Holy See quickly accepted. A few months later, Archbishop <mark>Wilson</mark> was acquitted on appeal, with the judge ruling that the original conviction was tainted by the current anti-clerical frenzy in Australia. All of which poses a critical question for the Church. Does she have enough confidence in her own canon law to defend judgments which might be at variance with secular proceedings? Especially when it appears that justice has not been done--as has been demonstrated with <mark>Wilson</mark>, is certainly true with Pell and likely true with Barbarin? The question extends beyond the most recent cases. In facing cases of misconduct--not only sexual--the practical abandonment of canonical processes in the 1960s onwards was a major factor in the current crises. In 2010, dealing with the Irish abuse crisis, Benedict XVI made that point in the interview book Light of the World. \"The Archbishop of Dublin [Diarmuid Martin] told me something very interesting about [the mishandling of sexual abuse cases],\" Benedict said. \"He said that ecclesiastical penal law functioned until the late 1950s; admittedly it was not perfect--there is much to criticise about it--but nevertheless it was applied. After the mid-60s, however, it was simply not applied any more...the prevailing mentality was that the Church must not be a Church of laws but, rather, a Church of love; she must not punish. Thus the awareness that punishment can be an act of love ceased to exist. This led to an odd darkening of the mind, even in very good people .\" The same diagnosis--that canon law was simply abandoned--was reached by the Irish government's Murphy Commission report into abuse in the Archdiocese of Dublin. It wasn't until the mid-1990s that canonical punishments began to be applied again. This was for priestly misconduct though, not for failings in the oversight of bishops. In 2016, Pope Francis implemented legislation to deal with cases of bishops who either were accused of sexual misconduct, or were negligent or malfeasant in handling such cases. In 2018, he said that he preferred not to use those measures. In the case of Cardinal Barbarin those measures, if used, might have deposed him from office even with an acquittal at criminal law, as the canonical standards for conviction are much lower than criminal ones. Alternatively, a canonical process could have decided on a remedy short of resignation, even with a criminal conviction. The Church fought for many centuries to keep clerics out of the jurisdiction of secular courts altogether. She no longer does that. The question now is whether clerics will be treated, de facto, by secular courts alone, and be kept out of the canonical justice system. Fr Raymond J de Souza is a priest of the Archdiocese of Kingston, Ontario, and editor-in-chief of convivium. ca The post Pell, Barbarin and the need for canon law appeared first on Catholic Herald.", "articleID": "2020032614_00125063_W", "names": {"Philip Wilson": ["Q1742273", "Q21464802", "Q262201", "Q51365713"]}}, {"date": "2020-03-30", "url": "https://www.nevadaappeal.com/news/government/president-extends-social-distancing-guidelines-through-april/", "content": "President extends social distancing guidelines through April Government | March 29, 2020 0 MATT SEDENSKY and MICHAEL R. SISAK Associated Press 0 Travelers wearing face masks to help curb the spread of the coronavirus line up for their train at the station in Beijing on Sunday, March 29, 2020. As the coronavirus epicenter has shifted westward, the situation has calmed in China, with falling death rates and most new cases coming from abroad, restrictions on travel have been slowly lifted. (AP Photo/Ng <mark>Han Guan</mark>) AP | AP People sit on benches at Primrose Hill, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP People sit on benches at Primrose Hill, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP People sit on benches at Primrose Hill, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP A man walk alone on the promenade under the FDR drive in Lower Manhattan, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP A man walk alone on the promenade under the FDR drive in Lower Manhattan, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP A man walk alone on the promenade under the FDR drive in Lower Manhattan, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP People applaud from their houses in support of the medical staff that are working on the COVID-19 virus outbreak in Barcelona, Spain, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP People applaud from their houses in support of the medical staff that are working on the COVID-19 virus outbreak in Barcelona, Spain, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP People applaud from their houses in support of the medical staff that are working on the COVID-19 virus outbreak in Barcelona, Spain, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP A couple hugs as they walk down a boardwalk on a mostly deserted Santa Monica beach Sunday, March 29, 2020, in Los Angeles. With cases of coronavirus surging and the death toll increasing, lawmakers are pleading with cooped-up Californians to spend a second weekend at home to slow the spread of the infections. (AP Photo/Marcio <mark>Jose Sanchez</mark>) AP | AP A couple hugs as they walk down a boardwalk on a mostly deserted Santa Monica beach Sunday, March 29, 2020, in Los Angeles. With cases of coronavirus surging and the death toll increasing, lawmakers are pleading with cooped-up Californians to spend a second weekend at home to slow the spread of the infections. (AP Photo/Marcio <mark>Jose Sanchez</mark>) AP | AP A woman stands leaning against the window during a nationwide confinement to counter the new coronavirus in Barcelona, Spain, Sunday, March 29, 2020. Spanish Prime Minister <mark>Pedro Sanchez</mark> has announced that his government will order a two-week ban on commuting to all non-essential businesses starting on Monday. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP A woman stands leaning against the window during a nationwide confinement to counter the new coronavirus in Barcelona, Spain, Sunday, March 29, 2020. Spanish Prime Minister <mark>Pedro Sanchez</mark> has announced that his government will order a two-week ban on commuting to all non-essential businesses starting on Monday. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP A woman stands leaning against the window during a nationwide confinement to counter the new coronavirus in Barcelona, Spain, Sunday, March 29, 2020. Spanish Prime Minister <mark>Pedro Sanchez</mark> has announced that his government will order a two-week ban on commuting to all non-essential businesses starting on Monday. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP A paramedic transports a patient into the Trauma Center at the Elmhurst Hospital Center, Sunday, March 29, 2020, in the Queens borough of New York. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP A paramedic transports a patient into the Trauma Center at the Elmhurst Hospital Center, Sunday, March 29, 2020, in the Queens borough of New York. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP A red phone box stands in an empty street in Westminster, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP A red phone box stands in an empty street in Westminster, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP A red phone box stands in an empty street in Westminster, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP Signs of support are shown on a window in Montreal, Sunday, March 29, 2020, as Coronavirus COVID-19 cases rise in Canada and around the world. (Graham Hughes/The Canadian Press via AP) AP | The Canadian Press Signs of support are shown on a window in Montreal, Sunday, March 29, 2020, as Coronavirus COVID-19 cases rise in Canada and around the world. (Graham Hughes/The Canadian Press via AP) AP | The Canadian Press Volunteers in a protective suits spray disinfectant on passing vehicles helping curb the spread of the coronavirus in Kabul, Afghanistan, Sunday, March 29, 2020. The government Friday ordered a three-week lock-down for Kabul to stem the spread of the new coronavirus. (AP Photo/Rahmat Gul) AP | AP Volunteers in protective suits spray disinfectant on passing vehicles helping curb the spread of the coronavirus in Kabul, Afghanistan, Sunday, March 29, 2020. The government Friday ordered a three-week lock-down for Kabul to stem the spread of the new coronavirus. (AP Photo/Rahmat Gul) AP | AP Volunteers in protective suits spray disinfectant on passing vehicles helping curb the spread of the coronavirus in Kabul, Afghanistan, Sunday, March 29, 2020. The government Friday ordered a three-week lock-down for Kabul to stem the spread of the new coronavirus. (AP Photo/Rahmat Gul) AP | AP A coronavirus patient from Metz in France is transported from a military helicopter for treatment at the University Hospital in Essen, Germany, in bad weather Sunday March 29, 2020. Two COVID-19 coronavirus victims are to be treated in Germany. The COVID-19 coronavirus causes less serious symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause severe illness and even death. (Marcel Kusch/dpa via AP) AP | dpa A coronavirus patient from Metz in France is transported from a military helicopter for treatment at the University Hospital in Essen, Germany, in bad weather Sunday March 29, 2020. Two COVID-19 coronavirus victims are to be treated in Germany. The COVID-19 coronavirus causes less serious symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause severe illness and even death. (Marcel Kusch/dpa via AP) AP | dpa An Indian girl stands amid smoke as municipal workers fumigate an area spray disinfectants as a precautionary measure against COVID-19 in Ahmedabad, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Ajit Solanki) AP | AP An Indian girl stands amid smoke as municipal workers fumigate an area spray disinfectants as a precautionary measure against COVID-19 in Ahmedabad, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Ajit Solanki) AP | AP An Indian girl stands amid smoke as municipal workers fumigate an area spray disinfectants as a precautionary measure against COVID-19 in Ahmedabad, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Ajit Solanki) AP | AP Italian police cars patrol the area outside an empty St. Peter's Square with the Basilica in the background during Pope Francis' angelus prayer from his studio overlooking an empty square due to restrictions to contain the Covid-19 virus, at the Vatican, Sunday, March 29, 2020. Pope Francis is backing the U.N. chief's call for a cease-fire in all conflicts raging across the globe to help slow the spread of the coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Andrew Medichini) AP | AP Italian police cars patrol the area outside an empty St. Peter's Square with the Basilica in the background during Pope Francis' angelus prayer from his studio overlooking an empty square due to restrictions to contain the Covid-19 virus, at the Vatican, Sunday, March 29, 2020. Pope Francis is backing the U.N. chief's call for a cease-fire in all conflicts raging across the globe to help slow the spread of the coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Andrew Medichini) AP | AP People wearing masks stand in a queue to receive food being distributed during lockdown in Mumbai, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Rafiq Maqbool) AP | AP People wearing masks stand in a queue to receive food being distributed during lockdown in Mumbai, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Rafiq Maqbool) AP | AP People wearing masks stand in a queue to receive food being distributed during lockdown in Mumbai, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Rafiq Maqbool) AP | AP People wearing masks stand in a queue to receive food being distributed during lockdown in Mumbai, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Rafiq Maqbool) AP | AP Only occasionally do cars drive over the city's largest traffic junction, the Riebeckplatz in Halle, Germany, March 29, 2020. There are exit restrictions throughout Germany due to the coronavirus. (Jan Woitas/dpa via AP) AP | DPA Only occasionally do cars drive over the city's largest traffic junction, the Riebeckplatz in Halle, Germany, March 29, 2020. There are exit restrictions throughout Germany due to the coronavirus. (Jan Woitas/dpa via AP) AP | DPA Travelers wearing face masks to help curb the spread of the coronavirus line up for their train at the station in Beijing on Sunday, March 29, 2020. As the coronavirus epicenter has shifted westward, the situation has calmed in China, with falling death rates and most new cases coming from abroad, restrictions on travel have been slowly lifted. (AP Photo/Ng <mark>Han Guan</mark>) AP | AP Show Captions Hide Captions NEW YORK--The coronavirus outbreak could kill 100,000 to 200,000 Americans, the U.S. government's top infectious-disease expert warned on Sunday as smoldering hot spots in nursing homes and a growing list of stricken cities heightened the sense of dread across the country. Faced with that grim projection the possibility and that even more could die in the U.S. without measures to keep people away from each other, President Donald Trump extended federal guidelines recommending people stay home for another 30 days until the end of April to prevent spread of the virus. Trump's extension of the original 15-day guidelines was a stark reversal just days after he suggested restarting the economy in about two weeks and came after Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, made the dire prediction of fatalities, adding that millions in the U.S. could become infected. By evening, the U.S. had over 139,000 infections and 2,400 deaths, according to the running tally kept by Johns Hopkins University, though the true number of cases is thought to be considerably higher because of testing shortages and mild illnesses that have gone unreported. Worldwide, more than 710,000 infections were reported, and deaths topped 33,000, half of them in Italy and Spain, where hospitals are swamped and the health system is at the breaking point. New York state--where the death toll closed in on 1,000, up by more than 200 from the day before--remained the epicenter of the U.S. outbreak, with the vast majority of the deaths in New York City. But spikes in infections were recorded around the country, not only in metropolitan areas but in Midwestern towns and Rocky Mountain ski havens. \"This is not going to get better soon,\" New York Gov. Andrew Cuomo said. The virus is moving fast through nursing homes, assisted living facilities and other places that house elderly or otherwise vulnerable people, spreading \"like fire through dry grass,\" Cuomo said. New York City Mayor Bill De Blasio asked the federal government to deliver 400 more ventilators to city hospitals and warned that the city will run out of masks, gowns and other hospital supplies in a week if they don't get resupplies. Since the U.S. saw its first major outbreak of the coronavirus earlier this month--centered at a nursing home in Kirkland, Washington--a stream of facilities have battled infections among residents and staff. A week ago, the Centers for Disease Control and Prevention said 147 nursing homes in 27 states had patients with COVID-19. The problem has only worsened since. In Woodbridge, New Jersey, an entire nursing home relocated its residents after two dozen were confirmed infected and the rest were presumed to be. In Louisiana, at least 11 nursing homes, largely in the New Orleans area, have reported cases. In Mount Airy, Maryland, a death linked to the virus was recorded in a home where 66 people were confirmed infected. Residents' loved ones are being kept away to try to slow the spread of the virus. \"I have a feeling that I very likely may never see my mother again,\" said James Preller, whose 94-year-old mother, Ann Preller, is a resident at Peconic Landing, a retirement community near Greenport on New York's Long Island where seven have died in the past two weeks. <mark>Brian Lee</mark> of Families for Better Care, an advocacy group for those living in long-term care facilities, said in a nursing home, \"when we see an outbreak that's uncontrolled, it's practically a death sentence .\" But he also said the way residents are being walled off from the outside world is as much of a concern as the virus itself. In New York, the virus is overwhelming some of the city's poorest neighborhoods, with data showing high rates of infection in densely packed areas with big non-English-speaking populations. Dr. <mark>Craig Smith</mark>, who heads the surgery department at New York-Presbyterian/Columbia University Medical Center, said the hospital will probably be forced into \"apocalyptic scenarios\" in the coming weeks in which ventilators and intensive care unit beds will need to be rationed. \"Yesterday tried my soul,\" he wrote in an online posting. Worry for the poorest was being echoed around the world. In India, a lockdown covering the country's 1.3 billion people has put untold numbers out of work and left many families struggling to feed themselves. Tens of thousands in New Delhi were forced to flee their homes, with no way to pay the rent, journeying back to their native villages. Women in saris held babies on their hips. Others toted their belongings in bags normally used for cement. Prime Minister Narendra Modi apologized for the hardships that the lockdown brought but said, \"These tough measures were needed to win this battle .\" Though the U.S. leads the world in reported cases, five other countries have higher death tolls: Italy, Spain, China, Iran and France. Italy reported more than 750 new fatalities Sunday, bringing the country's total to nearly 10,800. But the number of new infections showed signs of easing, with officials expressing cautious optimism that the most severe shutdown in the industrialized West is showing results. Italy's civil protection agency said more than 5,200 new cases were recorded in the last 24 hours, the lowest number in four days, for a total of almost 98,000 infections. Spain moved to tighten its lockdown and ban all nonessential work as it hit another daily record of almost 840 dead. The country's overall official toll was more than 6,500. Spain's health emergencies chief, Fernando Simon, said the number of people in intensive care units keeps rising and hospitals are at their limits in several regions. \"That is why we have to strictly apply the control measures,\" he said. Egypt shut its beaches as cases in the Mideast surpassed 50,000. Police in the Philippines stepped up arrests of quarantine violators, and more tourists were evacuated from Mount Everest and the Indonesian island of Bali. Poland is considering delaying its May 10 presidential election. Russia ordered borders to close on Monday, Moscow all but confined its 12 million residents to their homes, and the head of the Russian Orthodox called on believers to stay away from churches and pray at home instead. A prominent French politician with the virus died, the country's first death of a senior official. For most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. But for others, especially older adults and people with existing health problems, the virus can cause more severe illness, including pneumonia, and lead to death. About 150,000 people have recovered, according to Johns Hopkins. Trump on Saturday backtracked on a proposal to quarantine New York and neighboring states amid criticism and questions about the legality of such a move. But the CDC issued a travel advisory urging all residents of New York City and others in New York state, New Jersey and Connecticut to avoid all nonessential travel for 14 days. Shocking as that is, it stopped short of the restrictions imposed in Europe or elsewhere. Parisians are fined if they try to leave the city, South Africans can't buy liquor, and Serbians are upset over a ban on walking their dogs. In Italy, burials are being held with only one family member. Some U.S. states began to try to limit exposure from visitors from harder-hit areas. Rhode Island National Guard troops went door to door in coastal communities to find New Yorkers. Florida is setting up checkpoints to screen visitors from Louisiana. Texas said it would require drivers from Louisiana to self-isolate for two weeks. Few areas of the country have escaped untouched: West Virginia reported the state's first death linked to the new coronavirus on Sunday, leaving Hawaii and Wyoming the only remaining states with no reported deaths linked to the outbreak. As others tightened controls, China continued to ease its restrictions, following the ruling Communist Party's declaration of victory over the coronavirus. Flights from Hubei province at the epicenter of the country's outbreak resumed Sunday. Government See more", "articleID": "2020033000_00033385_W", "names": {"Brian Lee": ["Q16145430", "Q17661135", "Q2924919", "Q2924941", "Q4964464", "Q4964465", "Q4964466", "Q4964469", "Q515227", "Q56367581"], "Craig Smith": ["Q1138675", "Q16197253", "Q21285570", "Q22096890", "Q2565774", "Q3002061", "Q40198915", "Q5181461", "Q5181462"], "Han Guan": ["Q45384234", "Q45522833", "Q45642591"], "Jose Sanchez": ["Q25860481", "Q3186563", "Q3810586", "Q5548031"], "Pedro Sanchez": ["Q6070218", "Q742858"]}}]