[{"date": "2020-03-30", "url": "http://asiaone.com/asia/hong-kong-jails-men-who-flouted-coronavirus-quarantine-rules", "content": "#Hong Kong #coronavirus #Jail term Hong Kong jails men who flouted coronavirus quarantine rules March 30, 2020 By <mark>Brian Wong</mark> South China Morning Post The convicted man passed through Shenzhen Bay port on March 8, a month after quarantine rules came in for people arriving from north of the border. South China Morning Post Three Hong Kong men who flouted isolation rules brought in to fight the spread of the deadly coronavirus were jailed for up to three months on Monday, in the city's first such convictions. The longest term was handed to a homeless man, after he admitted evading mandatory quarantine by falsifying a home address. Two other men were jailed for 10 days and six weeks respectively, for trying to leave Hong Kong for mainland China while they were subject to 14-day home quarantine. Magistrates said imprisonment was the only appropriate sentence, criticising the men's actions as selfish and irresponsible, and adding that they could have undermined the government's anti-contagion efforts and endangered the community. As of Monday morning, Hong Kong had recorded 641 confirmed Covid-19 cases, with four related deaths. All arrivals to the city have been required to undergo compulsory quarantine for 14 days, following government measures introduced on February 8. It is a criminal offence to contravene the order and offenders are subject to a maximum fine of HK $25,000 (S $4,600) and six months' imprisonment. Fanling Court heard delivery man Sing Kin Kung-kai was required to enter a 14-day quarantine upon his return from mainland China on March 8. But when the 31-year-old local resident passed through Shenzhen Bay port that night, he lied to a health officer that he was living at a youth hostel in Yuen Long, to avoid being sent to a quarantine centre. He was intercepted at the same border control point two days later, when he tried to leave for the mainland to visit relatives. He was subsequently sent to quarantine at Tso Kung Tam Outdoor Recreation Centre in Tsuen Wan, and was charged two weeks later. He pleaded not guilty to giving false information to an authorised officer when he first appeared at West Kowloon Court on March 23, but opted to plead guilty to the charge on Monday. [[nid:481121]] The defendant told acting principal magistrate Don So Man-lung he had been without a fixed place of residence since December 2018. He pleaded for leniency on the grounds that he had tested negative for the coronavirus, and had been asymptomatic before and after the offence. But So considered immediate imprisonment the only appropriate sentence, blasting the defendant for his \"selfish\" act. \"Although the defendant might not be a carrier of the virus, its ability to incubate means that nobody can assume they are off the hook,\" the magistrate said. \"The defendant put the society in danger and had all along no intention to co-operate with the quarantine requirement. His selfish act might have dealt a blow to the government's anti-contagion efforts and put them to complete waste .\" Meanwhile at West Kowloon Court, Xie Xong-yue and <mark>Wong</mark> Yee-keung each pleaded guilty to one summons over contravention to restrictions during quarantine, for leaving their isolation site without reasonable excuse or permission. The court heard Xie, 37, was issued a 14-day quarantine order following his entry at Shenzhen Bay Control Point on February 8, running to February 21. He was required to stay at his reported address in Tsuen Wan and banned from leaving Hong Kong. [[nid:481993]] But immigration officers found him at the same port just four days later on February 12 and intercepted him. \"I wanted to see my sick mother,\" he told Principal Magistrate Peter Law Tak-chuen. <mark>Wong</mark> was similarly accused of breaching his quarantine order, effective from February 10 to 23, after he was intercepted at the Hong Kong-Zhuhai-Macau Bridge on February 13. Upon arrest, <mark>Wong</mark> told police officers that he wanted to visit the mainland for fun because he was bored at home. Both men, of prior clear records, were subsequently sent to quarantine camps to complete their isolation periods. Law said health workers were working very hard to contain the outbreak and keep everyone healthy, but the public's co-operation is needed to fight the outbreak. \"This is very irresponsible behaviour,\" he said of the offence. The magistrate also described <mark>Wong</mark>'s conduct as \"selfish to the extreme\". Xie and <mark>Wong</mark> were respectively jailed for 15 days and nine weeks as starting point of sentence, before they were given a one-third discount to credit their guilty pleas. For the latest updates on the coronavirus, visit here. This article was first published in South China Morning Post. #Hong Kong #coronavirus #Jail term SUBSCRIBE TO OUR NEWSLETTER Your daily good stuff - AsiaOne stories delivered straight to your inbox SUBSCRIBE", "articleID": "2020033008_00043770_W", "names": {"Brian Wong": ["Q4965675", "Q56248560", "Q8968957"]}}, {"date": "2020-03-31", "url": "http://ctpost.com/news/education/article/Marshall-held-boot-camp-for-faculty-for-online-15167961.php", "content": "https: //www.ctpost.com/news/education/article/Marshall-held-boot-camp-for-faculty-for-online-15167961.php Justice admits travel order may be unconstitutional Anthony Izaguirre, Associated Press Updated 6:57 pm EDT, Tuesday, March 31, 2020 West Virginia Gov. Jim Justice speaks during a news conference at the State Capitol in Charleston, W. Va., Monday March 16, 2020. Justice declared a state of emergency in response to the new coronavirus, even as West Virginia remains the last state in the U.S. without a confirmed case. (F. Brian Ferguson/Charleston Gazette-Mail via AP) less West Virginia Gov. Jim Justice speaks during a news conference at the State Capitol in Charleston, W. Va., Monday March 16, 2020. Justice declared a state of emergency in response to the new coronavirus, even as...more Photo: F. BRIAN FERGUSON, AP Photo: F. BRIAN FERGUSON, AP Image 1 of / 7 Caption Close Image 1 of 7 West Virginia Gov. Jim Justice speaks during a news conference at the State Capitol in Charleston, W. Va., Monday March 16, 2020. Justice declared a state of emergency in response to the new coronavirus, even as West Virginia remains the last state in the U.S. without a confirmed case. (F. Brian Ferguson/Charleston Gazette-Mail via AP) less West Virginia Gov. Jim Justice speaks during a news conference at the State Capitol in Charleston, W. Va., Monday March 16, 2020. Justice declared a state of emergency in response to the new coronavirus, even as...more Photo: F. BRIAN FERGUSON, AP Justice admits travel order may be unconstitutional 1 / 7 Back to Gallery CHARLESTON, W. Va. (AP)--West Virginia Gov. Jim Justice on Tuesday acknowledged that his directive to have police monitor roads and check in on travelers from coronavirus hotspots might be unconstitutional but he said it will continue for safety reasons. Justice has issued an executive order mandating that people entering the state from places hard-hit by the virus must quarantine for two weeks or face an obstruction charge, saying authorities will watch roads and conduct home checks to make sure people comply. \"If they don't quarantine themselves for 14 days, you know, I'm going to take a big time issue with it, and I may lose at the end of the day but I'm going to try to protect our people,\" Justice, a Republican, said in response to a question about the legality of the directives. The instruction triggered constitutional concerns almost immediately, with the leader of the American Civil Liberties Union of West Virginia saying the order was overly broad and could violate constitutional rights on unreasonable searches and seizures. \"From a real practical standpoint it's hard to imagine how they would enforce this order without violating the Fourth Amendment,\" <mark>Joseph Cohen</mark>, executive director of the ACLU chapter, said in an interview. The order, which went into effect Tuesday, follows similar moves by governors in Rhode Island, Texas, Florida, Maryland and South Carolina, at least one of which triggered constitutional concerns over whether it is legal to pull someone over on the basis of the origin state of his or her license plate. Justice said it's important for people entering the state from New York, New Jersey, Louisiana, Connecticut, Italy or China to self-isolate and that he \"wants to be really respectful of constitutional rights but people are dying all over this country right and left .\" Clay Marsh, a high-ranking West Virginia University health official tapped to lead the state's coronavirus response, said the self-quarantine directive is in line with federal guidance but did not mention the order's criminal and policing components. The directive allows for people who are under the ordered quarantine to leave to get food or medical attention. It doesn't apply to people traveling into West Virginia for work, health, emergency or essential business purposes. At least 162 people in West Virginia have the virus, with a total of 4,143 residents have tested, state health officials said Tuesday. The state reported its first virus fatality on Sunday, with the death of an 88-year-old Marion County woman. West Virginia was the last U.S. state to report a confirmed case, though Justice attributed that to a lack of testing. Testing remains limited, meaning most people now spreading the highly contagious virus may not know they have been infected, and state health officials have admitted their count lags behind the actual total as results pour in from counties around the state. A statewide stay-home order that directed all nonessential businesses to close went into effect last week, intensifying previous moves by Justice, who has ordered the closure of bars, restaurants, casinos, gyms, health clubs, recreation centers, barbershops, nail salons and hair salons. Schools statewide are closed until at least April 20. Justice on Tuesday also announced he was banning elective surgeries and closing private campgrounds to new arrivals from people who aren't from West Virginia, which he said was intended to further deter visitors. In addition, the governor quietly signed an executive order eliminating a rule requiring that medical professionals conduct an in-person screening before refilling an opioid prescription. Justice did not mention the order at his news conference. It says that the state boards of nursing and medicine identified the rule as burdensome during the ongoing state of emergency. For most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks, and the overwhelming majority of people recover. But severe cases can need respirators to survive, and with infections spreading exponentially, hospitals across the country are either bracing for a coming wave of patients, or already struggling to keep up. ___ Follow AP coverage of the virus outbreak at https: //apnews.com/VirusOutbreak and https: //apnews.com/UnderstandingtheOutbreak. Most Popular 1 CT grocery chains to limit number of shoppers in stores 2 CT National Guard starts new coronavirus \"missions' 3 Town-by-town breakdown: Coronavirus cases in CT 4 Coronavirus in Connecticut: Live updates, hour-by-hour 5 CT cases reach 2,571; New Haven, Mohegan Sun eyed for overflow 6 How many get infected: The coronavirus infection rate in CT 7 CTbanks agree to delays for mortgage payments, foreclosures Connecticut Post View Comments © 2020 Hearst Communications, Inc. .", "articleID": "2020033123_00029844_W", "names": {"Joseph Cohen": ["Q19629750", "Q28703566"]}}, {"date": "2020-04-02", "url": "https://www.news-gazette.com/news/nation-world/central-park-houses-hospital-ward-as-ny-races-to-add-beds/article_fd2bc90d-7abe-558e-be37-f1940375a895.html", "content": "Facebook Twitter WhatsApp SMS Email Listen to this article Facebook Twitter WhatsApp SMS Email Print Save NEW YORK (AP)--There is a coronavirus ward in tents in Central Park. A makeshift hospital has been set up in a Manhattan convention center. Over the next few weeks, spaces including pro tennis courts, college dorms and a cruise ship terminal are supposed to start housing patients as New York state races to roughly triple its hospital capacity. And still, officials worry whether the massive effort will be enough in the U.S. epicenter of the coronavirus pandemic. A recent state chart tallying the planned hospital beds ended with question marks about how much space might be found in nursing homes. Some hospital and city leaders have questioned whether too much temporary hospital space is being reserved for patients who don't have the virus that causes COVID-19, though there are now plans to shift one big temporary site's focus to caring for them. And officials underscore that beds alone can't solve a problem growing by more than 1,000 hospitalizations a day. \"Beds, we can find. Not easy, but we can find them. The harder components are the staff and the supplies,\" Gov. Andrew Cuomo said Thursday. As he spoke, over 13,300 coronavirus patients were hospitalized and more than 3,300 needed intensive care around the state, though mostly in New York City. The outbreak's expected peak was still seven to 30 days away, the Democrat said. When that happens, New York expects to need 140,000 hospital beds--compared to the 53,000 it had when the crisis began. So many seriously ill patients are anticipated that New York City is preparing to turn all its 20,000 permanent hospital beds into intensive care ones, while trying to add 65,000 temporary beds for other patients. For most people, the new virus causes mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with chronic health problems, it can cause more severe illness, including pneumonia, and can be fatal. It has killed over 2,300 people in New York state so far, according to the governor. The scramble for hospital space, staff and ventilators is intended to ward off a dire worst-case scenario: medical centers becoming so swamped that some people die whose lives could otherwise be saved. Even though they are working to squeeze in thousands of extra beds, some New York City facilities have been overloaded at times, transferring patients around the city and sometimes as far away as the Albany area. Emergency rooms at Mount Sinai Health System's Brooklyn and Queens hospitals started getting backed up over the weekend, emergency medicine chair Dr. <mark>Brendan Carr</mark> said. Patient transfers to larger Mount Sinai hospitals ultimately eased the crunch. But if not for that, \"two of our hospitals would be in terrible distress,\" he said Wednesday. \"That can't keep going. We're continuing to grow capacity at all these hospitals, but at some point, we run out of space,\" he said. Some relief is now in sight, even from the windows of Mount Sinai's flagship hospital in Manhattan. Across Fifth Avenue, white tents now cover much of Central Park's East Meadow. They form a 68-bed emergency field hospital for coronavirus patients that opened Wednesday. Nine patients were being cared for Thursday, according to Samaritan's Purse, the evangelical Christian relief group running the operation. The group's opposition to same-sex marriage sparked concern among some of New York's Democratic political leaders. The organization's CEO, the Rev. Franklin Graham, told Fox News on Monday that \"we're going to give the best health care we can to all New Yorkers--it doesn't matter who they are or what they are .\" State, city and federal officials say they have lined up--and in some cases, opened--dozens of additional spots for temporary hospitals around the metropolitan area. A Navy hospital ship, the USNS Comfort, is docked in Manhattan with 750 beds, three of them occupied as of Thursday, commanding officer Capt. Patrick Amersbach said in a telephone news briefing. The Javits Center, a glassy convention facility where such events as New York Comic Con and the New York International Auto Show usually take place, now houses a federally-run hospital, with 2,500 beds as of Thursday, according to Cuomo. Officials also are tapping colleges, the Aqueduct horse-racing track, a part of the tennis center that hosts the U.S. Open, a Brooklyn cruise terminal, and 20 hotels so far. Decisions on routing patients to the temporary hospitals are made from a state-run operations hub set up in the Javits Center, according to city Emergency Management Office spokesman Omar Bourne. A similar system has been used before during such disasters as Superstorm Sandy. Some facilities are intended for COVID-19 patients who need hospitalization, but not intensive care. Others, including the Comfort and the Javits Center, were designated for patients who don't have the virus but need care for other reasons--though President Donald Trump said Thursday evening that the Javits would switch to caring for coronavirus patients. New York officials and hospital leaders had urged a change in focus. \"You're only going to help if you take the patients that we need help with, which is COVID patients,\" Michael Dowling, CEO of Northwell Health, said before Thursday's announcement. \"If they don't relieve us of the pressure that we're under, then I'm not sure the utility .\" While scouring for temporary hospital space, state and city officials are also sounding even more urgent calls for ventilators, medical personnel and protective gear for them. Cuomo warned Thursday that the state's supply of breathing machines could be exhausted in six days if the current rate of critical COVID-19 illness continues. Democratic New York Mayor Bill de Blasio asked the federal government this week to supply 1,000 nurses, 150 doctors and 300 respiratory therapists by Sunday. \"The bed,\" he said, \"is only as good as the supplies, the equipment, and especially the people that go with it .\" ------Associated Press writers Michael R. Sisak in New York, Marina Villeneuve in Albany, New York, and Robert Burns in Washington contributed to this report. Copyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Facebook Twitter WhatsApp SMS Email Print Save Locations United States North America Albany New York Brooklyn New York City Manhattan", "articleID": "2020040302_00146020_W", "names": {"Brendan Carr": ["Q25993038", "Q39073457", "Q4960828"]}}, {"date": "2020-04-06", "url": "https://www.krwg.org/post/golf-reshuffles-its-schedule-all-4-majors-canceled-or-postponed", "content": "Golf Reshuffles Its Schedule: All 4 Majors Canceled Or Postponed By Brakkton Booker • 2 hours ago Share Tweet Email The British Open, which is golf's oldest tournament, has been canceled this year because of the coronavirus. Last year, <mark>Shane Lowry</mark> (right) celebrated winning that championship. Andrew Redington / Getty Images Originally published on April 6, 2020 1:44 pm Golf tournament organizers announced a series of major schedule changes Monday due to the spread of the coronavirus, including canceling the British Open and rescheduling the Masters, the U.S. Open and the PGA Championship. \"It is with a heavy heart that we have to cancel The Open for the first time since WWII,\" the official Twitter account for the British Open, golf's oldest tournament, said on Monday. \"We appreciate that this will be disappointing for a great many people but we have to act responsibly during this pandemic and it is the right thing to do,\" the tweet continued. It is with a heavy heart that we have to cancel The Open for the first time since WWII. We appreciate that this will be disappointing for a great many people but we have to act responsibly during this pandemic and it is the right thing to do. Statement: https: //t.co/brJfuOZSFP pic.twitter.com/iizOupOk4m--The Open (@ TheOpen) April 6, 2020 The Open is the first major for men's golf to be canceled. It was one of a series of changes in golf's calendar announced Monday. The sport's most iconic U.S. tournament, the Masters, said it was postponing the Augusta, Ga., -based competition from April to November. \"We have identified Nov 9-15 as the intended dates to host the 2020 Masters. We hope the anticipation of staging the Tournament brings a moment of joy to the Augusta community and those who love the game,\" Augusta National Golf Club Chairman Fred Ridley said in a statement on Twitter. Statement from Chairman Ridley: \"We have identified Nov 9-15 as the intended dates to host the 2020 Masters. We hope the anticipation of staging the Tournament brings a moment of joy to the Augusta community and those who love the game .\" Full details at https: //t.co/rSr9YUhCX2 pic.twitter.com/1lVmbq8jzJ--The Masters (@ TheMasters) April 6, 2020 The U.S. Open, which had been scheduled in June at Mamaroneck, N.Y., has been rescheduled to Sept. 17 to 20. The PGA of America announced that the PGA Championship, originally scheduled for May, is now set to be played August 3 to 9. The biennial men's golf tournament the Ryder Cup, which features a U.S. team competing against a European team, remains unchanged, and is still scheduled for September 22 to 27. We have new dates for the 2020 PGA Championship, provided we have clearance from public health authorities. #PGAChamp pic.twitter.com/Erkhm7GA5j--PGA of America (@ PGA) April 6, 2020 The 149th British Open was scheduled to be played July 12 to 19 at Sandwich, Kent, England. The tournament, one of men's golf's four major champions, will now be played July 11 to 19 in 2021, according to a statement by the R & A, the governing body of the sport outside the U.S. \"I can assure everyone that we have explored every option for playing The Open this year but it is not going to be possible,\" said Martin Slumbers, the chief executive of the R & A. The 150 th Open will also be pushed back a year and is now scheduled to be played at St. Andrews in Fife, Scotland from July 10 to 17 in 2022. Golf is far from the only sporting competition that's been forced to cancel or postpone events because of the coronavirus pandemic. Last week, the organizers of Wimbledon canceled the London-based tennis tournament because of concerns over COVID-19. The MLB, NBA, NFL, NHL and the Olympics have also canceled or postponed games or other league events because of the spread of the virus. The last golf tournament to be played in the U.S., the Players Championship in Ponte Verda Beach, Fla., was canceled after playing just one round last month. Copyright 2020 NPR. To see more, visit https: //www.npr.org. Share Tweet Email View the discussion thread.", "articleID": "2020040620_00057894_W", "names": {"Shane Lowry": ["Q2067337", "Q2736966"]}}, {"date": "2020-04-07", "url": "http://thestar.com/entertainment/stage/2020/04/07/shaw-festival-cancels-performances-until-june-30-due-to-coronavirus-pandemic.html", "content": "<mark>Shaw</mark> Festival cancels performances until June 30 due to coronavirus pandemic By Debra Yeo Toronto Star Tues., April 7, 2020 timer 2 min. read The show will not go on at the <mark>Shaw</mark> Festival in Niagara-on-the-Lake until at least July. The festival named for playwright George <mark>Bernard Shaw</mark> has announced that it's cancelling all performances and public events until June 30, due to the COVID-19 outbreak. That date matches the one declared by the Town of Niagara-on-the-Lake for cancellation of all in-person events during its state of emergency. But the festival says it will continue to monitor the situation to see if additional cancellations are required. \"You wouldn't believe how much great work this company is still doing, in spite of all the obstacles and uncertainty,\" artistic director <mark>Tim Carroll</mark> said in the news release. \"Of course it is frustrating to be pushing back the date when we hope to perform, but I know we will be ready with deeper and better artistry than ever before .\" One <mark>Shaw</mark> play that will not take the stage at any time in 2020 is \"Mahabharata,\" a Why Not Theatre production based on the 4,000-plus-year-old Sanskrit epic. The production, which features artists and creators from five countries, was to begin rehearsals in June and performances in August, and work had not yet begun on the sets, props and costumes. \"We remain positive and hopeful that we will realize this production in the near future, when it is safe for artists and audiences, both here in Canada and on the international stages for which\" Mahabharata' is destined, \"Why Not artistic director Ravi Jain said in the release .\" While I'm sad to have to postpone it, I really would rather do that than cut corners on what I believe will be an artistic event that people will talk about for years to come, \"he said. YOU MIGHT BE INTERESTED IN...<mark>Shaw</mark> ticket holders can email feedback @ shawfest.com. The province's other major theatre festival, the Stratford Festival, is cancelling performances through the end of May so far, with plans to issue an update in mid-April. Get the latest in your inbox Never miss the latest news from the Star, including up-to-date coronavirus coverage, with our free email newsletters", "articleID": "2020040716_00107489_W", "names": {"Bernard Shaw": ["Q10537487", "Q322736", "Q4893642"], "Tim Carroll": ["Q24849258", "Q28043361"]}}, {"date": "2020-04-09", "url": "http://latinpost.com/articles/144698/20200409/confirmed-study-finds-cats-catch-covid-19.htm", "content": "CONFIRMED! Study Finds Cats Can Catch COVID-19 By Neil P. (staff @ latinpost.com) First Posted: Apr 09, 2020 08:43 AM EDT Share This Tweet This Close Share This Tweet This (Photo: Pexels) A recently published study in the Journal of Science confirms that COVID-19 can infect cats, and this has now prompted the World Health Organization to have a further look at the study. COVID-19 TRANSMISSION COVID-19 that originated in Wuhan, China, is thought to be transmitted by persons to other persons through droplets. It is for this reason that social distancing, stay-at-home policy, and other strict measures are implemented across the globe to control the spread of the virus. Now, there are more than 1.5 million of COVID-19 cases around the globe and a death toll of more than 88,000 according to worldometers. These numbers are expected to increase or will reach its peak once there is mass testing for COVID-19. The transmission of COVID-19 from persons-to-persons has been scientifically established. It is the reason why almost 30 pharmaceutical companies are on the race of developing a vaccine that will kill the virus and treat the patients. CATS CAN CATCH THE VIRUS Recent research published in the Journal of Science states that COVID-19 can infect cats, but dogs and other animals like chickens, pigs, and ducks are not likely to catch the virus. The primary purpose of the study is to identify which among the animals are vulnerable for the virus so that they can use it in testing the vaccine before applying for the Phase 1 or the human clinical trial to make sure that the vaccine is safe and effective. It is believed that the virus first spread from bats to humans. Meanwhile, aside from the reports that cats and dogs can be infected with the virus, there is still no scientific and empirical evidence that pets can be carriers of the virus. In a recent report from Latin Post, a four-year-old Malayan tiger at the Bronx Zoo tested positive for COVID-19 after it was exposed to a zookeeper who was an asymptomatic COVID-19 carrier. It raised the question of whether or not the virus can be transmitted from humans-to-animals. HOW THE RESEARCH WAS CONDUCTED During the epidemic period of COVID-19 in China, they conducted a study in January and February and they found out that cats and ferrets are highly susceptible to the virus. The researchers of the said study attempted to infect the animals through viral particles via the nose. The other result of the study is that cats can transmit the virus to other cats via respiratory droplets. At the same time, these infected cats were found to have the virus in their mouth, nose, and small intestines. Daniel Kuritzkes, head of infectious diseases at Boston's Brigham and Women's Hospital, said: \"It's both interesting and not surprising in the sense that with the original SARS epidemic, civet cats were implicated as one of the vectors that may have transmitted virus to humans .\" He also added: \"What these data do provide is support for the recommendation that people who are with COVID-19 should be distancing themselves, not only from other household members but also from their household pets, so as not to transmit the virus to their pets, particularly to cats or other felines .\" WORLD HEALTH ORGANIZATION WILL HAVE A FURTHER STUDY For this reason, the World Health Organization announced that they are now working with their partners to have a closer look at the study so that they will know the role of cats in this infectious and deadly disease. Maria Van Kerkhove, a WHO epidemiologist, said: \"We don't believe that they are playing a role in transmission, but we think that they may be able to be infected from an infected person .\" Moreover, WHO's top emergency expert <mark>Mike Ryan</mark> is asking people not to retaliate against the animals. He said: \"They're beings in their own right and they deserve to be treated with kindness and respect. They are victims like the rest of us .\" Read a related article: First of Her Kind: Tiger at Bronx Zoo Tests Positive for COVID-19 Tags Cats, COVID-19, new study, COVID-19 infections © 2015 Latin Post. All rights reserved. Do not reproduce without permission.", "articleID": "2020040917_00093752_W", "names": {"Mike Ryan": ["Q20655947", "Q30122415", "Q360703", "Q37381043", "Q6848659", "Q6848661"]}}, {"date": "2020-04-12", "url": "http://www.times-series.co.uk/news/national/18374841.hollywood-problem-apollo-13-movie-quotes-fiction-not-fact/", "content": "News National News Hollywood, we have a problem! Some Apollo 13 movie quotes were fiction not fact By Press Association 2020 Apollo 13 Anniversary Quotes 0 comment Apollo 13 ′ s best known quotes originated not in space or Mission Control, but in Hollywood. Their moon-bound spacecraft wrecked by an oxygen tank explosion on April 13 1970, the astronauts urgently radioed: \"Houston, we've had a problem here .\" Screenwriters for the 1995 film Apollo 13 wanted to improve it. Thus was born: \"Houston, we have a problem .\" Even more artistic license was taken with Nasa flight director Gene Kranz's mobilising speech to his team in Houston. Mr Kranz never declared: \"Failure is not an option .\" Asked what he actually told flight controllers, Mr Kranz rattled it off without a moment's hesitation a half-century later. \"I have never lost an American in space, sure as hell aren't going to lose one now .\" This crew is coming home. You got to believe it. \"Your team must believe it. And we must make it happen .\" Fred Haise, Jack Swigert and Jim Lovell gather for a photo on the day before launch (Nasa/AP) Mr Kranz said the filmmakers came up with: \"Failure is not an option .\" He does not regret not saying it, saying: \"No--I'm satisfied with what I said .\" Mr Kranz constantly finds himself setting the record straight, \"in fact, every time I speak\". \"I try not to plagiarise,\" he said with a laugh. He did borrow the phrase for the title of his 2000 autobiography. Jim Lovell is winched from the sea after the successful splashdown (AP) Director <mark>Ron Howard</mark>'s film starring <mark>Ed Harris</mark> as Mr Kranz and Tom Hanks as mission commander Jim Lovell was based on Lovell's 1994 autobiography, Lost Moon. Actors <mark>Bill Paxton</mark> and <mark>Kevin Bacon</mark> portrayed Apollo 13 astronauts Fred Haise and Jack Swigert. 0 comment", "articleID": "2020041201_00090997_W", "names": {"Bill Paxton": ["Q110374", "Q42426634"], "Ed Harris": ["Q104791", "Q16729663"], "Kevin Bacon": ["Q23823432", "Q3454165", "Q6395762", "Q6395763", "Q6395764"]}}]