[{"articleID": "2017053016_00999404_W", "names": {"Pablo Martinez": ["Q1757794", "Q19896089", "Q7121684"], "Donald Trump": ["Q22686", "Q27947481"], "Michael Hayden": ["Q1226020", "Q449604", "Q6831016"], "Susan Rice": ["Q23848423", "Q50612"]}, "date": "2017-05-30", "url": "http://stamfordadvocate.com/technology/businessinsider/article/Embattled-House-intelligence-chairman-Democrats-11182478.php", "content": "http: //www.businessinsider.com/devin-nunes-democrats-trump-russia-probe-justify-clinton-loss-2017-5? utm_source=hearst & utm_medium=referral & utm_content=allverticals Embattled House intelligence chairman: Democrats are using the Russia \"narrative' to justify Clinton's loss Sonam Sheth, provided by Published 10:55 am, Tuesday, May 30, 2017 <mark>Pablo Martinez</mark> Monsivais/AP House Intelligence Committee chairman Devin Nunes said congressional investigations into the <mark>Trump</mark> campaign's possible collusion with Russian officials during the 2016 election were an attempt by Democrats to blame someone other than Hillary Clinton for her loss, The LA Times reported Tuesday.\" The Democrats don't want an investigation on Russia. They want an independent commission, \"Nunes told attendees at a private Republican fundraiser on April 7, which an event-goer captured on video and provided to the LA Times.\" Why do they want an independent commission? Because they want to continue the narrative that Vladimir Putin and <mark>Donald Trump</mark> are best friends, and that's the reason that he won, because Hillary Clinton would have never lost on her own; it had to be someone else's fault. \"The California Republican initially spearheaded the House intelligence committee's Russia probe, but stepped aside after a string of controversial actions that raised questions about his independence leading the investigation. Nunes drew intense scrutiny after it emerged that he met with a secret source on the White House grounds the day before he briefed the president on information that showed <mark>Trump</mark> and his advisers may have had their communications\" incidentally collected \"by the intelligence community during the transition period. Following an announcement from the House Ethics Committee that it was investigating whether Nunes had disclosed classified information without authorization, he stepped aside from the House's Russia investigation on April 6. Nunes' comments at the Republican fundraiser came the very next day.\" [Democrats] have tried to destroy this Russia investigation, they've never been serious about it, and one of the great things now that I've stepped aside from this Russia investigation, I can actually say what I want to say, \"Nunes said at the fundraiser.\" I know that there's probably media in here--you can write it, but just try to get it right when you do. \"When reached for comment by The Times, Nunes' spokesperson issued a statement saying:\" For the LA Times to tout comments I made in front of 700 people, which attendees broadcasted on Facebook Live and which reflected themes I've discussed repeatedly this year, as some sort of unique revelation is the epitome of lazy reporting and fake news. \"AP Photo/Evan Vucci During the fundraiser, Nunes also addressed <mark>Trump</mark>'s unfounded claim that former President Barack Obama wiretapped <mark>Trump</mark> Tower. He said he was aware that Obama administration officials had requested the unmasking of certain individuals whose communications had been intercepted.\" I went and looked at what I knew existed on the unmaskings, but what I found was a treasure trove of stuff that's really bad in terms of surveillance on Americans, and that is critical to the job that I have as chairman of the House Intelligence Committee, \"Nunes told attendees. The California Republican went on to call the unmaskings\" horrible \"and said the Obama administration had abused its power and endangered national security by requesting that the names of certain <mark>Trump</mark> associates be revealed. <mark>Michael Hayden</mark>, the former director of the National Security Agency and the CIA, told CNN on Saturday that some of the latest revelations about communications between <mark>Trump</mark> advisers and Russian officials could have prompted former national security adviser <mark>Susan Rice</mark> to request their names be unmasked. When it emerged on Friday that <mark>Trump</mark>'s son-in-law and senior adviser Jared Kushner may have spoken to Russian ambassador Sergey Kislyak about setting up a secret back-channel between <mark>Trump</mark> and Moscow using Russian facilities, <mark>Hayden</mark> said that would have raised a huge red flag. Kislyak reportedly notified Moscow of Kushner's request in a phone call that was intercepted by US intelligence. The details of that call would have been included in an intelligence report that <mark>Rice</mark> had access to. When asked whether he would have requested the unmasking of a US individual proposing a back-channel between <mark>Trump</mark> and the Kremlin, <mark>Hayden</mark> said,\" Oh my, yes. Anyone would have. \"Join the conversation about this story\" NOW WATCH: Watch Sally Yates go toe to toe with Ted Cruz over <mark>Trump</mark>'s immigration ban See Also: Investigators are reportedly looking into why Kushner met with a Putin-linked Russian banker Former CIA Director: \"Now we know' why <mark>Trump</mark> officials talking to the Russians may have been\" unmasked' The Trump-Russia controversy may put \"wartime consigliere' Steve Bannon back in the spotlight SEE ALSO: The <mark>Trump</mark> administration is skirting the biggest question about Kushner-Russia ties DON'T MISS: Homeland security secretary Kelly:' I don't see any big issue' in Kushner-Russia back-channel View Comments © 2017 Hearst Communications, Inc. ."}, {"articleID": "2017042621_00863563_W", "names": {"Alex Jones": ["Q16235485", "Q19559933", "Q20666729", "Q26330355", "Q2641401", "Q319121", "Q47113851", "Q4717247", "Q4717250", "Q4717251", "Q4717252", "Q4717253", "Q4717255", "Q50365540", "Q5665987"]}, "date": "2017-04-26", "url": "http://cnbc.com/2017/04/26/coca-cola-insists-it-made-coke-healthy-by-putting-fiber-in-it.html", "content": "Coca-Cola says a new soda it just released in Japan ended up with some fiber in it--please note that this isn't another crazy recall notice, though. In fact, the fiber was added on purpose to this beverage, which is being marketed as the company's healthiest soft drink yet, and brave soda drinkers can now find it on shelves under the product name Coke Plus. The company gave an earlier warning about Coke Plus back in February. The official press announcement promised a no-calorie soda with \"five grams of indigestible dextrin.\" More from Grub Street: Trump Has a Button He Pushes So a Butler Brings Him a Coke The Absolute Best Soccer Bar in New York <mark>Alex Jones</mark> Is Now Being Sued by Chobani Yogurt It let Coke's Asia-Pacific director of product development--a certain Dr. David Machiels, who came dressed in a white lab coat to help burnish his science credentials--list the purported health pros of drinking fiber. Among them: Consuming one Coke Plus a day (à la a multivitamin) can help \"suppress fat absorption\" and \"moderate the levels of triglycerides in the blood.\" It looks like the company has already started passing samples of fiber Coke out to reporters, so maybe soon somebody will address how putting roughage in soda affects the taste. The odds seem high that it won't improve mouthfeel, though. In 2007, Coke actually introduced a Plus variant in several countries that was fortified with vitamins and minerals (it even carried the same name). Japanese consumers didn't love it, but the reception in America was especially brutal. Problem was, the FDA sent Coke a threatening letter explaining that Plus violated the Federal Food, Drug, and Cosmetic Act--any product with that word on the label must contain at least 10 percent more nutrients than comparable products. Coke felt Plus complied with those regulations, but bottles started disappearing from stores in 2011, anyway. But Coke brags that this newer version is the first-ever Coca-Cola product approved by the Japanese government as a so-called \"food of specified health use,\" an indication it supposedly reserves for products that have \"clearly proven\" health benefits."}, {"articleID": "2013050306_00072071_W", "names": {"Mike Newell": ["Q1933404", "Q30612396", "Q312088"]}, "date": "2013-05-02", "url": "http://kwwl.com/story/22147531/2013/05/02/largest-campaign-in-university-of-iowa-history-announced", "content": "The University Of Iowa Thursday announced the largest fundraising campaign in state history. For Iowa. Forever More: The Campaign for the University of Iowa, will try to raise $1.7 billion in private donations by December of 2016. $1.025 billion of the goal has already been raised. The University formally announced the campaign Thursday afternoon in Iowa City. University of Iowa President, Sally Mason, told supporters, \"The University of Iowa's strengths are precisely aligned with some of the most urgent challenges we face as a global society, and with the additional resources that For Iowa. Forever More. will make available, the UI can develop new ways to bring its creativity and expertise to the world,\" The new campaign has been quietly securing numerous major gifts, including a $32 million donation from Mary and John Pappajohn and $25 million from the Fraternal Order of Eagles. A gift of $14 million is coming from the Roy J. Carver Charitable Trust. Lynette Marshall, President and CEO of the University of Iowa Foundation, notes, \"It is an exciting moment to publicly announce the campaign with this tremendous amount of momentum, which has been built to date through contributions from alumni and friends.\" The University's last comprehensive campaign came in 1999. That campaign, headed by the late <mark>Mike Newell</mark>, raised a record $1 billion between 1999 and 2005. More than 116-thousand individuals made contributions during that 8-year campaign. The new, For Iowa. Forever More, campaign, will be even more aggressive, says Foundation President and CEO, Lynette Marshall. \"Through the public phase of For Iowa. Forever More ., we look forward to connecting thousands more generous donors with tens of thousands of students, countless programs, and numerous life-changing educational discoveries at the University of Iowa,\" Marshall said. meta itemprop = \"datePublished\" content = \"2013-05-02 23:38:40\" > Largest campaign in University of Iowa history underway; $1.7 billion Largest campaign in University of Iowa history underway; $1.7 billion The University Of Iowa Thursday announced the largest fundraising campaign in state history. For Iowa. Forever More: The Campaign for the University of Iowa, will try to raise $1.7 billion in private The University Of Iowa Thursday announced the largest fundraising campaign in state history. meta itemprop = \"datePublished\" content = \"2013-05-02 21:39:50\" > Spring snow creates mess in eastern Iowa Spring snow creates mess in eastern Iowa The calendar might say May, but a wintry mix of weather blanketed eastern Iowa Thursday. The calendar might say May, but a wintry mix of weather blanketed eastern Iowa Thursday. The calendar might say May, but a wintry mix of weather blanketed eastern Iowa Thursday. meta itemprop = \"datePublished\" content = \"2013-05-02 22:19:45\" > Clarksville man killed, 3 injured in Butler County crash Clarksville man killed, 3 injured in Butler County crash A two-car crash Thursday morning killed one Clarksville man and injured three other Clarksville residents. A two-car crash Thursday morning killed one Clarksville man and injured three other Clarksville residents. A two-car crash Thursday morning killed one Clarksville man and injured three other Clarksville residents. meta itemprop = \"datePublished\" content = \"2013-05-02 21:59:05\" > Slick roads, snow today and tonight; rain tomorrow Slick roads, snow today and tonight; rain tomorrow This map shows how much rain is expected through Saturday evening. A wintry mix of rain, freezing rain, sleet and snow has been falling this afternoon across eastern Iowa. A wintry mix of rain, freezing rain, sleet and snow has been falling this afternoon across eastern Iowa. meta itemprop = \"datePublished\" content = \"2013-05-02 18:24:03\" > Waterloo pizza delivery driver robbed Thursday morning Waterloo pizza delivery driver robbed Thursday morning Waterloo police are looking for two men they say robbed a pizza delivery driver early Thursday morning. Waterloo police are looking for two men they say robbed a pizza delivery driver early Thursday morning. Waterloo police are looking for two men they say robbed a pizza delivery driver early Thursday morning. meta itemprop = \"datePublished\" content = \"2013-05-01 21:25:42\" > UPDATE: No changes in 24 hours, gas leak near Monticello forces evacuations The Jones County Sheriff's Office says a gas leak near Monticello has forced the evacuation of homes. The Jones County Sheriff's Office says a gas leak near Monticello has forced the evacuation of homes. meta itemprop = \"datePublished\" content = \"2013-05-02 18:28:36\" > New clues to the cause of migraine headaches New clues to the cause of migraine headaches Genetic research has uncovered new clues to the causes of migraine headaches. Genetic research has uncovered new clues to the causes of migraine headaches. Genetic research has uncovered new clues to the causes of migraine headaches. meta itemprop = \"datePublished\" content = \"2013-05-02 18:23:36\" > Iowa announces new production program, \"Produce Iowa\" Iowa announces new production program, \"Produce Iowa\" The state is opening a new office to support film, television and digital media production in Iowa. The state is opening a new office to support film, television and digital media production in Iowa. The state is opening a new office to support film, television and digital media production in Iowa. Five years since the EF-5 tornado sliced through Parkersburg, the community continues to rebuild both physically and mentally. Five years since the EF-5 tornado sliced through Parkersburg, the community continues to rebuild both physically and mentally. Five years since the EF-5 tornado sliced through Parkersburg, the community continues to rebuild both physically and mentally. meta itemprop = \"datePublished\" content = \"2013-05-02 07:22:15\" > Sport utility vehicle collides with Waterloo police squad car It happened at 1 a.m. at the intersection of Sixth Street and Mulberry Street. Former UD Star Hanus to try out with NFL Vikings Sweet Tooth: Lizzy Mae's Cupcakes & Sweets All content? Copyright 2000 - 2013 WorldNow and KWWL. All Rights Reserved. . Persons with disabilities who need assistance with issues relating to the content of this station's public inspection file should contact Administrative Assistant"}, {"articleID": "2013092220_00041543_W", "names": {"Jason Cameron": ["Q16197895", "Q19956723"], "Ted Williams": ["Q16106506", "Q42321986", "Q978330"], "Peter Koch": ["Q1335073", "Q17325664", "Q18333710", "Q2074254", "Q47120328", "Q56956659", "Q57781793"], "Charles Oakley": ["Q21463411", "Q24005614", "Q608514"], "Eric Olsen": ["Q22279484", "Q3056367", "Q5387212"], "John Martin": ["Q1288067", "Q15493968", "Q15501984", "Q16097202", "Q16105692", "Q16121829", "Q18157597", "Q19564547", "Q19753966", "Q21074715", "Q21463179", "Q23842927", "Q25189274", "Q26462682", "Q26898993", "Q27842993", "Q28147609", "Q28554074", "Q30609439", "Q3156793", "Q3260135", "Q43133925", "Q47541911", "Q50285672", "Q50347129", "Q51291861", "Q51587593", "Q57430285", "Q59242386", "Q6224533", "Q6224538", "Q6225762", "Q6244714", "Q6246935", "Q6246939", "Q6246942", "Q6246945", "Q6246948", "Q6246950", "Q6246958", "Q6246967", "Q6246971", "Q961419"], "James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}, "date": "2013-09-22", "url": "http://www.blogtalkradio.com/dr_robb/2013/09/22/prayer-time", "content": "God exhibits & honors faithfulness. Psalm 100:5 says, \"The Lord is good & His love endures forever; His faithfulness continues through all generations.\" Best of Tavis: DJs, Movies, & Syria Discussing how President Obama likes to quote hip-hop, why classic movie \"National Lampoon's Vacation\" was rated R, and why removing the chemical weapons from Syria won't be quick. A Long Journey on Horseback In an effort to raise awareness about the plight of the rainforest author Lucian Spataro Jr. sets off on a cross-country journey by horseback. Building Your Man Cave DIY expert <mark>Jason Cameron</mark> shares his ideas on building the ultimate man cave that's fit for hosting football parties. The Billion Dollar Video Gamer Discussing Grand Theft Auto V, which pulled in over $800 million in it's first 24 hours on sale. New Movie \"Prisoners\" Reviewed BFCA film critic Marc Eastman reviews \"Prisoners\" and shares some interview clips with the stars. Sports Broadcaster Ann Liguori WFAN's Ann Liguori talks about her interviews with sports legends such as Mickey Mantle, <mark>Ted Williams</mark>, Wilt Chamberlain, Sam Snead, and Billie Jean King. Become Your Own Boss in 12 Months Melinda Emerson discusses the ideas behind her book \"Become Your Own Boss in 12 Months.\" Behind the Scenes of House of Cards Finding out more about the \"House of Cards,\" the show that's up for 13 Emmy Awards, with it's producer Dana Brunetti. The Life of a Young Mom Tara Jefferson, author of \"Make It Happen, The Young Mommy Guide to Creating a Career You Crave,\" shares tips on being a successful young mom. Author Allan Topol Bestselling author Allan Topol discusses his works of international intrigue, including \"The Russian End Game.\" New Rules for Angel Investors Naval Ravikant, founder of AngelList, the SEC's new solicitation rules which go into effect on Monday. Chicago MC Young Myke Chicago's hottest hip hop producer, Young Myke, will be joining us to talk about his new album \"Something to Prove\" as well as the Chicago music scene. Baseball Video Games The makers of \"Out of the Park Baseball 2014\" talk about their new baseball simulation game that's just been released. From the NFL to Hollywood <mark>Peter Koch</mark> discusses his career in the NFL with the Cincinnati Bengals, and his move to Hollywood where he's starred in over 100 movies. Meeting the People Who Inspire You Sean Spence discusses his quest to meet the 60 people in business that he finds most interesting. NHL: Detroit Red Wings Preseason Latest All the latest news, views and gossip as the Detroit Red Wings get ready for the new hockey season. LBGT Roundtable Discussion Members of the LGBT community from all over the US and Canada take a look at human rights issues, news, and some very serious global events. Who's Fault is Homelessness? Today's guests debate homelessness. Who is to blame, what are the consequences for society, and what is being done? This Week's Movie Reviews Taking a look at what's in your cinema this week, with reviews of three new films, \"Prisoners,\" \"Enough Said,\" and \"Thanks for Sharing.\" Rodney Perry Live On his show, Comedian Rodney Perry covers arts and entertainment, everything from comedy and politics to music and acting, with his signature comedic slant. Intel's MashUp Radio MashUp Radio is a 30-minute podcast that discusses the fusion of technology, life, culture and science. Host Peter Biddle, engineer and executive for Intel's Atom Software, dishes up a thought-provoking discussion. Saturday Mornings With Joy Keys Joy Keys provides her listeners with insight to improve their lives mentally, physically, monetarily and emotionally. Past guests on the show have included Meshell Nedegeocello, Blair Underwood, in addition to an impressive list of CEOs, humanitarians and authors. Small Business Unstuck Host Barry Moltz gets small businesses unstuck. He has founded and run small businesses with a great deal of success and failure for more than 15 years. This is a business radio show where he shares all the craziness of small business. It's that craziness that actually makes it exciting, interesting and totally unpredictable. The Bottom Line Sports Show The Bottom Line Sports Show is hosted by former NBA stars Penny Hardaway, <mark>Charles Oakley</mark>, Mateen Cleaves. Tune in to get the inside scoop on what's happening in sports today. Hits Radio Hits Radio covers basketball, sports culture and entertainment with past guests including Jason Kidd, Robin Lundberg and Chris Herren. The Halli Casser-Jayne Show Listeners get an earful on The Halli Casser-Jayne Show, Talk Radio for Fine Minds. Whether it's the current political cocktail or the latest must-read award-winning book, Halli tackles all topics and likes to stir - and sometimes shakes - things up. America's Most Haunted Official Internet radio show of forthcoming epic paranormal investigation book by <mark>Eric Olsen</mark> and \"Haunted Housewife\" Theresa Argie. World Footprints Award-winning World Footprints is a leading voice in socially responsible travel and lifestyle. Hosts Ian & Tonya celebrate culture and heritage and bring a unique voice to the world of travel. Football Reporters Online Football Reporters Online is a group of veteran football experts in the fields of coaching, scouting, talent evaluation, and writing/broadcasting/media placement. Combined, the group brings well over 100 years of expertise in sports. Small Business Roundtable Host <mark>John Martin</mark> interviews the nation's leading entrepreneurs and small biz experts to educate small business owners on how to be successful. Past guests have included Emeril Lagasse and Guy Kawasaki. Movie Geeks United The Movie Geeks share their passion for the art through interviews with the stars of and creative minds behind your favorite flicks and pay tribute to big-screen legends. From <mark>James Cameron</mark> and Francis Ford Coppola to Ellen Burstyn and Robert Duvall, The Geeks have got 'em all. Sylvia Global Sylvia Global presents global conversations pertaining to women, wealth, business, faith and philanthropy. Sylvia has interviewed an eclectic mix from CEOs and musicians to fashion designers and philanthropists including Randolph Duke and Ne-Yo. We were unable to process payment for your premium services. Please update your billing information so that you can continue using your premium services"}, {"articleID": "2019120315_00239025_W", "names": {"Michael Pearce": ["Q16196208", "Q635480"]}, "date": "2019-12-03", "url": "https://www.hellenicshippingnews.com/u-s-dominance-in-global-services-economy-weakens/", "content": "U.S. Dominance in Global Services Economy Weakens in World Economy News 03/12/2019 Over the past half-century, the U.S. has evolved from an industrial superpower into the undisputed champion of the global services economy. From 2003 to 2015, the U.S. trade surplus in services such as medical care, higher education, royalties and payments processing nearly sextupled to $263.3 billion. Growth has since stalled, however. Exports of services barely rose in the first nine months of 2019, while imports increased 5.5%. The services surplus, at $178.5 billion through September, was down 10% from the same period last year, on pace for its steepest annual decline since 2003. Some of the softness in service exports likely reflects cyclical factors, such as a strong dollar or slowing foreign economies. But economists say the decline in the surplus is difficult to pin exclusively on such issues. They point to other forces--some political, others more tectonic--that are weighing on exports while prompting American consumers and firms to buy more foreign services. Much rides on whether this trend continues or reverses. While trade surpluses or deficits aren't intrinsically good or bad, they reflect a country's comparative advantages in the global economy. The U.S.'s prowess in academia, tech, finance and consulting creates millions of jobs, often high-skilled, and effectively helps pay for imports of merchandise such as smartphones, cars and wine. \"It goes to the heart of what the U.S. is really good at,\" said <mark>Michael Pearce</mark>, an economist at Capital Economics. \"These are all areas in which the U.S. is a world leader, and it's also what drives more fundamental, supply-side growth in the economy.\" Western Kentucky University provides a case in point. Between 2011 and 2015, its enrollment of international students more than doubled to above 1,500, each paying up to $40,000 in fees. They helped the school balance its budget while building new dorms, renovating its student union and making other upgrades, even as the state legislature reduced appropriations for the university. But since 2015, international enrollment has fallen by nearly half, squeezed by less-generous foreign-government subsidies, competition from other schools overseas, and a perception abroad that the U.S. has become less safe and welcoming. \"It's always been up, up, up,\" said John Sunnygard, WKU's associate provost for global learning and international affairs. \"We never knew down. We started to see it, and we didn't believe it.\" Services exports may be suffering from rising tensions between the U.S. and its trading partners. \"The instability that's been created in the trade world, in large part by tariff escalation but also just the U.S. approach to trade, has had a negative effect,\" said Christine Bliss, who served as an assistant U.S. trade representative in the Obama administration. The pending trade agreement between the U.S., Mexico and Canada includes strong services provisions, and the Trump administration has pressed for better intellectual-property protection in its negotiations with China. But progress toward large-scale trade agreements in services has been halting. In his policies and rhetoric, President Trump tends to focus on farm products and factory goods, seldom services. The U.S.'s largest export isn't cars or soybeans but travel services: spending by foreign visitors on food, lodging, tuition, health care and other items. These exports were down 0.6% in the first nine months of this year to $160.5 billion. The trade war with China appears to be taking a toll. U.S. immigration officials have ramped up scrutiny of visa applications by Chinese students, tourists and even medical patients seeking treatment in American hospitals. Beijing this year advised its citizens to reconsider visiting or studying in the U.S. due to heightened scrutiny at the border and frequent \"shootings, robberies and thefts\" on American streets. Exports of other services, such as intellectual property and transportation, are also down this year from last. In September, FedEx Corp. reported a drop in revenues and profits, and disclosed plans to retire or idle dozens of cargo planes due to rising trade tensions and a slowdown in the global economy. \"Weakening global trade and industrial production have resulted in less-than-expected demand for our most profitable Express package and freight services,\" Chief Financial Officer Alan Graf said in a conference call. \"Adverse changes in international trade policies and relations would likely drive additional weakness in our business.\" Chinese telecom giant Huawei Technologies Co. has scaled back its purchases of U.S. technology products and services this year, a company official told The Wall Street Journal. It is also developing an operating system that could eventually compete with Google's Android and Apple's iOS, which currently dominate the Chinese smartphone market. Huawei has also begun making smartphones without American chips. Other countries are becoming more competitive in service industries that the U.S. has traditionally dominated. Since 2004, the number of U.S. universities ranked among the world's top 200 has fallen to 46 from 62, according to the QS World University Rankings. China passed the U.S. as the top producer of scientific and technical articles in 2016 and leads the world in applications for patents, trademarks and industrial design. \"We've probably reached a point of diminishing returns,\" said Chris Bakewell, head of the intellectual-property practice at consulting firm Duff & Phelps, of the U.S.'s global tech supremacy. As foreign doctors--many trained at American medical schools--get better at treating cancer and heart disease, health experts say well-heeled citizens of other countries will have less reason to seek care at U.S. hospitals. Meanwhile, more Americans are seeking health care and college abroad to avoid the spiraling costs in the U.S. From 1999 and 2018, U.S. spending on education-related travel rose 379% and health-related travel soared 1,761%, albeit from low bases. After breaking his collarbone in a cycling accident in July, 28-year-old Cale Green, who lacks health insurance, spent days on the phone in Anchorage, Alaska, trying to figure out the cost of surgery. An orthopedic practice quoted him $3,800 plus up to $6,000 for an anesthesiologist; the local hospital offered a base price of $28,000 for drugs and a couple of hours in an operating room. Others who had undergone the procedure told him to expect a final tab between $50,000 and $60,000. Then Mr. Green connected via WhatsApp with a doctor his girlfriend's family knew in La Paz, Mexico, where they owned a condo. His price: $5,800. Two weeks after the accident, Mr. Green was en route to Mexico, where the doctor and a team of nurses operated on his shoulder in a pink-stucco hospital. \"Except for the food that they brought and the people speaking Spanish, everything felt similar...it was the same care,\" Mr. Green said a couple of months later, well on his way to recovery. The surgery also came with a bonus that Mr. Green would be hard-pressed to find in the U.S.: The doctor invited him to a dinner of fresh-caught marlin after his procedure. Source: Dow Jones 2019-12-03 hellenicshippingnews. tweet Share"}, {"articleID": "2020021811_00029348_W", "names": {"Sarah Sanders": ["Q24698460", "Q27986907", "Q30961180", "Q3473414"]}, "date": "2020-02-18", "url": "https://www.theatlantic.com/ideas/archive/2020/02/hes-going-cheat/606643/", "content": "Former senior speechwriter for President Barack Obama Tom Brenner / Reuters Link Copied Democratic primary voters care deeply about electability. What most want is simple: a candidate who can beat President Donald Trump in November. So they worry about whether former Vice President Joe Biden will inspire young people, and about whether Senator Bernie Sanders will scare away old people. They debate whether a political revolution is necessary to energize the base, or whether the revolution will dissuade independents. Will the historic candidacy of a woman or a gay man take off or implode? But these concerns about policy and broad cultural appeal are secondary to the true \"electability\" crisis facing whichever Democrat wins the nomination: He or she will need to run against a president seemingly prepared, and empowered, to lie and cheat his way to reelection. Factually, Trump's position is rather weak. A stronger candidate would be flying higher, given the economic recovery that began (and yielded greater success) under President Barack Obama's watch. While Trump remains an untouchable, vengeful god within the Republican Party and is competitive in crucial battleground states, he is relentlessly divisive. He must win back the suburban voters who handed the House of Representatives to Democrats in 2018--an especially difficult task now that he's released an Achilles' heel of a budget that would cut Medicare, Medicaid, Social Security, food stamps, and a host of other popular programs. But--and this must be said out loud--the facts may not matter. If past is prologue, Trump will say absolutely anything necessary to attract and maintain support, including patent untruths. His pathological lying has been well documented and yet never ceases to stun. By one count, he has told more than 15,000 lies since taking office. A small sampling: After falsely declaring that Hurricane Dorian was headed toward Alabama, he displayed a doctored map to cover his tracks, and his chief of staff made the National Oceanic and Atmospheric Administration release a statement defending his lie. Trump also recently claimed that he rescued health coverage for people with preexisting conditions--even though he has gutted the Affordable Care Act and is suing to overturn it. One day after tweeting, \"We will not be touching your Social Security or Medicare in Fiscal 2021 Budget,\" his budget revealed cuts to both. How can Democrats run against a candidate who will simply deny his unpopular positions and make up nonexistent accomplishments? No amount of fact-checking can counter his constant stream of mendacity, which has become white noise in our political culture. Lying, of course, is only one challenge. The Democratic nominee will also have to contend with cheating. After the 2016 election, the journalist Katy Tur offered an applicable analogy. She said that what made covering Trump as a reporter and running against him as a candidate so difficult was the way that scandals stuck--or didn't stick--to him. Hillary Clinton's use of a private email server as secretary of state was like a stain on her shirt that people couldn't get past, because it was the only mark on an otherwise clean shirt. But Trump had so many stains that \"you couldn't tell if it was a stained shirt or if it was just supposed to be that way.\" The many ways Trump pushes the boundaries of what is acceptable political behavior, breaking norms and maybe even laws along the way to get what he wants, are so varied and numerous as to be blinding. Sometimes his cheating is obvious, the equivalent of the kid in math class who leans over and copies your answers to the test. For example, he was impeached for tying aid to Ukraine to that country's investigation of the Biden family--that is, for trying to hurt his then-likely rival in the 2020 election. He was nonetheless acquitted by a Senate Republican majority. Vindicated, Trump will only get worse. He and the whole Republican Party seem intent on using the power of government to assist in the president's reelection. Republicans senators have already announced that they plan to look into the Biden family's dealings in Ukraine, despite absolutely no evidence that Hunter Biden committed a crime or that the former vice president did anything but carry out U.S. foreign policy. Anyone who thinks these investigations are sincere should note that there is no comparable probe planned into the blatant corruption of sitting president Trump and his children. Trump and members of the White House staff, meanwhile, are violating with impunity the Hatch Act, which prohibits executive-branch employees from using their position to influence an election. The president uses his personal Twitter account both for official business and as an arm of his political campaign; nobody bats an eye. The Office of Special Counsel recommended that senior adviser Kellyanne Conway be booted from federal service because she's violated the Hatch Act so many times. Ivanka Trump, the president's daughter and one of his senior advisers, tweeted a campaign photo, and <mark>Sarah Sanders</mark> tweeted the campaign slogan (while she was still the White House press secretary). This White House believes--correctly, it seems--that it is entirely above the law. These transgressions mark a dramatic departure from the norm. When I worked in the White House, there was a Halloween tradition of decorating the Eisenhower Executive Office Building, where most staff worked, for their trick-or-treating children. In 2016, one of my speechwriting colleagues covered our office door with orange paper and glued on letters cut out of black and white construction paper that read, \"Don't Boo. Vote.\" It was a clever nod to President Obama's oft-quoted line on the campaign trail urging people to make themselves heard at the ballot. However, the ethics lawyers in the White House counsel's office demanded that the decoration be taken down, arguing (incredulously, in our view) that it violated the Hatch Act. Perhaps the most troubling form of cheating is the most diffuse, and therefore the hardest to grasp. Trump's reelection campaign, abetted by right-wing media and companies like Facebook that have absolved themselves of any democratic responsibility, is waging a disinformation war modeled on the efforts of dictators and unprecedented in its scale. As reported by this magazine, the campaign is prepared to spend $1 billion to harness digital media to the president's advantage, including bot attacks, viral conspiracy theories, doctored videos, and microtargeted ads that distort reality. The Trump campaign's efforts are also bolstered by foreign actors. We know, and a bipartisan Senate Intelligence Committee report confirmed, that Russian hackers meddled in the 2016 election, and cybersecurity experts say that we should expect more and worse attacks in 2020. They could be as subtle as social-media accounts that stoke partisan differences or as blunt as software attacks on voter databases. While Special Counsel Robert Mueller did not bring charges of conspiracy with Russia against Trump, he explicitly did not exonerate him. Unbowed, Trump openly repeated the very offense that got him impeached in the first place, inviting--in front of cameras--foreign actors like China to look into the Bidens. At the same time, his campaign is fomenting distrust in the very system he is undermining. Using guerilla tactics, his supporters jammed up the Iowa Democratic Party hotline on caucus night to sow chaos. Then, when the results indeed yielded chaos, Republican trolls, including Don Jr., tweeted out conspiracy theories about a rigged election. Worst of all, congressional Republicans are shamelessly block ing election-security bills, including two that would specifically fight foreign interference in American elections. Should the lying and cheating fail--should the Democrat manage to win the 2020 election--Trump will have one more trick up his sleeve. Before the 2016 election, he suggested that he might not accept a defeat. So who's to say that he will accept one in 2020? You don't have to squint hard to see the clues: He retweeted Jerry Falwell Jr.'s suggestion that he ought to have two years added to his term and \"joked\" about staying in office longer than eight years. If he loses in November, the litigious showman might claim that the election was rigged against him and theatrically contest the results in court. The cumulative effect of Trump's efforts, of all the stains on his shirt, is to disorient the media and the electorate. Democrats, meanwhile, are fighting about how aggressive to get on climate change or whether debt-free college should be means-tested--bless their hearts. These are worthy questions, but not the question of the moment: How they should fight against a president who has no moral or legal compass, and who will use the full might of the executive branch to win? Electability, ultimately, cannot rest on the shoulders of whomever the party nominates, talented though that person may be. Electability does not depend, simply, on the nominee's ability to earn the votes of a wide array of Americans in a few battleground states. It depends on all Americans' willingness to demand an election that is, indeed, free and fair. We want to hear what you think about this article. Submit a letter to the editor or write to letters @ theatlantic.com. Sarada Peri is a writer and communications strategist, and was a senior speechwriter for President Barack Obama. About"}, {"articleID": "2010120211_00119985_W", "names": {"Kate Middleton": ["Q10479", "Q17506155"]}, "date": "2010-12-02", "url": "http://brentwoodweeklynews.co.uk/uk_national_sport/8716082.Prince_William_leads_England_bid/?ref=rss", "content": "prince william leads england bid (from brentwood weekly news) prince william led england's 2018 world cup presentation to fifa on thursday by telling members: \"i love football, we english love football and it would be an honour for us to host the world cup.\" the prince, who was applauded by the 22-man executive committee before the presentation also stressed that england were committed to developing football internationally. the presentation opened with eddie afekafe, a bid ambassador who works with manchester city on their community programmes, explaining how football had changed his life, and william built on that, saying: \"what eddie represents is a credit to fifa because it's your game that transformed his life.\" he added: \"england 2018 and fifa together have the opportunity to create thousands of more opportunities for people like eddie.\" it's a supremely powerful force for binding people together. \"i love football, we english love football - that's why it would be such an honour for us to host the 2018 world cup.\" i also give you an assurance that england is committed to developing football internationally as a member of your football family. \"william also referred to his forthcoming marriage to <mark>kate middleton</mark>, saying:\" we can deliver extraordinary public occasions - i certainly hope as i'm planning quite a big one myself next year. search for hundreds of jobs in essex and beyond dating bring love into your life! find a date in essex homes for sale, and to let, in essex"}, {"articleID": "2012061907_00031277_W", "names": {"Stephen Conroy": ["Q2344980", "Q7608936"], "John Singleton": ["Q363005", "Q6258000"], "Paul Murphy": ["Q15972994", "Q16186391", "Q16228602", "Q16919574", "Q18098677", "Q2061382", "Q333828", "Q616919", "Q7152657", "Q7152658"]}, "date": "2012-06-19", "url": "http://tradingroom.com.au/apps/view_breaking_news_article.ac?page=/data/news_research/published/2012/6/171/catf_120619_170500_0048.html", "content": ", sydney, june 19 aap june 19 2012, 5:05 pm mining billionaire gina rinehart's move on fairfax is being resisted by the company's journalists, but an investment analyst thinks she should be given a chance to prove herself as a media proprietor. industry operators, including former editor-in-chief of the age andrew jaspan, said there is a risk that fairfax may not implement its future of fairfax strategy if ms rinehart, or a private equity firm, launches a takeover bid. ms rinehart has reportedly been refused board seats at fairfax, despite her 18.67 per cent shareholding, because she will not sign up to the company's charter of editorial independence. it is understood the fairfax board continues to refuse ms rinehart any board seats until she agrees to the independence charter but discussions are now at a stalemate. senior fairfax journalists made public on tuesday a letter written to ms rinehart asking that she agree to the charter, which requires that proprietors, shareholders and board members not seek to influence editorial content. the letter has not been answered. while ms rinehart has maintained public silence, she has been criticised by federal treasurer wayne swan and federal communications minister <mark>stephen conroy</mark> for not supporting the charter. senator <mark>conroy</mark> told abc radio that while ms rinehart was entitled to a place on the board, she was not entitled to \"trash the brand\" for all other shareholders. \"if rinehart wants to turn (fairfax newspapers) into the mining gazette, well ms rinehart's entitled to, but the shareholders, the other 80 per cent, the 80 per cent of shareholders who will see the share price fall, need to know that that's what's behind it,\" he said. greg fraser, an analyst with stock research firm fat prophets, said fairfax faced risks from potential industrial action and cost blowouts during its $248 million restructure, but he did not think ms rinehart's ascension to the board would be damaging. \"it is not appropriate for senator <mark>conroy</mark> to be making prognostications that she is going to trash the brand - that's counterintuitive for her to trash something that she's thrown hundreds of millions of dollars at.\" however mr fraser also said it was unrealistic to expect newspaper owners not to seek to influence public debate. \"the past is littered with examples of newspapers using their vehicles to voice their own opinions - i think fairfax is trying to adopt a holier-than-thou attitude,\" he said. mr fraser said ms rinehart's lack of media experience should not disqualify her as current fairfax chairman roger corbett, the former ceo of woolworths, also had no media background. \"you might find that she has a perspective on running the business that could help the productivity,\" he said. advertising millionaire <mark>john singleton</mark>, a friend of ms rinehart's and a former fairfax board member, dismissed the charter of independence on tuesday, calling it \"double-dutch\" and claiming journalists did not understand its purpose in an abc radio interview. media, entertainment and arts alliance spokesman <mark>paul murphy</mark> said ms rinehart should sign the charter of independence. \"anyone who goes onto the fairfax board should be bound by the charter,\" he said. ms rinehart has publicly supported campaigns against the federal government's carbon tax and has criticised climate change science. june 19, 2012 5:17 pm aest portfolio / watchlist track all your assets and manage your investments easily. enewsletter keep up to date with the market subscribe to our"}, {"articleID": "2019100116_00320641_W", "names": {"Dan Bennett": ["Q5213145", "Q5213146"], "William Hill": ["Q16209612", "Q18719475", "Q22667358", "Q39070895", "Q8009538", "Q8012338"]}, "date": "2019-10-01", "url": "https://www.barkinganddagenhampost.co.uk/essex-simon-harmer-collects-cricket-writers-club-award-1-6301055", "content": "Harmer collects cricket writers' club award PUBLISHED: 16:47 01 October 2019 | UPDATED: 16:47 01 October 2019 <mark>Dan Bennett</mark> Simon Harmer of Essex. Picture: Nick Wood/TGS Photo © TGS Photo tgsphoto. co. uk +44 1376 553468 Simon Harmer has this afternoon been named as the winner of the Cricket Writers' Club's County Championship Player of the Year Award for 2019, presented in association with <mark>William Hill</mark>. Share Email this article to a friend To send a link to this page you must be logged in. Harmer, 30, enjoyed a brilliant season, with his spin bowling being a major factor in Essex securing their second Specsavers County Championship Division One title in three years. The South African off-break bowler bagged 83 Division One wickets at an average of 18.29. This even surpassed his tally of 72 wickets collected in 2017 when Essex ended a 25-year search for the County Championship crown. Harmer took five wickets in an innings on ten occasions in 2019. Perhaps his most remarkable match was against Hampshire in June when he claimed 12 wickets for just 61 runs as Essex surged to an emphatic victory inside two days. He also contributed with the bat, making two Championship fifties. Harmer was a key cog in Essex's first domestic T20 success. Captaining the side, it was fitting that he hit the winning runs as the Eagles landed the \"Blast' title with a thrilling last-ball victory over Worcestershire at Edgbaston. He received the County Championship Player of the Year award today at the Cricket Writers' Club's annual lunch, attended by almost 250 guests at the Marriott Grosvenor Square hotel in central London. Harmer said:\" It's been a great last month of the season, and a wonderful season for Essex. \"It's difficult to pick out one particular highlight. Obviously, Blast Finals Day was an extremely exciting occasion and everything fell into place for us at Edgbaston - it was great to win the Vitality Blast for the first time. You may also want to watch:\" Then, down at Somerset in the last and decisive County Championship match of the season, I think we got ourselves into a little bit of trouble trying to play out a draw on that pitch. \"In the end, it was the relief of finally lifting the trophy at the culmination of such a great season that was a real highlight.\" Very many thanks to everyone who voted for me to win this Award. \"Alison Mitchell, chair of the Cricket Writers' Club, said:\" <mark>William Hill</mark> has enjoyed an association with the CWC County Championship Player of the Year Award since its inception, and the club is delighted that we continue to enjoy such support. \"The prestige of the award, and the high regard in which it is held, is demonstrated year on year by the enthusiastic voting among our members.\" Our congratulations go to Simon Harmer for an outstanding season, and one which helped Essex win the coveted County Championship title. \"Rupert Adams, media relations manager for <mark>William Hill</mark>, added:\" Since <mark>William Hill</mark> have supported the CWC County Championship Cricketer of the Year Award, from its inception in 2012, there have been some exceptional winners, including the likes of Jonny Bairstow and Rory Burns. \"Simon's feats at Essex this season ensure that he is another very worthy recipient of the award.\" His fine off-spin bowling has been instrumental in Essex's excellent season, underlined by the number of five-wicket hauls he returned. \"We extend warm congratulations to Simon on his wonderful form this year.\" "}, {"articleID": "2019011306_00065713_W", "names": {"Susan Spencer": ["Q42329380", "Q7648411"]}, "date": "2019-01-13", "url": "https://www.milforddailynews.com/news/20190113/whitinsville-man-files-1m-suit-against-retirement-home", "content": "Whitinsville man files $1M suit against retirement home By <mark>Susan Spencer</mark> Telegram & Gazette Staff Sunday Jan 13, 2019 at 1:00 AM NORTHBRIDGE - A 73-year-old Whitinsville man has sued the owners of Whitinsville Retirement Home for $1 million in U.S. District Court in Worcester, claiming they violated his civil rights by illegally pressuring him to leave the home on the basis of disability and religion, among other actions. The case, brought under the federal Fair Housing Act, state anti-discrimination laws and other laws, raises broader issues of what protections seniors have in private group housing that isn't regulated by health care or elder affairs agencies. Community Legal Aid lawyer Maureen St. Cyr and Ray Mestre from Legal Assistance Corporation of Central Massachusetts filed the lawsuit Dec. 4 on behalf of Joseph Crowley, against Whitinsville Retirement Society Inc., a nonprofit that owns and operates Whitinsville Retirement Home, 10 Chestnut St. St. Cyr said Crowley's goal was to bring the home into compliance with the law, not to litigate. But negotiations over the past year have failed. \"I think the ability to age in place, I think that's an important thing to have. This really is a landlord-tenant relationship,\" St. Cyr said. \"We aren't throwing up roadblocks to full integration in the community. That's why it (the Fair Housing Act) is a powerful civil rights law. That's why we think it's so brave of Mr. Crowley to stand up for those rights.\" A key matter underpinning the lawsuit is what kind of a residence, legally, the retirement home is. Crowley's complaint contends the retirement home \"is simply private rental housing that is subject to state and federal laws that prohibit discrimination in housing based on...disability and religion.\" Shayne Picard, lawyer for the Whitinsville Retirement Society, denied the allegations made in Crowley's complaint, including the claim that the home is private rental housing. While he acknowledged that the retirement home isn't a licensed skilled nursing or rehabilitation facility, or state-certified assisted living residence, \"It's definitely not your standard apartment,\" he said in an interview. Whitinsville Retirement Home, in the circa-1840 John C. Whitin mansion, contains 17 rooms for rent with private bathrooms and common spaces. Residents receive meals together in the dining room, as well as laundry and housekeeping services. An on-site director lives in the mansion. The Whitinsville Retirement Society also owns and operates 24 units of independent-living apartments for the elderly, at 2 Chestnut St., which were built on the shared nine-acre grounds in 1979. The independent apartments are not part of the lawsuit. According to the mission posted on its website, \"The Whitinsville Retirement Home is a Christian residential home for the elderly. Our goal is to create a loving atmosphere in a comfortable, home-like setting and to provide carefree living and companionship in a healthy environment.\" The Whitinsville Retirement Society, which owns and operates the home, was incorporated as a nonprofit organization in 1975, led by members of Fairlawn Christian Reformed Church. Although it is not formally linked to or designated as a religious organization, the purpose spelled out in the 1975 articles of organization shows a close tie: \"To establish, maintain, and operate nonprofit facilities for the housing, sheltering, and care of persons in their retirement years and to give aid, comfort, encouragement and direction to such persons of retirement age at or below cost all in conformity with the doctrines and principles of the Reformed Churches.\" The organization's purpose was amended in April 1979, largely to allow the society to build and operate the separate independent living apartments and to make improvements on the property. Reference to the doctrines and principles of the Reformed Churches was removed. The society's mission is summarized on its IRS Form 990 for the year ending Jan. 31, 2016, the most recent publicly available, as, \"Residence for the elderly.\" According to the complaint, Crowley moved into Whitinsville Retirement Home eight years ago, after suffering a stroke. His partner at that time helped him choose the home because of the assistance offered there. He signed an admission agreement, which included policies such as: \"Applicants must be able to walk unassisted with a cane or walker, dine without assistance, take own medications, practice good personal hygiene including bathing, and contribute positively to the atmosphere of the Home. Applicants must also be able to pay the fee as outlined by the Board of Directors.\" Also in the policies is the statement, regarding mealtimes: \"All residents are expected to be at the table for devotions.\" Admissions involved submitting a medical history completed by a physician, agreeing to submit to periodic medical exams and authorizing medical information and advance planning documents to be released to the home. The home doesn't provide any medical or personal care services, but, according to its website, residents may be \"allowed\" to have outside assistance on a regular, private-pay basis. Other terms of the contract, which Crowley's lawyers claim are illegal, include mandates that residents appoint an outside sponsor to act as their representative in all dealings with the society; keep their unit door unlocked; waive all claims against the society; and participate in religious (Christian) devotions at mealtime. The lawsuit claims, too, that the society operates a listening system located in tenants' rooms or in hallways just outside their doors, which is not disclosed to tenants. In December 2016, approximately six years after moving into a second-floor room at the retirement home, Crowley was hospitalized after suffering a fall. The retirement home representatives initially refused to permit him to return home unless he signed an agreement waiving all personal injury claims against the society; promising to comply with future third-party medical advice; and granting the society the right to determine if or when it becomes in Crowley's best interest to stop residing at the home, the complaint continues. Crowley refused to sign, and was only permitted to return home after \"an upsetting dispute.\" The next month, the society decided that Crowley's mobility had become too limited to remain in his second-floor unit because he could not get downstairs on time for meals. As a condition of continued tenancy, he was forced to move to a smaller unit on the first floor. In October 2017, the society began pressuring Crowley by emails, letters and personal statements to move out of Whitinsville Retirement Home because the society believed he was no longer sufficiently independent. He refused to move out and asked the society to permit him to stay if he hired, at his own expense, private in-home care. The complaint contends that the society \"denied Mr. Crowley's requests for reasonable accommodations.\" The society served Crowley with an eviction notice in December 2017. He retained legal counsel and the action was dismissed last February. Through his lawyers, Crowley made written requests that the society change its illegal discriminatory policies and practices. But instead of doing so, according to the complaint, Crowley was harassed and intimidated by representatives of the society in an effort to force him from his home. On Oct. 25, Crowley's lawyer emailed a letter to the society's lawyer, demanding that the harassment stop immediately. The next day, Oct. 26, the society served Crowley with a no-cause eviction notice. Crowley still lives at the retirement home, with private home health aide service, as the lawsuit is pending. \"What happened here was very paternalistic,\" said Leigh Woodruff, litigation director for Community Legal Aid in Worcester. \"That doesn't exempt them from the civil rights laws.\" The complaint argues that Whitinsville Retirement Society violated the Fair Housing Act by discriminating against Crowley in rental housing by forcing him to move to a different unit; attempting to evict him because of his disabilities; and creating a hostile housing environment. It claims the terms and conditions of tenancy and denial of Crowley's request for a reasonable accommodation, to hire a home health aide, also violated the law. It cites other causes of action, including violations of the state anti-discrimination law; interfering with Crowley's right to quiet enjoyment of his home; interfering with his right of privacy; and negligent supervision of staff or agents. Crowley requested a jury trial, in addition to bringing the site into compliance and assessing monetary damages. The Whitinsville Retirement Society, in its answer to the complaint, also requested a jury trial. Besides denying Crowley's allegations, the defense claims that the society acted in good faith and had reasonable grounds for believing its actions complied with the law. It states that all actions taken by the defendants with respect to Crowley were for legitimate charitable or business reasons. Further, it highlights legal limitations that would bar the claims or limit damages. St. Cyr said that the Fair Housing Act was amended in 1988 because of concerns that people with disabilities were losing their homes. Lawsuits have been filed nationwide alleging that senior housing providers are illegally forcing residents with disabilities out, a growing concern for an aging population, she said. Locally, senior care professionals voiced concern about private communal residences that fall outside the regulatory purview that assisted living, nursing homes and adult foster care have. \"I think there's a problem with it because there is no oversight,\" said Robert Dwyer, executive director of Central Massachusetts Agency on Aging. Northbridge Council on Aging Director Kelly Bols said she hasn't seen much demand for that type of congregate housing. \"It's limited in what it can offer. There is some supervision, but not a heck of a lot.\" Michelle Edelstein, Sutton Council on Aging director, questioned the level of training for staff in such senior residences and whether tenants' rights were clearly displayed. She said these issues need to be worked out soon as baby boomers are now reaching their 70s and older people want to remain in the community. \"When you think of all the older folks starting up now in age - housing is big,\" she said. Never miss a story Choose the plan that's right for you. Digital access or digital and print delivery."}]