[{"articleID": "2014042521_00022211_W", "names": {"Robert Owens": ["Q3436023", "Q40499677"], "Zsa Zsa": ["Q509446", "Q52585329"], "Storm Queen": ["Q12337388", "Q15131554"]}, "date": "2014-04-25", "url": "http://www.npr.org/blogs/metropolis/2014/04/25/306770987/metropolis-4-19-14?ft=1&f=1039", "content": "hide caption Factory Floor appears on this week's show. Factory Floor appears on this week's show. Porter Robinson, \"Sea Of Voices (Rac Mix)\" (Astralwerks) Gui Boratto, \"Beautiful Life (Sascha Funke Remix)\" (Kompakt) London Grammar, \"Hey Now (Arty Remix)\" (Columbia) Tensnake, \"First Song\" (Astralwerks) Little Dragon, \"Paris\" (Loma Vista/Republic) Blood Orange, \"Uncle Ace (Kindness Remix Featuring <mark>Robert Owens</mark>)\" (Domino) Blamma Blamma, \"<mark>Zsa Zsa</mark> Feat Kristina Train (Andy Cato Remix)\" (Eskimo) Jagwar Ma, \"Uncertainty (Ewan Pearson Remix)\" (Mom & Pop) Blackbird Blackbird, \"There Is Nowhere (Phages Remix)\" (Lavish Habits) Odesza, \"Sun Models (Feat Madelyn Grant)\" (Souncloud.Com / Odesza) Rufus Du Sol, \"Desert Night\" (Sweat It Out!) John Tejada, \"Farther And Fainter\" (Plug Research) Factory Floor, \"How You Say (Daniel Avery Remix)\" (Dfa) Plastic Plates, \"Sweat\" (Plastic Plates) Static Revenger, \"Colors At The Night Feat Kay (Deep Mix)\" (D-Dub) <mark>Storm Queen</mark>, \"Look Right Through (MK Dub Iii)\" (Defected) Flight Facilities, \"I Didn't Believe\" (Future Classic) Maceo Plex, \"Love Somebody Else\" (Visionquest) Maceo Plex, \"Conjure Balearia\" (Crosstown Rebels) Pink Floyd Vs. Prydz, \"Proper Education\" (Ministry Of Sound) Flume, \"The Greatest View (Feat Isabella Manfredi)\" (Mom & Pop) Sign In / Register Please keep your community civil. All comments must follow the"}, {"articleID": "2015101519_00130110_W", "names": {"Stephen King": ["Q25183273", "Q27983592", "Q2832846", "Q39829", "Q7609688", "Q7609689", "Q7609690"], "James Patterson": ["Q311671", "Q6141039", "Q6141040"], "Mark Dawson": ["Q27973746", "Q6767303", "Q6767304"]}, "date": "2015-10-15", "url": "http://mindentimes.ca/a-tough-way-to-earn-a-buck?id=870", "content": "A tough way to earn a buck By Jim Poling Sr.. New book releases are tumbling into book shops, book sites and libraries this fall almost as fast as the falling autumn leaves. As many as 20,000 to 25,000 new titles could be released in the United States during this fall's book season. The flurry of new books is so great that it is difficult to decide on a list of books you might want to read, let alone an individual book. The sheer numbers leave an impression among some people that authors who write them are taking in major dollars. Not exactly. The big names like <mark>Stephen King</mark>, Nora Roberts and <mark>James Patterson</mark> continue to pull in millions of dollars but the lesser lights are seeing diminishing incomes. The Authors Guild in the U.S. surveyed more than 1,400 full - and part-time writers this year and found that more than one-half of respondents earned less than $11,670 a year. That figure just happened to be the U.S. federal poverty level in 2014. \"No one likes to see the word\" poverty level' on a survey that has anything to do with people you know, \"says Roxana Robinson, Authors Guild president.\" You used to be able to make an absolutely living wage as a writer. You wrote essays and you published them in journals. You wrote magazine pieces and you got paid very well for those. And you wrote books and you got good advances. So being a writer, it didn't usually mean you would be rich, but it had meant in the past that you could support yourself. \"The Guild survey reported that the average income of a full-time writer has dropped to $17,500 a year, down from $25,000 in 2009. For the average part-time author the figure was $4,500 a year, down from $7,250 in 2009. The numbers for authors who win major book awards also are shocking. The Man Booker prize in the United Kingdom released its short list of nominees for the prize last month. Two of the Man Booker finalists each have sold only 15,000 to 20,000 hardcovers each of their books. One other finalist has sold 3,600 copies in the U.S., another only 3,000. Those numbers mean meagre money for authors who spend countless hours researching and writing these books. At least getting into the finals does provide more. The Man Booker winner gets $75,000 Canadian, while the runners-up get roughly $3,800 Canadian. Canadian writers' book earnings in most cases are small. However, they also receive small payments from the Public Lending Right based on how many libraries are carrying their books. The more of your books in the library, the higher the payment. Also, Access Copyright pays writers money from a fund collected from institutions that use writers' copyrighted work. The federal government passed a new copyright act not long ago which screwed writers out of an important source of income. Schools and other educational institutions, and even some government departments, now say they don't have to pay into the copyright fund for using writer's works anyway they wish. E-books have created new earnings opportunities for writers. More and more writers are self publishing digital books. There have been success stories. British author <mark>Mark Dawson</mark> is pulling down six figures a year from his series about an assassin published through the Amazon Kindle program. Self publishing through a digital platform is a simple way to get a book out. But the majority of those books go nowhere because moving the books to make some money is all up to the author. Hundreds of thousands of books are self-published and getting one noticed in that ocean of publishing is difficult no matter how good the book. The writer has to become an entrepreneur, which means weekends at flea markets, fairs and days and nights speaking to book clubs and any other groups willing to listen. Promoting, marketing and selling the book leaves little time for more writing. I mention all this because Haliburton County has a sizeable population of writers. They work hard with varying degrees of success and we hope they will continue and someday we'll see some county names on those lists of awards and bestsellers."}, {"articleID": "2017110804_00377390_W", "names": {"Imtiaz Ali": ["Q16224409", "Q3149575", "Q51735857", "Q6008453"], "Anil Sharma": ["Q4764669", "Q55192662", "Q58332017"]}, "date": "2017-11-08", "url": "http://www.bollywoodlife.com/news-gossip/gadar-ek-prem-katha-team-sunny-deol-and-anil-sharma-to-return-with-kavach-read-all-the-details-here/#disqus_thread", "content": "Last week, there were reports about Shahid Kapoor and <mark>Imtiaz Ali</mark> reuniting for a film, after a gap of 10 years. Now, another popular actor-director duo is coming up with their next film--Sunny Deol and <mark>Anil Sharma</mark>. Reveals a source, \"Sunny and <mark>Anil</mark> have always shared a great working relationship. <mark>Anil</mark> had this script and approached Deol, who immediately agreed to be part of the film. It's titled Kavach.\" This will be their fifth film together. Their first film Gadar: Ek Prem Katha, which released in 2001, is considered one of Indian cinema's biggest hits. Sunny and <mark>Anil</mark> collaborated on three other films thereon--The Hero (2002), Apne (2007), and Singh Saab The Great (2013). They are coming together after almost five years now. Also read: Dimple Kapadia is the reason Hema Malini spoke to Sunny Deol for the first time? Our source adds, \"<mark>Sharma</mark> will start this film right after his next. They will begin filming for Kavach sometime next year and the film is expected to release in the last quarter of 2018 or January 2019, depending on their schedule.\" <mark>Anil</mark> doesn't want to divulge any details about the project at the moment. He says, \"I am busy finishing Genius which is my son Utkarsh's debut film. I don't want to talk about any other film right now.\" "}, {"articleID": "2011062020_00079859_W", "names": {"John O'Donnell": ["Q21462779", "Q22007217", "Q59560536", "Q6250835", "Q6250837", "Q6250838", "Q6250842"], "Michael Noonan": ["Q1390688", "Q16733451", "Q6833088", "Q6833090"]}, "date": "2011-06-20", "url": "http://us.rd.yahoo.com/finance/external/reuters/SIG=13u47u04s/*http%3A//www.reuters.com/article/2011/06/20/eurozone-esm-status-idUSLDE75J20D20110620?feedType=RSS&feedName=bondsNews&rpc=43", "content": "* policymakers adjust structure of permanent bailout fund * no \"preferred status' for existing bailout recipients * decision should be positive for ireland, greece, portugal (adds details, changes byline) <mark>john o'donnell</mark> luxembourg, june 20 (reuters) - the euro zone's permanent bailout fund will not have preferred creditor status if it lends to greece, ireland or portugal, but would be paid back first in other cases, euro zone finance ministers decided on monday. the european stability mechanism (esm) will come into effect in june 2013, replacing the temporary european financial stability facility that was set up last year. it will have an effective lending capacity of 500 billion euros ($710 billion). the initial agreement between euro zone countries was that all esm loans, which will be provided to highly indebted governments in exchange for reforms, would enjoy preferred creditor status, junior only to the international monetary fund. efsf loans are on equal footing with private creditors. that would have meant that esm loans would have to be paid back before private bondholders were--a prospect that investors have said would discourage private creditors from buying the bonds of those countries already forced to seek bailouts. however, finance ministers agreed on a compromise to ease market concerns. esm loans to the three greece, ireland and portugal will not get preferential treatment. at the same time, any euro zone member states that need emergency financial assistance from the esm in the future would not benefit from the same exemption--the esm and imf would still have to be repaid first.\" it (the esm) will not have preferred creditor status as regards countries that are already in a support programme...it will make it easier for them to come back to the market, \"the chairman of euro zone finance ministers, jean-claude juncker, told a news conference. irish finance minister <mark>michael noonan</mark> welcomed the compromise, saying it would help dublin return to the market.\" we hope to complete our programme and get back into the markets in 2012 or 2013. but those that would be lending to us...they would be cautious that we might have to go for a second programme under the esm and the very prospect of it would stop them lending to us, because of the fact that they would be taking a bigger risk and the esm would have the preferred status, \"<mark>noonan</mark> told reporters.\" the esm will have the same status as a creditor as anybody who lends to ireland. that makes it easier for us to get back into the market, \"<mark>noonan</mark> said.\" there should be people prepared to lend to us who won't be inhibited by incurring the greater risk from the esm as originally drafted, \"he said. the decision to remove the preferred creditor status of the esm for greece, portugal and ireland may ease the private sector's concerns about rolling over greek debt, a key sticking point of an expected second bailout package for athens. if private creditors know they have the same status as the esm when it comes to being repaid, then they are more likely to remain invested in greece, portugal and ireland, particularly if they are asked to retain long-term exposure. (reporting by we welcome comments that advance the story through relevant opinion, anecdotes, links and data. if you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. views expressed in the comments do not represent those of reuters. for more information on our comment policy, see thomson reuters is the world's largest international multimedia news agency, providing investing news, world news, business news, technology news, headline news, small business news, news alerts, personal finance, stock market, and mutual funds information available on reuters.com, video, mobile, and interactive television platforms. thomson reuters journalists are subject to an editorial handbook which requires fair presentation and disclosure of relevant interests."}, {"articleID": "2018080712_00061688_W", "names": {"Giuseppe Conte": ["Q3770348", "Q46756395", "Q53844829"], "Giuseppe Amato": ["Q3769954", "Q56682291", "Q58868222"]}, "date": "2018-08-07", "url": "http://www.thewesternstar.com/news/regional/italian-premier-visits-victims-of-fiery-crash-near-bologna-231858/", "content": "Italian premier visits victims of fiery crash near Bologna The Canadian Press Published: 1 hour ago Updated: 6 minutes ago MILAN--Italy's premier visited victims of the fiery crash of a tanker truck carrying highly flammable gas near Bologna, saying Tuesday that it was important to understand what happened to prevent future tragedies. The truck's driver was the only person killed. \"I am here today to demonstrate the closeness of the government to the people who are suffering, but also to understand why so that these things are not repeated,\" said <mark>Giuseppe Conte</mark>, who plans to travel later to the scene of another deadly crash in southern Italy. Prosecutors have opened an investigation into the Bologna accident, triggered when the tanker truck carrying liquefied petroleum gas, or LPG, rammed into a truck stuck in a line of traffic. The tanker immediately caught fire, and then exploded a short time later across eight lanes, collapsing part of the raised highway. Police video shows that by the time of the explosion, most vehicles had been evacuated from the highway. Highway police said only the tanker driver died in the crash, revising earlier reports by the carabinieri that there were two dead. Dozens of people were injured, many with burns or cuts from flying glass when windows of buildings nearby were shattered in the blast. The victim was identified as 41-year-old Andrea Anziolin of the northern city of Vicenza. \"Maybe it was a moment of distraction, or a wave of sleepiness,\" Bologna prosecutor <mark>Giuseppe Amato</mark> told RAI radio. \"But it is too early to say with certainty.\" <mark>Conte</mark> will later travel to the southern region of Puglia, where a van packed with immigrant farmworkers overturned after colliding with a truck carrying tomatoes in the southern Puglia region, killing 12. It was the second such fatal accident in the area in the space of three days. ___ Simone Somekh contributed to this report from Rome. Colleen Barry, The Associated Press More regional stories"}, {"articleID": "2015072303_00146037_W", "names": {"Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"], "Larry King": ["Q213430", "Q51724798", "Q6490623", "Q6490625"], "Kevin Williamson": ["Q16191505", "Q16566420", "Q360642"], "Benny Lau": ["Q4914559", "Q8992299"], "Steve Grossman": ["Q2033191", "Q7612724"], "Dan Gordon": ["Q3696450", "Q5213590", "Q5213591", "Q5213593"]}, "date": "2015-07-23", "url": "http://stljewishlight.com/news/world/article_b9ccc6a4-ac6d-52b7-9b99-748f75083052.html", "content": "http: //www.jta.org The Global Jewish News Source Tue, 21 Jul 2015 17:38:36 +0000 en-US hourly 1 http: //wordpress.org/? v=4.1.1 http: //www.jta.org/2015/07/21/news-opinion/world/european-maccabi-games-to-play-at-olympic-venues-built-by-nazis http: //www.jta.org/2015/07/21/news-opinion/world/european-maccabi-games-to-play-at-olympic-venues-built-by-nazis #comments Tue, 21 Jul 2015 17:33:47 +0000 http: //www.jta.org/? p=1033429 The quadrennial Jewish sports event for the first time is coming to Germany, site of the ’36 Olympics that banned some Jews from competing .]]> Adolf Hitler, second from left, watching the Olympic Games in Berlin with the Italian crown prince, left, August 1936. (Fox Photos/Getty Images) BERLIN (JTA)--They are roaring through Europe, raising dust as they go: Jewish bikers bearing an Olympic-style torch all the way from Israel to this German city. Next week, 11 core riders will pull their steel steeds into Berlin's famous outdoor amphitheater, the Waldbuehne, to help usher in the 14th European Maccabi Games--the first ever in Germany--at a venue built by the Nazis for the 1936 Olympics. Other competitions will be held at the Olympic Stadium here, where Hitler presided over the opening of the games that year. The riders are following in the treads of the Maccabiah Riders, who rode through Europe in the early 1930s to promote the games then being held under British mandate in Palestine. The July 28 opening ceremony, which will feature remarks by German President Joachim Gauck and a concert featuring Matisyahu, Dana International and others, will usher in 10 days of sports, parties, a Limmud Germany learning event and more. Some 2,300 Jewish athletes from 36 countries will take part, cheered on by fans bused in from across the country by the Central Council of Jews in Germany. And the sports venues, including Berlin's Olympiastadion, will be open to all, free of charge and under heavy security. Elen Katz and Catherine Lurie-Alt participating in a motorcycle rally from Israel to Berlin for the opening of the European Maccabi Games. (Yosef Alony) Athletes will compete in 19 sports, as well as a few exhibition games pitting Jewish athletes against German soccer and basketball stars. On July 31, they will try to break the Guinness World Record for the largest kiddush ever. The European Maccabi Games grew out of the Maccabi movement, which traces back more than a century to Turkey when Jews, then shut out of local sporting clubs, founded the Israel Gymnastic Club in 1895. Jews elsewhere followed suit. The first European Maccabi Games were held in Prague in 1929, and the second a year later in Antwerp. But with the rise of the Nazis, Jewish sports associations were banned. Germany's Makkabi Club was reinstated only 50 years ago. In 1969, the quadrennial competition resumed, alternating every two years with the Maccabiah Games in Israel. Bringing the European Maccabi Games to Germany was a herculean feat, says Alon Meyer, head of Makkabi Germany. \"People told me they never could imagine setting foot in Germany because their parents and grandparents were sent away from there,\" said Meyer, 41, a Frankfurt businessman whose father fled Nazi Germany for Palestine. \"Now these people are coming back to see the changes [and take part in] the biggest Jewish event ever held on European ground.\" The Berlin Olympiastadion was built for the 1936 Olympic Games. (<mark>Scott</mark> Heavey/Getty Images) The change to which Meyer referred is the dramatic growth in Germany's Jewish population. Only a few thousand of Germany's prewar Jewish population of 500,000 remained in Germany after the Holocaust. Today there are some 240,000 Jews here, most of them immigrants from the former Soviet Union. Membership in Jewish sports clubs has grown, too. Meyer wanted the competition to be held in the Olympic Stadium, those same stone halls where many Jewish athletes, though not all, were banned in 1936. \"They came all the way to Germany and in the morning they got a call, they were not allowed to run. They found out right before the race,\" said Steven Stoller, 64, of New Jersey, a distant cousin of the late Jewish-American sprinter Sam Stoller, who was told he could not compete by Avery Brundage, then president of the U.S. Olympic Committee. \"I wanted to come to Berlin for my children, my future grandchildren, to have the story live on,\" Stoller said. Jed Margolis, the executive director of Maccabi USA, will fly in from Philadelphia to cheer some 200 participating American athletes aged 15 to 85. \"At one point in life I would say,\" I will never go to Germany or buy a German product, \"' Margolis said.\" Yet there is a vibrant and growing Jewish community there. We want to support them and at the same time teach our next generation \"about what happened there. Security will be tight for the event, in the stadium and beyond. Berlin announced the creation of a new digital reporting system for anti-Semitic incidents just in time for the games.\" Security is the No. 1 priority, \"said Lena van Hooven, spokeswoman for the games. But Danny Maron is not worried. He and the other Jewish bikers have been traveling through Eastern Europe with Israeli flags attached to their bikes.\" We have no fear at all, \"Maron said.\" We are very proud. \"Maron's father, Yoram, a Holocaust survivor, told JTA that he wanted\" to show the whole world that after all the death, we are still alive, and we keep moving. \"At each stop, from Athens to Romania to Krakow, more Jewish bikers have woven into the pack. The Maccabi torch itself rides in a specially built case carried by Greek biker Kobi Samuel, 48.\" Two of our riders are descendants of actual Maccabi riders of the 1930s, nine are descendants of Holocaust survivors, and two of our bikers are actual survivors aged 73 and 78, \"said filmmaker Catherine Lurie-Alt, who snagged Jewish talk show host <mark>Larry King</mark> as the narrator for her documentary about the motorcycle rally.\" This is where it all started, \"Lurie-Alt said.\" We are going through communities where Jewish populations were decimated, on our way to Berlin, where they will enter that stadium with jubilation and joy. \"]]> http: //www.jta.org/2015/07/21/news-opinion/world/european-maccabi-games-to-play-at-olympic-venues-built-by-nazis/feed 0 http: //www.jta.org/2015/07/21/news-opinion/politics/dermer-makes-civil-rights-appeal-to-black-dems-and-other-iran-deal-politics http: //www.jta.org/2015/07/21/news-opinion/politics/dermer-makes-civil-rights-appeal-to-black-dems-and-other-iran-deal-politics #comments Tue, 21 Jul 2015 17:24:49 +0000 http: //www.jta.org/? p=1033749 Jeb Bush and <mark>Scott Walker</mark> debate how quickly to bomb Iran and a Democrat tries to use the Iran deal to unseat a Republican Senator .]]> Rep. Charlie Rangel, seen in New York on April 8, 2015, said he had a long talk with Israel's U.S. ambassador last week. (Andrew Burton/Getty Images) It's too early for blow-by-blow coverage of federal election campaigns, right? Maybe not, with the fight for the Iran deal getting very, very, very political. Republican presidential candidates Jeb Bush and <mark>Scott Walker</mark> are tussling, the Weekly Standard reported, over whether contemplating a strike on Iran in the first week of one's presidency is wise. (Bush thinks it isn't .) Rep. Tammy Duckworth, D-Ill ., is using Sen. Mark Kirk's criticism of the Iran deal in an ad for her bid to unseat the Illinois Republican. At least one Democrat isn't worried that her support of the deal makes her vulnerable. Ron Dermer, Israel's ambassador to Washington, has been lobbying the Congressional Black Caucus to oppose the Iran deal, Foreign Policy reported. He's been persistent, and welcomed, but less than successful.\" Is that the Republican guy from Florida? \"Rep. Charles Rangel, D-N.Y., reportedly chortled when asked if he had met with Dermer.\" We had a long talk. \"Rangel added that during his meeting with Dermer, the ambassador made references to Jewish support for the civil rights movement in the 1960s--a history Rangel didn't see as relevant.\" They certainly have the \"we were together in 1961' story,\" said Rangel. \"It's not germane to this.\" ]]> http: //www.jta.org/2015/07/21/news-opinion/politics/dermer-makes-civil-rights-appeal-to-black-dems-and-other-iran-deal-politics/feed 0 http: //www.jta.org/2015/07/21/news-opinion/united-states/jewish-run-childrens-charity-in-n-y-accused-of-fraud http: //www.jta.org/2015/07/21/news-opinion/united-states/jewish-run-childrens-charity-in-n-y-accused-of-fraud #comments Tue, 21 Jul 2015 17:21:50 +0000 http: //www.jta.org/? p=1034035 The National Children's Leukemia Foundation, founded and run by a Brooklyn Jewish man from his basement, reportedly collected $9.7 million from 2009 to 2013 and paid out $57,451 in assistance to patients .]]> (JTA)--New York state is suing to shut down a charity for children with leukemia run by a Brooklyn Jewish man accused of raising money fraudulently. A petition filed in state Supreme Court in Brooklyn on Monday requested the closing of The National Children's Leukemia Foundation, which was founded by Zvi Shor and run from his basement. The foundation collected $9.7 million from 2009 to 2013, The New York Times reported, citing court documents. Some 80 percent of the money went to telemarketing and direct-mail fundraising campaigns, and only $57,451 was paid out in \"direct cash assistance to leukemia patients,\" the Times report said. The state's attorney general is asking for the recovery of the money. The foundation's website has been taken down and its phone number disconnected, according to the Times. Shor was president of the foundation until his resignation in 2010 following revelations that he had been convicted of bank fraud in 1999. The foundation's accountant, Yehuda Gutwein, took over as president, though Shor continued to run things, according to the court filings. Shor established the foundation in 1991 after losing a son to leukemia, the court filing said, according to the Times. He paid himself $595,000 in salary and $600,000 in deferred compensation from 2009 to 2013, and a lifetime pension of more than $100,000 a year. The foundation fraudulently claimed to have a bone marrow registry and cancer research building in Israel. It also promoted a Make a Dream Come True program, arranging trips to places like Disney World for children with cancer, which apparently did not take place, investigators said in court filings. According to the petition, the foundation also transferred $655,000 to an Israeli research organization .]]> http: //www.jta.org/2015/07/21/news-opinion/united-states/jewish-run-childrens-charity-in-n-y-accused-of-fraud/feed 0 http: //www.jta.org/2015/07/21/news-opinion/politics/national-review-calls-bernie-sanders-a-national-socialist http: //www.jta.org/2015/07/21/news-opinion/politics/national-review-calls-bernie-sanders-a-national-socialist #comments Tue, 21 Jul 2015 16:11:45 +0000 http: //www.jta.org/? p=1033751 The right-wing magazine's <mark>Kevin Williamson</mark> acknowledged that describing a Jew whose father's family perished in the Holocaust as a Nazi has its problems, but found he had no choice .]]> Sen. Bernie Sanders speaks to the crowd at the Phoenix Convention Center, July 18, 2015 in Phoenix, Arizona. (Charlie Leight/Getty Images) Democratic presidential candidate Bernie Sanders has never been shy about calling himself a socialist, a term that most other American pols, however liberal their stripe, take pains to abjure. National Review's <mark>Kevin Williamson</mark> has been tracking Sanders' campaign for the nomination, and he said in an article Monday that \"socialism\" should be modified by \"national.\" Yes, that national socialism. \"L’Internationale, my patootie. This is national socialism,\" he said. Trying very hard to get from Ben & Jerry's Ice Cream to Hitler's Beer Hall Putsch, <mark>Williamson</mark> cited Sanders' Made-in-the-USA jobs rhetoric, although he never quite explained how this arrives at race ideology, never mind genocide. <mark>Williamson</mark> acknowledged that describing a Jew whose father's family perished in the Holocaust as a Nazi has its problems, but found he had no choice, saying: \"He is, in fact, leading a national-socialist movement, which is a queasy and uncomfortable thing to write about a man who is the son of Jewish immigrants from Poland and whose family was murdered in the Holocaust. But there is no other way to characterize his views and his politics.\" There's not a lot else of Sanders in the lengthy piece. There is a lot of what <mark>Williamson</mark> does not like, including Des Moines, Iowa, Nirvana and declarative sentences. \"Here in a dreary, rundown, hideous little corner of Des Moines dotted with dodgy-looking bars and dilapidated groceries advertising their willingness to accept EBT payments sits Drake University, where Bernie is speaking at Sheslow Auditorium, a kind of mock church--spire, stained glass, double staircase leading down to the podium for communion--that is the perfect setting for the mock-religious fervor that the senator brings to the stump. He is a clumsy speaker, pronouncing\" oligarchy'--a word he uses in every speech--as though he were starting to say \"à la mode.\" He's one of those rhetorical oafs whose only dynamic modulations are sudden shifts in volume--he's the oratorical equivalent of every Nirvana song ever written--and he is undisciplined, speaking for an hour and then pressing right through, on and on, feeling the need to check off every progressive box, as though new orbiters in the Bernieverse might think him a Rick Santorum--level pro-lifer if he didn't lay his pro-choice credentials out on the table at least once during every speech, \"he said. Should Sanders take offense? Perhaps not. On Twitter, New Republic senior editor Jeet Heer delved into how National Review treated national socialism and its discontents in the distant past. 1. Since National Review saw fit to call Bernie Sanders a Nazi, let's take a trip down memory lane .--Jeet Heer (@ HeerJeet) July 21, 2015]]> http: //www.jta.org/2015/07/21/news-opinion/politics/national-review-calls-bernie-sanders-a-national-socialist/feed 0 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/rivlin-to-host-rabbis-in-unity-building-study-session http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/rivlin-to-host-rabbis-in-unity-building-study-session #comments Tue, 21 Jul 2015 15:17:23 +0000 http: //www.jta.org/? p=1033877 The Orthodox representative changed after the original participant backed out .]]> JERUSALEM (JTA)--Israeli President Reuven Rivlin will host a study session with rabbis from various streams of Judaism in a unity-building effort. Thursday's event in Jerusalem will mark the upcoming fast of the Ninth of Av. The Orthodox representative who originally had agreed to participate backed out, Haaretz reported. Rabbi Uri Sherki told Haaretz he would not attend for\" technical reasons. \"A day earlier, however, Sherki told the same newspaper that he was under pressure from some in the Orthodox community to cancel his appearance. He also was quoted on an Orthodox website as calling Reform Jews\" heretics, \"Haaretz reported. Rabbi <mark>Benny Lau</mark>, the cousin of Rabbi David Lau, the Ashkenazi chief rabbi of Israel, agreed to appear in Sherki's place. Several incidents in recent weeks have caused tension among the Jewish streams and the government.\" At this important time, the Office of the President, together with the Jewish People Policy Institute, has initiated an event to bring together the communities of the Jewish people in an atmosphere of mutual respect, and of learning and studying, to discuss the importance of Jewish unity and the need to work together to build understanding and respect, \"said a statement from the President's Office announcing the event. The timing of the event, according to the statement, comes during\" the Three Weeks, and indeed the Nine Days, and nearing the Ninth of Av, during which time we commemorate the destruction of the Temple and Jerusalem, among other terrible calamities which have befallen the Jewish people. Tragedies linked throughout Jewish tradition with the erosion of Jewish unity and respect for our fellow man. \"]]> http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/rivlin-to-host-rabbis-in-unity-building-study-session/feed 0 http: //www.jta.org/2015/07/21/news-opinion/united-states/timeline-to-a-deal-irans-nuclear-push-has-been-decades-in-the-making http: //www.jta.org/2015/07/21/news-opinion/united-states/timeline-to-a-deal-irans-nuclear-push-has-been-decades-in-the-making #comments Tue, 21 Jul 2015 14:52:50 +0000 http: //www.jta.org/? p=1033389 There were two tracks to a nuclear deal with Iran: The Islamic Republic's race to a weapon and efforts by Israel and the United States to stop a weapon through sanctions .]]> A view of the reactor at the Russian-built Bushehr nuclear power plant in southern Iran as the first fuel is loaded, Aug. 21, 2010. (IIPA via Getty Images) WASHINGTON (JTA)--The road to the Iran nuclear deal did not start in November 2013, when the major powers and Iran launched formal talks. It did not begin in 2010, when the U.S. Congress passed the far-reaching Iran sanctions and the U.N. Security Council approved its own set of sanctions. Rather, the road to the deal secured last week, which will limit Iran's uranium enrichment in exchange for the lifting of international sanctions, began decades earlier. Here are some highlights on the way to the deal that now faces Congress's yea or nay. Mid-1950s to late 1970s With U.S. backing, the shah of Iran develops nuclear technology as an alternative energy source. Toward the end of his reign, Mohammad Reza Shah Pahlavi begins to look into nuclear weapons capacity. It is not clear whether it is with the knowledge or support of the United States. 1979 A revolution overthrows the shah in January and Ayatollah Ruhollah Khomeini returns to Iran the following month--a week after promising to preserve the rights of Iranian Jews. His aides tell JTA that they may renew ties with Israel. But in May, the new regime executes Habib Elkanian, a former leader of the Jewish community, prompting calls from U.S. Jews for the imposition of sanctions on the regime. On Nov. 4, Iranian students, with the regime's blessing, take hostage 52 Americans employed by the U.S. Embassy, and 10 days later, President Jimmy Carter freezes $12 billion in Iranian U.S. assets--the first U.S. sanctions imposed on the regime. Nearly half of the blocked assets are in the overseas branches of U.S. banks. 1980s Iran restarts its civilian nuclear program in 1984 and Iranian officials meet in 1987 with A.Q. Khan, the father of the Pakistani nuclear bomb, to discuss weaponizing their program. Meanwhile, Israel sells Hawk missiles to Iran in the mid-1980s at the behest of the United States as part of a complicated arms-for-hostages deal that culminates in a scandal for the administration of President Ronald Reagan. 1990 to 1992 Israel confirms importing oil from Iran in 1990, despite the regime's declared hatred of the Jewish state. By 1992, just-elected Prime Minister Yitzhak Rabin, who had authorized the sale of arms to Iran when he was defense minister, is concerned about intelligence that Iran is considering a nuclear weapon. Israel's political parties, left to right, share concern at the prospect of a nuclear Iran and the government launches an effort to persuade other countries to isolate Iran. Rabin, during meetings with American Jewish leaders, urges them to leave Israeli-Arab relations to the Israelis but asks them to take on Iran. 1994 to 2000 The 1994 bombing of the AMIA Jewish community center in Buenos Aires, Argentina, kills 85 and spurs calls to isolate Iran. (The Iran-backed terrorist group Hezbollah is suspected in the terror attack .) In 1995, Russia signs a deal with Iran to develop a civil use nuclear reactor at Bushehr, in southern Iran. The American Israel Public Affairs Committee, working closely with the office of then-Sen. Alfonse D’Amato, R-N.Y., begins drafting legislation in 1994 targeting third parties dealing with Iran. <mark>Steve Grossman</mark>, then the president of AIPAC and a friend of President Bill Clinton and first lady Hillary Clinton, spends a cool evening on a White House balcony after a dinner party in the spring of 1995 smoking cigars and attempting to persuade the president to use his executive powers to impose sanctions. In May 1995, Clinton issues an executive order banning investment in Iran, and in 1995 and 1996, Congress passes and Clinton signs into law the Iran Libya Sanctions Act, which targets foreign entities doing business with Iran's energy sector. Soon, however, Clinton is faced with tough European opposition to the sanctions. He is also encouraged by the election of a relatively moderate Iranian president, Mohammed Khatami. Clinton begins to waive some sanctions, disappointing some in the pro-Israel community. 2001 to 2008 President George W. Bush sustains Clinton's delicate engagement with the Khatami government, especially after the United States invades Afghanistan following the Sept. 11, 2001, terrorist attacks. (The U.S. and Iran have a shared enemy in al-Qaida .) However, Bush includes Iran in his\" axis of evil \"State of the Union speech in 2002 alongside Iraq and North Korea. Later in 2002, the Mujahedeen Khalq Iranian dissident group reveals that Iran is enriching uranium in Natanz and building a heavy water reactor in Arak. Bush, however, is preoccupied with plans to invade Iraq and does not devote much attention to Iran. The Khatami government, rattled by the initial success of the 2003 Iraq invasion, makes overtures to the international community to discuss placing limits on its nuclear activities in exchange for greater engagement. Bush does not want to directly negotiate with Iran until it ceases uranium enrichment, but he does consult closely with three European nations, Britain, France and Germany--the E3--that enter into talks with Iran. The talks are buried with the election in 2005 of a hard-line Iranian president, Mahmoud Ahmadinejad. The Bush administration leads the passage in the U.N. Security Council of resolutions targeting Iran's nuclear sector and arms sales, as well as Iranian individuals. Under Bush, the U.S. Office of Foreign Assets Control builds an architecture of sanctions that includes persuading third parties not only to end dealings with Iran's energy sector, but with its financial sector as well. In a February 2006 meeting with Jewish leaders, Condoleezza Rice, the U.S. secretary of state, for the first time intimates that the United States would contemplate a military strike to keep Iran from going nuclear. However, two years later, in 2008, Israeli Prime Minister Ehud Olmert fails to get the go-ahead from Bush he believes he needs to launch an Israeli strike. 2009 to 2015 Newly elected President Barack Obama in March 2009 offers Iran's people and leaders a message for Nowruz, the Iranian New Year, saying\" greater opportunities for partnership and commerce \"are available but they\" cannot be reached through terror or arms, but rather through peaceful actions that demonstrate the true greatness of the Iranian people and civilization. \"In April 2009, the United States joins talks between Iran and five other major powers: Britain, France, Russia, China and Germany. But Ahmadinejad is reelected in June of that year, and in September, Obama joins other world leaders in revealing the existence of a second uranium enrichment plant embedded deep in a mountain in Fordow, near the holy city of Qom. The Qom revelations accelerate legislation in Congress that would toughen Iran sanctions, dropping the threshold for banned investment in the energy sector from $20 million to $1 million in some cases and expanding bans to Iran's financial sector. The legislation passes in 2010. Meanwhile, the same year, Obama's team leads the passage in the U.N. Security Council of expanded sanctions that target Iran's energy and financial sectors and restrict arms sales to the country. In subsequent years, the intelligence agencies of Israel and the United States disrupt Iran's enrichment capacity through a computer virus, Stuxnet, and a number of Iranian nuclear scientists are assassinated, reportedly at Israel's behest. In September 2012, Israeli Prime Minister Benjamin Netanyahu, in a dramatic (and much mocked) United Nations speech, illustrates with a cartoon bomb diagram Israel's version of the\" red line \"that cannot be crossed: Enough uranium enriched at 20 percent, a step before weaponization at 90 percent, to power a bomb. Netanyahu predicts that Iran could arrive at the red line within a year. In June 2013, Iranians elect a relative moderate president, Hassan Rouhani. Just prior to the election and anticipating such an outcome, the United States begins secret negotiations with Iran to set up talks toward sanctions relief in exchange for nuclear restrictions. In November of that year, they arrive at a formula and announce a deal that ends Iran's enrichment of uranium beyond civilian levels. In January 2014, the major powers and Iran launch talks aimed at an agreement, and an increasingly wary Netanyahu mounts an effort to oppose what he sees as a dangerous deal, culminating in his March 2015 speech to Congress, organized with Republicans and without the knowledge of the White House. In April of this year, the sides reach the outline of an agreement in Lausanne, Switzerland. In May, Congress passes a law that will allow it to disapprove of a deal within a two-month period. On July 14, after multiple extensions of a June 30 deadline, Iran and the six world powers arrive at a comprehensive agreement. Two days later, 172 Republican co-sponsors in the U.S. House of Representatives introduce a resolution of disapproval .]]> http: //www.jta.org/2015/07/21/news-opinion/united-states/timeline-to-a-deal-irans-nuclear-push-has-been-decades-in-the-making/feed 0 http: //www.jta.org/2015/07/21/news-opinion/world/british-jewish-group-condemns-criticism-of-queen-over-nazi-salute http: //www.jta.org/2015/07/21/news-opinion/world/british-jewish-group-condemns-criticism-of-queen-over-nazi-salute #comments Tue, 21 Jul 2015 13:50:19 +0000 http: //www.jta.org/? p=1033819\" It's really important for us not to judge this event with hindsight, \"the president of the Board of Deputies of British Jews said .]]> (JTA)--A major British organization condemned criticism of Queen Elizabeth II in the wake of the release of a video showing her giving a Nazi salute at the age of 7. The president of the Board of Deputies of British Jews, Jonathan Arkush, on Sunday praised the royal family for its close relationship with the Jewish community.\" I don't think any criticism of a 7-year-old child would be remotely appropriate and I don't intend to make any, \"Arkush said at a meeting of the board, the Jewish Chronicle reported over the weekend, following the publication of the video on the website of The Sun and on the tabloid's front page.\" It's really important for us not to judge this event with hindsight. Obviously the Nazi salute now carries horrible memories and bitterness for us, but I do not think for one moment that it would be appropriate for me to suggest that the full horror of Nazi Germany was known at that point. \"Buckingham Palace reportedly has ordered an investigation into the publication of the images, including how The Sun obtained the footage. In the video, the young princess and her sister Margaret, 3, are shown dancing and smiling as the future British <mark>king</mark>, Edward VIII, instructs his nieces how to perform the Nazi Heil Hitler salute. Some historians have accused Edward of being sympathetic to Adolf Hitler's regime; Edward abdicated the throne in 1936 to marry divorcee Wallis Simpson. Queen Elizabeth, 89, is widely popular in Britain and it is not believed that the images will damage her reputation, according to reports. Last month, the queen met with survivors and liberators in a visit to Bergen-Belsen, her first to a Nazi concentration camp .]]> http: //www.jta.org/2015/07/21/news-opinion/world/british-jewish-group-condemns-criticism-of-queen-over-nazi-salute/feed 0 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/eu-foreign-ministers-call-on-israel-to-halt-settlements-and-transfers http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/eu-foreign-ministers-call-on-israel-to-halt-settlements-and-transfers #comments Tue, 21 Jul 2015 13:10:03 +0000 http: //www.jta.org/? p=1033799 The ministers also called for the creation of an international support group to help move along the peace process .]]> JERUSALEM (JTA)--The foreign ministers of the European Union called on Israel to halt settlements and policies including\" forced transfer. \"Their statement on the Middle East peace process was released Monday at the end of a monthly European Union Council meeting in Brussels. It reiterates\" strong opposition to Israel's settlement policy and actions taken in this context, such as building the separation barrier beyond the 1967 line, demolitions and confiscation--including of EU funded projects--evictions, forced transfers including of Bedouins, illegal outposts, settler violence and restrictions of movement and access. \"More specifically, the statement\" calls on Israeli authorities to halt plans for forced transfer of population and demolition of Palestinian housing and infrastructure in the Sussiya and Abu Nwar communities. \"Israel's Foreign Ministry took umbrage at the use of the term\" transfer, \"but said it would raise the issue directly with the European Union, Haaretz reported. Sussiya is located near Hebron, and is next to an Israeli settlement by the same name. It is in Area C of the West Bank, which is solely under Israeli control. Israel plans by the end of the month to demolish the homes in Sussiya--home to about 340 Palestinians--that were built without permission, and relocate the residents to an area controlled by the Palestinian Authority. EU representatives visited the village last month. Abu Nwar is an illegally built Bedouin community. Israel plans to move its residents to a planned community in the country's south. The 28 EU ministers called for\" an increased common international effort \"in order to secure\" a just and lasting peace. \"The statement asks for the creation of an international support group to help move along the peace process, for which the ministers state that there is\" no alternative to a negotiated two-state solution. \"The statement also calls for an easing of restrictions on Palestinians in the West Bank and for a full opening of Gaza border crossings with Israel. It also\" urges all Palestinian factions to find common ground, based on non-violence and reconciliation, and to work together to address the needs of the Palestinian population. \"]]> http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/eu-foreign-ministers-call-on-israel-to-halt-settlements-and-transfers/feed 0 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/knesset-lawmakers-approve-law-against-rock-throwers http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/knesset-lawmakers-approve-law-against-rock-throwers #comments Tue, 21 Jul 2015 11:55:18 +0000 http: //www.jta.org/? p=1033793 Rock throwers can now be sentenced to up to 20 years in jail if it is proven that they intended to cause injury .]]> JERUSALEM (JTA)--Israeli lawmakers voted to impose longer jail terms on people caught throwing rocks at civilian cars and roads. The Knesset passed the bill on its second and third readings on Monday night by a vote of 69 to 17. Under the new law, rock throwers can be sentenced to up to 20 years in jail if it is proven that they intended to cause injury, and 10 years if harmful intent is not proven. Also, a prison sentence of five years can be levied for throwing a rock at a police officer or police car.\" Today justice has been done, \"said Justice Minister Ayelet Shaked of the Jewish Home party after the vote.\" For years terrorists have been evading punishment and responsibility. The tolerance shown to terrorists ends today. A stone thrower is a terrorist, and only a proper punishment can be a deterrent. \"The law does not cover the West Bank, which is under Israeli military law, and where Palestinians frequently throw rocks at Israeli civilian cars. The Arab Joint List party in a statement called the new law a form of\" collective punishment \"and said it was meant to\" oppress the Palestinians' civilian and popular struggle. \"At least three Israelis, including a baby, have been killed in the West Bank after rocks were thrown at the cars they were riding in, and others have been seriously injured. Earlier this month, a Palestinian teen was shot in the back and killed after throwing a rock at an army vehicle. Col. Yisrael Shomer said he felt threatened by the teen in the July 3 incident near the West Bank city of Ramallah, but a surveillance camera showed that the teen was shot as he ran away. The vehicle's windshield was shattered in the attack .]]> http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/knesset-lawmakers-approve-law-against-rock-throwers/feed 0 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/pilot-louis-lenart-called-the-man-who-saved-tel-aviv-dies-at-94-2 http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/pilot-louis-lenart-called-the-man-who-saved-tel-aviv-dies-at-94-2 #comments Tue, 21 Jul 2015 10:56:47 +0000 http: //www.jta.org/? p=1033774 Lenart led an air attack with four airplanes on the Egyptian advance columns during Israel's War of Independence, causing them to retreat .]]> (JTA)--Louis (Lou) Lenart, an American fighter pilot hailed as\" The Man Who Saved Tel Aviv \"during the opening days of Israel's War of Independence, has died. Lenart died Monday at his home in Raanana, Israel, of heart and kidney failure. He was 94. His funeral will be held Wednesday at the Kefar Nachman Cemetery in Raanana. High-ranking officers of the U.S. Marine Corps and Israeli Air Force are expected to attend, according to Lenart's wife, Rachel Nir. Lenart was born Layos Lenovitz, the son of Jewish farmers, in a small Hungarian village near the Czech border. To escape the prevalent anti-Semitism, the family moved to the United States when Lenart was 10. His parents settled in the Pennsylvania coal-mining town of Wilkes-Barre, where he was the target of anti-Jewish taunts. At 17, Lenart enlisted in the U.S. Marines and after 18 months of infantry training talked his way into a flight school, where he was almost given up for dead after a midair collision during training. Lenart saw action in the Battle for Okinawa and other Pacific engagements. Discharged at war's end with the rank of captain, he learned that 14 relatives in Hungary had been killed in Auschwitz. It took little additional incentive for the ex-Marine to join the clandestine effort to smuggle war surplus planes into the nascent State of Israel in early 1948. When Israel declared its independence on May 14, 1948, the Israeli Air Force consisted of four bastardized Czech versions of the German Messerschmitt. On May 29 of that year, large Egyptian forces had advanced to within 16 miles of Tel Aviv and Israel decided to gamble its entire air force in an attack on the Egyptian advance columns. As the most experienced pilot, Lenart led the attack, backed by Ezer Weizman, later president of Israel, as one of the other three pilots. The stunned Egyptian troops, who had been assured that the Israelis had no aircraft, stopped their advance and retreated. Subsequent news reports hailed Lenart as\" The Man Who Saved Tel Aviv. \"After the war, Lenart participated in the airlift of Iraqi Jews to Israel, was a pilot for El Al Airlines and produced six feature films, including\" Iron Eagle \"and\" Iron Eagle II. \"One of his collaborators was Hollywood screenwriter <mark>Dan Gordon</mark>, who emphasized that the headline was no exaggeration.\" In many ways, Lou was what Lafayette and Nathan Hale were to the American Revolution, \"<mark>Gordon</mark> said.\" If it hadn't been for Lou and his three comrades, Tel Avivians would be speaking Arabic today. \"Michael Oren, Israel's former ambassador the United States and now a Knesset member, described his friend some years ago as\" a loving father, loyal friend, champion of Israel. Lou Lenart is an inspiration not only for Jews, but for all people who have suffered oppression and have had to struggle for their liberty and defense. \"Along with his wife, Lenart is survived by a daughter, Michal, and a grandson .]]> http: //www.jta.org/2015/07/21/news-opinion/israel-middle-east/pilot-louis-lenart-called-the-man-who-saved-tel-aviv-dies-at-94-2/feed 0 This entry passed through the Full-Text RSS service - if this is your content and you're reading it on someone else's site, please read the FAQ at fivefilters.org/content-only/faq.php #publishers."}, {"articleID": "2017101321_00792680_W", "names": {"Chris Smith": ["Q11963798", "Q16235029", "Q1626495", "Q18158024", "Q18210302", "Q18631755", "Q18641613", "Q21066572", "Q22954127", "Q27861882", "Q27957276", "Q2964864", "Q30907275", "Q333264", "Q39089696", "Q41247400", "Q43137589", "Q47117548", "Q5108087", "Q5108088", "Q5108090", "Q5108094", "Q5108095", "Q5108096", "Q5108097", "Q5108098", "Q5108099", "Q5108100", "Q5108101", "Q5108102", "Q5108103", "Q5108104", "Q5108105", "Q5108106", "Q56134418", "Q56254566", "Q57684371", "Q981167"], "John Hamilton": ["Q16195098", "Q19816311", "Q25183942", "Q28955335", "Q29642873", "Q43910681", "Q46648449", "Q5786239"]}, "date": "2017-10-13", "url": "http://www.wnewsj.com/news/53059/bls-parent-local-leaders-not-doing-their-job-reinbolt-lynch-father-aggressive-disruptive-banned-from-school-grounds", "content": "BLANCHESTER--A former Blanchester High School student's father spoke before village council Thursday night over concerns he has with both the police department and with Blanchester Local Schools as well as employees of each. Tom Pollitt, of Pleasant Plain, accused Police Chief Scott Reinbolt and Blanchester Schools Superintendent Dean Lynch of \"not doing their job\" in regards to an incident involving his daughter (a minor), who attended Blanchester High School, and another student who allegedly assaulted her at school. According to him, on Sept. 21 his daughter was shoved into the lockers by another student. The alleged assault, resulting in the girl getting a black eye and swelling, was the result of issues going on with several students both in-person and across social media channels in the days leading up to the incident. Pollitt and his wife expressed concerns to Blanchester High School Assistant Principal Pandy McCarty. They said that, due to an accident last year in which their daughter was struck by a car in Loveland, causing brain damage, they feared the alleged assault would make things worse for their daughter. This resulted in legal action against the alleged offending student being pursued through Clinton County and a restraining order being filed against the suspect, through Clermont County. Pollitt alleges that the school didn't comply with the order. He said he discussed the issue with Superintendent Dean Lynch and Blanchester High school Principal <mark>Chris Smith</mark> about it. \"They said they don't have to comply, they can't comply with it,\" said Pollitt. Lynch called this claim \"unsubstantiated\" --that they received a restraining order against the student that was put in place on Sept. 26 but expired on Oct. 2. \"We did a number of things to support the restraining order,\" said Lynch. According to Lynch, the student withdrew from the school on Oct. 4. Lynch also submitted a no trespassing letter to Pollitt for his behavior at the high school on Sept. 21 including disobeying a school official's (McCarty) request to the point where she felt the need to call police. Reinbolt told the News Journal Friday, \"On or about Sept. 28 I received a copy of a letter sent to Mr. Pollitt by the School Superintendent informing him that due to his angry and disruptive behavior at the high school, he was no longer permitted to be there without permission of the building principal. I briefed officers on this and made inquiries as to the circumstances that led to it. Officers informed me that Mr. Pollitt had been angry, rude and aggressive with school officials.\" Pollitt said he then went to the Blanchester Police Department, where he spoke with an officer who, according to Pollitt, said, \"I'm not going to pick her up and drive two-and-half hours and take her because she violated this thing.\" After an alleged second restraining order violation, Pollitt spoke with Reinbolt where the two then had a \"rough conversation\" according to Pollitt. This included Reinbolt allegedly telling him that they didn't have to comply with the order and that if he called the police department again, \"They were going to have problems.\" He also allegedly said that if Pollitt \"didn't like it\" then he should \"get a lawyer and sue us.\" Reinbolt told the News Journal Friday, \"Mr. Pollitt and/or his wife called the police department repeatedly in the week following the assault. Each of those conversations were not documented, but generally involved the Pollitts making demands for seizure of evidence, immediate arrests of students and school officials without evidence of criminal conduct, and immediate arrest of the perpetrator of the assault. Each call was answered by a patrol officer who attempted to explain the process of criminal investigation, prosecution and how the court system operates. These phone calls were so frequent that it was distracting officers from other duties. According to the officers involved, they could not get the Pollitts to understand that the case was proceeding and appropriate action would be taken at the close of the investigation.\" According to the police report, the BPD forwarded its entire report (more than 20 pages) on the incident to the Clinton County Juvenile Prosecutor on Oct. 2 for \"consideration of charges\" against the alleged perpetrator of the assault. Reinbolt said, \"Mr. Pollitt told me the officers here were not doing their job and repeated this allegation without ever giving specifics. I finally interrupted him and asked for specifics, and he provided none, but continued alleging that the officers weren't doing their jobs. I finally asked him to give me one sentence in which he outlined what he was seeking from me. He stated he wanted a restraining order from the Clermont County Courts enforced.\" \"I asked what the order provided, and he said it required the alleged perpetrator in his daughter's case to remain 500 feet away from his daughter. I told him that, since the children attend the same school, it would seem difficult for anyone to enforce such an order. I told him I had not seen the order. He said he brought it to the police station the night before and showed it to an officer, who refused to do anything to enforce it ....I asked him to mail me a copy of the order so I could review it, and he seemed shocked that I would ask such a thing. I explained that we cannot enforce every court order, as some provide for police intervention and others do not...\"Reinbolt added,\" I told him that he and his wife needed to stop repeatedly calling the police station day after day as we have other matters that also require our attention. I told him if they didn't cease the repetitive calls that I would take action to prevent that from occurring further. \"Council member Don Gephart on Thursday night suggested that Pollitt attend the next Blanchester School Board meeting on Monday and bring his concerns to them. The council later met in executive session with Mayor <mark>John</mark> Carman and Village Solicitor Andrew T. McCoy to discuss the situation. Carman said the council did not come to a decision and that Pollitt would have to report his complaints to the Mayor's Office. Carman indicated he felt he should've asked Pollitt to stop commenting at Thursday's meeting as he was making accusations about a city official which was against the public comment guidelines. Reinbolt told the News Journal Friday he was\" disappointed that Village Council last night operated contrary to its own rules regarding complaints about Village employees. The Council has consistently, for the past five years or more, refused to permit complaints about individual employees during open council meetings. They have insisted that the proper channel for such complaints are to the employee's immediate supervisor, not in an open council session. I'm a bit befuddled as to why that rule was apparently disregarded last night...\"http: //www.wnewsj.com/wp-content/uploads/sites/22/2017/10/web1_Blan-sign-cr-1.jpg Reinbolt, Lynch: Father' aggressive',\" disruptive', banned By <mark>John Hamilton</mark> and Tom Barr News Journal RECOMMENDED FOR YOU 5:30 pm | Village of Sabina employees donate sick-leave time to co-worker 5:02 pm | Two men receive prison terms for property crimes in Clinton County 9:35 pm | Clinton County's foster care levels keep on rising Load comments (0)"}, {"articleID": "2009031123_00002657_W", "names": {"Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2009-03-11", "url": "http://vueweekly.com/article.php?id=11316", "content": "music backlash blues: extrasensory perception and value roland @ vueweekly.com some asshole broke a window at the hydeaway, the fledgling licensed all-ages venue connected to the old econolodge and the jekyll and hyde. instead of incurring the irritatingly high costs of replacing said glass, the venue's superheroic promoter cecil frena decided to fix this problem through a different kind of transparency. after receiving numerous offers from local musicians, a fundraiser was developed and the result was more than enough income to get a new window as well as subsidize the cost of the quarterly edmonton music cd newsletter that frena ships to college radio for our benefit. but i figured as much. i suppose it's a good thing that i'm a psychic. clairvoyant, voodoo man, gyspy, whatever you want to call me, i was ahead of three developments during this sunday night marathon. enduring a rotating gallery of guitar acts, i was a little disappointed by the singularity of edmonton's burgeoning talent. my brief generation of synth-tempered acts has been replaced by a lo-fi personal dynamic, a rockist reaction to the commercialization and oversaturation of electro-house in recent years. it seems that approaching a genuine synth aesthetic based on european traditions and abstract melodicism would somehow betray the workmanlike dirt city rock ethos. that isn't to say the music that was played wasn't worthwhile. taking in an eamon mcgrath set at 5:30 pm may seem beside the point, but it was an interesting view on a passionate performer. known for his hedonism and devil-may-care attitude, seeing mcgrath rock out on an empty floor for a seated audience where he was playing (possibly) without alcohol while nursing a tender voice was a special moment of revelation. as blurry as his rep is, you have to consider his focus on stage as undeniable. there's a certain mystique about him that instantly creates interest, regardless of his reputation. the fact that he was playing this event reminded me of sean nicholas savage's brilliant anthem in his name, \"eamon,\" a song that lampoons his (alleged) drug-addled stage frenzy (\"doin' shows on ecstasy!\" ) and maudlin lyricism (\"he's so unhappy!\" ). after i spent much of the night singing that song's praises, sans aides (nee peter sagar) randomly brought his posse on stage for a completely unrelated chorus line take on that local favourite. maybe that one was pretty obvious. but during sagar's creative set incorporating live looping of drums and atmospheric guitar textures, i remarked on a similarity to the approach of animal collective...immediately before he launched into a cover of \"ponytail\" by ac member panda bear. perceptive? sure. psychic? possibly. after a hilarious romp through christmas traditions and drunk-dialing etiquette from the multi-talented doug hoyer and an emotionally stirring performance from jim cuming, we were treated to a rollicking blues set from michael rault. beyond the obvious retro touchstones and \"old soul\" rhapsodizing people typically afford him, rault actually reminded me a lot of <mark>michael jackson</mark>. r & b roots, methodical, measured delivery, complete control of tone and pitch and a knack for melodies that only seem to sound good with his voice, he fits an atypical profile in my head. it also doesn't hurt that he's a complete natural on stage. the first song played after his set was \"black and white\" by <mark>michael jackson</mark>. i thought this was really weird. i guess as long as he doesn't dye his skin black and get a taste for faberge eggs, he should be safe."}, {"articleID": "2011073007_00040235_W", "names": {"Charo Soriano": ["Q18022255", "Q5765150"]}, "date": "2011-07-30", "url": "http://tempo.com.ph/2011/v-league-ateneo-vs-maynilad/", "content": "sports? v-league: ateneo vs maynilad v-league: ateneo vs maynilad posted by no comment games sunday (the arena, san juan) 2 p.m. - ssc vs air force 4 p.m. - maynilad vs ateneo first conference champion ateneo and san sebastian battle separate new rivals sunday when season 8 of the shakey's vleague open conference blasts off at the arena in san juan. ateneo faces commercial team maynilad at 4 p.m. before san sebastian collides with the air force at the 2 p.m. curtain-raiser. the lady eagles, who beat adamson to claim their fi rst-ever crown early this year, will parade with guest player leal patnongon and mainstays gretchen ho, alyssa valdez and jem ferrer. parley tupaz, a former national beach volleyball player, will take over the reins from <mark>charo soriano</mark> as ateneo's coach when the squad hopes to extend its crown. maynilad, meanwhile, will have joy cases and charise ancheta at the frontline along with margarita pepito, syvie artates and beverly boto. roger gorayeb, a veteran coach for san sebastian, said the depth of the newcomers' lineup cannot be taken lightly. \"iba maglaro ang mga yan, malalim ang experience,\" said gorayeb, who initially eyes nothing but survival for his team in the fi rst stage of the tournament. composed mostly of sophomore tossers, san sebastian will start as underdog against air force, which has 2009 second conference most valuable player aiza maizo, 2006 mvp cherry rose macatangay and standout jen manzano. \"malusutan lang itong eliminations, dito lang muna kami nakafocus. saka na namin iisipin yung chances namin sa title,\" gorayeb said. the seven squads will play a single round elimination format with the top six advancing into the single-round quarterfi nals."}, {"articleID": "2018122104_00138451_W", "names": {"Daniel Meyer": ["Q5218149", "Q57313557"]}, "date": "2018-12-21", "url": "http://wivb.com/news/local-news/former-operators-of-emerald-south-to-sue-mark-poloncarz-for-defamation/1669891624", "content": "Former operators of Emerald South to sue Mark Poloncarz for defamation Former operators of Emerald South to sue Mark Poloncarz for defamation By: Posted: Dec 20, 2018 10:54 PM EST Updated: Dec 20, 2018 10:54 PM EST BUFFALO, N.Y. (WIVB) - The former operators of Emerald South nursing home are planning to sue Erie County Executive Mark Poloncarz for statements he made during a news conference and on social media back in August. During the August 23 news conference, Poloncarz called on the State Department of Health to force another company to take over running the troubled nursing home after two patients died and claims surfaced about an administrator sexually molesting a patient. \"This is very serious, if I had the power to shut it down I would. Force the sale of Emerald South from its current deadbeat downstate owners who neither care about the patients and residents nor the employees at this facility,\" said Poloncarz at the August news conference. That same day, Poloncarz took to Twitter, saying, \"The Emerald South Nursing Facility is a danger to its residents, employees and now the public. The New York State Department of Health must immediately put the facility into receivership and force the sale of it from the downstate, deadbeat owners.\" Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Tweet from Mark Poloncarz on August 23 Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Tweet from Mark Poloncarz on August 23 The comments made by Poloncarz in the news conference and on social media are now landing the county executive in a potential legal battle. Benjamin and Judy Landa, the former operators of Emerald South, recently filed a notice of claim against Poloncarz. They are planning to sue him for false and defamatory statements about them and their business. They say his comments were deliberately reckless and negligent and claim he hurt their reputation, income and caused humiliation and emotional distress. If the notice of claim turns into a lawsuit, it could cost Erie County taxpayers a lot of money. \"Potential litigation against Erie County is serious because it could cost us a significant amount of money. Taxpayers are footing the bill either way,\" said Erie County Comptroller Stefan Mychajiliw. Erie County Legislator Joe Lorigo says taxpayers should not have to pay for a lawsuit if the Twitter account Poloncarz used is a personal account. In a tweet last month, Poloncarz said his Twitter page is a personal page. Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Tweet from Mark Poloncarz November 28 Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Tweet from Mark Poloncarz November 28 \"Why are Erie County taxpayers expected to defend the county executive for statements he made on his personal Twitter account, he should be covering the cost of his own defense,\" said Lorigo. Legal Analyst Barry Covert told News 4 it's unlikely this notice of claim will materialize into a lawsuit. According to Covert, the county executive's statements are protected under the first amendment. He's also protected by stating facts supported by other information. Covert also says, as a public official, Poloncarz has limited qualified immunity. \"If you are making statements that are in furtherance of your office, you can't be sued for liable or slander just because those comments can somehow injure somebody. It's a very high standard to overcome,\" said Covert, News 4 legal analyst and criminal defense attorney for Lipsitz, Green, Scime, Cambria. The Erie County Executive's Office responded to the notice of claim in a statement: \"While we will not comment on the factual or legal aspects of the pending litigation, the county stands ready to fully defend against this frivolous lawsuit. Additionally, County Executive Poloncarz and the Department of Senior Services are extremely pleased to see that action has been taken by New York State to resolve the serious issues that have plagued EmeraldSouth Rehabilitation and Care Center.\" - <mark>Daniel Meyer</mark>, Deputy Press Secretary, Erie County Executive's Office News 4 reached out to the attorneys for the Landa's, but they did not return our phone calls."}]