[{"articleID": "2019091620_00173836_W", "names": {"Jim Barber": ["Q6129350", "Q6193534"]}, "date": "2019-09-16", "url": "https://pittsburgh.cbslocal.com/2019/09/16/ups-hiring-for-the-holidays-770-workers-needed-in-new-stanton/", "content": "Filed Under: Jobs, Local News, Local TV, Seasonal Jobs, UPS, Work PITTSBURGH (KDKA)--UPS is hiring for the holidays. More than 770 people are needed in the New Stanton area. They will be among the 100,000 seasonal workers UPS will be hiring across the country this holiday season. \"We expect another record peak season this year, with daily package deliveries nearly doubling compared to our average of 20 million per day,\" said <mark>Jim Barber</mark>, chief operating officer in a press release. \"In order to make that happen, once again we're recruiting more than 100,000 people for some of the country's best seasonal jobs .\" The local positions are a combination of seasonal and permanent jobs, including: • 400 package handlers"}, {"articleID": "2017082005_00545126_W", "names": {"Mark Hughes": ["Q1494363", "Q214513", "Q21516094", "Q3294110", "Q33676880", "Q39073279", "Q58235929", "Q6768131", "Q6768132", "Q6768133", "Q6768134", "Q6768135", "Q6768136", "Q6768137"]}, "date": "2017-08-20", "url": "http://scmp.com/sport/soccer/article/2107506/arsenal-dont-get-fair-share-penalties-claims-arsene-wenger-after-stoke", "content": "South China Morning Post Print Email Now Reading \"Arsenal don't get fair share of penalties,' claims Arsene Wenger after Stoke condemn Gunners to first defeat of the season Arsenal don't get fair share of penalties, claims Arsene Wenger after Stoke condemn Gunners to first defeat of the season Gunners boss reacts furiously to two failed penalty appeals PUBLISHED: Sunday, 20 August, 2017, 1:00 pm UPDATED: Sunday, 20 August, 2017, 1:00 pm Everton shrug off crowd trouble in European win over Hajduk Split 18 Aug 2017 Arsene Wenger believes his side does not receive its fair share of penalty decisions, a view he claimed was demonstrated in their 1-0 Premier League defeat at Stoke City. The Arsenal manager was left beaten by an early second half goal from Stoke's new Spanish forward Jese, signed on loan this week from PSG and whose training had been curtailed by his new-born son requiring a medical procedure. But, while accepting that his side had not performed well, the veteran French manager was also left fuming by two failed penalty appeals--for a handball by Kurt Zouma and foul by Mame Diouf .\" We don't get penalties, we know that, \"said Wenger .\" I can get the numbers you will see. Look at the statistics. We had the highest penalties against us at home by a mile and the lowest number for us. \"To add to the manager's bad mood, he also saw a second half\" equaliser \"by record signing Alexandre Lacazette ruled out for offside--a decision by referee Andre Marriner which television replays suggested had been correct by a matter of millimetres .\" I watched it, it's not offside at all, \"said Wenger .\" Even his foot was not offside but we have to swallow that. \"We should have scored and it's just another detail that didn't go our way .\" Among many disappointing Arsenal performances, German international Mesut Ozil was particularly underwhelming, with television pundits picking him out for special attention, although Wenger would not criticise him. \"I think he did try,\" said the manager. \"It is difficult to single anybody out. Personally, I don't think he deserved it .\" Wenger also confirmed that Chilean striker Alexis Sanchez, who trained with the team in London on Friday, will be available for their next game, Sunday's visit to Liverpool, after being linked with a potential move away from the club. Tottenham Hotspur pay club record £ 42m to Ajax for Colombian defender Davinson Sanchez But, in the meantime, having conceded three goals in the opening weekend victory over Leicester, Wenger insists he is not panicking about his team in that area. \"Last week we conceded two goals from corners,\" he said. \"They only had three shots on goal so I don't think defended so badly--on set-pieces, yes .\" Today, the goal we conceded we were 100 per cent guilty but it was the kind of night when, not only we didn't score, but stupid mistakes--first by losing the ball centrally and then by defending poorly--cost us. \"Meanwhile, Stoke manager <mark>Mark Hughes</mark> believes his new signing Jese will set the Premier League alight after his debut goal came on the back of a solitary training session with his new club. The 24-year-old Spaniard had also missed an entire week's training before arriving in Stoke due to a family illness. Liverpool reject £ 114m Barcelona bid for Philippe Coutinho\" He's an elite player, \"said <mark>Hughes</mark>.\" A player that can change games for teams, I'm delighted he's here. \"Everybody has seen what he is going to bring to Stoke and bring to the Premier League. We're glad he's in our colours because he's going to light up the Premier League .\" I saw glimpses of that in training and knew if we could get him on the pitch and give him some minutes he would have opportunities to show what he can do. He can be devastating. \"He's not up to speed yet. He's only had one significant training session and missed a week's training last week because his new-born child had a minor operation .\" But he came in and wanted to make an impression and really enjoyed his first taste of the Premier League. \"SCMP Today: HK Edition"}, {"articleID": "2017081713_00089074_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-08-17", "url": "http://www.huffingtonpost.com/entry/trump-charlottesville-reaction_us_59956f3fe4b0acc593e5639c?section=us_queer-voices", "content": "President <mark>Donald Trump</mark> on Thursday claimed that he never \"said there is a moral equivalency between\" white supremacists and the activists protesting bigotry last weekend in Charlottesville, Virginia. But <mark>Trump</mark> had on Saturday blamed \"many sides\" for the deadly violence at a white supremacists rally in Charlottesville, and waited two days to denounce the neo-Nazis and other far-right groups who organized the event. Then, on Tuesday, he defended his initial response to the violence and lashed out at the anti-fascist activists who had been protesting the \"Unite The Right\" event. He also claimed there were \"fine people on both sides\" and even said that some of those attending the white supremacist gathering were \"innocent .\" \"I am not putting anybody on a moral plane,\" he said. \"You had a group on one side and the other and they came at each other with clubs and it was vicious and horrible. It was a horrible thing to watch. There is another side. There was a group on this side, you can call them the left. You have just called them the left, that came violently attacking the other group. You can say what you want. That's the way it is .\" Publicity seeking Lindsey Graham falsely stated that I said there is moral equivalency between the KKK, neo-Nazis & white supremacists....--<mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) August 17, 2017...and people like Ms. Heyer. Such a disgusting lie. He just can't forget his election trouncing. The people of South Carolina will remember!--<mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) August 17, 2017 The public is learning (even more so) how dishonest the Fake News is. They totally misrepresent what I say about hate, bigotry etc.. Shame!--<mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) August 17, 2017 As The New York Times put it, \"<mark>Trump</mark> buoyed the white nationalist movement on Tuesday as no president has done in generations--equating activists protesting racism with the neo-Nazis and white supremacists .\" \"If you look, there were people protesting very quietly the taking down of the statue of Robert E. Lee,\" he said on Tuesday, referring to a torch-carrying group of far-right activists, many of whom were waving Swastikas or chanting \"Jews will not replace us .\" His Thursday comments were a direct rebuttal to Sen. Lindsey Graham (R-S.C.), who had on Wednesday accused <mark>Trump</mark> of \"dividing Americans\" with his Charlottesville response. \"Through his statements yesterday, President <mark>Trump</mark> took a step backward by again suggesting there is moral equivalency between the white supremacist neo-Nazis and KKK members who attended the Charlottesville rally and people like Ms. Heyer,\" Graham had said in a statement. \"I, along with many others, do not endorse this moral equivalency .\" <mark>Trump</mark>'s comments have been panned by lawmakers across both parties, as well as officials overseas. Download Suggest a correction Alana Horowitz Satlin Assignment Editor, HuffPost MORE: <mark>Donald Trump</mark> U.S. News Republican Politics Hate Speech Political Science Subscribe to the Queer Voices email. Get all of the queer news that matters to you."}, {"articleID": "2017102014_00870247_W", "names": {"Jeff Stone": ["Q1686356", "Q19662662", "Q6175083", "Q6175085"]}, "date": "2017-10-20", "url": "https://theislandnow.com/community-news/assemblyman-durso-presented-citations-kiwanis-honorees/#respond", "content": "Community News Manhasset Port Washington Share on Facebook Tweet on Twitter From left, Kathy Levinson, Assemblyman Anthony D’Urso and <mark>Jeff Stone</mark>. Assemblyman Anthony D’Urso recently attended a dinner held by the Kiwanis International of Manhasset and Port Washington where he presented citations to the honorees Lt. Governor Kathy Levinson and President <mark>Jeff Stone</mark>. The dinner was held in Manhasset at the Strathmore-Vanderbilt Country Club. \"There are thousands of Kiwanis Club volunteers all around the world who give their time to raise funds to help children and others everywhere. We are fortunate that two of their most dedicated volunteers--Kathy Levinson and <mark>Jeff Stone</mark>--live in our community,\" said Assemblyman D’Urso."}, {"articleID": "2016081619_01133591_W", "names": {"William Hayes": ["Q16205974", "Q18603380", "Q55088372", "Q56876827", "Q8011060", "Q8011061", "Q863134"], "Jeff Fisher": ["Q1757363", "Q18585355", "Q3176484"]}, "date": "2016-08-16", "url": "http://extramustard.si.com/extra-mustard/2016/08/16/la-rams-william-hayes-mermaids-hard-knocks-video", "content": "Extra Mustard Rams DE was excited about moving to LA because he'd be closer to mermaids Share facebook twitter Dan Gartland 2 hours ago Rams defensive end <mark>William Hayes</mark> made people scratch their heads last season when he said that he believes mermaids are real and dinosaurs never existed. A year later, he's sticking to his guns on at least one of those theories. Head coach <mark>Jeff Fisher</mark> was asked about <mark>Hayes</mark>'s unusual beliefs for HBO's Hard Knocks and confirmed that he still very much believes in mermaids. Not only that, <mark>Hayes</mark> was excited about the franchise's move to Los Angeles because it meant he'd have a better chance of seeing one. \"Will <mark>Hayes</mark> absolutely believes and is totally convinced, that there are mermaids and they do exist .\" #HardKnocks https: //t.co/AiDetIsXar--NFL (@ NFL) August 16, 2016 What, there aren't any mermaids in the Mississippi River? Tags la rams will <mark>hayes</mark> mermaids hard knocks video la rams <mark>William Hayes</mark> <mark>william hayes</mark> rams <mark>william hayes</mark> mermaids <mark>william hayes</mark> dinosaurs <mark>william hayes</mark> hard knocks Hard Knocks hbo hard knocks rams hard knocks"}, {"articleID": "2020011123_00086626_W", "names": {"Mohammad Aslam": ["Q13120210", "Q21572785", "Q27831147", "Q6891843"], "Arun Sharma": ["Q24005693", "Q27531866", "Q38054951", "Q43380263", "Q59156251"], "Altaf Hussain": ["Q16199407", "Q20065239", "Q23905417", "Q2840298"]}, "date": "2020-01-11", "url": "https://indianexpress.com/article/india/jk-porter-beheaded-army-says-looking-into-pak-hand-6212118/", "content": "J & K porter beheaded, Army says looking into Pak hand J & K porter beheaded, Army says looking into Pak hand While it was earlier believed that the head of 28-year-old <mark>Mohammad Aslam</mark> may have blown off due to a mortar blast, the Army has been unable to recover it so far, leading them to suspect BAT may have beheaded him. Written by <mark>Arun Sharma</mark> | Jammu | Published: January 12, 2020 4:45:38 am The Army has not yet confirmed a BAT role (Representational) ONE OF the two porters killed in cross-border shelling in Jammu's Poonch district on Friday morning could have been beheaded by Pakistan's BAT (Border Action Troops). While it was earlier believed that the head of 28-year-old <mark>Mohammad Aslam</mark> may have blown off due to a mortar blast, the Army has been unable to recover it so far, leading them to suspect BAT may have beheaded him. If proved right, it would be the first instance of BAT, which comprises Pakistani army regulars and terrorists, targeting a civilian, although similar incidents involving security personnel have taken place in the past. While the Army did not confirm a BAT role, Defence Ministry spokesperson Lt Colonel Devender Anand said that one of the porters had been found to be headless, and that they were investigating whether there was Pakistani hand in it. A senior police officer said the head appeared to have been severed by a sharp-edged weapon. Asked about the incident at a press conference in Delhi Saturday, Army Chief Gen M M Naravane said that professional armies never resort to such \"barbaric\" acts. \"We will deal appropriately with such situations in a military manner .\" The last such incident was reported back in September 2018, when a BSF jawan was killed and his body mutilated in Samba district, leading to the cancellation of Indo-Pak talks scheduled days later. In December 2017, bodies of four soldiers, including a Major, killed in Rajouri sector were found to be mutilated by a BAT team that infiltrated 300-400 metres inside the LoC. Similar incidents were reported in 2017, 2016 and 2013. The two porters, along with four others, were in Poonch district, falling ahead of the barbed wire fence marking the Line of Control. The Army generally hires civilians for logistics duties here. While <mark>Aslam</mark>, a resident of Kasalian, was killed on the spot, fellow villager <mark>Altaf Hussain</mark>, 23, died on way to hospital. The families carried out the funeral on Friday evening. injured during Pakistani shelling at Kassalian village The three injured porters are recuperating and said to be stable. The Army had retaliated with heavy firing to the attack. Condemning the killings, the Congress asked why Prime Minister Narendra Modi and Defence Minister Rajnath Singh were \"silent\" on the \"barbarism\" by Pakistan, and recalled that the BJP had attacked the UPA government mercilessly over the matter. \"When will Pakistan's cowardly acts be given a befitting reply?\" 10 heads for 1' when? \"Congress spokesperson Randeep Surjewala tweeted, referring to the BJP's threats against Pakistan."}, {"articleID": "2014120817_00037903_W", "names": {"James Robison": ["Q16106427", "Q6142315"]}, "date": "2014-12-08", "url": "http://www.westernjournalism.com/wolfboy-princess-cupcake-complementarity-sexes/?utm_source=rss&utm_medium=rss&utm_campaign=wolfboy-princess-cupcake-complementarity-sexes", "content": "Ouch: Rand Paul Just Rubbed This Big Loss In These Democrats' Face In A Funny Way WATCH: What Obama's Mentor, A Harvard Law Professor, Just Said About Ferguson Is Unbelievable WATCH: This Fired Up Fox News Host Body Slams \"Racial Hatred' Obama In An Unforgettable Way Cowardly Conservatives Use Garner Case To Grab Their\" Ferguson Moment \"WATCH: What Obama's Mentor, A Harvard Law Professor, Just Said About Ferguson Is Unbelievable WATCH: This Fired Up Fox News Host Body Slams\" Racial Hatred' Obama In An Unforgettable Way Alabama Christmas Parade Has Largest Attendance In Years Despite Atheist Attacks Wolfboy And Princess Cupcake: The Complementarity Of The Sexes Ecumenism at its best was recently demonstrated at the Vatican, where dozens of faith leaders worldwide assembled to remind us of the essential complementarity of men and women in life, marriage, and parenthood. It was enough to prompt a high-five between Pope Francis and evangelical pastor <mark>James Robison</mark>. Of course, do we really need reminding that male and female are different? Absolutely, especially with the advent of same-sex marriage, which is prompting assertions that it \"doesn't matter\" whether two men or two women parent a household. Ask any parent if males and females are different. My wife and I have eight children under our roof, and the boy-girl differences are dramatic. Here's a typical Saturday morning exchange at our house: \"Daddy!\" my 7-year-old son yells, running toward me in camouflage hunting clothes. \"I had a dream last night that I stabbed Bigfoot nine times with a spear!\" Not missing a beat, his 3-year-old sister prances and dances toward me in a flowered pink dress: \"Daddy, I had a dream about a ladybug!\" The 3-year-old goes by \"Princess Cupcake .\" She's of the age where she dresses up and displays herself in front of me waiting for me to gush, \"Wow, you look like a princess!\" She beams. Her older sisters did the same thing. The first time I said that to her oldest sister, she calmly glowed to her mom, \"He said I look like a princess .\" Needless to say, the boys have never done that-not once in 20,000-plus days of combined lives. My wife and I have nothing to do with these differences, other than providing the chromosomes. My 7-year-old boy, long before fancying himself a Bigfoot slayer, declared himself \"Wolfboy .\" My wife and I certainly didn't come up with that one. She will tell you that she did not give birth to a wolf boy. No, it was he alone who transmogrified himself into this half beast, half boy. Wolfboy sauntered around the house creeping, preying. We attempted to keep these wild manifestations at, shall we say, bay-a more restrained Wolfboy. One day at the home of friends, he politely asked my wife if he could go outside to \"howl,\" to the giggles of my friend's teenage girl. Fortunately, the Wolfboy thing eventually cooled. One afternoon, he grabbed two chopsticks for fangs, shoving them into his throat. Wolfboy had to be taken to the hospital. We've since had several full moons with no reappearances. That brings me back to the differences in the sexes. These traits follow us into adulthood, marriage, and parenting. There are things my wife does that I just can't. She happily jumps up in the middle of the night at the slightest cry. I lay there groaning. On the flip side, she has no yearning to take the teenage boys hunting in 20-degree weather with rifles and crossbows to shoot and gut and hang and skin and butcher a deer. My boys crave that, and they're utterly mystified at their sisters' insatiable interest in the Duggar family's weddings. In short, all of this is obvious, observable. Really, to deny it is to be warped by ideology, culture, politics, or some agenda. That brings me back to the ecumenical gathering at the Vatican, where these gender differences in married and family life were acknowledged and celebrated. \"The biggest threat to marriage is that people have forgotten its purpose,\" said Pastor Rick Warren, the 28th speaker at the conference. \"Children who grow up with the presence of a mother and father are more successful in life, are healthier, are stronger, are less likely to be involved in crime, are less likely to go to prison, are less likely to be involved in drug abuse, are less likely to live in poverty. If you really want to support children, we need to support two-parent families, a husband and a wife, a mom and a dad .\" The bishop of Rome didn't disagree with the Saddleback Church pastor. \"Children have a right to grow up in a family with a father and a mother,\" said Pope Francis. Such households are best \"capable of creating a suitable environment for the child's development and emotional maturity .\" Of course, not all children get that ideal; but it's an ideal our culture should strive for rather than against. We were made male and female; and from birth to death and childhood to parenthood, those differences have a distinct and complementary purpose. Photo credit: shutterstock.com The views expressed in this opinion article are solely those of their author and are not necessarily either shared or endorsed by WesternJournalism.com. Conservative Celebrities Lead Charge To Save '19 Kids And Counting' Previous post Cowardly Conservatives Use Garner Case To Grab Their \"Ferguson Moment\" Cowardly Conservatives Use Garner Case To Grab Their \"Ferguson Moment\" The following \"conservatives\" are using the Garner case to suck up to the liberal media ..."}, {"articleID": "2012031616_00099512_W", "names": {"Helen Taylor": ["Q43392993", "Q43395652", "Q57420024"], "Jim Mcmahon": ["Q1689159", "Q17306267", "Q6196886"]}, "date": "2012-03-16", "url": "http://oldham-chronicle.co.uk/news-features/8/news-headlines/67874/5m-youth-zone-goes-on-show", "content": "reporter: erin heywood date online: 16 march 2012 local dignitaries and key decision-makers essential to the development of oldham's new youth zone will see the finished product when mahdlo launches today. they will get the chance to tour the building and experience the types of facilities and activities available to the young members when doors officially open on monday. the state-of-the-art? 5million youth facility is set to benefit more than 1,500 young people in the borough within its first year of opening. it will be open seven nights a week and will have over 25 activities ready to be utilised by members aged eight to 21. disabled members can use it up to the age of 25. <mark>helen taylor</mark>, chief executive at mahdlo youth zone, said: \"we are absolutely delighted to finally showcase mahdlo to our supporters following years of hard work and commitment from within the borough .\" mahdlo is a cutting-edge youth facility that will inspire, motivate, raise aspirations and take pride in oldham's young people. \"our aim is to make a tangible difference to the lives and futures of local young people, by providing them with a safe and engaging place to spend their leisure time .\" councillor <mark>jim mcmahon</mark>, leader of oldham council, said: \"it gives me great pleasure to see mahdlo open its doors and i'm sure it will become a popular, fun and enjoyable destination for our young people. oldham has the highest proportion of under-25s in the region so it is vitally important that we offer the best facilities available for them to enjoy - and mahdlo certainly fits the bill .\" the borough already has some outstanding facilities for young people and together with our partners we offer great activities through our year long go! oldham initiative, so this state-of-the-art facility can only enhance that offer. \""}, {"articleID": "2014080313_00037800_W", "names": {"Robert Moore": ["Q18636266", "Q21453623", "Q42887786", "Q59260611", "Q7347771", "Q7347775", "Q7347776"], "Rob Smith": ["Q16847100", "Q16931899", "Q17198726", "Q21151369", "Q28868156", "Q3434235", "Q5206244", "Q7340559", "Q7340561", "Q7340562", "Q7340564"], "Brad Stewart": ["Q1523176", "Q2923441"]}, "date": "2014-08-03", "url": "http://www.nwaonline.com/news/2014/aug/03/springdale-starts-study-on-regional-slu/", "content": "Northwest Arkansas considers a regional approach to treating, processing biosolids from wastewater. Posted: August 3, 2014 at 1:30 a.m. ROGERS--<mark>Robert Moore</mark> dipped his hand into a 5-foot-tall, waterproof bag and brought out a handful of what looked like rich topsoil. \"The pathogens are gone,\" said <mark>Moore</mark>, plant manager of the Rogers Pollution Control Facility. \"Plants can grow in this .\" Raw Sewage Thousands of U.S. cities dumped raw sewage directly into rivers, lakes and bays 30 years ago, but federal and state laws have cleaned up the waterways, and made them safer. The treated residuals from wastewater treatment, known as biosolids or sludge, can be safely recycled. Fast Fact Drying System Rogers uses a Therma-Flite Bio-Scru sludge drying system that uses continuous flow processing. The process reduces the smell, which is notorious to wastewater treatment facilities, and is energy efficient. Source: Staff Report Rogers is among about 10 Arkansas cities to use a dryer system to turn sludge, or organic matter in wastewater, into something considered to be, basically, fertilizer. Bentonville and Fayetteville have similar drying facilities, but Rogers' process has drawn the attention of Northwest Arkansas wastewater officials who are considering building a regional sludge-processing facility. The facility would be the first known of its kind, according to the Arkansas Department of Environmental Quality. Heath Ward, Springdale Water Utilities executive director, announced last month the city hired McClelland Consulting Engineers to study the feasibility of a regional facility--something that could handle Springdale's roughly 23,000 tons of wet sludge produced annually, and have room to grow. The facility would be located on land near the Northwest Arkansas Conservation Authority wastewater treatment plant, west of Cave Springs. A regional facility with a dryer could take three years to get off the ground and cost millions, Ward said. He hopes the sludge study is finished in December or January, around the same time the city's master plan study should wrap up. \"I think (a regional facility) would be beneficial to Springdale short term, but to Northwest Arkansas long term,\" Ward said. Ward is interested in emulating Rogers because the city's facility creates a product that is \"clean\" and can be sold. <mark>Moore</mark> rolled the dirt-like material fresh from the Rogers dryer in his palm. The bacteria is gone. The product is safe, he said. Sludge processed through the dryer can go on parks, playgrounds and farms, according to a brochure on the technology provided by <mark>Moore</mark>. Authorities are so interested in Springdale's regional idea--an idea reminiscent of the organization's original mission--the Northwest Arkansas Conservation Authority board approved a resolution supporting the city's study July 17. Board members, including Bentonville Mayor Bob McCaslin, called the regional concept a good one. Springdale will pay between $100,000 and $120,000 for the study, Ward said. The city plans to pay for the study, and pay for construction and for operations, at least initially, said Chris Weiser, chairman of the Springdale Water and Sewer Commission. Springdale wants a facility that can expand as other cities decide to use it, Ward said. Ideally, operations, and the facility, would be turned over to the authority eventually, he said. Springdale would lay the \"footprint\" of a facility that could help Northwest Arkansas as a whole. \"It's something we need to look at for the future,\" Ward said. \"We are part of a region. It would take care of our problem--there's our benefit--and it might have a benefit for others .\" Selling Sludge Rogers sold its processed sludge in July for $17.66 a ton to an out-of-state company, <mark>Moore</mark> said. The sale was the first time Rogers sold its processed material. Previously, Rogers had to pay landfill after landfill to take the city's sludge--about 10 truckloads a day or 10,400 wet tons a year. By heating and drying its sludge, Rogers will earn about $40,000 a year, instead of paying about $38 a ton for removal, <mark>Moore</mark> said. The revenue won't immediately recoup the cost for installing and running the $3.4 million Therma-Flite dryer system, but it will pay for some expenses, <mark>Moore</mark> said. Other communities are paying attention. Ward toured Rogers' wastewater facility at least once in the past few months, <mark>Moore</mark> said. On a sunny, summer day, the building that houses the dryer is swept clean. A rake used to clean out dehydrated semi-solids sits on top of the chamber dryer. Workers continually clean the chamber, watch the temperatures and maintain the machine, <mark>Moore</mark> said. Since taking over operations of the drying system in 2013, the city has had no real problems with the dryer, said David Staib, operations supervisor. The dryer is better for Rogers and the environment, he said. \"It's the wave of the future,\" Staib said. Shrinking Landfills The dryer in Rogers will meet the city's needs for another 20 years, but small cities in Northwest Arkansas don't have good options for sludge removal, <mark>Moore</mark> said. Landfills are turning away cities, the amount of sludge produced is growing and costs to cities are going up, Ward and others said. \"It's a big deal,\" Ward said. \"Something has got to be done with it .\" Landfill space is becoming more valuable, said Billy Ammons, regional business manager at CH2M Hill, the company that operates two wastewater plants in Fayetteville. \"Everybody is going to have an issue at one time or another,\" Ammons said. Springdale spends $1 million a year to remove its sludge, but that amount could double if Waste Management stops accepting sludge, Ward said. Springdale has a good relationship with Waste Management, but the landfill stops taking sludge if the amount exceeds 15 percent of the total solid waste coming in on any given day, said George Wheatley, Waste Management spokesman. Adding too much sludge or wet-food byproducts to the landfill impacts its structural integrity, Wheatley said. The landfill wouldn't be able to support the heavy equipment and dump trucks. \"There have been other cities that have brought their sludge to us, but we've had to turn them away for different reasons,\" Wheatley said. Nationwide, a growing number of states are trying to eliminate sludge and similar material from landfills, said Jennah Durant, U.S. Environmental Protection Agency spokeswoman, in an email. Many areas are looking at regional approaches to deal with sludge, she said. More Sludge At the same time landfills are cutting back, Northwest Arkansas' population is growing and producing more, wastewater experts said. The Northwest Arkansas Council used U.S. Census Bureau data earlier this year to determine the area's population grew to about 500,000 in May, said <mark>Rob Smith</mark>, council spokesman. In Springdale, the amount of sludge the city produces has been creeping up for the past few years, said <mark>Brad Stewart</mark>, pretreatment manager. The city produced sludge at a rate of about 1,800 wet tons per month on average in 2011-12, compared to about 1,900 a year later, <mark>Stewart</mark> said. The authority's treatment facility hauled off 30 percent more sludge this year over the same time a year ago, said Rick McClain, facility manager. \"Our cost for sludge, in the budget, has increased because I'm hauling more sludge than I did a year ago,\" McClain said. Hauling away about 3,600 wet tons of sludge per year costs the authority about $120,000, McClain said. Costs will continue to rise, he said. Between the environment and rising costs, something must change soon, <mark>Moore</mark> and Ward said. They both said they are interested in keeping sludge out of landfills and producing a safe product. Copyright © 2014, NWA Media. All rights reserved. This document may not be reprinted without the express written permission of NWA Media. Please read our contact us. Material from the Associated Press is Copyright © 2010, Associated Press and may not be published, broadcast, rewritten, or redistributed. Associated Press text, photo, graphic, audio and/or video material shall not be published, broadcast, rewritten for broadcast or publication or redistributed directly or indirectly in any medium. Neither these AP materials nor any portion thereof may be stored in a computer except for personal and noncommercial use. The AP will not be held liable for any delays, inaccuracies, errors or omissions therefrom or in the transmission or delivery of all or any part thereof or for any damages arising from any of the foregoing. All rights reserved. We hope you've enjoyed your preview of NWAonline.com. You've now read the maximum number of stories available without a subscription."}, {"articleID": "2018062716_00027881_W", "names": {"Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}, "date": "2018-06-27", "url": "https://www.financialexpress.com/entertainment/amazon-prime-video-to-stream-superstar-rajinikanth-starrer-kaala-soon/1222768/", "content": "Amazon Prime Video to stream superstar Rajinikanth starrer Kaala soon Amazon Prime Video to stream superstar Rajinikanth starrer Kaala soon Amazon Prime Video will soon stream on its platform superstar Rajinikanth-starrer Kaala, a top company executive said today. By: PTI | Published: June 27, 2018 8:47 PM Rajinikanth-starrer Kaala Amazon Prime Video will soon stream on its platform superstar Rajinikanth - starrer Kaala, a top company executive said today. \"Kaala will be on our platform for streaming soon, probably in next two months or so...the film will be available for customers,\" Amazon Prime Video India Director and Head (Content) Vijay Subramanian told PTI here. \"Kaala will connect with customers across languages because Rajinikanth is such a popular star not only in India, but also globally,\" he said. Subramanian is in the city for the release of the trailer of their new Prime Original series Comicstaan. Produced by Only Much Louder (OML) and hosted by comedians Abish Mathew and Sumukhi Suresh, Comicstaan is a talent hunt to discover Indias next big comedic talent. Replying to a query, Subramanian said he did not foresee any disruption taking place in television serials due to webserials. \"There are creative people like Karan Johar, <mark>Salman Khan</mark>, who are associated with online entertainment streaming platforms. They also are doing work on television and big screens too,\" he said. \"I don't see any disruption in television serials. In fact, it will complement each other due to the sheer opportunity it offers to both types of entertainment-seekers,\" he added."}]