[{"articleID": "2019090915_00198372_W", "names": {"Martin Griffiths": ["Q21457259", "Q59281930"]}, "date": "2019-09-09", "url": "https://www.standard.co.uk/news/uk/doctors-to-teach-london-pupils-how-to-give-stabbing-victims-first-aid-a4232321.html", "content": "News' UK Doctors to teach London pupils how to give stabbing victims first aid Naomi Ackerman Monday 9 September 2019 16:00 {{#singleComment}} {{value}} comment {{/ singleComment}} {{^ singleComment}} {{value}} comments {{/ singleComment}} Click to follow The Evening Standard Experts will use simulation and practical exercises. (helenrigby.com) Enter your email address Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid You already have an account. Please log in. Register with your social account or click here to log in I would like to receive lunchtime headlines Monday - Friday plus breaking news alerts, by email Update newsletter preferences An NHS project training at-risk teenagers how to give emergency first aid to stabbing victims is launching in London schools. Doctors and nurses will show pupils how to stem bleeding, keep victims alive in the first crucial minutes after an attack, and keep themselves safe. The \"zero responder\" workshops were first run at Feltham and Pentonville young offender institutions by A & E specialists from the Royal London Hospital in Whitechapel last autumn. Since then, the two-hour sessions have also been held at youth and community centres in Hackney and Southwark. This term the Barts Health Trust specialists will launch the workshops in London schools for the first time. Read more Two killed in 15 minutes: Mum stabbed and man shot yards apart They will run them in four east London pupil referral units--education centres for children who have been removed from mainstream school--this autumn, with the aim of expanding into mainstream schools. Experts will use simulation and practical exercises to teach groups of about 15 to 20 pupils, who will be able to ask questions. Michael Carver, lead violence reduction nurse at the Royal London, said he wanted to give first aid to all pupils, adding: \"The primary outcome is they will be able to do first-responder things to stop people bleeding to death in the first five minutes; and the secondary outcome is we start talking properly about knife crime .\" The move is part of a Barts Health violence reduction initiative, running alongside a NHS programme to tackle youth violence in the capital, led by its first clinical director for violence reduction, Royal London trauma surgeon <mark>Martin Griffiths</mark>. More about: | stabbing Show {{#moreThan 3}} {{value_total}} {{/ moreThan3}} comments Reuse content Comments Log in or register to comment Hello {{nickname}} (Logout) {{^ nickname}} {{/ nickname}} {{#nickname}} {{/ nickname}} Post {{#singleComment}} {{value}} Comment {{/ singleComment}} {{^ singleComment}} {{value}} Comments {{/ singleComment}} Refresh • Subscribe • RSS {{^ comments}} There are no comments yet {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply Flag {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply Flag {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Flag {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} {{#showMore}} Read more {{/ showMore}} Notifications Enter your email to subscribe to new comments on this article. Subscribe Thanks for subscribing! {{errorMessage}} Vote Are you sure you want to submit this vote? Yes, submit this vote Cancel You must be logged in to vote. Report Comment Are you sure you want to mark this comment as inappropriate? Yes, flag this comment Cancel This comment has been flagged. This comment has been flagged. Delete Comment Are you sure you want to delete this comment? Yes, delete this comment Cancel This comment has been deleted. This comment has been deleted. Reply {{^ nickname}} {{/ nickname}} {{#nickname}} {{/ nickname}} {{^ nickname}} Post {{/ nickname}} {{#nickname}} Post {{/ nickname}} Cancel Comment posted! {{errorMessage}} Most popular {{title}} Popular videos {{title}} Sponsored features {{title}}"}, {"articleID": "2011102814_00005067_W", "names": {"Brian Mclaughlin": ["Q21461001", "Q4964728", "Q4964729", "Q4964730"], "Chris Henry": ["Q30122704", "Q5106860", "Q5106861", "Q950907"], "Paul Marshall": ["Q12141742", "Q3898113", "Q42122872", "Q6067230", "Q6381092", "Q7152221", "Q7152223", "Q7152224"], "Ian Humphreys": ["Q21454991", "Q3147280"]}, "date": "2011-10-28", "url": "http://sportsnewsireland.com/rugby_irish/60027/", "content": "joe scmidt has named the leinster team for the rabodirect pro12 clash with edinburgh in murrayfield alan conway has the latest news from the leinster squad ahead of this fridays trip to edinburgh. last 7 days: all articles from the last 7 days. last 28 days: all articles from the last 28 days. sports news 24/7 six of ulster's world cup players have gone straight into the starting xv to face scarlets saturday afternoon at the parc y scarlets (kick off 3pm). head coach <mark>brian mclaughlin</mark> has made a total of seven personnel changes and two positional switches for the rabodirect pro12 clash. johann muller returns to captain the side from the second row, where he is resumes his partnership with dan tuohy. ireland prop tom court will join andi kyriacou and declan fitzpatrick in the front row. the back row remains unchanged from the lastmatch against treviso, with pedrie wanneneburg and mike mccomish on the flanks and <mark>chris henry</mark> at number 8. <mark>paul marshall</mark> makes way for returning springbok ruan pienaar at scrumhalf, with <mark>ian humphreys</mark> starting in the number 10 jersey and paddy wallace and nevin spence occupying the centre positions. andrew trimble and craig gilroy have been named on the wings, with simon danielli starting at fullback. <mark>mclaughlin</mark> is confident the returning players will benefit the team: \"we've had a very positive week with johann at the helm as captain and we're looking to put in a positive performance on saturday. when you and in andrew, simon, paddy, tom and ruan, we are starting to take a bit more shape .\" the guys who have played up until now have done a great job and they will get plenty of opportunities as the season progresses, with so many games on the horizon. \"we had to make a few tough decisions in terms of selection. leaving darren cave out of the side was very difficult considering the form he was in. paddy (wallace) and nevin (spence) struck up a good relationship last season and it's a tried and tested combination. we know with darren on the bench, it will give us a bit of quality there and it gives us great options .\" we have a long run of games no and it's important that we get off on the right foot against scarlets. we will be looking for a good performance as well as a good result. \"ulster go into the game on the back of three straight defeats, including a loss to treviso last time out which brought their nine game winning streak at home to an end. ulster are stuck on 99 wins in this competition but having completed a double over scarlets last season, they will be quietly confident. ulster (15-9): s danielli; a trimble, n spence, p wallace, c gilroy; i <mark>humphreys</mark>, r pienaar; (1-8): t court, a kyriacou, d fitzpatrick, j muller (capt), d tuohy, p wannenburg, m mccomish, c <mark>henry</mark>; replacements (16-23): n brady, p mcallister, a macklin, l stevenson, r diack, p marshall, d cave, a d'arcy unavailable due to injury: jared payne (achilles), luke marshall (jaw), jerry cronin (neck)"}, {"articleID": "2019121823_00052643_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-12-18", "url": "http://www.gamereactor.eu/?system=ps4&sid=3158447473a7a2458f290852090dd1e2", "content": "PS4 Some games are just as good the second time around. Some are even better. Here are the best remasters and remakes of 2019. Preview The Witcher 3 included in December's Game Pass additions Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 15:14 Console Game Pass subscribers get a lot of games to play on their Xbox One this month, including CD Projekt Red's RPG. Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 14:42 After the original sequel was scrapped, we know that the recently-announced project has started from scratch. Respawn job listings hint at Star Wars Jedi: Fallen Order sequel Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 14:12 There are several openings on the Star Wars team, which seem to be helping with a \"third person action/adventure game\". World War Z's Horde Mode Z is here Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 13:41 Saber's Tim Willits said it was the \"number one feature that fans wanted in World War Z\" when we spoke to him. Overcooked 2's Winter Wonderland update is here Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 13:10 Get into the festive spirit with Overcooked 2, as there are new enemies, recipes, and levels to enjoy. Horizon: Zero Dawn joins PS Now in January Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 12:08 Uncharted fans have a little something too, and can even take a break from the exclusives with some chaos in Overcooked 2. We play Destiny 2 on today's stream for Season of Dawn Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 11:18 The season has just kicked off, so we're heading back in to check out all of the new content in Bungie's shooter. Borderlands 3, Breakpoint, and more join Stadia lineup Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 11:07 There are also a number of discounts active right now, celebrating the new batch of games hitting the service. Batman: The Telltale Series' Shadows Edition confirmed Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 09:36 After an early announcement leaked the bundle, we have a brand new trailer for the package as it releases. Rainbow Six Pro League ditches relegation in EU/NA Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 07 Season XI starts next month, and there are some big changes coming in, increasing the number of teams as well. Apex Legends Global Series will start next month Written by <mark>Sam Bishop</mark> on the 18th of December 2019 at 07 Online competition will kick things off, and then the first of four Major events will start in March. Farming Simulator 19 gets Seasons Mod on consoles Written by <mark>Sam Bishop</mark> on the 17th of December 2019 at 16:05 The mod roster has expanded on PS4 and Xbox One, bringing plenty of changes after originally landing on PC. Children of Morta gets roadmap for 2020 content Written by <mark>Sam Bishop</mark> on the 17th of December 2019 at 14:01 Dead Mage and 11 bit Studios are providing more content in the coming months, expanding the RPG after this year's launch. US and Canada getting Phantasy Star Online 2 closed beta Written by <mark>Sam Bishop</mark> on the 17th of December 2019 at 13:30 It'll be exclusive to Xbox One, and those in the Xbox Insider Program can sign up for the chance to get involved now. Blair Witch gets physical release on January 31 Written by <mark>Sam Bishop</mark> on the 17th of December 2019 at 13:00 The horror game has only just landed on PS4, but now we know that we can get a copy for our shelves too."}, {"articleID": "2010022206_00011367_W", "names": {"Brian Gibbons": ["Q4963833", "Q4963835", "Q8805306"], "Jimmy Hayes": ["Q1414790", "Q1689367"], "Ben Smith": ["Q21622916", "Q21622918", "Q2895559", "Q31193", "Q3637951", "Q4886477", "Q4886478", "Q4886480", "Q4886481", "Q4886482", "Q4886483", "Q4886484", "Q4886490", "Q56144844"], "Jerry York": ["Q16107179", "Q3177432"], "Roy Williams": ["Q17414660", "Q18391329", "Q18706111", "Q21035306", "Q2170754", "Q30716994", "Q321623", "Q3445837", "Q3445839", "Q7373500", "Q7373502", "Q7373504", "Q7373505", "Q7373506"]}, "date": "2010-02-22", "url": "http://bostonherald.com/sports/college/hockey/view.bg?articleid=1234549&srvc=rss", "content": "college hockey <mark>brian gibbons</mark>' trick treats bc boston college has to offer in the postseason, it could be quite a finish for the eagles. taking on a northeastern squad that had defeated it friday night at matthews arena, bc delivered a performance as dominant as you'll ever see, routing the huskies, 7-1, yesterday behind the first career hat trick and 100th career point by junior center <mark>brian gibbons</mark> of braintree. \"they were great,\" a stunned nu coach greg cronin said. \"i've been at this for five years now, and that's as thorough and as consistent an effort as i've seen from a team in five years. and then when you add the talent and the speed they have, it was like they were on steroids, and we just couldn't match it .\" (bc) wanted to win every battle from the opening faceoff to the end. their game plan was very visible: it started with winning battles, hunting pucks down with passion, and we couldn't match it. they did it for 60 minutes. our (defenders) were under assault for most of the game. \"aside from <mark>gibbons</mark>' three goals (nos. 12, 13 and 14), bc got single tallies from pat mullane (no. 7), chris kreider of boxford (no. 9), cam atkinson (no. 18) and <mark>jimmy hayes</mark> of dorchester (no. 7). <mark>ben smith</mark> had two assists. eagles freshman goalie parker milner (22 saves) improved to 7-2-0. in the huskies' 3-2 win friday, 6-foot-5 nu goalie chris rawlings had an outstanding 38-save showing. he was good again yesterday but would have needed a lot more saves than he had in the weekend opener to give the huskies a chance - as the eagles (18-10-2, 13-8-2 hockey east) posted a 50-23 advantage in shots .\" our offensive zone play was outstanding, \"bc coach <mark>jerry york</mark> said .\" we cycled the puck really well and maintained possession. \"the eighth-ranked eagles were simply terrific in every facet of play. they played very strong defense (with <mark>york</mark> praising defensemen patrick wey, brian dumoulin and philip samuelsson), and turned it into lightning-fast transitions. the eagles got pucks deep and forechecked like crazy, keeping the attack alive for long stretches with their cycle. they also got lots of traffic and pucks to the goalmouth of northeastern (16-13-1, 11-11-1). moving the puck extremely well, bc generated a few easy, open-net tap-ins .\" the puck wasn't staying on anyone's stick too long, \"said <mark>gibbons</mark>, who matched his career-high with four points .\" no one was selfish. everyone was just: get it and move it to the guy who's open. \"<mark>gibbons</mark>' big night began with a high-speed dash up ice and a shot from the right hashmark that beat rawlings low to the far side. that was the only goal of a first period in which bc (18-6 edge in shots) should have had more. by associated press chapel hill, n.c. - north carolina coach <mark>roy williams</mark> finally has some good...by associated press baltimore - jim paquette has been named assistant vice president and...© copyright by the boston herald and herald media. no portion of bostonherald.com or its content may be reproduced without the owner's written permission."}, {"articleID": "2014061311_00013403_W", "names": {"Tim Cahill": ["Q14946751", "Q15429744", "Q187238", "Q7803268"]}, "date": "2014-06-13", "url": "http://news.smh.com.au/breaking-news-sport/postecoglou-not-weighing-in-on-ref-drama-20140613-3a0rx.html", "content": "Register Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Socceroos coach Ange Postecoglou refused to weigh in on the refereeing drama of the World Cup's opening game, despite it possibly becoming a big factor in Australia's clash with Chile on Friday. The showpiece kicked-off in controversy on Thursday after Japanese referee Yuichi Nishimura awarded a penalty that helped hosts Brazil start their campaign with a 3-1 win over Croatia in Sao Paulo. Nishimura ruled Fred had been brought down in the box however, replays showed there had been minimal contact. In the wake of the controversy there are suggestions referees may be gun shy when it comes to making similar decisions during the rest of the tournament. Advertisement Socceroos striker <mark>Tim Cahill</mark> said on Wednesday he was expecting there to be shirt-pulling and nudging by the Chileans in the box during their crucial first clash in Cuiaba on Friday (Saturday AEST). But Postecoglou wouldn't get drawn into the matter. \"All the teams have had a visit from the officials and they've told every country what they're looking for, so we're aware of what they're looking at,\" Postecoglou said. \"The referees have got their job, we've got ours so we won't sit there and try and preempt what may or may not happen .\" We've been told the things that are going to be highlighted at this World Cup and we'll deal with it accordingly. \"While the Chileans may look to nullify <mark>Cahill</mark>'s aerial advantage Postecoglou said he wasn't Australia's only threat .\" We've got somebody there who's very threatening and Timmy's looked very sharp. But I don't think that's our only avenue for goal, \"Postecoglou said .\" We're working on a few things and we certainly believe we can be a threat in other areas. \"But there's no doubt they're going to have to pay attention to Timmy because if he does get half a chance in the box, particularly in the air, he can head it in from any position. So we'll use that .\" Postecoglou emphasised there were no concerns over Mark Bresciano's fitness and indicated the veteran midfielder would start. The 34-year-old has been battling a back complaint in the lead up to the Socceroos' campaign opener. \"Absolutely (he's right to start),\" Postecoglou said. \"He's trained really well and more important he's recovered from training really well. So he's ready to go .\" I think he's really looking forward to it, he's got that steely look in his eye and he's ready to play. \"There's no doubt in my mind physically now he's right to go .\" Meanwhile, FIFA has ordered the Socceroos to change their strip for their opening match."}, {"articleID": "2018012901_00626668_W", "names": {"Dick Johnson": ["Q16091224", "Q357924", "Q3706952", "Q5273060", "Q5273062", "Q5273063"], "James Courtney": ["Q1680206", "Q30818524"]}, "date": "2018-01-29", "url": "http://www.motorsport.com/v8supercars/news/djr-team-penske-co-owner-steve-brabeck-passes-away-1000001/", "content": "DJR Team Penske co-owner Steve Brabeck passes away 2 views By: Andrew van Leeuwen, News Editor 29/01/2018 01:51 DJR Team Penske co-owner Steve Brabeck passed away overnight after a brave 24-year battle with cancer. The influential businessman first got involved with the DJR Team Penske squad as a sponsor through his Crimsafe company in 2009 when it was known as <mark>Dick Johnson</mark> Racing, going on to provide funding badly needed to help the team survive a financially difficult 2010 season and seal the Supercars title with <mark>James Courtney</mark>. Brabeck then became part of the ownership structure several years later, retaining a 20 per cent stake through the transition into DJR Team Penske for the 2015 season. \"Jill and I have known Steve for many years, and he became much more than a business partner, he became a true friend,\" said Supercars legend and fellow part DJRTP owner <mark>Dick Johnson</mark>. \"He shared some incredible moments on track with us over the years and we will remember those for a long, long time. Our thoughts are with his family, especially his two boys Matt and Ben. He will be missed, greatly .\" Roger Penske also paid tribute to Brabeck's role in the pre-DJRTP survival of the old DJR outfit. \"We first met Steve in 2013 when we started talking to <mark>Dick</mark> and the team about Supercars,\" said Penske. \"He was a great guy, a successful businessman and really enjoyed going racing .\" He was there in the tough times for DJR and a terrific partner to us in DJR Team Penske. \"Motorsport.com offers its condolences to Brabeck's family and friends. Want motorsport news in your inbox? Sign up for our newsletters!"}, {"articleID": "2014060422_00038977_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"]}, "date": "2014-06-04", "url": "http://crushable.com/2014/06/04/entertainment/cameron-diaz-dating-benji-madden-weird-couple/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "The Inspiration Behind Kate McKinnon's Justin Bieber Impression Is Hilariously Perfect Jonah Hill Apologizes Again For His Homophobic Slur, Continues To Seem Sincere There's Another Video Of Justin Bieber Using The N-Word, So It's A Good Thing He Isn't Racist Here's That Video You Wanted Of Jill Duggar Getting Proposed To By Derick Dillard Shailene Woodley Tried To Clarify Her Feminism Comments, Just Confused Us Further Cameron Diaz and Benji Madden are apparently dating, and if it's true, this is one of the most promising entries in the \"Weirdest Couple Ever' competition I've seen in a long time. Honestly, these two are gonna be tough to catch, people. We'd have to do something drastic like get Paris Hilton together if we want even a hope of passing them up. I know it's a big sacrifice to make for you Cumberbitches, but we have to keep our collective eyes on the prize! There have been rumors for a couple weeks that Benji and Cameron were dating when they were seen together at a gym in LA, but Benji refused to confirm the rumors when he was asked during an interview on an Australian radio show. But now Star Magazine is able to confirm that even if the two aren't officially dating, they're at least making out, because they up and got some pictures of it. And in addition, another source says they saw Benji and Cameron having breakfast with a group of six people at ABC Kitchen in Manhattan:\" Throughout the entire meal, Cameron and Benji couldn't keep their hands off each other. They were whispering to each other and laughing, just having the best time together. \"Well this sounds pretty cute, actually. And for anyone who's wondering how they met, it was apparently through Cameron's friend Nicole Richie, who as you may recall is married to Benji's brother and Good Charlotte bandmate, Joel Madden .\" Everyone else at the table was talking and catching up, but Benji and Cameron were completely removed from the conversation. They were totally consumed with each other. Benji kept his arm around her, and she'd just rest her head on his shoulder and stare at him, grinning. It was obvious that she's crazy about him. \", and <mark>Alex Rodriguez</mark>, so Benji isn't someone I'd expect to be her type. What are they feeding those Madden boys that they're able to pull dime pieces like Cameron and Nicole? Good for them .\" I wouldn't be surprised is they are together for a very, very long time. \"Cameron Diaz Pranked Jimmy Fallon's Baby, And They Have The Adorable Photo To Prove It In Defense Of Kooky Cameron Diaz And Her Apparent Quest To Become A Wise Old Crone"}, {"articleID": "2012101618_00074286_W", "names": {"Kyle Moore": ["Q1795054", "Q6451311"]}, "date": "2012-10-16", "url": "http://aol.sportingnews.com/nfl/story/2012-10-16/buffalo-bills-shawne-merriman-nfl-stats-week-7-fantasy-defense", "content": "orchard park, n.y.-the buffalo bills made an interesting move to boost their pass rush monday, re-signing defensive end shawne merriman. he will provide depth behind starters mario williams, chris kelsay and <mark>kyle moore</mark>, the guy who beat him out for a job in training camp. shawne merriman should help boost buffalo's pass rush, which has been hampered due to injuries. (ap photo) \"you can never have too many guys that we believe can rush the passer,\" coach chan gailey said about re-signing merriman, who was released aug. 20. \"with mark [anderson] being out and spencer [johnson], who was kind of our swing guy being out we can't go into a game with just three defensive ends. so we signed shawne back and hopefully he gives us some pass rush off the edge .\" merriman spent the past two seasons in buffalo, but played in just five games. he had surgery on his achilles' in the offseason, and looked to be making decent progress in training camp. the bills, though, felt <mark>moore</mark> provided a better option. despite his name recognition, merriman had no trouble accepting a reserve role and fit in well in the locker room. he'll never be the \"lights out\" star he was in san diego, but merriman should provide a positive veteran influence on the defense. line movement: the bills could be on the verge of getting right guard kraig urbik back into the lineup. he hopes to practice wednesday and his return would be a solid boost for the offense. before hurting his ankle in week 4, urbik had become a dependable presence up front."}, {"articleID": "2017032310_00423393_W", "names": {"Keith Palmer": ["Q1738074", "Q1776781", "Q19276832", "Q19876817", "Q30333381", "Q46585611"]}, "date": "2017-03-23", "url": "http://www.walesonline.co.uk/news/uk-news/london-terror-attack-theresa-tells-12784935", "content": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email Prime Minister Theresa May has given a statement to MPs, saying killed PC <mark>Keith Palmer</mark> was \"every inch a hero and his actions will never be forgotten\". She told the House of Commons that Parliament was sending out the message following Wednesday's attack: \"We will never waver in the face of terrorism .\" The Prime Minister addressed MPs as they gathered at the usual time inside the Palace of Westminster, which a day before had come under attack from a knife-wielding terrorist. She says millions will be boarding trains and planes to come to London and \"see for themselves the greatest city on earth\". \"Our values will prevail and I commend this statement to the House .\" Mrs May told MPs: \"Yesterday an act of terrorism tried to silence our democracy, but today we meet as normal, as generations have done before us and as future generations will continue to do, to deliver a simple message:\" We are not afraid and our resolve will never waver in the face of terrorism'. \"She said it was still believed that the attacker acted alone and there was\" no reason to believe \"further attacks on the public were planned. She added:\" His identity is known to the police and MI5 and when operational considerations allow, he will be publicly identified. Read More London terror attack latest: Everything we know so far \"What I can confirm is that the man was British-born and that some years ago he was once investigated by MI5 in relation to concerns about violent extremism .\" He was a peripheral figure. The case is historic. He was not part of the current intelligence picture. \"There was no prior intelligence of his intent or of the plot .\" Mrs May concluded her statement by saying: \"Our values will prevail .\" An hour before MPs had stood for a minute's silence in honour of the innocent people killed in the attack, Mrs May delivered a statement with details of the atrocity. Read More London terror attack: Victim named as mum of two who was collecting her children from school Read More London terror attack Live updates MP claims bomb was found in 4x4 Victim was mum of two MP filmed as he ran through Westminster MPs speak of \"frightening' atmosphere Reporter describes scenes James Corden pays tribute What we know so far"}, {"articleID": "2019021417_00600016_W", "names": {"Jeff White": ["Q13461839", "Q56479027", "Q6175258"], "Peter Cooper": ["Q2075218", "Q22003710", "Q39078607", "Q7173381"]}, "date": "2019-02-13", "url": "https://www.nashville.com/flamekeeper-the-michael-cleveland-story-premieres-at-hof/", "content": "L-R Cortlandt Ingram, John Presley, Michael Cleveland, Sam Bush, Ricky Skaggs, Bela Fleck. Photo by Peyton Hogue Flamekeeper: The Michael Cleveland Story Premieres At HOF Jerry Holthouse 18 hours ago Nashville Music Scene w / Jerry Holthouse Leave a comment 84 Views Last night, the stirring biographical documentary, Flamekeeper: The Michael Cleveland Story, premiered at the Country Music Hall of Fame and Museum. The film tells the story of Michael Cleveland, an iconic and sought-after fiddle player who has overcome great personal hardship to become one of Bluegrass music's most revered instrumentalists. Cleveland is the International Bluegrass Music Association's 11-time, most-awarded, Fiddle Player of the Year, and he has won Instrumental Recorded Performance of the Year six times. Cleveland also fronts the 5-time Instrumental Group of the Year, Michael Cleveland & Flamekeeper, which he founded in 2006. Cleveland was born blind and with a cleft palate, and in early childhood lost 80% of the hearing in his left ear. In spite of physical challenges, he undertook a musical career undeterred and has ascended to the highest possible echelons of his genre. Director John Presley brings his expert eye and heart for storytelling to the project. The film, while visually engaging, was also designed with Cleveland himself in mind. \"I learned that our visually impaired friends see the world in an entirely different way,\" says Presley. \"One of my goals was to create a film that Michael would be able to experience and enjoy through sound alone .\" Years of commercial and short film work, along with his experience as a musician, led the director on a journey to uncover how Cleveland became the artist--and person--he is today. \"I have felt deeply honored to tell his inspirational story and present his talent to new audiences around the world,\" says Presley. \"When I was first approached about the idea of a documentary film about me, I was definitely surprised, and it still seems so surreal,\" adds Cleveland. \"For as long as I've been playing music professionally, I have made it a point to keep the focus on the music and not the fact that I am visually impaired. I decided that if I was going to have a career in music, I wanted to make it on my abilities as a musician and not the fact that I was blind. After I talked to John and took a few days to think it over and run it by my family and the rest of the Flamekeeper team, I realized that this could be an inspiration to some young kid somewhere with a dream that looks as impossible as it seemed to me when I was growing up and dreaming of a career in music .\" Flamekeeper features interviews with 14-time Grammy Award winner Bela Fleck and 21-time Grammy Award winner Vince Gill, who says of Cleveland, \"It's wicked to see how much music he pulls out of a bow--He's untouchable .\" Also appearing in the film are such music notables as Sam Bush, Jens Kruger, <mark>Jeff White</mark>, the Bibelhauser Brothers and Andy Statman. The evening was hosted by the Country Music Hall of Fame and Museum's <mark>Peter Cooper</mark> and was attended by a who's who of bluegrass icons including Fleck, Bush, Gill, Ricky Skaggs, The Whites, <mark>Jeff White</mark>, Becky Buller, and others. Flamekeeper was produced by Validate Films and is Presley's first feature-length documentary film. Presley was joined on the project by co-producer Cortlandt Ingram, a familiar name in the bluegrass world. After winning over one hundred fiddle contests early in his career, Ingram founded a company providing audio and lighting resources for events across the nation. Ingram's knowledge of the bluegrass genre was an invaluable asset to the film's production. Flamekeeper will be released globally to audiences online through Amazon and other streaming platforms on March 1. For more information visit FlamekeeperFilm.com. Share Tweet"}]