[{"articleID": "2013032717_00039196_W", "names": {"Anthony Kennedy": ["Q11171", "Q59192346"], "Paul Clement": ["Q1356377", "Q15708728"], "Charles Cooper": ["Q22001750", "Q2667506", "Q30093089", "Q5079333"]}, "date": "2013-03-27", "url": "http://posttrib.suntimes.com/news/19120697-418/5-supreme-court-justices-appear-skeptical-of-marriage-definition.html", "content": "washington - the supreme court is indicating it could strike down the law that prevents legally married gay couples from receiving a range of federal benefits that go to married people. justice <mark>anthony kennedy</mark>, often the decisive vote in close cases, joined the four more liberal justices wednesday in raising questions about the provision of the federal defense of marriage act that is being challenged at the supreme court. <mark>kennedy</mark> said the law appears to intrude on the power of states that have chosen to recognize same-sex marriages. other justices said the law creates what justice ruth bader ginsburg called two classes of marriage, full and \"skim-milk marriage.\" <mark>kennedy</mark>'s comment came as other conservative justices on the court seemed skeptical about whether they should even proceed with the case over a challenge to the defense of marriage act. <mark>kennedy</mark> said there was a \"real risk\" that the challenged statute would conflict with state laws, particularly in income tax cases. the federal law affects a range of benefits available to married couples, including tax breaks, survivor benefits and health insurance for spouses of federal employees. it still is possible the court could dismiss the case for procedural reasons, though that prospect seemed less likely than it did in tuesday's argument over gay marriage in california. the motivation behind the 1996 federal law, passed by large majorities in congress and signed by president bill clinton, was questioned repeatedly by justice elena kagan. she read from a house of representatives report explaining that the reason for the law was \"to express moral disapproval of homosexuality.\" the quote produced an audible reaction in the courtroom. <mark>paul clement</mark>, representing the house republican leadership in defending the law, said the more relevant question is whether congress had \"any rational basis for the statute.\" he supplied one, the federal government's interest in treating same-sex couples the same no matter where they live. <mark>clement</mark> said the government does not want military families \"to resist transfer from west point to fort sill because they're going to lose their benefits.\" the u.s. military academy at west point is in new york, where same-sex marriage is legal, and fort sill is in oklahoma, where gay marriages are not legal. a section of the 1996 defense of marriage act says marriage may only be a relationship between a man and a woman for purposes of federal law, regardless of state laws that allow same-sex marriage. lower federal courts have struck down the measure, and now the justices will consider whether to follow suit. a somewhat smaller crowd gathered outside the court wednesday, mainly gay marriage supporters who held american and rainbow flags. one man wore a rainbow flag as a cape. \"two, four, six, eight, we do not discriminate,\" a group chanted at one point. \"if this isn't the time, when is the time? when does equality come into play?\" asked laura scott, 43, of columbia, md. the doma argument follows tuesday's case over california's ban on same-sex marriage, a case in which the justices indicated they might avoid a major national ruling on whether america's gays and lesbians have a right to marry. even without a significant ruling, the court appeared headed for a resolution that would mean the resumption of gay and lesbian weddings in california. marital status is relevant in more than 1,100 federal laws that include estate taxes, social security survivor benefits and health benefits for federal employees. lawsuits around the country have led four federal district courts and two appeals courts to strike down the law's section 3, which defines marriage. in 2011, the obama administration abandoned its defense of the law but continues to enforce it. house republicans are now defending doma in the courts. same-sex marriage is legal in nine states and the district of columbia. the states are connecticut, iowa, maine, maryland, massachusetts, new hampshire, new york, vermont and washington. it also was legal in california for less than five months in 2008. the justices chose for their review the case of edith windsor, 83, of new york, who sued to challenge a $363,000 federal estate tax bill after her partner of 44 years died in 2009. windsor, who goes by edie, married thea spyer in 2007 in canada after doctors told them that spyer would not live much longer. she suffered from multiple sclerosis for many years. spyer left everything she had to windsor. there is no dispute that if windsor had been married to a man, her estate tax bill would have been zero. the u.s. 2nd circuit court of appeals in new york agreed with a district judge that the provision of doma deprived windsor of the constitutional guarantee of equal protection of the law. like the proposition 8 case from california, windsor's lawsuit could falter on a legal technicality without a definitive ruling from the high court. the house republicans, the obama administration and a lawyer appointed by the court especially to argue the issue were to spend the first 50 minutes wednesday discussing whether the house republican leadership can defend the law in court because the administration decided not to, and whether the administration forfeited its right to participate in the case because it changed its position and now argues that the provision is unconstitutional. if the supreme court finds that it does not have the authority to hear the case, windsor probably would still get her refund because she won in the lower courts. but there would be no definitive decision about the law from the nation's highest court, and it would remain on the books. on tuesday, the justices weighed a fundamental issue: does the constitution require that people be allowed to marry whom they choose, regardless of either partner's gender? the fact that the question was in front of the supreme court at all was startling, given that no state recognized same-sex unions before 2003 and 40 states still don't allow them. but it was clear from the start of the 80-minute argument in a packed courtroom that the justices, including some liberals who seemed open to gay marriage, had doubts about whether they should even be hearing the challenge to california's proposition 8, the state's voter-approved gay marriage ban. justice <mark>anthony kennedy</mark>, the potentially decisive vote on a closely divided court, suggested the justices could dismiss the case with no ruling at all. such an outcome would almost certainly allow gay marriages to resume in california but would have no impact elsewhere. there was no majority apparent for any particular outcome, and many doubts were expressed by justices about the arguments advanced by lawyers for the opponents of gay marriage in california, by the supporters and by the obama administration, which is in favor of same-sex marriage rights. the administration's entry into the case followed president barack obama's declaration of support for gay marriage. on the one hand, <mark>kennedy</mark> acknowledged that same-sex unions had only become legal recently in some states, a point stressed repeatedly by <mark>charles cooper</mark>, the lawyer for the defenders of proposition 8. <mark>cooper</mark> said the court should uphold the ban as a valid expression of the people's will and let the vigorous political debate over gay marriage continue. but <mark>kennedy</mark> pressed him also to address the interests of the estimated 40,000 children in california who have same-sex parents. \"they want their parents to have full recognition and full status,\" <mark>kennedy</mark> said. \"the voice of those children is important in this case, don't you think?\" yet when theodore olson, the lawyer for two same-sex couples, urged the court to support such marriage rights everywhere, <mark>kennedy</mark> feared such a ruling would push the court into \"uncharted waters.\" olson said the court similarly ventured into the unknown in 1967 when it struck down bans on interracial marriage in 16 states. <mark>kennedy</mark> challenged the accuracy of that comment: he noted that other countries had had interracial marriages for hundreds of years. the justice also made clear he did not like the rationale of the federal appeals court that struck down proposition 8, even though it cited earlier opinions in favor of gay rights that <mark>kennedy</mark> had written. that appeals court ruling applied only to california, where same-sex couples briefly had the right to marry before the state's voters in november 2008 adopted proposition 8, a constitutional amendment that defined marriage as the union of a man and a woman."}, {"articleID": "2011050413_00100194_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2011-05-04", "url": "http://business-standard.com/india/news/inflation-fight-may-keep-gdp-growth-around-85-pranab/134039/on", "content": "inflation fight may keep gdp growth around 8.5%: pranab india's fight against inflation could knock about half a percentage point off economic growth in asia's third-largest economy this fiscal year, finance minister pranab mukherjee said on wednesday, a day after the reserve bank of india (rbi) raised rates. the rbi stepped up its fight against rising prices on tuesday, raising interest rates by a bigger-than-expected 50 basis points and vowing to battle price pressures even at the cost of some economic growth. the government had been expecting economic growth this year of 8.75% to 9.25%, mukherjee said. india is not alone in facing up to the reality that gdp growth is likely to be dented in the battle against inflationary pressures that have been building in asia as the region leads the global recovery. vietnam, which has the highest inflation among the main asian economies, signalled on tuesday that the government had lowered its expectations for economic growth because it was focusing on reining in prices. mukherjee, in hanoi for the asian development bank's annual meeting, said it was too early to tell if further measures would be needed to check inflation. \"we have already taken steps. i do hope it will have its impact,\" he said. more tightening may be taken \"if it is needed\" , he said, adding \"i can't predict right now.\" the rbi has been among the most aggressive central banks anywhere with nine rate rises since march 2010, but its gradual policy tightening has failed to cool inflation initially driven by high food and fuel prices, and more recently by demand pressures. slower economic growth would be another political headache for prime minister <mark>manmohan singh</mark>. his government is counting on growth of 9% to help fund increased social spending and keep the fiscal deficit in check. the target is in excess of most private forecasts and the central bank's expectation for growth of about 8%, which assumes a normal summer monsoon and global crude oil prices of $110 a barrel. the economy grew by an estimated 8.6% in the fiscal year that ended in march 2011. grow your wealth, interpret markets better. smartinvestor plus e-zine @ less than 60 paise a day the sensex finally ended at 18,469, lower by 65 points and the nifty ended at 5,537 lower by 28 points?"}, {"articleID": "2011052319_00065238_W", "names": {"Sofia Vergara": ["Q231911", "Q28111741"]}, "date": "2011-05-22", "url": "http://wonderwall.msn.com/tv/ashton-kutcher-only-contracted-to-do-25-men-for-10-year-1620085.story", "content": "ashton kutcher's contract to star in \"two and a half men\" is surprisingly only for a single year. that's what sources with inside knowledge of the deal told the wall street journal. warner bros. television also has only a one-year deal with cbs to continue producing the show. despite its status as the most popular sitcom on tv, \"two and a half men'\" s recent troubles with former star charlie sheen seem to have everyone a bit on edge on how the audience will respond to a revamped series and kutcher. it also gives kutcher, who is reportedly being paid $20 million for the season, the right to walk away after a year even if the show is renewed and warner bros. wants to keep him. if all goes well, expect to see the show which also stars jon cryer and angus t. jones, to remain on cbs through 2013. done deal! ashton kutcher in, charlie sheen out on \"two and a half men' exclusive video: charlie sheen takes radar for tour of his\" sober bar' britney spears, rihanna and more stars at the billboard music awards in las vegas. jessica simpson and her fiance step out in new york, fergie catches a flight and more celebs out and about. russell brand was deported from japan on saturday. read story \"lost\" star evangeline lily welcomes a son. read story? kim kardashian, demi lovato and more celebs tweet about the rapture. dr. drew asserts that jeff conaway's coma stems from pneumonia and sepsis, not an od. michael buble and his wife celebrate their love with a third wedding in vancouver. get the scoop on sara rue's weekend wedding...read story costs are piling up for nick lachey and vanessa minnillo's upcoming wedding. kelly ripa talks party planning and analyzes the authenticity of \"the real housewives of new jersey.\" we dish out advice for teresa giudice and more \"housewives\" stars. jen's decade of hotness and more on may 20's 7 wonders hosted by brian mcfayden. ginnifer goodwin splits with her fiance. read story? mila jovovich, brangelina and more a-listers grace the cannes film festival. pink takes on selena over a horse of a different color; plus, katy vs. carnations and lots more gossip! jeff conaway remains comatose in an encino hospital after a possible drug overdose. kim kardashian collaborates with opi on a nail polish line, plus more star shilling. <mark>sofia vergara</mark> parties in new york, plus more of your favorite celebs this week in photos. rosario dawson splits from her french dj boyfriend. read story check out the best of pippa middleton's fashion choices over the years!"}, {"articleID": "2014090423_00006035_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "Stephen King": ["Q25183273", "Q27983592", "Q2832846", "Q39829", "Q7609688", "Q7609689", "Q7609690"]}, "date": "2014-09-04", "url": "http://www.eurweb.com/2014/09/finding-your-roots-2-returns-with-courtney-b-vances-dads-side/", "content": "(L-R) Actor Courtney B. Vance, Actress/Playwright Anna Deavere Smith, Recording artist Nas, Actress Khandi Alexander, and Executive Producer, Writer and Presenter Henry Louis Gates, Jr. speak onstage at the \"Finding Your Roots 2' panel during the PBS Networks portion of the 2014 Summer Television Critics Association at The <mark>Beverly</mark> Hilton Hotel on July 23, 2014 in <mark>Beverly Hills</mark>, California * You know you have a complicated family history when ancestry.com's help line tells you,\" We can't help you. \"This is what actor Courtney B. Vance says he was told verbatim when he went to the popular genealogy website for help in researching his dad's side of the family. Luckily for Vance, Dr. Henry Louis Gates, Jr. and his trusty DNA kit was available. The Harvard professor is back on PBS this month with Vance and 28 other celebs for\" Finding Your Roots 2. \"The season premiere will find Vance, author <mark>Stephen King</mark> and actress Gloria Reuben all exploring the mysteries of their paternal ancestry. Vance's story is particularly complicated because his dad, Conroy Vance, was a foster child who never discussed his biological father.\" I've been looking for my dad's side of the family for a long time, \"he told the TCA Summer Press Tour.\" My dad would never talk about him, my mom didn't even know anything about him. \"Growing up, my dad and my mom were there for my sister and I. We were a tight, tight family, and for us not to know anything about him, there were certain things we just didn't talk about with Daddy. It's just family. Family is funny, and so it was not an unnatural thing for me growing up not to know anything about my dad or about the Vance side of our family.\" Vance has expressed endless gratitude toward Dr. Gates for tacking his father's branch of the family tree for the series. The actor, who just finished a run on Showtime's \"Masters of Sex,\" explains how he was literally turned away by ancestry.com when he first attempted to track down his father's lineage. \"Finding Your Roots 2\" will feature 29 celebrities from sports, music, film, television, theatre, and literature, airing Tuesdays, Sept. 23 through Nov. 25 at 8 p.m. ET. \"Finding Your Roots': Marsalis Reflects; Why Alicia Keys Pulled Out"}, {"articleID": "2019011219_00105352_W", "names": {"Ben Foster": ["Q10585", "Q2895425", "Q311804", "Q4885664"], "James Tomkins": ["Q1681200", "Q1681210"]}, "date": "2019-01-12", "url": "http://www.wirralglobe.co.uk/sport/national/17354137.hodgson-hurting-after-palace-pipped-by-watford/", "content": "Crystal Palace v Grimsby Town--Emirates FA Cup--Third Round--Selhurst Park 0 comments Roy Hodgson rued Crystal Palace's missed opportunities after Watford fought from behind to secure a 2-1 victory at Selhurst Park. Hornets defender Craig Cathcart scored at either end, before Tom Cleverley sealed all three points for the visitors with a fine volley just six minutes after coming on as a substitute. The win moved Watford back above West Ham in the table, after their earlier victory against Arsenal. Palace they will be looking over their shoulder once more despite heading into Saturday's fixture hoping for a third consecutive win. \"Of course it hurts,\" said Hodgson. \"It is tough to lose any game, tough to lose at home, and it is even tougher because we have done well lately.\" I hoped this would provide the chance to get that elusive third consecutive victory to lift us to a more comfortable place in the table, and I am feeling very sad that we couldn't do it. \"But, if you want to win games, you need to take the chances that come your way.\" Cathcart's own goal, following a goalmouth scramble, afforded Palace the lead heading into the interval, and the hosts had chances to put the game to bed. Wilfried Zaha, who now has not scored or laid on an assist in 13 matches, was probably the most culpable, after hitting <mark>Ben Foster</mark>'s out-stretched leg, and then blazing high and wide after neat footwork in Watford's box early on in the second period. Palace's scoring troubles are well-documented, with just six goals to their name at home this season, and only four from open play. \"We started the second half brightly, and we had the opportunities to increase our lead which would have made life very difficult for Watford, but we were not as effective as them,\" Hodgson added. Watford stemmed Palace's speedy second-half start and were back on level terms after 67 minutes when Cathcart made amends for putting through his own net after leaping above <mark>James Tomkins</mark> and heading home Jose Holebas' corner. Seconds later, Cleverley was introduced, and within six minutes the game turned on its head following his fine volley. The former Manchester United and Everton midfielder has only recently returned from a near year-long injury lay-off. His appearance here at Selhurst Park was just his fourth in the Premier League this season. Watford have now won 16 points away from Vicarage Road which is a greater haul than they managed on the road throughout the entirety of their last campaign. \"I am proud of all my players, not only for today but other games where we have competed well, with good and bad results, but always kept a good level,\" said boss Javi Gracia. \"After the own goal it was more difficult for us, but in that moment the team showed character, ambition.\" Tom scored an amazing goal, and to be able to turn the result around was important. \"0 comments"}, {"articleID": "2016072717_01022652_W", "names": {"Carl Wilson": ["Q19360696", "Q28873143", "Q29033805", "Q5040973"], "Steve Hayes": ["Q16193141", "Q31381382", "Q7612798", "Q7612799", "Q767363"]}, "date": "2016-07-27", "url": "http://portsmouth-dailytimes.com/news/9483/2500-raised-for-animals-in-need", "content": "Musician Henry Gross, an animal-lover and no stranger to heartache, teamed up with Sierra's Haven to put on the \"Cause for Paws' concert held last Thursday. Last Thursday, July 21, music-lovers and animal aficionados gathered for a concert at Port City Cafe and Pub to support Sierra's Haven for New and Used Pets. The second annual\" Cause for Paws,' concert raised over $2,500 dollars for Sierra's Haven. \"It was a really great evening,\" said Shawnee Animal Clinic's Dr. Gail Counts. \"We sold over 70 tickets and overall it was a great night.\" The shelter was founded in memory of Counts' brother Bernie. Bernie Counts, Jr. was the brother of Dr. Gail Counts, who serves as the President and Executive Director of Sierra's Haven. He died at the age of 42 of a heart attack. Sierra, his cat, stayed by his side until he was found by a neighbor. Sierra has since passed away, but both Sierra's and Bernie's memories will live forever in the work being done at Sierra's Haven. The concert, was a performance by Henry Gross, an American singer-songwriter best known for his association with the group Sha Na Na and for his hit song, Shannon. In 1976 when Shannon was climbing the charts, few knew that Gross was singing from a broken heart. The power ballad that sold a million records and was a top 10 hit, was about the death of Beach Boys member <mark>Carl Wilson</mark>'s Irish Setter and the pain we all feel after losing a pet. \"Henry did an amazing job and everyone really enjoyed the show,\" explained Counts. \"This was the second year we've done the show and we're going to make it an annual event. It just continues to grow every year. We're really grateful to Henry for agreeing to do this and to <mark>Steve Hayes</mark> for helping promote and organize the concert. We're also so glad that Port City provides us with a space to do this as well as the food and the drinks for the evening. And of course, we're grateful for the continual support of the community.\" Sierra's Haven is a no-kill animal shelter, staffed by a dedicated group of volunteers working together to help find safe, loving homes for adoptable pets. Whether strays, drop - offs or animals in need of medical attention, Sierra's has opened their doors to thousands of animals and saving their lives. For more information, you can visit Sierra's Haven wesbite at www.sierrashaven.org, and on Facebook \"Sierra's Haven for New and Used Pets.\" Musician Henry Gross, an animal-lover and no stranger to heartache, teamed up with Sierra's Haven to put on the \"Cause for Paws' concert held last Thursday. http: //portsmouth-dailytimes.com/wp-content/uploads/2016/07/web1_Henry-Gross-RECAP.jpgMusician Henry Gross, an animal-lover and no stranger to heartache, teamed up with Sierra's Haven to put on the\" Cause for Paws' concert held last Thursday. By Ciara Conley [email protected] Reach Ciara Conley at 740-353-3101 ext. 1932, Facebook \"Ciara Conley--Daily Times,\" and Twitter @ PDT_Ciara Portsmouth Daily Times Reach Ciara Conley at 740-353-3101 ext. 1932, Facebook \"Ciara Conley - Daily Times,\" and Twitter @ PDT_Ciara Please enable JavaScript to view the comments powered by Disqus. comments powered by Disqus"}, {"articleID": "2020011711_00164349_W", "names": {"Robert Shapiro": ["Q446561", "Q7349716", "Q7349717"]}, "date": "2020-01-17", "url": "http://www.squamishchief.com/oops-radio-reporter-calls-wrong-robert-shapiro-on-air-1.24055024", "content": "LONDON--Will the real <mark>Robert Shapiro</mark> please take the microphone? BBC radio presenter Evan Davis was left in an embarrassing situation Thursday while introducing a segment on a proposal to allow cameras to record sentencing remarks in U.K. courts. article continues below Trending Stories UPDATED: Quest University granted financial protection Province seeking to seize properties associated with Squamish cannabis dispensary Squamish police briefs Former executive vice-president sues Quest University During a live telephone interview on \"PM,\" an evening public affairs program, Evans thought producers had called <mark>Robert Shapiro</mark>, a Los Angeles-based attorney who represented ex-football star O.J. Simpson in one of the most famous televised trials in U.S. history. Instead, Davis found himself speaking to another American with the same name but made his mark by advising Presidents Bill Clinton and Barack Obama on economic policy. A round of giggles could be heard in the background as the man was wrongly introduced as the lawyer who in 1995 was part of the team that successfully defended Simpson during his murder trial. Davis said: \"<mark>Robert Shapiro</mark>, I am fascinated in what you think about these rather tentative steps that have been taken here to show court on television and whether we are moving on the right track.\" An amused <mark>Shapiro</mark> replied: \"First of all, it's an honour to be on with Lord (Jonathan) Sumption. Second, let me say that I am <mark>Robert Shapiro</mark>, an adviser to Democratic presidents, not the lawyer. You called the wrong <mark>Robert Shapiro</mark>.\" Sumption is a former senior judge. Davis said: \"Oh my goodness, what a mistake we made. You are obviously in our Rolodex. I am surprised we didn't pick that up in the pre-conversation.\" \"I am surprised too,\" <mark>Shapiro</mark> said. Despite the blunder, <mark>Shapiro</mark> knew something about the topic, and was able to provide his views on the new draft laws. Read Related Topics"}, {"articleID": "2018010103_00546051_W", "names": {"Dennis Morris": ["Q5258762", "Q5258763"]}, "date": "2017-12-31", "url": "http://pittsburgh.cbslocal.com/2017/12/31/browns-steelers-game-frigid-temperatures/", "content": "Follow KDKA-TV: Facebook | Twitter PITTSBURGH (KDKA)--Emergency crews treated three people for weather-related problems as football fans braved the cold to attend Sunday's game at Heinz Field. Pittsburgh Steelers fans were determined not to let the cold weather put a damper on Game Day. \"I live out of town now for work, so I take every chance I get to go to a Steeler game,\" one fan said. \"I'm a little cold, but not too cold.\" Temperatures were in the teens with a near-zero wind chill factor. \"It's pretty chilly, but it's kinda nice. We like it,\" Sequoia Bauerle, of Anaheim, Calif., said. \"It's a big change. Big change. We're about an 80 degree difference right now, so big change,\" Sierra Roumimper, of Anaheim, Calif., said. Tailgaters came prepared. \"I think I have four shirts, two pairs of pants, hunting socks...It's not my first time,\" one fan said. \"It's three layers. Normal routine that we go through every cold game at home,\" another fan said. A group of tailgaters kept warm by a fire. One man didn't even wear boots, opting for flip-flops and shorts instead. \"You ask anybody that sits in my section, I never wear shoes,\" Steeler fan <mark>Dennis Morris</mark> said. Overall 21 people were checked out by EMTs for non-weather-related problems. Ten people were taken to the hospital."}, {"articleID": "2020032322_00087447_W", "names": {"Jim Henry": ["Q10457811", "Q39069871", "Q6195554", "Q6195556", "Q6195559", "Q6195561"]}, "date": "2020-03-24", "url": "https://www.news-mail.com.au/news/chilean-backpacker-stabbing-case-set-to-go-to-tria/3979601/", "content": "Chilean filmmaker Constanza (Kuki) Escudero, 26, was allegedly stabbed in a Cairns backpackers hostel. News Chilean backpacker stabbing case set to go to trial by Grace Mason 24th Mar 2020 7:16 AM premium_icon Subscriber only 0 PROSECUTORS have rejected a submission to reduce a charge against a man accused of trying to kill a Chilean backpacker at a Cairns hostel. Northern Territory man Raynard Gregory Moodoonuthi, 36, is accused of stabbing 26-year-old tourist Constanza \"Kuki\" Escudero in the neck at a Bunda St hostel in August last year, leaving her millimetres from death. She was just days into a dream Australian holiday. Defence barrister Tim Graw told the court last month he had made a submission to the Department of Public Prosecutions to have the charge dropped from attempted murder to grievous bodily harm in exchange for a guilty plea. The Cairns Supreme Court heard yesterday the DPP had rejected that offer and the matter would proceed to trial. Mr Graw said given the \"current circumstances\" with the impact of the coronavirus on court proceedings, it would be difficult to set a trial date at the moment. Crown prosecutor Eddie Coker said if found guilty, they would be submitting for a lengthy prison sentence and a serious violent offender declaration. \"So he is not in any danger this year of serving too much time,\" he said. Justice <mark>Jim Henry</mark> adjourned the matter for a mention on June 2. Ms Escudero returned to Chile soon after the alleged attack and continues to undergo medical treatment. Originally published as Chilean backpacker stabbing case set to go to trial More Stories premium_icon Chilean backpacker stab accused offers plea to lesser charge premium_icon Father's emotional tribute after hostel stabbing Support builds for Chilean stab victim More Stories premium_icon Chilean backpacker stab accused offers plea to lesser charge premium_icon Father's emotional tribute after hostel stabbing Support builds for Chilean stab victim 0 attempted murder Read More Login to follow backpacker Read More Login to follow case Read More Login to follow chile Read More Login to follow trial Read More Login to follow attempted murder backpacker case chile trial"}, {"articleID": "2011071706_00071610_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2011-07-16", "url": "http://dailyrecord.co.uk/showbiz/celebrity-news/2011/07/17/cheryl-cole-devastated-after-fresh-claims-ashley-cole-cheated-on-her-86908-23277313/", "content": "cheryl cole devastated after fresh claims ashley cole cheated on her cheryl cole ashley cole image 1 cheryl cole's reunion with love rat ashley was in the balance last night after he was accused of cheating with other women while trying to woo her back. the a-list couple shocked family, friends and fans by getting back together just months after their divorce was finalised. but reports last night claimed three women were preparing to kiss and tell on flings with the chelsea defender around the time he was trying to win back cheryl. pr guru max clifford said all the women had contacted him about selling their stories. he said: \"in recent weeks, three girls have been in touch with me claiming to have had recent relationships with ashley cole.\" they will be coming to see me and i'll see if there is any evidence to back up these allegations. \"one of the women is understood to be a 29-year-old air hostess. it is thought she has claimed to have spent the night with cole, 30, a few weeks ago at a mansion in <mark>beverly hills</mark>. cole was on holiday in la before flying to london to attend cheryl's 28th birthday party on july 1. at the bash, she threw her arms around him before performing a sexy dance. the public display of affection was seen as a clear sign that they were an item again. a source close to the air hostess said:\" she was with ashley a few times, the most recent was just a couple of weeks ago. another pal said: \"she had no idea ashley was in the process of getting back with cheryl and was horrified when she found out.\" she would never have gone near him had she known. \"the other girls are believed to be bikini models cole met in la. it's sex o'clock and we've got a picture of something absolutely humungous to show you...10 women, 10 great outfits and emma watson who has put the broomstick down and picked the louboutins up imogen thomas in acting class shock and more celebrity twitter twaddle harry redknapp: transfer request from luka modric changes nothing - we don't want to lose him cheryl cole didn't want a divorce from ashley says black eyed peas star fergie which rangers star has struck up a romance with playboy bunny kayla collins?"}]