[{"articleID": "2018042400_00243502_W", "names": {"Mark Saunders": ["Q20006905", "Q4428797", "Q56724352", "Q6769597"]}, "date": "2018-04-24", "url": "http://www.nationalobserver.com/2018/04/23/news/richmond-hill-resident-bombarded-calls-after-media-and-police-misidentify-him", "content": "Sign up for your daily dose of news and inspiration. Email Address * I'm already signed up. Richmond Hill resident bombarded by calls after media and police misidentify him as Toronto van attack suspect Previous story \"Not me. No connection,\" Richmond Hill resident Alex Minassian angrily posted on Facebook, as media started to bombard him with messages after mistaking him for Alek Minassian--the alleged suspect who killed 9 in Toronto by ramming a van into pedestrians on Yonge Street. \"NBC, ABC, CBC, stop harassing my friends and family.\" Minassian said he'd been contacted by numerous media outlets, and had his name and information linked by a number of media outlets, after he was misidentified by media as the suspect. Toronto Police tried to clarify with a tweet: The correct spelling of the arrested male in the Yonge And Finch incident is Alek Minassian, 25 of Richmond Hill. ^ sm--Toronto Police (@ TorontoPolice) April 24, 2018 But earlier in the day, it too had misidentified the name as \"Alex\" instead of \"Alek,\" causing confusion. It later tweeted the correct spelling. Toronto Police Service Chief <mark>Mark Saunders</mark> is updating media. It can be watched #LiveNow at media link below. Arrested male is Alex MINASSIAN, 25 of Richmond Hill ^ sm https: //t.co/EKnAD8MfuC--Toronto Police (@ TorontoPolice) April 24, 2018 \"I am not the person who committed these acts,\" he told National Observer. \"My name and accounts were linked and shared across a variety of online platforms, and while I carry no ill-will towards these people, I hope they use this as a lesson before spreading fake news again. The actual suspect is in custody.\" He added, \"\"I'd also like to note that I don't consider myself a victim in any way. The real victims are the victims of this tragedy.\" "}, {"articleID": "2014060414_00051858_W", "names": {"Big Ben": ["Q2902145", "Q295364", "Q537679", "Q599161", "Q657876"]}, "date": "2014-06-04", "url": "http://www.telegraph.co.uk/news/uknews/queen-elizabeth-II/10873294/Queens-Speech-a-timeless-new-coach-only-eight-years-too-late.html", "content": "Queen's Speech: a timeless new coach, only eight years too late Tom Rowley, and Jonathan Pearlman in Sydney 7:00 AM BST 04 Jun 2014 div class = \"bylineSocialButtons\" > Weighing three tons and at a cost of millions of pounds, it is Queen's latest 80th birthday present. But when she steps into her new state coach for the first time on Wednesday, for the procession to the state opening of Parliament, she could be forgiven for raising an eyebrow at its arrival, eight years too late. The coach, now named after the Diamond Jubilee only two years ago, is an extraordinary gift from a 64-year-old Australian craftsman who once spent three years looking after the Queen's horses. Jim Frecklington, an ardent royalist who grew up on an outback sheep farm, has spent the last nine years building the coach, mortgaging his house to finance the $5M (£ 2.7 m) project. Gold inlaid carriage which may carry Prince William to wedding completed for the Queen At 18ft (5m) long and 11ft (3m) high, it is only the second coach to be built for the royal family in the last century. And Mr Frecklington has not wasted the opportunity, creating a \"time capsule of British history\" on wheels. More than 100 fragments from historic British buildings have been incorporated into the bodywork, including wood from the Mary Rose, Henry VIII's flagship, and a piece of a doorway from 10 Downing Street that dates back to 1760. The armrests were crafted from the Royal Yacht Britannia's handrails and the crown that sits atop the roof was carved using oak from HMS Victory, Admiral Nelson's ship. There is apple wood from Woolsthorpe Manor, the birthplace of Sir Isaac Newton, and timber from Sir Ernest Shackleton's Antarctic base. Mr Frecklington built his first cart at the age of eight when a stubborn Shetland pony refused to be ridden on the family farm. Building carriages quickly grew to become an obsession. Interior view of the Diamond Jubilee State Coach (© HM QUEEN ELIZABETH II) In 1972, he moved to Britain and joined the Royal Household, initially looking after the Duke of Edinburgh's horses at Windsor Castle. Later, he tended to the Queen's show horses at Buckingham Palace, driving carriages on ceremonial occasions and serving as an outrider at Royal Ascot. Three years later, he moved back to Australia, but maintained his royal connections. He took two royal coaches across the country during the Queen's Silver Jubilee exhibition in 1977. \"People would often ask\" does anyone make coaches any more?' \"he said.\" The art of making coaches was lost as the men who made them had all gone into making bodies for motor vehicles. \"Mr Frecklington was determined to change that. So, in 1988, the Queen gave him his blessing to make his first royal carriage, the Australian State Coach. It was given by Australia to mark the country's bicentenary and has been used by the Queen for previous state openings of Parliament. As a token of her gratitude, Mr Frecklington was awarded the Medal of the Order of Australia. That first coach took just 11 months to finish, but this one has taken rather longer. Because it is his own\" private initiative \"rather than a palace commission, Mr Frecklington has found it difficult to finance the coach's construction. The Australian government gave him a $250,000 (£ 138,000) grant, but turned down a subsequent request for a further $5m. Mr Frecklington was undeterred, and instead mortgaged his house and persuaded some of the 50 craftsmen to work on the project as a favour. Brass plaques commemorate famous people, events, and feats of engineering accross the ages (© HM QUEEN ELIZABETH II) David Flint, a friend and fellow Australian monarchist, said Mr Frecklington had taken a\" substantial risk \", but was\" driven \"to complete the coach by his\" tremendous respect for the monarchy \".\" This has been a monumental project that he has undertaken, \"said Prof Flint.\" He took a risk, which involved a considerable amount of money. I think it was several million [Australian dollars]. I understand he did mortgage his place for it. \"He has a very fine sense of what is beautiful and appropriate, and a spectacular way of bringing together craftsmen. He has a tremendous respect for the monarchy.\" He likes the sense that there is something tangible which represents history and tradition and is also something that is practical and beautiful. \"The coach has now been purchased by the Royal Collection Trust, which will put it on public display in the Royal Mews at Buckingham Palace from Sunday. A spokesman refused to disclose how much they paid for it, and whether Mr Frecklington remains out of pocket. But Mr Frecklington has said he regards his endeavours as\" money well spent \"and\" good value \". He has travelled to London and will watch his coach take to a public road for the first time on Wednesday. For the past nine years, it has sat in his workshop, a former army barracks in a Sydney suburb. From his workshop, he arranged for the four lamps, with crystal panels, to be hand-blown and cut in Edinburgh and for 260 sapphires and 48 diamonds to be fitted into the door handles. The door panels are inlaid with timber from dozens of historically significant buildings, including St Paul's Cathedral, the Tower of London, Eton, and Oxford and Cambridge universities. There is also timber from Althorp, the final resting place of Diana, the Princess of Wales, the old royal box at Ascot, and from the Ferriby Boat, which dates back 3,800 years. The bodywork features a calibration penny used to fine-tune <mark>Big Ben</mark>, a lead musket ball from the Battle of Waterloo and a piece of metal from the casting of the Victoria Cross. A\" tribute case \"contains a fragment from the stone of destiny, used in the coronation ceremony, which was stolen from Westminster Abbey by Scottish nationalists in 1950 and is now kept in Edinburgh Castle. Mr Frecklington sent out hundreds of letters requesting the samples, and he was supported by English Heritage and the royal household's surveyors of the fabric. Aside from a discreet engraving on the wheel, there is no nod to the coach's designer. He is happy instead to celebrate\" one of the greatest monarchs that has ever lived \". British constitutional historians say Spanish king's abdication will have no effect on the Queen People diary: how the Duke of Edinburgh lightened the mood at disability event Malaysia Airlines plane search: British yachtswoman\" saw MH370 on fire' Two 12-year-old girls charged with trying to murder friend to please Internet demon Queen's Speech set to outline pensions reform as Coalition bids to prove it is \"no zombie government' Newark by-election descends into class warfare over candidates' fortunes Sudanese woman sentenced to death gave birth with her legs chained Bowe Bergdahl: a darker story behind the release of America's last prisoner of war Indian court asked to rule on whether Hindu guru dead or meditating Elliot Rodger may have used machetes to murder house-mates in\" killing chamber' Sudanese woman sentenced to death gave birth with her legs chained California drive by shooting: Suspect reportedly \"son of Hunger Games assistant director' Islamic court permits pregnant woman to give birth before she is hanged"}, {"articleID": "2010083018_00079231_W", "names": {"Peter Burns": ["Q17021424", "Q22003517", "Q3376483", "Q47330668", "Q7173072"], "Linda Jackson": ["Q17350666", "Q511699", "Q6551674", "Q6551676"], "Eric Holder": ["Q312644", "Q3591180"]}, "date": "2010-08-30", "url": "http://time.com/time/specials/packages/article/0,28804,2012217_2012252_2014413,00.html?xid=rss-topstories", "content": "half a decade has passed since the levees in new orleans' ninth ward broke, flooding the city and devastating lives. time looks back at the stories that were told there on a humid morning in may, mitch landrieu was sworn in as the 61st mayor of new orleans. in his inaugural address, landrieu, 50, sounded very much like a southern black baptist preacher (he is white and catholic) as he told his city's far-flung post-hurricane katrina diaspora, \"it is time for you to come home.\" the blogs and press made much of the fact that landrieu is the first white mayor elected in more than three decades in new orleans, which remains a majority-black city. the key question remains, can mitch landrieu put new orleans into recovery mode? by many measures, landrieu's new orleans is remarkably different from the city that, five years ago this week, was devastated by hurricane katrina. the city is wealthier, younger and whiter. its population has rebounded to an estimated 355,000, nearly 80% of its pre-katrina level. optimism is pervasive - only partly because the new orleans saints managed to reach the super bowl for the first time in its 43-year history and win. the city has largely evaded the recession and is the epicenter of some of the most audacious urban-renewal projects in america. exhibit a: the robust network of charter and public schools that actually expects students to succeed - and has the tools to help them do so. \"we're building from the ground up and attempting to set the standard for true community renewal in america,\" landrieu told the national press club last week. a trim man with close-cropped hair, landrieu is the scion of a political dynasty. his sister mary is louisiana's senior u.s. senator. his father maurice \"moon\" landrieu, a liberal democrat, was mayor of new orleans from 1970 to 1978 and is widely credited with opening political and business opportunities for the city's black population. that helped lead to a three-decade succession of black mayors, which began with ernest \"dutch\" morial and ended when mitch landrieu succeeded the term-limited ray nagin in may. landrieu had tried to become mayor twice before. in 1994, he ran against morial's son but finished a very distant third. in 2006, he challenged nagin, who defeated him 52% to 48%. this time, landrieu would benefit from two things: first, nagin's disastrous second term. second, the accolades he received in the post-katrina period. as lieutenant governor, landrieu distanced himself from the bumbling performance of governor kathleen babineaux blanco, partly by demanding that the boards that manage the levees surrounding new orleans be dismantled. beyond that, while he never took a memorably hard stance on any controversial issue, he cultivated a reputation as a consensus builder. the february 2010 election was, essentially, a referendum on nagin's regime. \"there was buyer's remorse,\" says political consultant silas lee. landrieu presented himself as a reformer, familiar with obama's washington, able to unite a city that nagin, in his rule-by-bullhorn way, had publicly declared forever \"chocolate,\" a \"majority african-american city...the way god wants it to be.\" indeed, in the days before february's election, the key question about landrieu, says <mark>peter burns</mark>, a loyola university political-science professor and author of electoral politics is not enough: racial and ethnic minorities and urban politics, was, \"can a white man win in new orleans?\" landrieu won decisively, with 66% of the vote. he also captured an estimated 62% of votes cast by african americans. that's attributable to two key factors: first, black voters want the same things - like credible leadership - as the general population. second, black voters, particularly of a certain generation, have a deep sense of loyalty to the landrieu family. \"people have high expectations for mitch,\" <mark>burns</mark> says, \"and he needs to be careful about that.\" to understand landrieu's new orleans, you must remember that, in many ways, it is a tale of two recoveries. the wealthier and whiter lakeview section has largely rebounded. but the lower ninth ward - \"the poster child of katrina,\" as neighborhood activist <mark>linda jackson</mark> describes it - looks much as it did just a few months after the water receded. homes that had been washed onto the street have been demolished. in their place are lots with grass taller than men, giving some blocks an odd, rural vibe. money that had been pledged to help restore the neighborhood hasn't trickled down. crime remains the most vexing problem facing new orleans, according to a recent survey by the kaiser family foundation. it certainly doesn't help that in the same survey only about 13% of respondents said they trust the police to do what's right \"almost always.\" landrieu has asked the u.s. justice department to investigate new orleans' long-troubled police department. the move was widely interpreted as preemptive: federal authorities probably would have launched a probe, especially after several police officers were charged with fatally shooting four men in a chaotic post-katrina incident known as the danziger bridge case. u.s. attorney general <mark>eric holder</mark> went to new orleans in july and made clear that his department \"will not tolerate wrongdoing by those who have sworn to protect the public.\" in the meantime, the new mayor has come in for criticism over some of his appointments. barely a week into his term, the doctor that landrieu appointed as new orleans' acting health director abruptly resigned amid published reports that she allegedly continued to see patients despite having been suspended by louisiana's board of medical examiners. there were complaints when landrieu named his sister-in-law, an attorney, the city's chief of economic development. louisiana's antinepotism rules, however, do not bar the hiring or appointment of a spouse's siblings. one key area landrieu must continue to deal with is education. new orleans, post-katrina, has an often confusing network of charter and public schools that has boosted student performance. it also worked, in part, because katrina removed much of the resistance that is proving to be a barrier to academic innovation in places like detroit. but at some point, there will be a clamor for the mayor to articulate a clear and unified vision for education. and then there's the perpetually vexing matter of race. consider this: new orleans once had a vibrant black political class. now it has a white mayor, who has installed a white police chief, and an elected white district attorney. \"that's like the holy trinity of power in this town,\" says <mark>burns</mark>, the loyola professor. the city council is majority white. new orleans' congressman, serving louisiana's second district, is a vietnamese american. silas lee, a political analyst, struggles to acknowledge the challenges. \"let me be honest,\" says lee, who is african american. \"there's a leadership deficit.\" that's partly attributable to the post-katrina demographic shift (when the percentage of blacks in the city fell from 67% to 59%). but it's also due to the failure of an older generation of blacks to cultivate credible successors. landrieu must deal with that growing sense of disempowerment."}, {"articleID": "2019050921_00267539_W", "names": {"Alex Scott": ["Q434354", "Q43882729", "Q4717762"]}, "date": "2019-05-09", "url": "http://www.leighjournal.co.uk/sport/national/17630451.alex-scott-vows-to-keep-leading-the-way-for-female-pundits-despite-sexist-abuse/", "content": "<mark>Alex Scott</mark> vows to keep leading the way for female pundits despite sexist abuse By Press Association 2019 <mark>Alex Scott</mark> has been the target of sexist abuse on social media 0 comment <mark>Alex Scott</mark> has vowed to continue as the standard-bearer for female football punditry despite receiving persistent sexist abuse on social media. <mark>Scott</mark> has made a successful transition from an England star with 140 caps to a respected voice on the women's and men's game for the BBC and Sky Sports since making her on-screen debut at the 2018 World Cup. But the 34-year-old former Arsenal defender has been forced to work against a backdrop of sexist comments that peak after every weekend appearance in the studio. Im not out here trying 2 be better than any Male/Female. There is room for us all to rise! I'm just trying to be the best \"I' can be in the role I am\" employed' to do. Have fun along the way, learn from people around me, grow/be better! FYI. . back in the studio the weekend, haha?? pic.twitter.com/mkUNrl8AoU--<mark>Alex Scott</mark> MBE (@ AlexScott) February 5, 2019 \"Twitter is there for everyone to see. I think I get it (sexist abuse) every single day now,\" <mark>Scott</mark> said. \"I went through a stage over Christmas when it got hard to handle. At the time I was,\" right, I'm going to come off Twitter and move away from social media'. \"But then I thought that it has been my strong presence on social media that's allowed me to connect with fans and that by coming off Twitter I was allowing them to win.\" So that's when I put out a tweet saying, \"actually, I'm not going anywhere and I'm going to keep doing what I'm doing'. View this post on Instagram Why? Cause they lovin the crew, they loving crew'???? #changethegame @ bbcsport A post shared by <mark>Alex Scott</mark> MBE (@ alexscott2) on May 1, 2019 at 11:33 pm PDT\" What keeps me going is knowing that I'm helping. People are now coming up to me on the street and are saying exactly that...they're watching with their daughter or even their boy. \"Me sitting there being strong enough to give my opinions in the way that I do it is normalising it.\" If that's giving more encouragement to young females in that they can see me and I'm visible and that they can do that, then that's great. \"We'll get to the stage when I'm not regarded as a female pundit, I'm just a pundit. When we get to that point we're getting somewhere.\" The 1st time mum gets to watch you live on @ SkySports but is gutted that @ Arsenal lost...LOVE IT?? #COYG?? ⚪ ️ pic.twitter.com/MMPTS6h7PV--<mark>Alex Scott</mark> MBE (@ AlexScott) February 3, 2019 <mark>Scott</mark>'s supporters on Twitter rushed to her defence following an exchange with Graeme Souness when analysing a match between Manchester United and Leicester in February. Souness interrupted the Londoner and was dismissive of her use of the term \"low block', which means to defend from a deep position.\" Every time I'm on with Graeme I get more comments about that than when I'm with any other pundit, \"<mark>Scott</mark> said.\" Graeme Souness is like that with every pundit he sits alongside, but with me it's highlighted because people see me as a female. <mark>Alex Scott</mark> appears on Sky Sports and the BBC (Mike Egerton/PA) \"If he's got a strong opinion and he disagrees with you, he'll say that. I respect that and want people to be like that with me.\" When people say on Twitter that I'm ticking a box, no I'm not ticking a box...I've done the work and deserve to be there. \"I wouldn't want Graeme Souness to change and be different just because I'm female. Treat me the same as everyone else, and he does.\" One term I used--a low block--he didn't know what that is. Football terminology, like everything else, changes and evolves. \"I can explain why a low block is different to being pegged back or holding a high line. Some people at home didn't know what it is.\" People reacted on Twitter because he's disagreeing with a female and it shouldn't be that way. That's how Graeme is. When the camera is off, he's lovely with me. \"0 comment"}, {"articleID": "2013010212_00094312_W", "names": {"Darren Williams": ["Q5225238", "Q5225239", "Q5225241"], "Harry Dunn": ["Q5668498", "Q59196545"], "David Campbell": ["Q1173915", "Q1173917", "Q15616175", "Q16104405", "Q1747204", "Q18954132", "Q24397525", "Q26398971", "Q3703127", "Q39072522", "Q43910793", "Q5232113", "Q5232115", "Q5232116", "Q5232118", "Q5232121", "Q5232122", "Q55599170"], "Brendan Rodgers": ["Q19973684", "Q310623"]}, "date": "2013-01-02", "url": "http://whitbygazette.co.uk/sport/football/guernsey-boss-daz-the-right-man-1-5269776", "content": "published on wednesday 2 january 2013 12:50 guernsey's national team coach kevin graham has backed <mark>darren williams</mark> to lead whitby town through a successful 2013 and beyond. graham, who played centre-half for town in the northern premier league between april 2000 and november 2002 under <mark>harry dunn</mark>, told the whitby gazette: \"cammy [assistant manager <mark>david campbell</mark>] and <mark>darren</mark> are obviously developing something and hopefully he's the kind of manager graham [manser] will back to build something successful over a longer period of time.\" in the same way that maybe <mark>brendan rodgers</mark> has got a plan at liverpool, i think <mark>darren</mark>'s trying to put something together that will bring sustainable success over a long period of time. \"i think the days are gone when you can just go and spend a load of money and bring players in and just buy success.\" you've got to do it in a sustainable manner. i do hope that people stay patient and back <mark>darren</mark>, as i'm certain he's the right man. \"the channel-islander, who's now living back in yorkshire, has been keeping tabs on his former club this season and would like nothing better than to see them start the new year, as they did 2012.\" i'd love to see the team kick on and put a run together \", graham said.\" just to develop some success on the pitch and to get up that league and maybe start challenging for play-offs. \"if not this year, then certainly next.\" with the club's question and answer forum taking place last night (thursday), graham has a few suggestions to help out off the field. \"you do have to have a family-orientated atmosphere to go forward,\" he said. \"i know there's a lot of hard work that goes into whitby town.\" it's really important that they try and work with schools and community forums to try and bring in the next generation of supporters, stuff every club should look into doing. \"the blues now allow under 16s into the turnbull ground for free, when accompanied by a paying adult and under 18s are admitted for just? 2. the pricing structure will continue into 2013, with leaders north ferriby the next visitors to the turnbull. l whitby town are away to marine on saturday (5 jan). a supporters' bus leaves the club house at 9am. temperature: 9 c to 11 c wind speed: 25 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by clicking here. if you remain dissatisfied with the response provided then you can contact the pcc by clicking here. whitby gazette provides news, events and sport features from the whitby area. for the best up to date information relating to whitby and the surrounding areas visit us at whitby gazette regularly or bookmark this page. can i opt out of receiving cookies? cookies are small data files which are sent to your browser (internet explorer, firefox, chrome etc) from a website you visit. they are stored on your electronic device. this is a type of cookie which is collected by adobe flash media player (it is also called a local shared object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. however, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. the types of cookies we, our ad network and technology partners use are listed below: a tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. to opt out of this type of targeting you can visit the\" your online choices' website by clicking here. google ads? our sites contain advertising from google; these use cookies to ensure you get adverts relevant to you. you can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"your online choices' website by clicking here. webtrends / google analytics? this is used to help us identify unique visitors to our websites. this data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. dart for publishers? this comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. this information is not used by us for any other type of audience recording or monitoring. comscore? comscore monitor and externally verify our site traffic data for use within the advertising industry. any data collected is anonymous statistical data and cannot be traced back to an individual. local targeting? our classified websites (photos, motors, jobs and property today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. these cookies store no personally identifiable information. grapeshot? we use grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. grapeshot stores the categories of story you have been exposed to. their privacy policy and opt out option can be accessed here. subscriptions online? our partner for newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. add this? add this provides the social networking widget found in many of our pages. this widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend. temperature: 8 c to 12 c wind speed: 22 mph temperature: 8 c to 12 c wind speed: 15 mph temperature: 6 c to 11 c wind speed: 20 mph temperature: 5 c to 9 c wind speed: 14 mph"}, {"articleID": "2019121121_00023249_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-12-11", "url": "https://torontosun.com/news/world/i-am-inevitable-thanos-creator-attacks-donald-trump-over-sick-re-election-campaign-video/wcm/fa5e68c9-4516-4999-bfc5-973419969f3f", "content": "The man behind Marvel supervillain Thanos has attacked <mark>Donald Trump</mark>'s presidential campaign managers for comparing the U.S. leader to his creation. A video of Trump's head superimposed onto Thanos as he delivers his famous \"I am inevitable\" line from Avengers: Endgame was posted to the verified Twitter account managed by the President's 2020 re-election campaign on Tuesday. House Democrats can push their sham impeachment all they want. President Trump's re-election is????????????????????. pic.twitter.com/O7o02S26nS--Trump War Room (Text TRUMP to 88022) (@ TrumpWarRoom) December 10, 2019 The aides captioned the footage: \"House Democrats can push their sham impeachment all they want. President Trump\" s re-election is inevitable. \"In the video, leading Democrats turn to dust as Trump's Thanos clicks his fingers. However, Marvel fans have pointed out that Thanos is defeated following that part of the film, and now the man behind the character, Jim Starlin, has weighed in with his thoughts, calling Trump a\" pompous fool \".\" After my initial feeling of being violated, seeing that pompous fool using my creation to stroke his infantile ego, it finally struck me that the leader of my country and the free world actually enjoys comparing himself to a mass murderer. How sick is that? \"Jim tells The Hollywood Reporter.\" These are sad and strange times we are going through. Fortunately all things, even national nightmares, eventually come to an end. \"Comments Share your thoughts"}, {"articleID": "2014061319_00025163_W", "names": {"Denis O'Brien": ["Q18351161", "Q3022849", "Q5257430"]}, "date": "2014-06-13", "url": "http://irishtimes.com/news/crime-and-law/courts/beautiful-game-of-democracy-suffers-as-government-embroiled-in-match-1.1830590", "content": "\"The Cup is ours! The ref is ours! Even the Croatian goal is ours!' People are left with no option but to beg or steal - isn't this what Dickens wrote about?\" Invented' process to appoint President of European Commission is damaging to democracy New accountability board and head of civil service could boost policy delivery Northern Ireland is the most successful country ever in World Cup finals Torture retold: how the \"Hooded Men' case has come back under the spotlight Seanad sketch: the Beautiful Game of democracy suffers as Government embroiled in match Fine Gael and Labour leaders yesterday showed they are quite prepared to win ugly if need be World Cup 2014, and before a ball was kicked or a beer cracked open we were already embroiled in a match-fixing scandal. And to think we once had such high hopes for the Beautiful Game. That was back in 2011, when starry-eyed Enda and high-minded Eamon took over as Ireland's management team and promised\" a democratic revolution \". They made a promise back then:\" This won't be politics as usual. \"It hasn't quite worked out that way. But at the end of the day, as our Coalition gaffers might say, a result is a result, Bill. Labour may spout about democracy being the beautiful game, but yesterday their leaders showed they are quite prepared to win ugly, if needs be. Following a Seanad vote at lunchtime, the Government got the result it wanted and retook control of their Fianna Fáil over the Banking Crisis. It wasn't a fair win. Even Fifa wouldn't get away with sticking two extra players onto a team in order to get their preferred selection through to the play-offs. But when Enda and Eamon realised at the end of normal time last week that they were not going to have a majority on this oh-so-independent committee, they readied up an extra period and changed the rules to suit themselves. Because, as Enda let slip to the Dáil on Tuesday, he has to be sure this non-partisan joint committee adopts the right terms of reference. Right for whom? The poor Taoiseach dreaded the havoc which two FFers on a committee of nine might cause. Particularly when independent thinkers How could Enda trust them to toe the Government line? Both men are quite right to be insulted by the Government's antics. Donnelly, disgusted by\" objectionable attempts to control what should be an independent inquiry \", is thinking of stepping down. And then there's those noted defenders of Fianna Fáil's role in the bank crisis, Sinn Féin, and their man on the committee, Pearse Doherty. So you see, Enda and Eamon had no choice but to nobble the Opposition.\" The Government has made a complete and utter balls of this; it's a mess, \"declared James Heffernan during an overwrought Order of Business in the Seanad. What made yesterday's carry-on all the more tawdry was the way in which Labour, in particular, sought to twist the facts around the circumstances leading to yesterday's match-fixing episode. Fianna Fáil was as surprised as everyone else when the sub-committee selecting the inquiry members voted their man onto the team. Denis O'Donovan, the FF Senator who chairs it, even offered an adjournment when three Government Senators - including their own nominee - didn't turn up for the vote. But this was refused. It appears there was a misplaced presumption that Banks write off over € 300m in three deals with <mark>Denis O'Brien</mark> People are left with no option but to beg or steal - isn't this what Dickens wrote about?\" The Cup is ours! The ref is ours! Even the Croatian goal is ours!' 13:00 Seanad sketch: the Beautiful Game of democracy suffers as Government embroiled in match 12:49 Ombudsman to investigate low levels of health complaints 12:07 Six men and one woman charged with murder of Dale Creighton 11:54 \"Religious ethos' victims need better redress mechanism - report 1 Banks write off over € 300m in three deals with <mark>Denis O'Brien</mark> 2 An Emergency wedding: war, rations and a 70-year love 3\" The Cup is ours! The ref is ours! Even the Croatian goal is ours!' 4 More questions than answers for Scolari and Brazil after opener Torture retold: how the \"Hooded Men' case has come back under the spotlight Opinion:\" Cover up is not containable. The past keeps pouring out' Policing the Garda in wake of Cooke report Problem with Cooke report is it has something for everyone"}, {"articleID": "2015032304_00035517_W", "names": {"Michael Bolton": ["Q25829592", "Q312514"], "John Paul": ["Q1701359", "Q6252169"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2015-03-23", "url": "http://buffalonews.com/columns/douglas-turner/minimum-wage-stance-could-cost-bush-votes-20150323", "content": "MessFest draws children and parents to Museum of Science Disturbing tailspin of BUILD Academy and other city schools demands action Generosity helps Catholic Charities continue its selfless work in WNY Another Voice: Erie County should pass a law to prevent housing discrimination Proposal would allow some juvenile criminals to escape justice Disturbing tailspin of BUILD Academy and other city schools demands action <mark>Michael Bolton</mark> pleases his audience with love songs - but without the trademark voice and hair [BN] the know Subscribe for just $1.99 / wk WASHINGTON - Inherited wealth would be only a moderate problem for Republican John Ellis Bush if he runs for president. The Bush family ranks somewhere in the middle of the ranks of monied White House aspirants. However, Jeb Bush, as he is called, complicated things on this score when he spoke about the federal minimum wage during stops in South Carolina a few days ago. He is against it, as are most conservatives around the country. While Bush's comments are sure to warm the pocketbooks of right-wing Republicans who control the presidential primaries, this issue rubs particularly raw with some voters because Bush is a Catholic, a convert of 20 years. The Associated Press reported Bush said he can accept the present federal minimum wage, last raised in 2009, of $7.25 an hour, but opposes raising it. \"State minimum wages are fine,\" Bush said, according to the AP. The wage, he said, should be left to the states and the influences of the marketplace. As governor of Florida, Bush opposed a 2004 referendum approved by voters that tied the wage to inflation. In his South Carolina appearances, Bush implied that the minimum wage actually hurts employment opportunities for the poor. Unfortunately for Bush, these comments came as the New York Times published a lengthy story about how Bush is increasingly influenced by his Catholic faith. \"It's made me a better person,\" he told the Times. There is nothing in the catechism about the minimum wage. It is surely not an article of faith. Yet, the concept of government intervention on behalf of working men and women has been deeply embroidered into the literature and actions of the Catholic Church for the last 114 years. In reaction to the growth of Marxism in Europe, Pope Leo XIII published the papal encyclical \"Of New Things\" in 1891 in which he supported a living wage, and workers' rights to organize into labor unions. Leo's message swept through Catholic Western Europe. In America, it particularly influenced the struggling dioceses of Chicago, Cleveland and Buffalo, where bishops fostered the creation of diocesan labor colleges to support unions and fair wages. In 1991, Pope <mark>John Paul</mark> II penned his own letter on economics, \"Our 100th Year,\" that took Leo's message further, stressing Christianity's \"preferential option for the poor.\" This is a fancy phrase calling for private and public intervention for the economic welfare of the poor and powerless. <mark>John Paul</mark> also warned that the economic boom of the 1990s was occurring \"over the heads\" of ordinary people, meaning the poor would be left out. Now it is Pope Francis who is warning about the spiritual and political dangers of the widening disparity of incomes. Of all the varied comments Francis has made about the church and society, his forebodings about rich and poor are his most consistent. According to the New Republic, Francis condemned \"the economics of exclusion\" in remarks before U.N. officials last May. Francis called for \"the legitimate redistribution of economic benefits by the state.\" He likened the economic \"throw away culture\" to the \"culture of death\" that allows abortion. All this makes tough sledding in swing states like Ohio and Florida for Bush, interested in becoming the second Catholic president. It was for Rep. <mark>Paul Ryan</mark>, R-Wis ., also a Catholic, as the GOP's vice presidential candidate in 2012. <mark>Ryan</mark> was attacked by Catholics for wanting to slash spending for social welfare. The Buffalo News works to promote civil conversation in the comments section below. Please review the Alerts Text message notifications of news happening now. Copyright 1999 - 2015 - The Buffalo News copyright-protected material. Sorry, an unexpected error occurred. Please try again later."}, {"articleID": "2017090121_00108645_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Sarah Sanders": ["Q24698460", "Q27986907", "Q30961180", "Q3473414"]}, "date": "2017-09-01", "url": "https://www.geo.tv/latest/156263-house-speaker-urges-trump-not-to-scrap-dreamers-immigration-policy", "content": "US House speaker urges Trump not to scrap \"Dreamers' immigration policy By R REUTERS Saturday Sep 02, 2017 House Speaker <mark>Paul Ryan</mark> speaks on Capitol Hill in Washington, US, July 27, 2017. REUTERS/Yuri Gripas/Files WASHINGTON: US House of Representatives Speaker <mark>Paul Ryan</mark> urged President Donald Trump on Friday not to rescind an Obama-era program that protects immigrants who entered the United States illegally as children, joining business leaders and others opposing the move. White House spokeswoman <mark>Sarah Sanders</mark> said Trump will announce on Tuesday whether he will end the Deferred Action for Childhood Arrivals (DACA) program, which protects nearly 800,000 people from deportation. It also makes those covered--the so-called Dreamers--eligible for work permits.\" We love the \"Dreamers,'\" the Republican president told reporters in the Oval Office. <mark>Ryan</mark> and Senator Orrin Hatch--both Republicans--on Friday joined a small but growing number of lawmakers from the majority party to speak out against killing DACA, created in 2012 by Democratic former President Barack Obama and long the target of conservative immigration hard-liners. \"I actually don't think he should do that, and I believe that this is something Congress has to fix,\" <mark>Ryan</mark> said in an interview with WCLO radio in his hometown of Janesville, Wisconsin. \"These are kids who know no other country, who were brought here by their parents and don't know another home. And so I really do believe that there needs to be a legislative solution. That's one that we're working on. And I think we want to give people peace of mind,\" <mark>Ryan</mark> added. Hatch said in a statement that rescinding the program would further complicate a US immigration system sorely in need of legislative reform. \"Like the president, I've long advocated for tougher enforcement of our existing immigration laws. But we also need a workable, permanent solution for individuals who entered our country unlawfully as children through no fault of their own and who have built their lives here. And that solution must come from Congress,\" the longest-serving Republican senator added. Trump made a crackdown on illegal immigrants a centrepiece of his 2016 election campaign and has stepped up deportations since taking office in January. However, business leaders say immigrants make important economic contributions and that ending the program would hit economic growth and tax revenue. Congress under presidents of both parties has been unable to pass comprehensive immigration reform. Obama bypassed the Republican-led Congress and created DACA through an executive order. In 2014, he signed another order providing similar protections as DACA to millions of additional illegal immigrants who were parents of US citizens or lawful permanent residents, but a group of Republican states led by Texas blocked it with a lawsuit that went all the way to the US Supreme Court. <mark>Sanders</mark> said Trump--who previously has called DACA illegal--is not taking the decision lightly. \"The president's priorities on immigration are to create a system that encourages legal immigration and benefits our economy and American workers,\" she told a news briefing. Most of the Dreamer immigrants came from Mexico and other Latin American countries. More than 200,000 live in California, while 100,000 are in Texas. On the other hand, New York, Illinois, and Florida also have large numbers. What to do about Dreamers has been actively debated within the White House and Trump administration. One senior administration official described the debate as a \"tug of war\" between factions in favour and against the move. \"Future of our country' Leading business figures including Facebook Inc CEO Mark Zuckerberg have rallied in defence of the program and the Dreamers.\" These young people represent the future of our country and our economy. They are our friends and family, students and young leaders in our communities, \"Zuckerberg wrote in a Facebook posting late on Thursday. DACA supporters argue that the people it protects grew up and were educated in the United States and were integrated into American society, with little connection to the countries in which they are citizens. Opponents of the program argue that illegal immigrants take jobs from US citizens. There are deep divisions in the United States over the fate of roughly 11 million illegal immigrants, most of them Hispanics. Trump as a candidate promised to deport all of them. Undoing DACA could have political consequences for Trump and his fellow Republicans, further alienating Hispanics, a growing voting bloc in the United States. Trump's pardon for an Arizona sheriff who critics accused of targeting Hispanics, his planned wall along the US-Mexican border and his comments about Mexico sending\" rapists \"and drug dealers into the United States already had antagonized many Hispanic Americans. Trump in February, four weeks after taking office, signalled he was conflicted over the DACA program, telling a news conference he would\" deal with DACA with heart \"and calling the matter\" one of the most difficult subjects I have. \"Trump said\" some absolutely incredible kids \"were among those covered by DACA, but also gang members and drug dealers. Advertisement"}, {"articleID": "2015031323_00005103_W", "names": {"Bob Hall": ["Q18619029", "Q47546010", "Q4932653", "Q4932654", "Q4932655", "Q887968"], "Greg Abbott": ["Q5605224", "Q5605225"], "Dan Patrick": ["Q19517991", "Q5214174", "Q5214175"]}, "date": "2015-03-13", "url": "http://www.texasgopvote.com/pro-life/end-life-talks-stalled-texas-right-life-will-not-come-table-007604", "content": "In letter, the group's attorney claims TEC could compel donor list release, other groups and their attorneys disagree Scott Braddock on March 13, 2015 at 3:49 PM originally published on the Quorum Report. The thorny issue of how to reform Texas' laws on end-of-life health care is front and center for prominent pro-life groups at the Texas Capitol. But, one of those groups is skipping out on negotiations about crafting legislation and in doing so the group's lawyer is blaming the Texas Ethics Commission for rules aimed at transparency in elections. Texas Right to Life is once again at odds with Texas Coalition for Life and Texas Alliance for Life, with the latter two of the three groups in agreement that there is no TEC rule standing in the way of productive talks on how to reform the Advance Directives Act. Former Sen. Bob Deuell, R-Greenville, unsuccessfully pushed changes in 2013 that would have given patients' families greater protections while providing clarity for doctors in situations when physicians and families do not agree about how to deal with a terminal illness. During last year's GOP primary runoff won by Sen. <mark>Bob Hall</mark>, Texas Right to Life seized on this issue and helped unseat Deuell by running broadcast advertisements that suggested he \"turned his back on life and on disabled patients\" and favored a \"death panel.\" Deuell has called those ads \"slanderous\" and the Texas Catholic Conference said Right to Life \"has tried to stoke fear through ridiculous claims of non-existent death panels and assertions that doctors are secretly trying to kill patients. Both claims are absurd.\" Texas Right to Life is suing Deuell in Houston because, the group says, he infringed on their First Amendment rights by asking radio stations to cancel the advertisements. Deuell's attorneys are working to get that case dismissed. A hearing is set in the next few weeks. Given that backdrop, it might not surprise you to learn that Texas Right to Life is refusing to participate in talks at the Capitol aimed at coming up with a legislative solution on end-of-life care. In an email obtained by Quorum Report, the group's attorney Trey Trainor argued that a rulemaking by the TEC about coordinated efforts during elections applies to lobby efforts. \"Clearly such a focused effort, one that is sorely needed, would meet the common activity portion of the TEC's new acting in concert definition,\" Trainor wrote. \"In fact, it is the singular focus of the group that wood evidence the common activity of the participating entities. If the end-of-life issue were ever discussed by any one of the participating entities in a campaign (notice the new rule, by design, has no limitation on when the cooperation or consultation had to occur in relation to a campaign expenditure) it could have the effect of forcing all the entities into donor disclosure,\" Trainor said. \"Participation by several non-profit entities in an organized and coordinated effort that has as its singular focus the discussion of one pending legislative/political issue jeopardizes the constitutionally protected private right of association of the donors to each entity because of the ambiguous and ill-conceived rulemaking of the Texas Ethics Commission,\" Trainor said. Trainor told Quorum Report that he could not comment on any advice he may have given his clients. copy of the email here. Executive Director of Texas Alliance for Life Joe Pojman said that his group's attorneys do not agree the assessment in Trainor's email. \"The TEC rule that he refers to does not apply to legislative activities, only to electioneering,\" Pojman said. \"The rule has no impact on our groups meeting to consider legislative action.\" Pojman argued that if Trainor were correct, the attorney would need to advise Texas Right to Life to withdraw from other activities in which end-of-life care has been discussed by multiple groups. Those activities include the Life, Liberty, and Property Coalition and the Texas Faith and Family Day at the Capitol headlined by Gov. <mark>Greg Abbott</mark> and Lt. Gov. <mark>Dan Patrick</mark>. Trainor said that those activities could not be equated with \"a backroom meeting wherein all manner of political and legislative information may be exchanged,\" "}]