[{"articleID": "2019101013_00172478_W", "names": {"Al Murray": ["Q4704500", "Q6000623"]}, "date": "2019-10-10", "url": "http://www.eppingforestguardian.co.uk/news/national/17960435.13-unknown-first-world-war-soldiers-buried-belgium/", "content": "13 unknown First World War soldiers buried in Belgium By Press Association 2019 Coffins arrive for a burial service at the Commonwealth War Graves Commission's Wytschaete Military Cemetery, near Ypres 0 comment Hundreds of people gathered to mark the burial of 13 unknown soldiers who died fighting in Belgium in the First World War. The unidentified war dead--all from the UK and Commonwealth nations--were buried side by side with full military honours near Ypres. Shots from the gun salute rang out across the quiet clearing, the same Flanders field where the men lost their lives. The poignant ceremony at Wytschaete Military Cemetery formed one of the final chapters of the Dig Hill 80 project, which discovered the remains of 110 soldiers. Father Patrick O’Driscoll, chaplain to the 1st Battalion The Royal Regiment of Fusiliers, conducted the service, starting at 11am. Father Patrick O’Driscoll leads a burial service at the Commonwealth War Graves Commission's Wytschaete Military Cemetery, near Ypres (Gareth Fuller/PA) He spoke of the symbolism of the red poppy and the need for enduring peace. He said: \"We are gathered in fellowship today before God to remember those who have made the supreme sacrifice by the giving of their lives in the service of their country .\" We remember and pray for all those who have suffered, and who still suffer, as a consequence of war. \"Finally, we pray for peace and reconciliation--especially remembering those with the responsibility for the leadership of nations--that conflict may be avoided, and peace prevail among all people .\" The service was attended by representatives of armed forces from various nations, there to pay their respects to the fallen 13 men. Two of the unknown soldiers--identified as British--were carried to the ceremony by soldiers from the Fusiliers. Union Jack flags were draped over the coffins. The remaining 11 war dead were buried in a third coffin before the service began. Father O’Driscoll paid tribute to the ultimate sacrifice made by the 13 soldiers as he addressed the crowd. \"We come together today to remember and thank these men for their great sacrifice in fighting and dying together as one. Soldiers prepare to bury two coffins (Gareth Fuller/PA)\" Even though we do not know their names, we remember their humanity and courage and that even in the hell of battle they were there for each other even to death. \"So in prayer and celebration, we place these men together in this consecrated and special ground, so that they rest in peace and we learn and make sure humanity endures in its fullness .\" As we commit the remains of our brothers to the deep, grant them peace and tranquility. \"After the burial, shots from the traditional four-gun salute to the fallen echoed across the quiet clearing. The Exhortation was read out, with guests repeating the famous promise:\" We will remember them. \"Music was performed by a joint venture between British and German schoolchildren, to symbolise peace and co-operation. Pupils from Mildenhall College Academy in Bury St Edmunds and St Joseph's College, Ipswich, formed the contribution from the UK. The service came as a result of the hard work of those at the Dig Hill 80 project, who excavated Hill 80--the site of a German gun emplacement where many UK and Commonwealth soldiers fell. The project led a 1.1-hectare crowdfunded archaeological excavation, which took place at the former site of Hill 80 in Wytschaete, on land that had been allocated for future housing development. The service was held at the Wytschaete Military Cemetery (Gareth Fuller/PA) The project excavated 550 metres of trenches and 430 bomb craters, with the remains of 110 soldiers--including British, French, German and South African personnel--discovered. Dig Hill 80 was highly publicised at the time, attracting international media attention and celebrity patronage from comedian <mark>Al Murray</mark> and support from military historian Dan Snow. It has not been possible to identify the 13 unknown soldiers who were buried on Thursday, but at least two are believed to be British. Three Commonwealth War Graves Commission (CWGC) headstones will mark their collective final resting places, which will be cared for by the commission in perpetuity. In keeping with burial tradition, the casualties were interred together, ensuring that those who served and died together are buried and commemorated together. Hill 80 was the site of a windmill before the First World War, but became an entrenched German gun position following the capture of the village of Wytschaete in 1914. The location afforded observational advantage to the Germans as it overlooked the town of Ypres and formed part of the Messines Ridge. The site remained in German hands until the Battle of Messines in June 1917, when it was recaptured. In 1918, Hill 80 was again taken by the Germans during the Battle of the Lys, before finally returning to Allied hands in September 1918. Dig Hill 80 head archaeologist Simon Verdegem said:\" It is now about a year since the investigation into the soldiers of Hill 80 was completed. \"Thanks to massive international support from individuals and organisations, enough money was raised through crowdfunding to make a detailed excavation possible. Coffins arrive for the burial service (Gareth Fuller/PA)\" The aim was not only to excavate the trenches but also to recover the soldiers. Now, the British and German soldiers will finally be given a definitive and dignified resting place along with their comrades. I dare to believe that it gives them peace, knowing that people from all over the world have joined forces to recover their mortal remains. \"In my opinion, this can count as a symbol of peace and reconciliation .\" CWGC director general Victoria Wallace said: \"It is always moving and a real privilege to attend reburials .\" And it's a credit to the team who excavated Hill 80 that they have recovered these men at last, who will now be laid to rest with former comrades, and cared for in perpetuity by the Commonwealth War Graves Commission. \"It is sad that the men cannot be identified individually, but they will never be forgotten, by their nation, or by the people of Flanders who always show such respect for our war dead .\" The German soldiers discovered on Hill 80 will be laid to rest on Friday at the German war cemetery in Langemark. 0 comment"}, {"articleID": "2010112519_00023582_W", "names": {"Eddie Johnson": ["Q1179451", "Q2325791", "Q376267", "Q5336165", "Q576969", "Q59196952", "Q960818"], "Ryan Reynolds": ["Q192682", "Q7384463"]}, "date": "2010-11-25", "url": "http://thestarphoenix.com/Victoria+schools+probe+safety/3883719/story.html", "content": "the focus on the individual excellence of andy fantuz enhances the deep-rooted team-first attitude of the saskatchewan roughriders. photo gallery: riders take to the field for practice video: riders punter <mark>eddie johnson</mark>'s video diary (day one) riders simpson seeks first grey cup win in third try starphoenix exclusive: rcmp video of const. perry, kyle lariviere outside beauval detachment rcmp release names of victims in deadly crash near moosomin photo gallery: riders take to the field for practice are the patriots due for a lunchbag letdown game? could happen here in a short week of work. the lions, playing at home, should keep this one close enough. <mark>ryan reynolds</mark>, justin bieber and joey votto transform world's image of canadian men tutoring underprivileged kids improves learning, relationships: study b.c. polygamists \"branded as outlaws,' court hears blissfully unaware, or just blissful? canadians are a happy bunch danish researchers have come up with a recipe for preventing and treating obesity: a diet high in proteins and low in refined starches such as white bread and white rice. choosing apples over cookies may help bone health how do exercise video games rate against the real...standard resume still hard to beat in landing a job although generations x and y are vastly different (i have daughters from both demographic cohorts so, believe me, i know all too well), when it comes to listing the impediments preventing them from...newly renovated 3000 sq ft (saskatoon starphoenix) schumacher acreage/business site (househunting.ca) $... victoria schools probe wi-fi safety health effects of wireless connections on students to be examined alex de medeiros teaches a grade 8 career/health class equiped with wi-fi laptops at gordon head school in victoria, b.c. november 19, 2010. photograph by: darren stone, victoria times-colonist health worries over the use of wi-fi in schools have spread to victoria. greater victoria trustees, who oversee nearly 20,000 students in 43 schools, are taking a closer look at concerns about wi-fi--or wireless-fidelity, the wireless link that connects laptops and other devices to the internet. most of the district's secondary and middle schools have wi-fi, as do several elementary facilities. presentations about possible health issues caused by wi-fi were first made to the board in the spring. there were more last week by a group of speakers. as a result of the most recent session, the district is forming a committee to study wi-fi usage, and is inviting trustees, district workers, members of the victoria confederation of parent advisory councils and the public to take part. district secretary-treasurer george ambeault will lead the committee, which is due to make a report next spring .\" if there's any level of concern about it, then we need to be able to at least respond to people's questions, \"board chairman tom ferris said .\" if we're going to do that, we have to educate ourselves. \"health canada says exposure to low-level electromagnetic frequency, such as that coming from wi-fi, does not pose a danger to the public. it says energy levels emitted are limited by guidelines that were set after looking at thousands of peer-reviewed studies .\" as long as the exposure is below these established limits, there is no convincing scientific evidence that this equipment is dangerous to schoolchildren or to canadians in general, \"a health canada statement says. not everyone is convinced. last summer in barrie, ont., a request was made to disconnect wi-fi in area schools after parents voiced fears that it was causing nausea and headaches in students. the board declined, saying there was no evidence indicating wi-fi caused such symptoms. in november, roots and wings montessori place in surrey banned wireless devices. citizens for safe technology is a vancouver-based group that has about a dozen active supporters in the capital region. two of them, parents tammy and rob jeske, were among the speakers who addressed the greater victoria board about wi-fi last week. the couple have two sons, aged nine and 11, in local schools. tammy jeske said there is plenty of expert opinion that indicates sources of electromagnetic frequencies such as wi-fi can pose a danger .\" i've seen it in my own children, i've seen it in myself, \"she said. like others, she said she has noticed the positive effect of removing wi-fi from her environment .\" the biggest thing for us is we weren't sleeping well. myself, it was to the point where i had to take medical leave from work because i had become so chronically fatigued. \"she said wi-fi also affected the family's immune systems and led to increased illness. last year, however, after removing wireless items from the home, her sons both earned awards for perfect school attendance, jeske said. she said members of the group are pleased that the greater victoria school district is considering the wi-fi issue .\" we think there's enough evidence to warrant precaution and to hold off on wi-fi, certainly when there's an alternative in place that's easy to use. \"jeske said the alternative is to hard-wire devices. the group is scheduled to make another presentation on wi-fi concerns to the sooke board of education on dec. 7. saanich board of education chairwoman helen parker said she expects wi-fi to be discussed in the near future. aaron gulliver, canada research chair in advanced-wireless communications at the university of victoria, said discussion of wi-fi use is a positive thing .\" here at the university, it's completely wi-fi-enabled from end-to-end on campus. we have wi-fi availability everywhere, \"he said. alex de medeiros teaches a grade 8 career/health class equiped with wi-fi laptops at gordon head school in victoria, b.c. november 19, 2010. starphoenix exclusive: rcmp video of const. perry, kyle lariviere outside beauval detachment supreme court orders review of roma extradition order canada won't participate in un\" hatefest,' says immigration minister when canadians head overseas, they're going on vacation: statscan starphoenix exclusive: rcmp video of const. perry, kyle lariviere outside beauval detachment? 2008 - 2009 postmedia network inc. all rights reserved."}, {"articleID": "2015021218_00001250_W", "names": {"Ian Khan": ["Q23664007", "Q5981972"], "Gene Kim": ["Q55153249", "Q5531290"]}, "date": "2015-02-12", "url": "http://www.sys-con.com/node/3299032", "content": "The City of Fairlawn announces the availability of the FairlawnGig Request for Proposals (RFP). The RFP solicits proposals relating to the creation and implementation of a new municipal broadband utility to provide wireless and fiber optic internet services to the City of Fairlawn and the Akron-Fairlawn-Bath Township Joint Economic Development District. Known as FairlawnGig, this municipal broadband utility seeks to provide the residents, businesses, and visitors of Fairlawn with the benefits of the latest internet access technology and creativity available from the private sector. At a meeting held on February 9, the Fairlawn City Council unanimously approved a municipal ordinance authorizing the Mayor to issue the Request for Proposals. \"I thank the City Council for their foresight in approving this ordinance,\" said Fairlawn Mayor, William J. Roth, Jr. \"Broadband internet access is an essential utility for the 21st century. Through this initiative we will bring world class internet services to all residents and businesses of Fairlawn .\" The City hopes to realize this vision by soliciting proposals from qualified high technology companies who are willing to partner with the City to design, build, operate, manage, and maintain the FairlawnGig utility. In so doing, the City is not proposing any increases in taxes or other assessments. Rather, the City's broadband utility will be funded through private financing and revenues from operations. The City of Fairlawn has created a website for the FairlawnGig RFP process. The FairlawnGig RFP, along with news, information, and detailed instructions on how to participate in the RFP process is available at www.FairlawnGig.info. Interested parties are encouraged to register at the website and download a copy of the FairlawnGig RFP. For more information about the FairlawnGig Request for Proposals, contact Ernie Staten, Deputy Service Director at Copyright © 2015 SYS-CON Media, Inc. - All Rights Reserved. \"With easy-to-use SDKs for Atmel's platforms, IoT developers can now reap the benefits of realtime communication, and bypass the security pitfalls and configuration complexities that put IoT deployments at risk,\" said Todd Greene, founder & CEO of PubNub. PubNub will team with Atmel at CES 2015 to launch full SDK support for Atmel's MCU, MPU, and Wireless SoC platforms. Atmel developers now have access to PubNub's secure Publish/Subscribe messaging with guaranteed 1/4 second latencies across PubN...Some developers believe that monitoring is a function of the operations team. Some operations teams firmly believe that monitoring the systems they maintain is sufficient to run the business successfully. Most of them are wrong. The complexity of today's applications have gone far and beyond the capabilities of \"traditional\" system-level monitoring tools and approaches and requires much broader knowledge of business and applications as a whole. The goal of DevOps is to connect all aspects of app...The Enov8 SolutionEcosystem allows enterprises to inject a level of transparency and discipline into DevOps and / or environment management operations. Ecosystem provides you with a foundation where you can systematically improve overall governance through out-of-the-box best practices and prioritize automation efforts based on the current work effort. \"Cigniti's focus to offer end-to-end software testing services solutions gets further strengthened through this partnership. Test environment m.. . The 16th International Cloud Expo has announced that its Call for Papers is open until February 28, 2015. 16th International Cloud Expo, to be held June 9-11, 2015, at the Javits Center in New York City brings together Cloud Computing, APM, APIs, Security, Big Data, Internet of Things, DevOps and WebRTC to one location. With cloud computing driving a higher percentage of enterprise IT budgets every year, it becomes increasingly important to plant your flag in this fast-expanding business opport...Platform-as-a-Service (PaaS) is a technology designed to make DevOps easier and allow developers to focus on application development. The PaaS takes care of provisioning, scaling, HA, and other cloud management aspects. Apache Stratos is a PaaS codebase developed in Apache and designed to create a highly productive developer environment while also supporting powerful deployment options. Integration with the Docker platform, CoreOS Linux distribution, and Kubernetes container management system...Eighty-five percent of companies store information in some sort of unstructured manner. In this demo at 15th Cloud Expo, Mark Fronczak, Product Manager at Solgenia, discussed their enterprise content management solution, which was created to help companies organize and take control of their digital assets. An entirely new security model is needed for the Internet of Things, or is it? Can we save some old and tested controls for this new and different environment? In his session at @ ThingsExpo, New York's at the Javits Center, Davi Ottenheimer, EMC Senior Director of Trust, reviewed hands-on lessons with IoT devices and reveal a new risk balance you might not expect. Davi Ottenheimer, EMC Senior Director of Trust, has more than nineteen years' experience managing global security operations and asse...The excitement around the possibilities enabled by Big Data is being tempered by the daunting task of feeding the analytics engines with high quality data on a continuous basis. As the once distinct fields of data integration and data management increasingly converge, cloud-based data solutions providers have emerged that can buffer your organization from the complexities of this continuous data cleansing and management so that you're free to focus on the end goal: actionable insight. CommVault has announced an arrangement with NaviSite, Inc., to extend the data protection capabilities of Simpana ® software to NaviSite's NaviCloud ® portfolio. CommVault will provide data protection and management capabilities for customers using NaviCloud Director, an enterprise-class cloud Infrastructure-as-a-Service (IaaS) solution offered directly to customers via an intuitive self-service portal, and also delivered in conjunction with NaviSite's broad portfolio of managed services .\" Our c.. . SYS-CON Events announced today that On the Avenue Marketing Group, a sales and marketing firm that utilizes events to market and sell products to consumers, will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. On the Avenue Marketing Group (OTA) is a sales and marketing firm that utilizes events to market and sell products to consumers. On behalf of our clients, we attend thousands of fairs, festivals, exp...Today's hyper competitive environment defined by unreasonable demands for speed and high expectations for quality and usability has forced companies to differentiate based on their technology. Every company is a software company where customers' demands for features and functions are more relentless than ever. All while organizations are unable to meet demand or innovate because of a lack of interface testing or too many bugs escape downstream, or a lack of automated testing, or even the difficu...John Michelsen is CTO of CA Technologies. As the Chief Technology Officer of CA Technologies, he is responsible for technical leadership and innovation, further developing the company's technical community, and aligning its software strategy, architecture and partner relationships to deliver customer value. Enterprises build applications with the latest tools, people and processes yet failures riddle the headlines. If state of the art fails us, it means we need a \"New State of the Art .\" In...Working with Big Data is challenging, especially when decision makers depend on market insights and intelligence from your data but don't have quick access to it or find it unusable. In their session at 6th Big Data Expo, <mark>Ian Khan</mark>, Global Strategic Positioning & Brand Manager at Solgenia; Zel Bianco, President, CEO and Co-Founder of Interactive Edge of Solgenia; and Ermanno Bonifazi, CEO & Founder at Solgenia, discussed how a revolutionary cloud-based BI along with mobile analytics is already c.. . SYS-CON Media announced today that Vormetric launched a popular blog feed on Cloud Computing Journal with almost 5,000 story reads. Cloud Computing Journal aims to show how and why Cloud Computing is an opportunity for business to implement low cost, low power and high efficiency systems to deliver scalable infrastructure without heavy investment in hardware, training or software licensing. Cloud Foundry open Platform as a Service makes it easy to operate, scale and deploy application for your dedicated cloud environments. It enables developers and operators to be significantly more agile, writing great applications and deliver them in days instead of months. Cloud Foundry takes care of all the infrastructure and network plumbing that you need to build, run and operate your applications and can do this while patching and updating systems and services without any downtime. Microsoft Opening Keynote | NoOps! = No Operations DevOps Summit Keynote | Purpose-Defined Computing: The Next Frontier in Automation General Session | Verizon Pay-As-You-Go Model for Oracle Database Licenses Means Costs Savings and Business Benefits Creating a Faster, More Secure Cloud General Session | [Podcast] Hybrid Cloud - Different Clouds for Different Needs SAP General Session | Innovation with Cloud and Big Data Solutions That Will Revolutionize Your Business - Join SAP and Partners General Session | How to Architect and Optimize Your Cloud for Consistent Performance Lunch Power Panel at 15th Cloud Expo | Choosing the Right Cloud Option View Dr. Kristof Kloeckner Keynote: Cloud Needs DevOps Microsoft Azure for Enterprise: What and Why Big Data Management System: Smart SQL Processing across Hadoop and your Data Warehouse Real-time Big Data: An Agile Approach Day 2 Keynote | How to Maintain Relevancy in a Cloud World: A Step-by-Step Approach to the Future Business of IT Day 2 Lunch Keynote | Application Delivery in the Cloud: Debunking Myths and Showcasing the Realities Day 3 Keynote | Navigating Storage in a Cloudy Environment Lighten Your Data Center TCO with Helium Storage Solutions Fear & Loathing in the Enterprise Cloud (with apologies to Hunter S. Thompson) As healthcare providers move into mobile device applications and across enterprise and cloud technologies in the U.S. and abroad, businesses and consumers are demanding more layers of protection. And it's needed: Recent online security breaches highlight the importance of security, especially as cloud transactions and the IoT become more commonplace. Attracting new customers and retaining old o.. . Feb. 12, 2015 12:30 PM EST Reads: 341 Where Did My Love for Data Start? Whenever Jack visited me, he used to leave sticky notes on my desk with nuggets of wisdom. For example, \"Keep people you trust close to you .\" ...or, \"Key values for Teradata where: Pride, Enthusiasm, Importance of the Individual, Teamwork and Open Communications, Ethics, Dedication, Quality, Support, Success, and Entrepreneurship .\" In the month of July, 1999, Jack Shemer and David Hartke both decide...Feb. 12, 2015 12:15 PM EST Reads: 1,132 What happens when the gadgets you wear also control the things around you? No doubt you've heard of various internet-connected things like light bulbs, coffee makers and thermostats making their way into our homes. And no doubt, you've probably heard of such devices that you wear (or insert) to track your fitness, sleeping or even blood sugar levels. But when that sleeping monitor can alert the l.. . Feb. 12, 2015 12:15 PM EST Reads: 736 DevOps is gaining serious momentum within enterprises as of late. The big business driver is the pursuit of agility and improved reliability and quality. Adopting DevOps can be challenging because it often requires drastic changes in culture, process, and technology. Those companies that have had success with DevOps often discover some hidden benefits that they may not have anticipated wh...Feb. 12, 2015 12:00 PM EST Reads: 608 Cloud, IoT, Big Data & DevOps Opportunity Cloud computing is now being embraced by a majority of enterprises of all sizes. Yesterday's debate about public vs. private has transformed into the reality of hybrid cloud: a recent survey shows that 74% of enterprises have a hybrid cloud strategy. Meanwhile, 94% of enterprises are using some form of XaaS - software, platform, and infrastructure as a service. Cloud Expo is the single show wher...Feb. 12, 2015 12:00 PM EST Reads: 520 I have seen many DevOps initiatives at various levels of maturity. One common pattern in successful ones is that they have made progress in automating the build process or the provisioning of environments. Both of these accomplishments are necessary and worthy of focus, but the efforts don't stop there. Check out my post on the Virtualization Practice that discusses 6 ways to take DevOp...Feb. 12, 2015 11:45 AM EST Reads: 667 Can IT Standards Facilitate Innovation? IT professionals continue to debate the benefits of standardization versus the benefits of innovation, and the potential of standards inhibiting engineer and software developer ability to develop creative solutions to business opportunities and challenges. At the Open Group Conference in San Diego last week (3 ~ 5 February) the topic of standards and innovation popped up not only in presentations,...Feb. 12, 2015 11:45 AM EST Reads: 971 There is no universal global guideline when it comes to how data is managed, secured, and accessed. Privacy laws vary from country to country and are still being defined in the digital age. In the face of trends like consumerization, mobility, and the distributed workplace, data residency is fast-becoming a vital issue that requires more attention. Stop and ask yourself. Do you know where your da...Feb. 12, 2015 11:15 AM EST Reads: 982 The explosion in SMAC technologies (social, mobile, analytic, and cloud) in recent years has created unprecedented opportunities for those who can code. Indeed, programmers are the gatekeepers who are on the frontlines of the most momentous technological transformation in our history. Those who can code the mobile apps, the games, or the automation software of our digital world will demand the bes...Feb. 12, 2015 11:00 AM EST Reads: 1,256 Solr vs. Elasticsearch - How to Decide? \"Solr or Elasticsearch?\" ...well, at least that is the common question I hear from Sematext's consulting services clients and prospects. Which one is better, Solr or Elasticsearch? Which one is faster? Which one scales better? Which one can do X, and Y, and Z? Which one is easier to manage? Which one should we use? Which one do you recommend? etc., etc.. These are all great questions, though...Feb. 12, 2015 11:00 AM EST Reads: 1,842 The Next Generation of the \"Internet of Things' Our guest on the podcast this week is Erik Sebesta, Co-Founder and CATO of Cloud Technology Partners. We discuss recent Internet of Things projects, including those of two healthcare intelligence companies, and explore exactly what it takes to delivery real-time data, safely and efficiently to end consumers. Listen in to learn how we're building the next generation of IoT platforms and helping com...Feb. 12, 2015 10:15 AM EST Reads: 519 Carrier Hotels Look to the Future While layer 1 (physical) interconnection of network resources will always be required - the bits need to flow on fiber or wireless at some point, the future of carrier and service resource intercommunications must evolve to accept and acknowledge the need for user-driven, near real time provisioning of network and other service resources, on a global scale. Feb. 12, 2015 10:15 AM EST Reads: 537 Four Steps for Structuring Log Data Log data provides the most granular view into what is happening across your systems, applications, and end users. Logs can show you where the issues are in real-time, and provide a historical trending view over time. Logs give you the whole picture. In the age of Big Data we are taught that no pile of data is too large or too complex. This is absolutely true. Most data analysis systems can take...Feb. 12, 2015 10:00 AM EST Reads: 1,033 ruxit adds Cassandra monitoring via Thrift In Agent version 1.61 we introduced support for the communication protocol Thrift. Thrift is a cross-platform cross-language communication framework that behaves very much like web services and so therefore automatically show ups in ruxit monitoring. It's used by a wide variety projects, most prominent among them, Cassandra. Thus you can now see Cassandra databases as a service, see traff...Feb. 12, 2015 10:00 AM EST Reads: 887 Programmability\" in \"the Network\" Programmability in the network \"is a wordy yet simpler way to describe the extension of network capabilities through the use of software-defined techniques. See what I mean? In any case, whatever you want to call it, there are two distinct methods of leveraging programmability in the network. One is specifically tied to SDN, using the extensible capability of an SDN controller supportive of a.. . Feb. 12, 2015 10:00 AM EST Reads: 663 Microservices, for the uninitiated, are essentially the decomposition of applications into multiple services. This decomposition is often based on functional lines, with related functions being grouped together into a service. While this may sound a like SOA, it really isn't, especially given that SOA was an object-centered methodology that focused on creating services around\" nouns \"like customer...Feb. 12, 2015 10:00 AM EST Reads: 754 The word DevOps is a portmanteau of\" development \"and\" operations \". However, anyone who knows\" The Phoenix Project \"by <mark>Gene Kim</mark> et al. will agree that its radius is much wider than what the term suggests: it's a melting pot that combines principles from Agile Software Development and Lean Manufacturing with the aim to reduce friction and improve collaboration by honing a culture of communication,...Feb. 12, 2015 09:30 AM EST Reads: 1,533 Log data provides the most granular view into what is happening across your systems, applications, and end users. Logs can show you where the issues are in real-time, and provide a historical trending view over time. Logs give you the whole picture. Modern infrastructure constantly generates log data at a rate faster than humans can easily analyze. And now that data centers can be built and torn...Feb. 12, 2015 09:15 AM EST Reads: 1,491 Internet of Things System Monitoring Log data provides the most granular view into what is happening across your systems, applications, and end users. Logs can show you where the issues are in real-time, and provide a historical trending view over time. Logs give you the whole picture. The Internet of Things (IoT) is really the morphing of physical devices into a software world. This means a lot of the same things you would do with...Feb. 12, 2015 09:00 AM EST Reads: 1,037 The New Rules of Digital Engagement Good food is not the most important attribute for a restaurant. Cleanliness is. It doesn't matter how great your dishes are - if patrons catch even a glimpse of a roach, they won't stick around to sample your cooking. The same principle applies to your company's digital experience. You may have great products at a great price. But if customers have a bad experience with your digital channels, the...The Hidden Benefits of DevOps By @ MadGreek65 | @ DevOpsSummit [#DevOps] Biggest Cloud, IoT, Big Data & DevOps Opportunity [#IoT #Cloud #DevOps #BigData] The Next Generation of the\" Internet of Things' By @ MadGreek65 | @ ThingsExpo [#IoT] Public Cloud Security Demands a CASB By @ CipherCloud | @ CloudExpo [#Cloud] Cassandra Monitoring via Thrift By @ Ruxit | @ DevOpsSummit [#DevOps]. @ HDScorp to Acquire @ Pentaho By @ BobGourley | @ ThingsExpo [#IoT #BigData] Internet of Things System Monitoring By @ HoardingInfo | @ ThingsExpo [#IoT] Announcing @ Gridstore to Exhibit at @ CloudExpo New York [#Cloud] Logging from Your Java Applications By @ Logentries | @ DevOpsSummit [#DevOps] \"Different Clouds' Presentation By @ CiscoCloud | @ CloudExpo [#Cloud]\" Cowboys & Bureaucrats' with @ QubellInc | @ DevOpsSummit [#DevOps] New DevOps Partners @ Cigniti and @ Enov8Inc | @ DevOpsSummit [#DevOps] IT As Competitive Differentiator By @ Automic | @ DevOpsSummit [#DevOps] Agile Is Not the Absence of ITIL By @ JodiKohut | @ DevOpsSummit [#DevOps] Solr vs. Elasticsearch - How to Decide? By @ Sematext | @ DevOpsSummit [#DevOps] \"Internet of Things' Security By @ DaviOttenheimer | @ ThingsExpo [#IoT] Deploy in Scale with Docker and Apache By @ WSO2 | @ CloudExpo [#Cloud] Partner Award For @ VMware Goes To @ NaviSite | @ CloudExpo [#Cloud] Enterprise Content Management with @ Solgenia_Corp | @ CloudExpo [#Cloud] What Anthem and Sony Could Have Done Differently By @ IanKhanLive [#Cloud] Bain Capital Ventures Prediction\" Ranking' By @ AriaSystemsInc | @ CloudExpo [#Cloud] The Need for Human Centric Automation By @ Automic | @ DevOpsSummit [#DevOps] Release Management RACI Matrix By @ Plutora | @ DevOpsSummit [#DevOps] Prioritizing Web Performance By @ MDaoudi | @ DevOpsSummit [#DevOps] Top DevOps Tools We Love By @ Dynatrace | @ DevOpsSummit [#DevOps] IoT and \"Sensor Analytics Ecosystem' By @ JAdP | @ ThingsExpo [#IoT] The Automation Opportunity By @ Automic | @ DevOpsSummit [#DevOps] The Big Picture About Product Management By @ Automic | @ DevOpsSummit [#DevOps] New @ Automic Blog with Over 7,000 Story Reads | @ DevOpsSummit [#DevOps] Log Analysis for Software-Defined Data Centers | @ DevOps Summit [#DevOps] IoD, IoT, IoE, IoS, IoP, IoU and IoX Are in Your Future | @ ThingsExpo [#IoT] Ten Myths of Cloud Computing By @ Wrecks47 | @ CloudExpo [#Cloud @ OracleCloudZone] DevOps Summit New York Call For Papers | @ DevOpsSummit [#DevOps]\" WebRTC + Internet of Things' By @ LiveOps | @ ThingsExpo [#IoT #WebRTC] Internet of Things and Internet of Everything By @ CiscoGovt | @ ThingsExpo [#IoE #IoT] Embracing SaaS with @ Bitium CEO @ ScottKriz | @ CloudExpo [#Cloud] The Real Potential of DevOps By @ AppDynamics | @ DevOpsSummit [#DevOps] New \"Internet of Things' Ad Campaign by @ Splunk | @ ThingsExpo [#IoT] Internet of Things Monetization By @ AriaSystemsInc | @ Thingsxpo [#IoT] Apache Drill's Self-Service Capabilities By @ MapR | @ CloudExpo [#BigData] Internet of Things Supply Chains By @ Microsoft | @ ThingsExpo [#IoT] State of On-Call Report Released By @ VictorOps | @ DevOpsSummit [#DevOps] Driving Analytics in the Cloud with @ SAPInMemory | @ CloudExpo [#Cloud] Monetizing\" Internet of Things' with @ SAP Google Glass Challenge | @ ThingsExpo [#IoT] Software-Defined Business with @ AppDynamics | @ DevOpsSummit [#DevOps] Storage Server Solutions with @ WJSales1 CEO | @ CloudExpo [#Cloud] SDK Support for @ Atmel Internet of Things By @ PubNub | @ ThingsExpo [#IoT] Internet of Things @ Oracle Suite for #WebRTC | @ ThingsExpo [#IoT] Internet of Things and #WebRTC By @ ComHearEarPuff | @ ThingsExpo [#IoT] Bluemix and ElasticBox Hackathons at @ DevOpsSummit [#IoT #Cloud #DevOps] Crash Course in Open Source Cloud Computing By @ CitrixCloud | @ CloudExpo Kafka Poll: Producer and Consumer Client By @ Sematext | @ DevOpsSummit [#DevOps] DevOps Summit Was a Terrific Event! By @ QubellInc | @ DevOpsSummit [#DevOps] DevOps Is Even More Important Than You Think | @ DevOpsSummit [#DevOps] Cloud Computing Security Issues and Challenges By @ GiladPN | @ CloudExpo [#Cloud] Internet of Things and \"The Physical Web' By @ ScottJenson | @ ThingsExpo [#IoT] Beacon, Oh Beacon, Wherefore Art Thou Beacon? By @ ScottJenson | @ ThingsExpo [#IoT] Announcing @ Creative_Busine to Exhibit at @ CloudExpo New York [#Cloud] Creating the New Big Data Developer By @ ABridgwater | @ CloudExpo [#BigData] Big Data Analysis in Ad Marketing By @ Dana_Gardner | @ CloudExpo [#BigData] Cloud Computing - Big Data - Internet of Things SDDC - WebRTC - DevOps Cloud computing is become a norm within enterprise IT. The competition among public cloud providers is red hot, private cloud continues to grab increasing shares of IT budgets, and hybrid cloud strategies are beginning to conquer the enterprise IT world. Big Data is driving dramatic leaps in resource requirements and capabilities, and now the Internet of Things promises an exponential leap in the size of the Internet and Worldwide Web. The world of SDX now encompasses Software-Defined Data Centers (SDDCs) as the technology world prepares for the Zettabyte Age. DevOps into the mix, and you have three days of pure cloud computing that you simply cannot miss. Cloud Expo - the world's most established event - offers a vast selection of 130 + technical and strategic Industry Keynotes, General Sessions, Breakout Sessions, and signature Power Panels. The exhibition floor features 100 + exhibitors offering specific solutions and comprehensive strategies. The floor also features two Demo Theaters that give delegates the opportunity to get even closer to the technology they want to see and the people who offer it. Save $700 on your\" Golden Pass \"! Call 201.802.3020 or click here to Register Early Bird Expires February 28, 2015! Speaker Opportunities Submit your speaking proposal for the upcoming Cloud Expo in New York [June 9-11, 2015] Exhibitor Info. Copyright © 1994-2014 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. ."}, {"articleID": "2019052416_00032433_W", "names": {"Tony Parker": ["Q193108", "Q19588477", "Q52151028", "Q52899347"], "Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"]}, "date": "2019-05-24", "url": "https://adage.com/article/cmo-strategy/why-nike-picked-tiny-atelier-make-its-denim-shoe/2174001", "content": "CMO Strategy Why Nike picked this tiny atelier to make its denim shoe Denim is enjoying a widespread resurgence Published on May 24, 2019. Credit: Nike In the back corner of a clothing boutique in downtown Manhattan, past the bolts of denim hanging from the wall, eight tailors and one cutter are at work sewing custom jeans. Each will make just two or three pairs in a day. The shop, called 3x1 (three-by-one), has intrigued shoppers and industry insiders alike. It is known for experimenting with selvedge denim sourced from mills around the world and for playing with new designs. Fans include professional athletes such as Lebron James, <mark>Tony Parker</mark> and Victor Cruz, whose superhuman physiques are ill-served by off-the-rack denim. A fully bespoke 3x1 pair can run upward of $1,200, but there are other ways for a high-end label to gain exposure to new shoppers. On Friday, 3x1 and Nike Inc. are releasing three limited-edition selvedge denim shoe styles, putting the type of fabric on the Air Force 1 for the first time ever, after 1,500 iterations. The sneakers cost $130 and come in stonewash blue, raw indigo and black denim. It's an important moment for the small denim house. \"We've had so many Nike relationships over the years,\" said owner and denim industry veteran <mark>Scott Morrison</mark>. \"I hope that this will be the first of many things we get to do .\" Nike is under constant pressure to develop new styles, so it often collaborates with outside fashion houses and designers. Drops happen every few days in an eternal cycle of hype, long lines and sellouts. Nike delivered strong results globally last quarter, but had weak sales in North America due to a slow period at its U.S. retail partners. Using non-traditional materials is one way to stand out, but the new collaboration won't be the first denim sneaker. Adidas, Puma and Converse have all sold denim styles. Nike previously made denim skateboarding sneakers and Air Jordans in collaboration with Levi's. The relationship between Nike and 3x1 began, at least in part, like many New York relationships: thanks to forced proximity. The 3x1 store is right next door to NikeLab 21 Mercer, a high-concept shop that's frequented by celebrities and hosts regular sneaker drops. Nike Chief Executive Officer Mark Parker began visiting the neighboring shop in 2011, and <mark>Morrison</mark> often chats with Al Baik, senior creative director of men's footwear at Nike Sportswear. Baik wanted to put high-end denim on people's feet. \"It only made sense to leverage <mark>Scott</mark>'s passion and expertise to get us there,\" he said. Denim is enjoying a widespread resurgence at the moment, having mounted a comeback in the past two years after shoppers passed over the classic style in favor of leggings and yoga pants throughout the mid-2010s. <mark>Morrison</mark> was along for that whole ride: He's been in the denim business for decades, first with Paper Denim & Cloth, then Earnest Sewn, before going on to run Japanese denim company Evisu. At 3x1, the custom jeans are its standout product, but the bulk of its business is in wholesale. The label's regular jeans run for around $200 to $400 and can be found in luxury retailers such as Saks Fifth Avenue, Bloomingdale's and Net-a-Porter. <mark>Morrison</mark> hopes to open additional 3x1 stores in California and Europe. He declined to share revenue numbers, but said the business is now \"as close to I've ever seen to profitable .\" --Bloomberg News In this article: CMO Strategy Retail and E-commerce"}, {"articleID": "2013062306_00005794_W", "names": {"Norman Rosenthal": ["Q1702411", "Q3343773"]}, "date": "2013-06-23", "url": "http://thestar.com.my/lifestyle/story.asp?file=/2013/6/23/lifearts/13121425&sec=lifearts", "content": "Sunday June 23, 2013 Endlessly inventive By KATE CONNOLLY Anish Kapoor in front of his installation, Symphony For A Beloved Sun, which involves conveyor belts depositing red wax on the floor of Berlin's Martin Gropius Bau exhibition hall. One of the world's most important contemporary artists has a new exhibition in Berlin that the Germans are hoping the whole world will visit. SITTING in a Berlin gallery over a cup of tea, Anish Kapoor is clearly at home in a city that is staging one of his largest ever shows. The British-based artist, 59, says the exhibition, entitled Kapoor In Berlin, is the best show he has yet put on, which may have much to do with the fact that he feels Germany demonstrates a huge degree of respect for the arts - in stark contrast to Britain and much of the rest of the world. \"Germans have a rather healthy respect for the arts and artists,\" he says, adding that \"in Germany, it seems that the intellectual and aesthetic life are to be celebrated and are seen as part of a real and good education, whereas in Britain, traditionally - certainly since the Enlightenment (in the 17th and 18th centuries) - we've been afraid of anything intellectual, aesthetic, visual .\" One of the most highly regarded sculptors in the world, Kapoor is keeping much of the vast show, which covers more than 3,000 sqm at the Martin-Gropius-Bau exhibition hall, under wraps. But he does reveal that around half the works were created especially for the show. It was, he explains, his concerted effort to stop it from becoming a retrospective, the idea of which he is keen to resist as long as he is alive and working. \"I don't see the reason to be doing a retrospective,\" he says. \"Let somebody else do a retrospective for me. There doesn't seem any reason to dwell on what's been done. Rather, let's build on it and try and do something else. I'm trying to push my practice out there and to see,\" Can I do that? Will it go there?' \"A good half of the show is new, and that's always a risk. But that's the sort of idiot I am .\" Kapoor In Berlin is a culmination of the artist's huge body of work of the past three decades, an extravaganza of colour, shapes and textures that its British curator, <mark>Norman Rosenthal</mark>, has called an \"endlessly inventive theatre of sculpture\". As Kapoor chats before the opening, around him bustling workers in hard hats glide up and down on cranes, spray pigment on to walls, and remove plastic covers from sculptures as the show takes shape. Later, we are given a sneak preview of the works, including the centrepiece of the show. Emerging from holes in walls and a trapdoor in the floor, conveyor belts rise skywards, carrying big rectangular blocks of viscous, wine-red wax. As the wax moves up, it produces a squelching sound before falling off the end of the belt and landing with a satisfying splat on the linoleum floor. Overseen by a huge crimson sphere suspended from a metal frame, Symphony For A Beloved Sun is a new creation that fills the exhibition hall's main atrium. Along with the other structures, it reveals the potential the show has to beguile the public, something Kapoor's audience has long come to expect of him. There is everything from a deflated whale, whose maroon mass spills across three rooms; to warty, cave-like innards fashioned from synthetic resin; huge geometrically fragmented mirrors; twisted stainless steel pillars; and a gigantic, slowly rotating wax bell. There is even an old British Telecom generator. Crafted from sandstone, alabaster, Kilkenny limestone and fibreglass are also the protuberances and orifices, mountains and tomb-like structures that have become Kapoor trademarks, including the subtle bulge in the wall called When I'm Pregnant, all of which reflect the long and complex history of Britain's most celebrated sculptor in a show he says is \"private and public in a very curious, sometimes uncomfortable mix\". Exhibiting at the Martin-Gropius-Bau hall, a neo-Renaissance pile in the centre of Berlin, is both a challenge and an inspiration for Kapoor, who has had to deal not just with its complicated, decorative interior, of late-19th-century ornate pillars and mosaics but also with the history that envelops the building: the Berlin Wall and the SS headquarters (of the Nazi secret police during WWII) are literally squeezed up against it, visible from the gallery's windows; and he makes deliberate references to them in his works. \"It's a building with a curious, difficult history that is inexorably linked to the history of Berlin,\" says Kapoor. \"That's very potent. You can't make a show here without some reference to all of that. And it certainly makes a show here so much more interesting .\" Symphony For A Beloved Sun is a nod to one of Kapoor's heroes, the late German sculptor Joseph Beuys, who exhibited in the same atrium space shortly after the building's postwar restoration, in 1982. It also strongly alludes to the industrialised, bloody mass murders of the Nazi era, according to <mark>Rosenthal</mark>. German critics have been quick to make the same connection to the favourite among Kapoor's fan base, Shooting Into The Corner - which has been given a room of its own - in which a cannon fires round pellets of wax into the far corner, staining the walls a blood red. \"We're pleased to say the wax stains can be removed when smeared with margarine,\" says the Martin-Gropius-Bau's director, Gereon Sievernich, highlighting just one of the many challenges Kapoor's works are posing as he inspects a show that is still very much under construction five days ahead of its opening. Other practical headaches have included the transportation, by a convoy of lorries, of the huge pieces from Kapoor's London studio. Some had to be dismantled before they could be brought into the hall; others were heaved in on horizontal cranes after window frames had been removed. For Kapoor, the arrival of his works in the space for which they were conceived over a period of months, during which their creation dominated his life, brings with it a huge sense of achievement. \"Getting things out of the studio is great, very exciting,\" he says. \"It's only when they are in the real world that they have a life of their own .\" One of his own favourites among the new works - which he describes as a \"mad, crazy idea - is the deflated PVC whale, called Death Of A Leviathan. It takes up an entire side of the building, and reinforces Kapoor's sense of responsibility towards tackling major societal issues .\" It's a big deflated skin, like a huge dead whale, a Hobbesian reference to the state being a kind of Leviathan beast that gives its control to the individual, \"he says .\" Death Of The Leviathan may imply the kind of death or deflation of the state, this present condition we seem to be in all over the world where the individual has to take responsibility for the things that the state once took responsibility for. \"- Guardian News & Media> Kapoor In Berlin is on at the Martin-Gropius-Bau exhibition hall, Berlin, until Nov 24, 2013. For more information, go to tinyurl.com/m3md8k8."}, {"articleID": "2012011801_00015479_W", "names": {"Rick Wilson": ["Q16186444", "Q16196773", "Q28421760", "Q3431613", "Q605482", "Q7331863", "Q7331864"]}, "date": "2012-01-18", "url": "http://us.rd.yahoo.com/dailynews/rss/politics/*http://us.rd.yahoo.com/dailynews/external/politico_rss/rss_politico_mostpop/http___www_politico_com_news_stories0112_71568_html/44211327/SIG=11mvtraa5/*http://www.politico.com/news/stories/0112/71568.html", "content": "mitt romney, the choice is stark. he can stop equivocating and cough up the tax returns that his rival republicans and reporters are clamoring for. or he can make an audacious effort to reverse a precedent that has been in place for more than four decades. there really isn't genuine drama-there is virtual unanimity among veterans of presidential politics that romney has no choice but to disclose. what's left is a mystery: what could romney be thinking with his slow striptease - tuesday's reveal was that he pays an effective partial disclosure in the spring, but has not been specific about how many years of returns he would make available. the awkwardness with which romney is handling the question-including a halting performance at a republican candidates debate monday night-is proving to be a serious distraction, and a contrast to the generally smooth fashion by which his campaign has dispatched most controversies, according to several operatives. \"it's not that they are hiding anything, it's not that they are doing anything illegal, but they have a baseline belief that there is no good that comes from releasing their tax returns,\" said <mark>rick wilson</mark>, who worked for rudy giuliani's 2008 campaign. \"it's a natural sense of caution that these guys have .\" and on top of that, romney's got an unenviable contrast as he looks toward the general election: barack obama released six years' worth of tax returns by march 2008, and has released them every year he's been in the white house. making it worse - the person who set the precedent of releasing returns that every major presidential candidate since has followed was romney's own father, who put out 12 years' worth a year before his own 1968 run. the returns are sure to cause problems for romney - running in a recession with every one of his many millions of dollars revealed isn't the image he'll want, and it's almost inevitable that some of his investments will run him into political trouble. but he was going to be pressed to release them at some point ahead of november, and the intensity of attacks he's been facing since monday night's debate suggest that he's only hurting himself by not having released them already. \"it doesn't seem to make sense to me,\" said chip saltsman, who managed mike huckabee's 2008 campaign. \"now that he's really put himself in to a box on this, he's going to have to release them sooner than april. my guess is there's lots of fun stuff in there .\" it's a replay of romney's bumbling initial response to the attacks on his bain record, a campaign appearing to be caught flat-footed as a narrative that could last through the general election took hold. the tax return storyline threatens to be the next cut in a dangerous narrative for romney: that he got rich by exploiting the little guy and isn't interested in explaining the details. romney hasn't helped his case. pressed at the debate, he first dodged a question from rick perry about the tax returns, then offered a halting response when moderator kelly evans followed up. cayman islands mittens mitt romneys probably using bernie madoffs accountants. my prediction: some hedge fund shorting activity. probably shorting mortgage backed securities. imagine the headlines: willard bets against america!"}, {"articleID": "2018121114_00299829_W", "names": {"Sergio Costa": ["Q54565819", "Q59614449"]}, "date": "2018-12-11", "url": "http://www.leaderlive.co.uk/news/national/17290515.romes-waste-troubles-turn-into-emergency-after-blaze/", "content": "Smoke rises from the fire 0 comments Rome's long-standing waste problems turned into an emergency as a huge fire at a disposal plant blanketed the Eternal City in smoke and forced authorities to scramble to find alternative facilities to treat the capital's rubbish. The Salaria plant has been the subject of protests for years by residents complaining of putrid smells and demanding its closure. Arson was suspected as the blaze put the plant out of operation indefinitely. It also sparked shorter-term health concerns given the huge cloud of smoke that covered the city. Smoke rises from the fire (Italian Firefighters Vigili del Fuoco/AP) While no health emergency was declared, Rome authorities urged residents to close their windows and stay indoors. Officials also recommended Romans avoid eating produce cultivated near the plant, suggesting fears of toxic residue settling in the northern part of the city. Authorities are trying to monitor the smoke cloud and to find an alternative plant for regular waste treatment and to deal with the Christmas period, when rubbish collection spikes. The Salaria facility treats about 800 tons of garbage a day--between 20% and 25% of the city total, news reports said. Rome's garbage collection and disposal system were notoriously insufficient even before the plant went out of service, and officials acknowledged the blaze had turned a festering problem into an emergency. Firefighters work to extinguish the fire (Massimo Percossi/Ansa/AP) Mayor Virginia Raggi appealed for local authorities in Lazio and other regions to lend a hand and open their depots to Rome's waste for the foreseeable future. \"All institutions are working to facilitate a solution,\" she said at a news conference that was interrupted by hecklers. Environment minister <mark>Sergio Costa</mark> said health authorities have determined that there is no immediate health emergency due to the smoke, but the situation is being monitored. He suggested foul play, noting that in recent days structural work had begun to improve the plant's functioning and capacity. \"It's perplexing that precisely at the moment that the problem was being dealt with...a fire breaks out,\" he said. 0 comments"}, {"articleID": "2019050705_00205291_W", "names": {"Ashley Graham": ["Q4805451", "Q4805452", "Q53680948"], "Sophie Turner": ["Q240573", "Q735034"]}, "date": "2019-05-07", "url": "https://www.msn.com/en-gb/lifestyle/beauty/the-36-best-—-and-wildest-—-hair-and-makeup-looks-celebrities-wore-to-the-2019-met-gala/ss-AAB0tnj?srcref=rss", "content": "Full Screen 1/37 SLIDES © Theo Wargo/Getty Images Each year, tons of celebrities attend the Met Gala in New York City wearing their most daring ensembles. But aside from their wild fashion choices, many people also wear showstopping makeup and hair looks to the event. On Monday, a number of stars attended the 2019 Met Gala at the Metropolitan Museum of Art wearing everything from false eyelashes to bright eye makeup in an attempt to match the event's theme of \"Camp: Notes on Fashion .\" Below, take a look at some of the best - and wildest - looks worn to this year's gala. 2/37 SLIDES © Theo Wargo/Getty Images Lady Gaga arrived wearing long eyelashes and fake tears. She also matched her lips to her ensemble with Barbie-pink lipstick, and donned a short blonde hairstyle. 3/37 SLIDES © Theo Wargo/Getty Images Laverne Cox used her makeup to add pops of color to her black ensemble. The actress wore blue eye shadow, purple lipstick, and a light-blue hairstyle. 4/37 SLIDES © Dia Dipasupil/Getty Images <mark>Ashley Graham</mark> added pearls and a bow to her ponytail for a touch of glam. The model also accessorized with Gucci hair clips, green eyeliner, and bright highlighter. 5/37 SLIDES © Theo Wargo Regina Hall dazzled with gems across her eyelids. Her look was completed with bold eye shadow and pink hair. 6/37 SLIDES © Dia Dipasupil/Getty Images Sara Sampaio's eyelashes feathered out at the corners. The model looked fierce, especially thanks to her smoky eye makeup. 7/37 SLIDES © Dia Dipasupil/Getty Images Awkwafina matched her eye shadow to her dress. For her first Met Gala appearance, the actress wore gold glitter across her eyelids, and glossy red lipstick. 8/37 SLIDES © Dia Dipasupil/Getty Images Charli XCX contrasted her yellow dress with a pink-and-red beauty look. As she walked the red carpet, the musician showed off her bright-pink eye shadow, and brown hair with red tips. 9/37 SLIDES © Evan Agostini/Invision/AP Mindy Kaling ditched her usually dark hair for a lighter shade. Kaling's blonde hairstyle perfectly complimented her gold dress. 10/37 SLIDES © Theo Wargo/Getty Images Billy Porter stunned with his golden makeup. His eyelids and eyebrows were entirely covered with sparkles, small pearls, and jewels. He also wore berry-colored lipstick with a gold streak down the middle. 11/37 SLIDES © Charles Sykes/Invision/AP Aquaria donned a bold white hairstyle and equally daring makeup. Her hairstyle appears to have been slicked down with white paint, while her eye makeup looked geometric. 12/37 SLIDES © John Shearer/Getty Images Natasha Lyonne went for a smoky eye look. She also wore her hair in a curled style that sat right above the wings of her suit. 13/37 SLIDES © Dia Dipasupil/Getty Images Darren Criss made a case for blue eye shadow at the 2019 Met Gala. Like Billy Porter, Criss also drew a line down the center of his lips, though in red. 14/37 SLIDES © Dia Dipasupil/Getty Images Madelaine Petsch experimented with bangs on the red carpet. Her pink eye shadow perfectly complimented her turquoise gown. 15/37 SLIDES © Theo Wargo/Getty Images Lucy Boynton also mixed shades of blue and pink. The actress wore a blue hairstyle to the Met Gala, as well as silver lines surrounding her eyes. 16/37 SLIDES © Evan Agostini/Invision/AP Constance Wu opted for a dark version of a 1920s beauty look. She wore dark lipstick, as well as a short and curled hairstyle. 17/37 SLIDES © Evan Agostini/Invision/AP Alessia Cara had black dots drawn across her eyes. The musician paired winged eyeliner with six black circles across her face. 18/37 SLIDES © Mike Coppola/MG19/Getty Images Elle Fanning looked like she stepped out of another decade with her half-up half-down hairstyle. She paired the look with blue winged eyeliner, and shiny pink lipstick. 19/37 SLIDES © Charles Sykes/Invision/AP Kacey Musgraves channeled Barbie in a blonde wig. And to match her outfit, the musician wore simple eye makeup and a bold pink lip color. 20/37 SLIDES © Evan Agostini/Invision/AP Gigi Hadid had some of the longest eyelashes on the red carpet. The model's eyelashes were a stark white color, while the rest of her face was almost bare. 21/37 SLIDES © Mike Coppola/MG19/Getty Images Dua Lipa wore jeweled barrettes in her hair. Her usually short hair was transformed into a long style with a beehive shape. 22/37 SLIDES © Dia Dipasupil/Getty Images Lily Collins wore a similar hairstyle. But rather than wearing jewel hair clips, the actress wore a white headband and flower clips. She also donned purple eye shadow. 23/37 SLIDES © Mike Coppola/MG19/Getty Images Hailey Steinfeld opted for a curled hairstyle with a large bow on top. For her makeup, the star chose green eye shadow, pink lipstick, and matching blush. 24/37 SLIDES © Dia Dipasupil/Getty Images Kylie Jenner matched her hair to her colorful gown. The reality TV star rocked a sleek purple hairstyle at the event. 25/37 SLIDES © Mike Coppola/MG19/Getty Images Dakota Johnson was one of many celebrities to wear pink eye shadow at the Met Gala. Her hair was more simple, styled in natural-looking waves. 26/37 SLIDES © John Shearer/Getty Images Priyanka Chopra Jonas looked like a completely different person on the red carpet. Her usually sleek hair was styled in curls, and her dark eyebrows were made an icy white. She also wore berry-colored lipstick, red eye shadow, and white eyeliner. 27/37 SLIDES © Dia Dipasupil/Getty Images Tessa Thompson's hair doubled as a whip. Her ponytail was covered in latex, and extended past her feet. 28/37 SLIDES © Dia Dipasupil/Getty Images Ciara had one of the biggest--and best--hairstyles of the night. She wore an afro that extended past her shoulders, as well as green eye shadow that matched her dress. 29/37 SLIDES © Dia Dipasupil/Getty Images Ezra Miller turned his face into an optical illusion. Though he carried a mask, the actor mostly walked the red carpet while showing his actual face, which was covered with seven eyes. 30/37 SLIDES © Dia Dipasupil/Getty Images La La Anthony took a unique approach to her hairstyle. To match her money-themed dress, the actress walked the red carpet with coins attached to her head. 31/37 SLIDES © Dia Dipasupil/Getty Images Though Cara Delevingne's makeup was minimal, the model did add one pop of color to her face. From one cheek to the other, the model wore a neon-orange streak across her face. 32/37 SLIDES © John Shearer/Getty Images Lili Reinhart channeled Marie Antoinette with her bold hairstyle. She attached flowers to one side, and completed the look with pink blush and matching eye shadow. 33/37 SLIDES © John Shearer/Getty Images Kristen Stewart paired an orange-and-yellow beauty look with her dark ensemble. Her eyes were decorated with the same colors - Stewart wore an orange shade over her eyebrows, and white shadow directly underneath. 34/37 SLIDES © John Shearer/Getty Images Lupita Nyong' o had one of the most eye-catching beauty looks of the night. She wore five gold combs in her hair, and sparkling eye makeup across her lids. She also donned lipstick in a deep shade of purple. 35/37 SLIDES © John Shearer/Getty Images Nicki Minaj chose to wear pink hair for the occasion. The rest of her beauty look was understated, and included winged eyeliner, minimal blush, and glossy lips. 36/37 SLIDES © Theo Wargo/Getty Images Kim Kardashian West looked stunning in neutral makeup with a smokey eye. Her hairstyle was just as flattering, and came down in lose waves. 37/37 SLIDES © John Shearer/Getty Images <mark>Sophie Turner</mark> and Joe Jonas wore matching slicked-back hairstyles to the Met Gala. <mark>Turner</mark> took an extra step by adding bright-blue eye makeup. 37/37 SLIDES 1/37 SLIDES Next Slide"}, {"articleID": "2018020702_00618816_W", "names": {"Chris Morris": ["Q2326339", "Q2547938", "Q3675540", "Q48975640", "Q5107505", "Q5107506", "Q5107507", "Q5107508", "Q5107509", "Q552780"], "David Miller": ["Q1175688", "Q12899557", "Q15455696", "Q16185473", "Q19875639", "Q20656547", "Q28870727", "Q3018511", "Q30607124", "Q404333", "Q404779", "Q5237563", "Q5237568", "Q5237569", "Q5237573", "Q5237574", "Q5237576", "Q55196713", "Q56458216", "Q57729525", "Q57832355", "Q6828449", "Q92986"]}, "date": "2018-02-07", "url": "https://www.newsx.com/sports/india-vs-south-africa-kuldeep-yadav-is-more-difficult-to-play-than-yuzvendra-chahal-says-shikhar-dhawan", "content": "India vs South Africa: Kuldeep Yadav is more difficult to play than Yuzvendra Chahal, says Shikhar Dhawan India vs South Africa: Kuldeep Yadav is more difficult to play than Yuzvendra Chahal, says Shikhar Dhawan Indian opener Shikhar Dhawan has picked chinaman Kuldeep Yadav as the more difficult bowler to play between the wrist spin duo of Yadav and Yuzvendra Chahal. Both the spinners have been in incredible form in the ongoing South Afric series but for Dhawan, Yadav's variation has an edge over Chahal's turn. By 8:16 AM Kuldeep Yadav has been in scintillating form in South Africa | Phoot - IANS | Indian spinners have been the force behind team's phenomenal performance in the first two games of the ongoing India South Africa ODI series. The wrist-spin duo of Yazuvendra Chahal and Kuldeep Yadav has particularly caused a lot of problems to the South African batsmen with their pinpoint spin bowling. The wrist-spinners share 13 wickets between each other from the first two games and will aim to continue their destructive form further in the series. While the Proteas batsman who are not used to playing spin on the rough South African patches are finding it difficult to play turn, Indian batsmen play the duo in the nets every day and have accustomed themselves to the spin very well. Ahead of the third ODI in Cape Town, Shikhar Dhawan has given his verdict on who out of the two spinners is more lethal. Though both the wrist spinners have been in great form in the series, Dhawan singled out Chinaman Kuldeep Yadav as the one he finds more difficult to play. Yadav ever since rising to prominence in the IPL has been an integral part of the Indian setup in the shorter formats and has lately formed a lethal partnership with Yuzvendra Chahal. \"From my point of view, chinaman is more difficult to read. Between Kuldeep and Chahal, I think Kuldeep is a little harder to read. There are players who can't read googlies. They will find Chahal's googlies tough to handle. As far as I'm concerned, I find Kuldeep a little more difficult to read,\" said Dhawan who is himself a fantastic batsman of spin. Chahal-Yadav duo has spun magic for India on the dusty South Africa tracks which are often ruled by the pacers. While the likes of Kagiso Ranbada, Morne Morkel are failing to hit the chords for their side, Chahal and Yadav have combined well for India to see off the challenge from the Proteas batsmen. The duo bundled out South African innings in the second ODI to help India post a comprehensive victory by nine wickets. They ran through the South African top and middle order picking eight wickets between them. Chahal went on to bag his first five-for against South Africa by dismissing the likes of Quinton de Kock, JP Duminy, K Zondo and <mark>Chris Morris</mark>. Meanwhile, Kuldeep packed skipper Markram and explosive batsmen <mark>David Miller</mark> along with Rabada, in the end, to stop the Proteas on a spectacularly low total of 118. Talking about the rainbow nation's problem in adapting to wrist-spin, Dhawan said, \"It's difficult to play the wrist spinners because they can turn the ball even on a flat track. Especially the overseas players...They are not used to (playing spin). So the wrist spinners can create doubts in the batsmen's mind. That's why they are effective .\" India's bowling has gone strength to strength on this tour and there was rarely a sight even in the Test series which India lost 2-1 that the Indian bowlers were not on par with the South Africans. It was most of the time their batting that failed Virat Kohli and his men. But Chahal and Kuldeep have remarkably turned things around for the Men in Blue under the able guidance of Kohli and imperative inputs of MS Dhoni from behind the wickets. They will aim to continue their brilliant run in the series when they take the field in the third ODI in Cape Town. Talking about the South African's problems of failing to tackle the spin, Dhawan ruled out the fact that they have been too impatient with the bat and instead pointed out losing wickets in the middle order as a bigger factor in the result of the first two ODIs. \"I won't say it's the lack of patience, for when you are playing the ODIs you have to score runs (quickly). They can answer it better; about their problems. But they are losing wickets in a heap in the middle-overs, which is the reason why they are not getting to their target scores. If you have doubts in your mind, then that reflects on your batting. And this is giving us the advantage,\" said Dhawan. South Africa who are already trailing behind 2-0 in the six-match series would aim to bounce back strongly in the third ODI but the team will once again be without three of their key batsmen which makes it more difficult for them. Apart from AB de Villiers and Faf Du Plessis, wicket-keeper batsman will also miss out the Cape Town ODI after picking up a wrist injury in the second game at Centurion. He is likely to be rested for 3-4 weeks and looks set to miss out on the T20 series as well."}, {"articleID": "2017092901_00231986_W", "names": {"Nelson Cruz": ["Q1133784", "Q11957344", "Q6990454"], "Felix Hernandez": ["Q1196594", "Q58310246"], "James Paxton": ["Q28054192", "Q6141080"], "Erasmo Ramirez": ["Q3055980", "Q5384933"], "Andrew Moore": ["Q17144472", "Q30597809", "Q4758056", "Q4758057", "Q4758058", "Q4758059", "Q506356"], "Nick Vincent": ["Q3339807", "Q7028082"], "Edwin Diaz": ["Q11290336", "Q5346370"], "Masahiro Tanaka": ["Q11575599", "Q11575656", "Q911463"]}, "date": "2017-09-29", "url": "http://tdn.com/sports/m-s-need-moves-to-stay-relevant/article_12e88e36-0d71-53b4-ba61-5b5fe10b5a6f.html", "content": "SEATTLE--It was four years ago when, seeking to jolt the franchise out of its extended doldrums, the Mariners shocked the baseball world by shelling out $240 million to sign second baseman Robinson Cano to a 10-year deal. Numerous club officials admitted privately at the time that such a contract made little financial sense in strict baseball terms. While Cano was then one of the game's premier players, he had just turned 31. The Mariners were hoping for four-to-five years of peak performance before age began to erode (gradually they hoped) his skills. The massive deal only made sense when linked to a franchise reset with its waning fan base and within the industry. The Mariners wanted everyone to know they were committed to winning. Signing Cano was a statement. Results to date have been mixed but generally disappointing. Cano has been an All-Star in three of his four seasons in Seattle. It's also unlikely <mark>Nelson Cruz</mark> would have signed a year later as a free agent if not for the franchise commitment shown in signing Cano. The Mariners, after perennially slogging through the season's closing weeks, played meaningful games in September in three of the last four years. They twice went to the season's final weekend before getting eliminated from postseason contention. But their postseason drought is now up to 16 years. All 29 other clubs have experienced postseason since the Mariners' magical 2001 run ended in a disappointing loss to the New York Yankees in the American League Championship Series. It's time for the Mariners to make another offseason splash. Texas and the Los Angeles Angels are in the process of turning over veteran rosters and have shown a willingness to spend in order to win. Oakland faces severe financial challenges but has nonetheless assembled a deep group of talented youngsters. Bottom line: The AL West already has an emerging bully in Houston, and the Mariners' three other division opponents each show signs of improvement. It's an arms race that can't be ignored. The Mariners recognize all of this, and they've taken steps over the last two seasons under general manager Jerry Dipoto to transform their roster into a younger, more athletic collection. \"Look around our diamond,\" he said. \"Our catcher (Mike Zunino) is 26. Our shortstop (Jean Segura) is 27. Our third baseman (Kyle Seager) is 29. Our outfielders (Mitch Haniger, Ben Gamel and Guillermo Heredia) are all 25 or 26 .\" We're not an old team outside of looking at <mark>Cruz</mark> and Cano. \"The pitching staff offers a similar story. While <mark>Felix Hernandez</mark> is an old 31 (in terms of mileage), the remaining rotation candidates are under 30: Mike Leake is 29, <mark>James Paxton</mark> and Ariel Miranda are 28, <mark>Erasmo Ramirez</mark> is 27, Marco Gonzales is 25 and <mark>Andrew Moore</mark> is 23. Lefty relief specialist Marc Rzepczynski is 31, and setup man <mark>Nick Vincent</mark> is 30. But closer <mark>Edwin Diaz</mark> is 23. Emilio Pagan, James Pazos and Shae Simmons are 26. Dan Altavilla is 24. Prospects Thyago Vieira and Max Povse are 23. The obvious offseason target is Japanese two-way star Shohei Otani, who is expected to be posted for MLB consideration in coming weeks by the Nippon Ham Fighters of the Pacific League. Otani is 23, which means he is subject to the international spending limits, which effectively eliminates a bidding war. The Mariners plan to make a strong push. Early indications suggest Otani will make a decision prior to the Winter Meetings. Whatever happens with Otani, the Mariners' primary offseason needs are to acquire an impact starting pitcher, a first baseman and a center fielder. They could pursue a corner outfielder if they choose to move Haniger to center. Trades are possible and have been Dipoto's preferred player-acquisition approach, but the Mariners' thin farm system makes any impact addition difficult to obtain without significantly weakening another area. The offseason roster turnover projects to free roughly $20 million in payroll once guaranteed increases for Seager and Segura are computed along with projected pay hikes for a handful of arbitration cases. Further relief is on the horizon. <mark>Cruz</mark>'s contract runs one more year at $14 million, and <mark>Hernandez</mark>'s deal runs two more years for a guaranteed $53 million. Neither is well positioned for a significant new contract. <mark>Hernandez</mark>'s form dipped significantly over the last three seasons, and while <mark>Cruz</mark> remains one of the game's premier sluggers, any new deal will start with his age-39 season. Signing an impact free agent will be costly, but big deals in recent years for <mark>Hernandez</mark>, Cano, <mark>Cruz</mark>, Seager and Segura suggest the Mariners are willing to spend money on what they view as reliable assets. So who's available on the free-agent market? The big splash for the rotation would be Yu Darvish, whom the Mariners know well from his time in Texas. Other high-impact possibilities are Jake Arrieta and <mark>Masahiro Tanaka</mark>. Signing Darvish or <mark>Tanaka</mark> could aid the Mariners in recruiting Otani, although getting either one signed--even assuming mutual interest develops--prior to Otani making a decision seems a long shot. More-likely rotation targets include Alex Cobb or Lance Lynn. The market is loaded with first basemen, including the Mariners' current duo of Yonder Alonso and Danny Valencia. The big name is Eric Hosmer, but the Yankees and Boston are expected to pursue him which, if so, could quickly escalate into a bidding war. The more likely possibilities for the Mariners are Lucas Duda or Mitch Moreland. The Mariners could choose to fill their need for a center fielder by retaining free-agent Jarrod Dyson, who could again form an effective platoon tandem with Guillermo Heredia. The best available free-agent center fielder is Dyson's old teammate in Kansas City: Lorenzo Cain, who figures to draw heavy interest. Possibilities widen if the Mariners shift Haniger to center field on a full-time or part-time basis. The top available free-agent corner outfielders are J.D. Martinez, Jay Bruce and possibly Justin Upton (if he opts out of his current contract)."}]