[{"articleID": "2016092917_00086772_W", "names": {"Chris Green": ["Q18686459", "Q19957945", "Q2048639", "Q5106713", "Q5106714", "Q5106715", "Q5106716", "Q5106717", "Q5106718", "Q59162298"]}, "date": "2016-09-29", "url": "http://www.star-telegram.com/news/local/community/weatherford-star-telegram/wt-news/article104893256.html#storylink=rss", "content": "September 29, 2016 11:53 AM Hudson Oaks hires new police chief Michael BaldwinCOHOPhoto courtesy i Order Reprint of this Story After a lengthy search process, the City of Hudson Oaks has selected Michael Baldwin as the new Chief of Police. Baldwin has more than 33 years of law enforcement experience and currently serves as a Captain with the Fort Worth Police Department. Although he spent most of career in Fort Worth, Baldwin has lived in Parker County for 29 years. Baldwin managed the Communications Division, West Division, North Division, Special Projects, Data Management, Support Services, Staffing Management, and Internal Affairs at the Fort Worth Police Department. \"Chief Baldwin brings a wealth of experience to our department, and with the explosive growth occurring in Parker County, Hudson Oaks is strategically investing in public safety,\" Mayor Pat Deen said. \"I am excited to provide our existing officers with a leader of Michael's caliber and look forward to the contributions he will make within the Parker County law enforcement community.\" Baldwin said he was very honored and blessed to be selected for the position. \"It is very exciting to become part of such a dynamic city,\" Baldwin said. \"I appreciate Chief <mark>Chris Green</mark> for his leadership during this interim period. I look forward to serving the citizens of Hudson Oaks and working with the members of the department, the city administration, city staff and the city council.\" Chief Baldwin will officially be sworn in on Dec. 1, after winding down his current commitments with the City of Fort Worth."}, {"articleID": "2009081505_00041398_W", "names": {"James Crowley": ["Q30143123", "Q6131990", "Q6131992"], "Walter Williams": ["Q15896691", "Q16019605", "Q18129269", "Q18603382", "Q7964738", "Q7966428"], "Colin Powell": ["Q150851", "Q5145485"], "David Gonzalez": ["Q18685628", "Q3017983", "Q5234219", "Q8354119"], "Eric Holder": ["Q312644", "Q3591180"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2009-08-15", "url": "http://americanthinker.com/2009/08/all_the_presidents_bigoted_men.html", "content": "all the president's bigoted men by when barack obama said that the henry louis gates affair was a teachable moment, he spoke truly. but the key is ensuring that the right things are taught and the right people learn. unfortunately, this is unlikely to happen. there is no need to rehash the events of july 16 chapter and verse. we all know about how the harvard professor flew into a rage of racial accusations and haughty posturing after sergeant <mark>james crowley</mark> appeared at his cambridge home to investigate a report of a possible break-in. we've heard that gates called <mark>crowley</mark> a \"racist\" and said he was being targeted because \"i'm a black man in america.\" we know how barack obama stirred the pot, saying at a press conference that he didn't know all the facts but then averring that the police \"acted stupidly.\" and we also know that it's a foot-in-mouth moment obama wishes he could do a groundhog day on, and that he fancies a beer a substitute for an apology. moreover, the obvious points have already been made. we know that the police were simply following procedure in requesting gates' identification and asking that he step outside his home. it has also been mentioned that, far from the police racially profiling the man, he and obama applied that technique in assuming that the white police officer was bigoted and/or acting stupidly. and, in keeping with last point, some of the boldest commentators even have hinted that bigotry may lie in the hearts of gates and obama. yet no one has thus far dared expose the pretense. i didn't need the gates affair, eye-opening for some, to understand the nature of a gates or of obama. immediately upon learning of gates' existence, i knew he was another one of the president's many, many bigoted men. and even before obama dared stray beyond the guiderails of the teleprompter and commented on the matter, i knew that another one of the president's bigoted men stared back at him every day in the mirror. in reality, i knew this even before learning of yet another one of the president's bigoted \"men,\" sonia \"wise latina\" sotomayor and even, actually, prior to being bombarded with the bile of his most notorious bigoted man, reverend jeremiah wright. i knew it for a very simple reason. for all intents and purposes, most politically liberal blacks are bigoted. if they buy into the entire package of liberal tenets, they are bigoted by definition. of course, we all know what is coming. many will say that i'm prejudiced for painting all the members of such a large group with the same brush. but let's note that \"prejudice\" in the negative sense denotes an unfavorable opinion about a person, group or thing that has no basis in reality. for instance, the wise latina had her foot-in-mouth moment when she said, \"i would hope that a wise latina woman with the richness of her experiences would more often than not reach a better conclusion than a white male who hasn't lived that life.\" however, if this had a basis in reality, it would not be a prejudice. so let's examine whether or not my assertion has that basis. i'll begin by emphasizing two things, the first of which will make it seem as if i'm being politically correct and the second of which will disabuse the reader of that notion. first, it goes without saying that there are blacks who aren't bigoted--they also aren't liberal. there are my two favorite economists, <mark>walter williams</mark> and thomas sowell; the man i want as president, alan keyes; talk show host larry elder; minister and head of b.o.n.d jesse lee peterson; and many, many others. between this ideological set and politically liberal blacks is another basic group, one epitomized by <mark>colin powell</mark>. while its members are weak sisters philosophically, it wouldn't be fair to describe all of them as bigoted. now for the second thing: even putting the keyes and <mark>powell</mark> groups together, percentagewise they are part of a very small minority. boyz n' the hood, the father character, played by laurence fishburne, gives a motivational speech about how the presence of alcohol and gun stores in south central l.a. is the result of a white conspiracy. note that he is cast in the film as the wise patriarch, a voice of reason. of course, this is hollywood, but it's also a case of art imitating life. we long ago learned about the surprisingly large numbers of black people who believe the aids virus is the result of a white conspiracy to wipe out blacks. and this paranoia also explains countless everyday interactions. for instance, some years ago there was the story of that public official who used the word \"niggardly\" at a meeting, and i the woes of illinoisan <mark>david gonzalez</mark>, who, replying to a query, told a black co-worker that a symbol he was wearing was a clan badge (scottish clan, a symbol of ethnicity). in both cases, the men were targeted by bigoted leftist blacks who were sure they were prejudiced. then there is bigoted obama man attorney general <mark>eric holder</mark>, who mentioned that he also was \"profiled\" by the police in this. now, i don't doubt that he believes he was unjustly targeted, but, then, i know something else: i've been \"profiled\" as well. i could tell you about a couple of incidents in which i was pulled over simply because i was in the wrong place, in the wrong kind of vehicle and, in one case, the wrong age. this, not to mention that i was the wrong sex--remember, the police view men much more suspiciously than women because, like some other groups, they commit an inordinate amount of the crime (note that the complaints of profiling we hear always involve black men). then there is that esteemed academic professor gates, who was sure that sgt. <mark>crowley</mark> was a \"\"racist' police officer.\" and there are many other such examples. now, why would anyone read bigoted motives into innocent things? it's not always a machiavellian playing of the race card, i can assure you. there is another reason. we've all had experiences with those who are prejudiced against an individual. it might have been a mother-in-law who just couldn't stand her son's wife, or a person who, after years of marital conflict, was fatally biased against his spouse. and when you thus hate someone, it's so often the case that you view him through colored glasses. his trespasses are then never innocent mistakes, are they? and are his errant comments ever just slips of the tongue? no, they're the result of evil motives, a desire to target you for attack. the thinking is, \"you know, that's just the kind of thing that scum of the earth would do!\" in reality, we'd do well to bear in mind that you should \"never attribute to malice what is better explained by stupidity,\" but the prejudiced person will never distinguish between the innocent and insidious. hatred is like darkness: the more there is, the less you can see. it is no different with politically liberal blacks. gates, aids conspiracy theorists, the niggardly-and-clan police and many others are just sure that those who \"offended\" them are bigoted because, well, that's just what white people do. also note that the demonization of whites is part of leftist dogma (i refute this). this was apparent even four decades ago when feminist susan sontag infamously proclaimed, \"the white race is the cancer of human history.\" and the idea gains ever more currency. in fact, i have encountered numerous whites who have expressed such sentiments, including a man online recently who wrote that he was \"ashamed\" to be white. yet, if such anti-white loathing is present among leftist whites out of a sense of being \"oppressors,\" how much more prevalent is it among leftist blacks, who view themselves as the oppressed? the answer is that it's common enough--and accepted enough--so that another one of the president's bigoted men, reverend joseph lowery, was given the podium and allowed to pray for a day \"when white will embrace what is right\" during obama's inauguration. oh, and obama didn't say he was sorry for that, either. it just seems that he only apologizes to those he considers then we have that old political observation about how blacks are actually quite conservative culturally. this evidenced itself just last november when 70 percent of blacks voted for california's proposition 8, which defined marriage as the union between a man and woman, versus only 49 percent of whites. now, while the phenomenon of black cultural conservatism is certainly exaggerated a bit, we have to ask, why would such a group vote democrat 95 percent of the time? the answer is race. there is a strong feeling in the black community that the republicans are the white party, which is no doubt why screaming howard dean this stereotype in 2008. and to rise above this--as alan keyes and the other fine gentlemen i've mentioned have done--is to transcend leftist politics itself. as for politically liberal blacks, the reality is that they are consumed by race. they live and die with it, eat it and breathe it. as an example, consider a certain affirmation black women sometimes utter to young black boys: \"you're going to grow up to be a strong, young black man!\" now, this isn't designed simply to reassure the lads that they're not going to go the way of <mark>michael jackson</mark>. there is another reason. everyone tends to define himself in some manner, viewing some particular status as central to his being. this should be \"child of god\" but usually is something else; it could be the quite wholesome identity of \"father\" or \"mother,\" or it could be \"policeman,\" \"doctor\" or \"athlete.\" then again, it could also have to do with one's group. in the case of most politically liberal blacks, they identify so closely with their race that there simply is little, if any, separation between them and it. as an example of how this manifests itself, consider congressman sheila jackson-lee's 2005 statement during a house, \"i came here as a slave; i now want the right to vote!\" now, just for the record, this woman isn't 175 years old. but was it just a manner of speaking? well, when i gave a talk about so-called racial profiling at a toronto symposium some years back, i took questions afterwards and one i fielded was from a black student. he began by passionately saying, \"there was a time when you and i couldn't drink out of the same water fountain...\"rest assured, it's not that these folks had a shirley maclaine vision of a past life. it is that identification. in their universe,\" i \"am the group; the group is me. anything that has happened to the group has happened to me, and any characterization of the group is a characterization of me. the latter is, by the way, one reason why people (of any group) exhibiting this phenomenon cannot abide any criticism of their group. their self-image is so intertwined with the image of the collective that anything diminishing the latter diminishes the former. this helps explain why such people will jump through hoops to rationalize away unflattering facts about their groups. it sheds light on why individuals such as obama can say that blacks get stopped by law enforcement disproportionately while ignoring the reason for it: they commit crimes disproportionately. the black person who has amalgamated group and self cannot acknowledge this fact because, in his mind, it would be tantamount to saying that he was criminally inclined. it would make him feel like less as a person. now, there is a funny thing about hang-ups. many of us have them, but we usually don't recognize them as hang-ups. we don't realize that our hang-ups are just that: things that seem all-important and ever-relevant because they're blown out of proportion in our minds and hearts. rather, we think they seem all-important because they are so. and here is the crux of the matter: because we believe this, we assume other people have recognized their importance as well and thus must also make them a priority. in other words, blacks who place race at the center of their being will assume that whites would, recognizing the importance of this factor, follow suit. this perspective explains a lot. it explains why a black man who hears a white guy utter a word that sounds vaguely like a racial epithet or who is asked to step out of his home by a white cop reads bigoted motives into the situations. it explains why many blacks, despite being advantaged by an affirmative-action society, believe they've experienced great\" racism. \"is it real or is it memorex? when you interpret all the normal bumps and stumbles of human interaction as expressions of bigotry, you certainly have experienced great\" racism. \"that is, at least in your own mind. couple the above perspective with the fact that many blacks are told from toddlerhood on that the white man has kept them down (just think of the kids in jeremiah wright's church), and it explains something else. we've all heard the leftist shtick about how only whites can be\" racist, \"which is based on the convenient interpretation that being so requires power, something only whites possess (untrue itself). of course, since\" racism \"was originated by leftists to facilitate their arguments, they can define it any way they want. this is why i avoid the term and instead try to use\" bigotry \"--i reject their lexicon. yet, this language manipulation is driven by something real, something substantive, and it harks back to what i said earlier about prejudice. you see, when you view the object of your hatred as truly evil (\"white devils,\" anyone?), then, in your eyes, your feelings aren't actually prejudice, are they? they cannot be because you will view them as having a basis in reality. in other words, you can't be \"racist\" because, by gum, you have a right to hate evil. and this is of course a common failing of man; other people may be wrong to hate, but, well, we're different. we have a reason to despise our bogeymen."}, {"articleID": "2009031200_00008707_W", "names": {"John Cook": ["Q16107263", "Q19325279", "Q19827849", "Q30122323", "Q328006", "Q39079025", "Q43915312", "Q53575228", "Q53839184", "Q53839193", "Q53839203", "Q56259962", "Q6227003", "Q6227006"], "Jim Jordan": ["Q186215", "Q5892295", "Q6195963"], "William O'Neil": ["Q15854679", "Q4340917"]}, "date": "2009-03-12", "url": "http://investors.com/editorial/IBDArticles.asp?artsec=16&issue=20090311", "content": "drivers step on the gas again as price spike fades from view by alan r. elliott investor's business daily posted 3/11/2009 americans seem to be climbing back in their cars even as the economy continues to go in reverse. four-week u.s. gasoline demand climbed for five weeks before dipping in the week ended march 6, the energy information administration said wednesday. implied demand - gasoline \"disappeared\" from refineries and distributors for delivery to gas stations and other outlets - fell just 0.7% vs. a year earlier after plunging 4.8% in early october. \"prices have declined dramatically since july and maybe some of the restraints people had on their driving have relaxed,\" said american petroleum institute economist ron planting. that in turn has pushed retail gasoline prices up 20% so far this year to $1.938 a gallon. that's still well below the summer peak above $4. api's gasoline demand gauge rose 1.7% in january vs. a year earlier, the first gain in 12 months. planting said preliminary results suggest another rise in february. gasoline inventories have trended lower, another clue to demand, after building for seven straight weeks through mid-january. they fell 3 million barrels last week to their lowest level since the start of the year, eia said. the lower supplies also reflect refiners doing a better job of curbing their output to match market demand. the combined changes have caught the attention of industry watchers. but most still don't expect a genuine strengthening in demand until the second half of the year. and there is broad agreement that the numbers should be interpreted with a strong dose of salt. \"i'm suspect of the data,\" said larry goldstein, director of the energy policy research foundation. \"it's too early to be looking at a structural, fundamental increase in consumption.\" <mark>john cook</mark>, director of the eia's petroleum division, points out that the weekly numbers can fluctuate wildly, and tend to be revised significantly lower over time, primarily due to exports data. <mark>cook</mark> emphasizes that the numbers do not show direct demand increase per se. but he contends the weekly data gauges trends just as accurately as do monthly data. he says the recent improvement in demand is significant. \"the four week averages are telling us something,\" <mark>cook</mark> said. \"folks are back on the road.\" at the same time, oil prices have steadied at above $40 a barrel after a dip below $34 in february. opec has slashed official output quotas by 4.2 million barrels per day since september. other producers have curbed activity due to lower prices. opec has struggled to coerce cash-starved members to actually cut back to meet their quotas. crude prices started to make a move on $50 earlier this week. but they fell $3.38 to $42.33 on wednesday after eia data showed u.s. crude supplies unexpectedly rose 749,000 barrels. also, china reported declining oil imports. opec ministers meet sunday in vienna. analysts debate whether they'll cut quotas again. but forecasters continue cutting their demand outlooks. the eia said tuesday that global oil use will fall by 1.4 million barrels per day this year. bp ceo tony hayward told investors in london last week that he didn't expect opec's production cuts to cut into inventories until the second half of 2009. fuels specialist robert starkey of houston-based <mark>jim jordan</mark> & associates says the impact is primarily psychological, influencing short sellers and other speculative forces that have helped hold current month prices well below subsequent month contracts on the futures markets. investor's business daily, ibd and can slim and their corresponding logos are registered trademarks of data analysis inc.. all rights reserved. the <mark>william o'neil</mark> + co. database and all data contained herein are provided by <mark>william o'neil</mark> + co. incorporated and are used by ibd under license agreement. daily graphs and daily graphs online are trademarks of <mark>william o'neil</mark> + co. incorporated or its subsidiaries. this site is powered by interactive data corp. real time services market data. price and volume data is delayed 20 minutes unless otherwise noted, is believed accurate but is not warranted or guaranteed by interactive data corp. real time services and is subject to interactive data corp. real time services' terms. all times are eastern united states. the s & p 500 data is the property of chicago mercantile exchange, inc. and its licensors. all rights reserved."}, {"articleID": "2019102105_00020024_W", "names": {"Serge Simon": ["Q3479538", "Q52906755"], "Jacques Brunel": ["Q2480198", "Q50700550"]}, "date": "2019-10-21", "url": "http://www.gazetteandherald.co.uk/sport/national/17982021.photo-peyper-mocking-vahaamahina-elbow-investigated-say-france/", "content": "Photo of Peyper \"mocking Vahaamahina elbow' should be investigated, say France By Press Association 2019 Sebastien Vahaamahina sent off 0 comment France have called for World Rugby to investigate a photo of referee Jaco Peyper in which he appears to mock the elbow to the head that earned Sebastien Vahaamahina a red card. Peyper sent Vahaamahina off for his brazen act of thuggery early in the second-half of Sunday's 20-19 World Cup quarter-final defeat by Wales. In full view of Oita Stadium, the Clermont lock struck Aaron Wainwright on the jaw while France staged an attacking maul, leaving Peyper to make one of the easier decisions of his career. But the South Africa official has now invited controversy on to himself after a picture emerged on social media showing him posing with Welsh fans and playfully landing an elbow on to the head of one. France's Sebastien Vahaamahina sits out after receiving a red card (David Davies/PA)\" This photo if it is true is shocking and explanations will be necessary, \"French Rugby Federation vice president Dr <mark>Serge Simon</mark> said on Twitter. Wales head coach Warren Gatland and his France counterpart <mark>Jacques Brunel</mark> endorsed Peyper's decision to issue the eighth red card of Japan 2019. The 28-year-old forward, scorer of his side's opening try, spent the rest of the game sat on the bench with his hands on his head.\" The officials dealt with it appropriately. I don't think anyone could complain about that. The right decision was made, \"Gatland said.\" Rugby is heat of the moment stuff and he made an error of judgement. When you have got a lot of testosterone involved in some pretty high intensity games, that will sometimes happen. He's made a poor decision. \"<mark>Brunel</mark> agreed that Vahaamahina deserved to be dismissed.\" The red card I don't contest--when you see the images it's very clear. He did have contact with the face so we can't deny that, \"<mark>Brunel</mark> said.\" Of course it changed the game. When you're playing half the match with 14 men it's difficult. \"0 comment"}, {"articleID": "2010022400_00009719_W", "names": {"Lee Wright": ["Q6515573", "Q6515575"], "Chris Murphy": ["Q1077594", "Q20022484", "Q2964809", "Q5107535", "Q5107536", "Q5107538", "Q56379834"], "Adam Walker": ["Q18163023", "Q3072285", "Q43157482", "Q4679929", "Q4679930", "Q4679931", "Q4679932", "Q4679936", "Q57954373"]}, "date": "2010-02-24", "url": "http://thegrocer.co.uk//Articles.aspx?page=articles&ID=207325", "content": "sorting out the rubbish: waste management for retailers it's the unsavoury issue that many people would rather sweep aside, but with new legislation and greater financial penalties on the horizon, now is the time for convenience store retailers to really start getting down and dirty with their waste. the uk produces 70 million tonnes of industrial and commercial waste a year, much of which ends up festering on landfill sites. the past three years alone have seen a bin-load of new laws governing how businesses should and shouldn't be disposing of their waste, and as the problem continues to creep up the political agenda, many more are set to follow. says <mark>lee wright</mark>, marketing director of workplace equipment provider slingsby: \"moving forward, it is likely that legislation will be introduced to make recycling schemes a legal requirement in the same way that there are laws governing hazardous waste.\" the laws may be driven by environmental concerns, but there's also a financial side to landfill waste. cost per tonne soared by 25% last year and is to rise again in 2010: from april 1 all commercial organisations will have to pay £ 48 for each tonne of waste they send to landfill, and this will rise by a further £ 8 each year until april 2013. \"any business or other organisation, regardless of size, is being penalised financially by the government through substantially increased waste disposal costs,\" slingsby adds. fiona serrecchia, key account manager for materials recycling company cawleys, agrees: \"regulation is on its way, so smart retailers will want to get ahead of the game and implement good waste management strategies before it's too late.\" recycling is one of the easiest and most cost effective ways to reduce the amount of waste that stores send to landfill, and once you've got a good strategy in place that can be clearly followed by your staff, implementing it shouldn't be too much like hard work, says <mark>chris murphy</mark>, deputy chief executive of the chartered institution of wastes management (ciwm). in fact, most of the big professional waste management and recycling companies, such as sita uk, will conduct a free waste audit for you. they also provide educational materials, specially marked bins and legislative updates to simplify the process further. phil eccles, the national field sales manager at sita uk, says he has already seen a major change in retailers' recycling habits in the past two years. \"half of all the services we now sell are for recycling, rather than traditional waste management bins. businesses of all sizes have really been embracing the need to recycle more.\" most uk councils will also offer a competitive paid-for commercial waste collection and recycling service but the hotting up of the waste debate is prompting a burgeoning number of disposal companies to wriggle out of the woodwork, too. be warned, though, as some definitely don't smell as sweet as they sound. small waste producers such as convenience stores might not have to comply with stringent producer responsibility obligations (only businesses which handle more than 50 tonnes of packaging a year and have an annual turnover of £ 2m need worry about those), but they do have to comply with duty of care regulations. these require businesses to: store and transport their waste appropriately and securely; keep all waste transfer notes for two years; and, most importantly, check that their waste is transported and handled by those authorised and registered to do so who won't end up fly-tipping it down a country lane. you can check if a company is a registered waste carrier by asking to see their certificate, confirming with the environment agency, or checking on the netregs waste directory website, where they should be listed. another important question to ask before employing a waste contractor is whether they will \"treat' your waste themselves, which basically means sorting, bagging or labelling it, or if you'll need to do this prior to collection. and if you don't want to end up with a mountain of card and wrappers in your backroom, don't forget to ask how often they will come to collect your waste. it's a question independent retailer chris pollard of barlby village stores in selby wishes he had asked.\" i used to use an independent recycling company to collect all the waste cardboard, but i dropped them after they started to become unreliable. the price of cardboard is incredibly volatile and when it was down the company just didn't bother turning up to collect it, leaving me with vast heaps in the garage. i now use the council's services. it costs just under £ 1,000 a year, but they collect once a week without fail. \"most larger stores will have their waste collected on a daily basis, but for smaller businesses weekly collections aren't uncommon, meaning that an increasing number of retailers are also turning to technology to reduce the size of waste products ahead of collection. charles brading has recently invested in a baler to help with the cardboard recycling at his store, vic's in the isle of wight.\" after some of our bigger deliveries of 400-plus cases we can be left with a mountain of card. i don't have much space at the back of the store so the baler has been a godsend. it squashes all the cardboard into small blocks which are then collected by biffa. it's also great for getting rid of the poly shrink-wrap. i fill about six bins with it each week and the machine compresses it into a 2ft block, \"he says. chris pollard has an altogether more physical approach to the problem.\" i'm really into my recycling, but i don't use any of the high-tech gadgets and gismos to help me do it. you can achieve the same effect by getting into the bins and stamping the cardboard down. trust me, it's very effective! \"those retailers who are part of a symbol group will probably have their recycling needs taken care of, says costcutter trading manager <mark>adam walker</mark>.\" symbol group members can benefit from centrally negotiated terms with waste management companies; costcutter has terms in place with jbs waste and biffa. we also offer a full baling solution, with free collections of baled cardboard available throughout the uk. \"<mark>walker</mark> adds that epos facilities such as the group's c-pos system can also help in reducing waste by enabling retailers to better manage stock levels and eliminate over-ordering. one retailer who is taking the battle of the bins to new heights is andrew thornton. the budgens retailer is on a quest to send zero waste to landfill, and he's not far from achieving it.\" six months ago i set myself the goal of reducing the amount of waste that my two london stores sent to landfill, and today i've managed to get it down to just 6%, \"he says. all andrew's waste cardboard is collected daily by budgens for recycling. the rest is collected by independent waste management company cawleys, which uses the innovative process of anaerobic digestion (ad) to dispose of all andrew's food waste in an environmentally friendly way. food waste is broken down into fertiliser, and biogas (which is converted into electricity and heat).\" it doesn't cost me any more than it did when i used an ordinary contractor to take my waste to landfill, and this is so much better for the environment. \"but andrew's not stopping there. he plans to achieve his zero waste to landfill goal in the next few months when he launches the food cycle scheme (convenience store, february 5, p8). the initiative involves freezing food before its sell-by date and sending it to soup kitchens across the capital. and there are other ways to recycle, too. online business-to-business waste exchanges are becoming increasingly popular, and your\" waste \"cardboard boxes or crates could be of great use to your local school's art department, or to people moving house. you'd be surprised how much interest a poster in your store could generate. so go on, why waste the opportunity? useful contacts www.wrap.org.uk/business/index.html www.netregs.gov.uk/netregs/63197.aspx www.businesslink.gov.uk www.ciwm.co.uk /"}, {"articleID": "2015121615_00392170_W", "names": {"Mohammed Ali": ["Q16002506", "Q6854083"]}, "date": "2015-12-16", "url": "http://www.morningstaronline.co.uk/a-ad18-Yemen-peace-talks-begin-as-air-strikes-end/", "content": "Yemen peace talks begin as air strikes end posted by in Morning Star World Houthis and government meet in Switzerland by Our Foreign Desk UN-BROKERED peace talks between the internationally recognised government and Shi’ite Houthi rebels began in Switzerland yesterday as the ferocious air raids launched by a Saudi-led coalition finally ended. Although the UN has not stipulated a venue for the negotiations, Swiss public radio identified the village of Macolin, near the town of Biel, as the location. The ceasefire had been supposed to take effect just before midnight on Monday, but the Saudis stepped up military activity in response to a setback in Taiz province. Saudi Colonel Abdullah Mohammed al-Sahyan and United Arab Emirates officer Sultan <mark>Mohammed Ali</mark> al-Ketb were among dozens of pro-government troops killed when Houthi forces fired a long-range missile at a secret military headquarters near the strategic strait of Bab al-Mandab. The official Saudi news agency announced a postponement of the ceasefire on Monday night, saying that their coalition forces would only stop fighting at noon yesterday. Yemen has been torn apart by armed conflict pitting the Houthi rebels and army units loyal to former president Ali Abdullah Saleh against the internationally recognised government, backed by the Saudi-led coalition and supported by the US, along with southern separatists, religious extremists and other militants. UN special envoy for Yemen Ismail Cheikh Ahmed voiced hope yesterday that the talks would \"mark the end of military violence in Yemen.\" According to the UN, the war has so far killed at least 5,878 people since March, when the fighting escalated after the Saudi-led coalition began launching air strikes targeting the rebels. Past efforts to end the violence have failed, as the government insisted on Houthi compliance with a UN resolution requiring them to return seized weapons and territory that they have captured over the past year."}, {"articleID": "2011080819_00090422_W", "names": {"Pete Moore": ["Q16105170", "Q7172162", "Q7172164"], "Martin Hill": ["Q13382592", "Q15967812", "Q17478669", "Q21065565", "Q21457269", "Q6775683"]}, "date": "2011-08-08", "url": "http://skegnessstandard.co.uk/registry_closures_1_2944407", "content": "mon aug 08 20:23:49 bst 2011 betrothed couples and bereaved relations in spilsby may have to travel further to register their weddings and deaths, if proposed registry office closures go ahead. as part of its cost cutting measures to save? 125million, lincolnshire county council is considering the closure of five registry offices across the county. currently, lincolnshire registry offices achieve high levels of customer satisfaction, but a report by the executive director of resources and community safety, <mark>pete moore</mark>, raises concerns about how the closures could affect this. the report states: \"there may be a risk of reduced customer satisfaction, negative feedback and the loss of staff morale, which may compromise the customer service excellence accreditation.\" further risks highlighted in the report focus on the foreseen loss of income for bridal shops and florists in affected towns if ceremonies are moved elsewhere. owner of bridal elegance on market street, spilsby, patricia fry, said: \"it will affect the business because we are the only bridal shop in spilsby and i don't really understand why they are closing it and horncastle.\" the white hart now has a license but it would not be everybody's choice and a lot of people don't have the transport to get to skegness or louth. \"the report also highlights the requirement for customers to travel increased distances to alternative offices as a potential concern. to ensure skegness registry is able to cope with more customers, the council has stated its commitment to providing better facilities there, which\" would prove very attractive to local residents and support local tourism by facilitating ceremonies for holidaymakers'. spilsby registry offices, along with those in bourne, market rasen, horncastle and long sutton, have been selected for the cuts due to their low usage and poor cost effectiveness. the registry opens less than eight hours a week and conducts a low volume of ceremonies but could provide a significant capital return to the council if and when it is sold. lcc leader coun <mark>martin hill</mark> said: \"with very much reduced budgets, all councils are having to look at how they can provide services more efficiently whilst still meeting their statutory obligations.\" to this end, a review has been undertaken of all registration offices to make sure they are efficient and providing a value-for-money quality service to the public. \"\"following this review. recommendations have been put forward to consider changes at registration offices that are currently only open a few hours a week where the costs to run them is more than any income they generate. proposals will be consulted on extensively before any final decisions are made.\" temperature: 10 c to 20 c wind speed: 30 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by temperature: 9 c to 18 c wind speed: 20 mph temperature: 14 c to 19 c wind speed: 24 mph temperature: 14 c to 22 c wind speed: 22 mph temperature: 15 c to 22 c wind speed: 17 mph"}, {"articleID": "2013031604_00007966_W", "names": {"Josh Adams": ["Q22095106", "Q23542559", "Q24005337", "Q6288577"], "Ryan Anderson": ["Q19361978", "Q20744442", "Q26678329", "Q27937758", "Q3453740", "Q376586", "Q58441078", "Q7383834", "Q7383835"], "Scott Wood": ["Q16302570", "Q18706121"], "Richard Howell": ["Q16227456", "Q2149824", "Q53576606", "Q7326565", "Q7326566"]}, "date": "2013-03-16", "url": "http://wwaytv3.com/2013/03/15/duke-falls-acc-uncw-womens-hoops-ends-season-uncw-baseball-loses-caa-opener", "content": "duke falls at acc, uncw women's hoops ends season & uncw baseball loses caa opener wilmington, nc (wway)--we've posted scores and notes from friday's high school sports. high school baseball west brunswick beat north brunswick 14-1 wallace-rose hill edged trask 11-10 north davidson defeated laney 14-4 high school softball south columbus beat east bladen 10-1 topsail defeated south lenoir 13-5 summer darnell picked up the win on the mound for topsail trask beat wallace-rose hill 21-5 high school girls soccer whiteville beat scotland county 6-2 girls soccer cape fear academy and ashley finished in a 2-2 tie girls soccer wallace-rose hill and trask finished in a 0-0 tie boys lacrosse new hanover beat laney in double overtime 7-6 <mark>josh adams</mark> scored the game winner for the wildcats---------------- nc 83 fsu 62--------------- greensboro, nc (ap) - boston college freshman olivier hanlan couldn't follow up his record-setting acc tournament debut with a huge upset. the eighth-seeded eagles lost to no. 9 miami 69-58 on friday in the quarterfinals of the atlantic coast conference tournament. and hanlan - who was coming off a 41-point performance in the first round, a record for league freshmen - was held to 14 points on 5-of-10 shooting by a miami team that's built on defense. \"it's very difficult to come back from that type of performance and not expect one of the best defensive teams in the country to put you on lockdown,\" bc coach steve donahue said. \"i thought he handled it well, and i thought we played off it well.\" hanlan made 16 consecutive shots over two days before missing 5 of his final 6 attempts of this one for eighth-seeded bc (16-17). yet the eagles were in this one down the stretch and gave the top-seeded hurricanes (25-6) a serious scare. patrick heckmann finished with 15 points for the eagles, and his 3-pointer with 3? minutes left tied it at 55. durand scott put miami in front to stay with two free throws with 3:01 left, and shane larkin took over a few moments later. he came up with a key steal from hanlan, then buried a momentum-shifting 3 off an inbounds pass to make it 60-55 with 1:49 left. \"it wasn't just me who got the steal,\" larkin said, adding that kenny kadji was in on the trap and teammate rion brown made a heady play to save the ball. \"it was all of us.\" after brown swished a pretty hanging jumper with 57.6 seconds left, and kadji added a free throw to make it 63-55, bc didn't get closer than five points the rest of the way. trey mckinney jones punctuated the victory with a dunk with 17.2 seconds left. \"we just had mental breakdowns\" during the final 3 minutes, hanlan said. \"the little things hurt us.\" larkin scored 15 of his 20 points after halftime, kadji added 15 points and mckinney jones finished with 12 for miami, which shot nearly 70 percent in the second half while making all the plays down the stretch to avoid becoming the acc's first no. 1 seed to lose its tournament opener since 1997. and the hurricanes - who have won at least one acc tournament game in eight of their 10 seasons in the league - have larkin to thank for their latest escape. \"by adding shane to that group (of seniors), he adds an element that allows all of them to play better,\" coach jim larranaga said. \"he's so good at what he does. a lot of times you'll see (larkin) in the first half try to get the ball to (his teammates), and then the second half starts, he starts to pick his spots to attack and score or find the open man. we absolutely needed that.\" larkin also keyed the defensive effort on hanlan, who a day earlier set an acc tournament record for freshmen with 41 points in the first-round win over georgia tech. <mark>ryan anderson</mark> also had 14 points for the eagles, who had their acc-best four-game winning streak snapped and were denied their first semifinal appearance since 2007. they lost twice to miami during the regular season in vastly differing ways: the hurricanes romped by 32 points in coral gables a few weeks after holding on for a one-point win at bc. and for a while, this one looked like a repeat of that blowout - at least until bc dug itself out of a double-digit hole for the second straight day. after rallying from 15 points down to beat the yellow jackets in the first round, the eagles spotted miami a 21-8 lead before closing the half on a 19-4 run and took their first lead when <mark>anderson</mark>'s layup with 4 seconds left made it 27-25. that coincided with a brutally cold spell for miami, which missed 14 of its last 16 shots of the half against a bc team that started pressing the hurricanes and defending them with a zone. \"we got a little passive,\" larranaga said. \"we didn't attack the way we wanted to.\" bc stretched its lead to 30-25 on heckmann's 3-pointer 20 seconds into the half. miami eventually countered with an 11-2 run and took a 48-44 lead on larkin's deep 3, and things remained tight until larkin and the hurricanes finally pulled away. (copyright 2013 the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed .)------------ greensboro, nc (ap) - <mark>scott wood</mark> had 23 points and seven 3-pointers to help north carolina state beat virginia 75-56 on friday in the atlantic coast conference tournament quarterfinals. c.j. leslie added 17 points and 11 rebounds with three blocks for the fifth-seeded wolfpack (24-9), who blew the game open after halftime and led by double digits nearly the entire second half for a second straight quarterfinal win against the fourth-seeded cavaliers (21-11). n.c. state also got strong performances from freshman t.j. warren with 18 points and senior <mark>richard howell</mark>, who battled through a right thigh injury to finish with 12 rebounds. the wolfpack avenged a regular-season loss to virginia that started a three-game skid, which all but took the preseason acc favorite out of the regular-season title chase. now n.c. state is back in the semifinals and has a saturday matchup with no. 9 miami, the tournament's top seed. (copyright 2013 the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed .)--------------greensboro, nc (ap) - dez wells scored a career-high 30 points and maryland upset no. 2 duke 83-74 on friday night in the quarterfinals of the atlantic coast conference tournament. wells was 9 of 13 from the field and 10 of 10 from the free throw line to lead the seventh-seeded terrapins (22-11). they never trailed, held the league's best team from 3-point range to 4-of-25 shooting from beyond the arc, and bolstered their ncaa tournament credentials with their second straight win over duke. mason plumlee had 19 points to lead second-seeded duke (27-5), which had the ball trailing by six points with about 2 minutes left after seth curry hit a rare 3-pointer and the blue devils got an even rarer defensive stop. but tyler thornton missed 3-pointers on consecutive trips downcourt and wells and seth allen each hit two free throws, with allen's stretching the lead to 77-67 with 1:44 left. (copyright 2013 the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed.)"}, {"articleID": "2009041305_00008023_W", "names": {"Alan Moore": ["Q1748845", "Q205739", "Q21065008", "Q4707357", "Q4707358"]}, "date": "2009-04-13", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=114201607&blogId=482813941", "content": "age: 21 sign: virgo city: rancho cucamonga story: the comedian is dead. murdered. it seems to be a burglary gone wrong, but when the only masked vigilanty that has not retired or sponsered by the government, rorshach, investigates his death, he not only finds the truth, but a conspiracy that will change the world forever. the world is also on the brink of doomsday. the two superpowers (usa and the ussr) are comming closer and closer to nuclear war. the doomsday clock is at 11:55 and moving closer and closer to midnight. is someone killing off masked vigilanties? if so, why? is it to stop them from preventing wwiii? is it revenge from an old advasary? and who is next? insights: after reading the book, one will like this adaptaion. it is basically taking the whole book and putting together each frame and turning it into an animated film. it is cool, and it does the entire book including tales of the black frieghter. however, it cuts out some of the interstial chapters after each chapter of the book where they put in segments from hollis mason's book under the hood, the newspaper articles, walter kovacks' police file, letters, and interviews with the characters, etc. and also some little tid bits like rorshach's opening monolouge is cut down. it ends at \"and i'll look down and whisper\" no .' \". sucks, but tolerable. also, the entire film is narrated and performed by one guy. tom stechschulte (all is normal, the manchurian candidate, fields of freedom). he does a good job, it just takes some getting use to. it is like a book on audio cd with visuals in a way with music and sound effects. all in all for a watchmen fan you only get 99% of the watchmen experience with this. but worth it. the theatrical cut story: same exact story, just with a better budget and cast list. click link to see. insights: to start with, everyone was perfectly casted. all was just perfect for a film adaptaion. just can't waith for the director's / extended cut dvd to come out. with this cut of the film you olny get maybe 70% -85% of the watchmen experience. but well worth it. black freighter story: a captian's ship is destroyed by the mysterious black freighter and is left to die. on a deserted island, the captian begins to stir and believes the black freighter is heading for his home in david's town. he creates a raft out of palmtrees and the dead bodies of his shipmates and travels across the ocean in hopes of getting there in time to save his loved ones and his home town before the black freighter slaughters them all. but will he? before the sea drives him mad? insights: a perfect adaptaion of the comic within the comic. with gerard butler (300, the phantom of the opera, timeline) as the captian delivering a perfect voice performance and beautifull animation. rate: * * * under the hood story: a tv show looks back on a segment they did in '75 about hollis mason's book under the hood and reshow it featuring interviews with mason, stephen mchattie (you might as well live, 300, twist), and several other members of the minutemen and their nemesis'. insights: a very well put together documentary about the first group of masked vigilanties with the actors from the film playing their parts for this. it was a cool way to do under the hood. rate * * * 1/2 incase you haven't read my review for the book, here it is: twelve minutes to midnight: a review of the graphic novel watchmen--today in movies--8/25/08 accomplished category: movies, tv, celebrities. . note: i am well aware the film adaptaion of this graphic novel is not out yet and that i am reviewing a graphic novel. but however, since this book is written and drawn like a film, i have decided to review it like one. nuf said. today's review is of the graphic novel: story: the comedian is dead. murdered. and the only masked adventurer who has not retired, rorschach, investigates the murder and begins to uncover more than expected. and also the world is on the brink of doomsday. the world is on the threat of nuclear anialation from both the american and soviet governments. is the comedian's death connected in some way? or is it a coincedence? or something more? who killed him and why? is someone killing all the maked adventurers? if so, who's next? and once all is solved, it will not only change those involved, but the whole world intirely. insihgts: the one this to say about this graphic novel is perfect. this is the best graphic novel i have ever read. a must read. <mark>alan moore</mark> and dave gibbons are geniuses. the realease of atom power has changed everything except our way of thinking...the solution to this problem lies in the heart of mankind. if only i had known, i should have become a watchmaker. - albert einstein now that i have said all that, with all the comic book films comming out this year and next, i think the one that is going to have the most high expectaions and the most attention will be the film adaptation of this book."}, {"articleID": "2019071022_00126968_W", "names": {"Tony Marino": ["Q29013247", "Q7822875"]}, "date": "2019-07-10", "url": "http://stalbertgazette.com/national-business/high-dividend-yields-due-to-cheaper-shares-spook-investors-say-oil-and-gas-ceos-1578641", "content": "National Business High dividend yields due to cheaper shares spook investors, say oil and gas CEOs CALGARY--Mid-sized Alberta oil and gas producers say their share prices have fallen so low that investors are starting to worry their rising dividend yields are becoming unsustainable. Jul 10, 2019 3:12 PM by: Canadian Press CALGARY--Mid-sized Alberta oil and gas producers say their share prices have fallen so low that investors are starting to worry their rising dividend yields are becoming unsustainable. The irony is that his Calgary-based company has no intention of reducing its monthly payouts to shareholders, which it has hiked three times in the past three years, said CEO Grant Fagerheim of Whitecap Resources Inc. \"I think there is a disconnect (in the market),\" said Fagerheim on Wednesday after taking part in a panel discussion at the TD Securities Calgary Energy Conference. \"There is no risk that we'll be decreasing our dividend. If anything, we'll be increasing it on a go-forward basis.\" A company's dividend yield is determined by comparing its regular payouts per share with its current share price--when the price goes down, the yield goes up. Nothing else has changed for the company but Whitecap's share price has fallen along with many other oil and gas producers, said Fagerheim, a situation he blamed on worries about regulatory uncertainty and pipeline delays in Canada. Whitecap shares are off by almost 30 per cent in the past three months and its dividend yield has jumped from about six per cent to eight per cent as a result, much higher than its more typical four to six per cent. There's little reason for concern about cuts in payouts for many of the dividend-paying intermediate companies he covers, said Adam Gill, an energy analyst for Eight Capital Research. \"At US $50 (per barrel), maybe some of the dividends are a little out of the sustainability range but at a US $60 oil price like we're seeing today, a lot of these companies are safe and offering a pretty good yield,\" he said. CEO <mark>Tony Marino</mark> of Vermilion Energy Inc. says he is seeing similar investor worries as his company's share price fell by 16 per cent over the past three months, boosting its yield to almost 10 per cent from about eight per cent. He said a dividend cut is \"not something we're even entertaining.\" Enerplus Corp. could \"easily afford\" to increase its dividend but the low value of its shares--down 20 per cent in the past three months--makes buying them back and cancelling them a compelling alternative use for the company's free cash flow, said CEO Ian Dundas. The company reported buying back $35 million of its stock in the first five months of the year. It has regulatory approval to buy back an estimated $190 million worth in the 12 months ended next March."}]