[{"articleID": "2018102022_00187431_W", "names": {"Luis Suarez": ["Q26517", "Q270367"], "Roger Marti": ["Q50195398", "Q7358599"], "Mariano Diaz": ["Q2322154", "Q6762342"]}, "date": "2018-10-20", "url": "http://watoday.com.au/sport/soccer/messi-injured-in-barca-win-floundering-real-madrid-booed-20181021-p50az7.html", "content": "Messi injured in Barca win, floundering Real Madrid booed 21 October 2018--5:31 amLarger text sizeVery large text size Barcelona have snapped a four-match winless run in Spain's La Liga with a 4-2 home victory over Sevilla to reclaim top spot although the triumph was marred by talisman Lionel Messi being forced off with an injured arm. Messi was trying to reclaim the ball in the first half when he ran into the back of a defender, fell and bent his right elbow badly. Concern: Lionel Messi suffered an elbow injury in the victory over Sevilla. AP Credit: He was treated on the Camp Nou pitch on Saturday with doctors wrapping his elbow with bandages and he tried to continue, but he eventually left the field on 26 minutes. The club later confirmed he had fractured the radial bone in his arm and will be sidelined for around three weeks. Messi scored the team's second goal with a shot from outside the area in the 12th minute after Philippe Coutinho had opened the scoring two minutes in. <mark>Luis Suarez</mark> extended the lead on 63 minutes from the penalty spot. Advertisement Pablo Sarabia pulled a goal back on 79 minutes for the visitors before goals from Barca midfielder Ivan Rakitic, against his former side, and Sevilla striker Luis Muriel rounded out the scoring. Loading Barcelona, on top with 18 points, next play on Wednesday against Inter Milan in the Champions League before they host Real Madrid in El Clasico next weekend. Sevilla dropped to third on 16 points, trailing Alaves (17 points). Meanwhile, Real Madrid fans ran out of patience at the Bernabeu after seeing their team suffer their worst scoring drought and lose for the fourth time in five matches. They loudly jeered coach Julen Lopetegui and his players after Madrid reached a club-worst 481 minutes without finding the net in losing to Levante 2-1 to be fifth. Lopetegui, only three months into his stint with Real Madrid, defended himself against the critics. \"Football matches are won by scoring goals and not according to who deserves to win,\" he said. \"We did what we needed to do because we had 34 or 35 shots on goals, 14 or 15 of which were on target .\" We had goals ruled out, hit the woodwork three times...we attacked a lot and looked dangerous. \"The stats aren't worth much at all, what counts are the goals. This is the way things go in football .\" Levante took the lead after just seven minutes through Jose Luis Morales while things went from bad to worse for Real when Raphael Varane handled the ball just inside the area. Pressure: Julen Lopetegui during the defeat to Levante. AP Credit: <mark>Roger Marti</mark> stepped up to take the penalty sending it past Thibaut Courtois on 13 minutes. Madrid had a Marco Asensio header ruled out by the video assistant referee soon after for offside before they halved the deficit in the second half when substitute Karim Benzema pulled the ball back to Marcelo and he smashed it into the roof of the net. <mark>Mariano Diaz</mark> thought he had equalised late on but the goal was ruled out for offside leaving Levante to celebrate a famous victory. Atletico Madrid are fourth after they were held to a 1-1 draw at Villarreal. Filipe Luis put the visitors ahead in the second half before Mario Gaspar equalised. Valencia couldn't manage more than 1-1 against struggling Leganes at home, to be winless for the fifth time in six matches. Jose Gaya scored in the 85th minute to keep the hosts from losing after Gerard Gumbau put Leganes ahead with a second-half penalty kick. AP"}, {"articleID": "2013102600_00025847_W", "names": {"Jonathan Reid": ["Q42087292", "Q6274224"], "Stephen Schwartz": ["Q25190543", "Q43098294", "Q542484"], "Nick Adams": ["Q3339702", "Q41787493", "Q7026686", "Q7026687", "Q7026688"]}, "date": "2013-10-25", "url": "http://www.broadwayworld.com/cabaret/article/Joan-Ryan-Returns-to-54-Below-with-Tituss-Burgess-Tomorrow-20131025", "content": "Joan Ryan, who boasts an impressive four octave range will make her long awaited return to the NYC cabaret stage with her self-titled show Trevor Nunn on Andrew Lloyd Webber's \"Aspects of Love\" and \"Sunset Boulevard\" ) with musical direction from Tituss Burgess (\"30 Rock,\" JERSEY BOYS) on Saturday, October 26 at 11pm at 54 Below (254 West 54th Street) in Manhattan. Layered with fiercely rich vocals and an innate sense of humor and frank wisdom, Joan Ryan LIVE is a musical journey through the life and eclectic career of \"consummate performer\" Joan Ryan. Ms. Ryan, who received both critical and audience praise in the hit indie film \"Hot Guys With Guns,\" has been called \"a mesmerizing performer who moves smoothly from larger-than-life drama to small, captivating emotional moments,\" by the Los Angeles Times. Rex Reed, of the NY Observer, said \"she can explore the nuances of a piercing ballad with the investigative talent of a forensic expert, then ignite a show stopping Broadway melody with the combustion of a freight locomotive on the Philadelphia Railroad .\" Her stage credits include the original LA cast of the musical \"Ruthless!,\" the west coast premiere of \"Anyone Can Whistle,\" \"Footloose,\" \"Triumph of Love,\" \"Little Shop of Horrors,\" etc.. In addition to \"Hot Guys With Guns,\" Ms. Ryan's TV and film credits include: Tina Paladrino on the popular TV series \"Saved By the Bell\" and Kathleen Houghton on \"The Young and the Restless .\" Tituss Burgess is best known for his recurring role on the hit NBC series \"30 Rock\". He has originated memorable roles in the original Broadway casts of Jersey Boys, The Little Mermaid, and the revival of Guys and Dolls, as well as headliner at major symphonies and top cabaret venues throughout the world. Other television credits include \"A Gifted Man\" and \"Blue Bloods\". His highly anticipated album will be released this fall. Follow him @ TitussBurgess. 54 BELOW, Broadway's nightclub, is the new performance venue in the grand tradition of New York City nightlife. A few blocks from the heart of Times Square and just below the legendary Studio 54, 54 BELOW is a classically designed state-of-the art nightclub in the theatre district. (866)? 468-7619 or online at TicketWeb.com - direct link: AT & T Opens New Store In Oklahoma City Featuring An Innovative Design That Mirrors Customers' Mobile Lifestyle Cast of EVIL DEAD THE MUSICAL Set for Neon Museum's Boneyard Bash Today Molotov Theatre Group Offering Free eBook/Audiobook of HP Lovercraft's THE BEAST IN THE CAVE Britney Spears Releases Personal Letter to Fans and Britney Jean Album Cover Art! Play Company to Premiere Andy Bragen's THIS IS MY OFFICE, 11/5-12 / 8 Kenneth Russell to Bring LOVED-LEST to Gorilla Tango Bucktown, 11/2 -3 VIDEO: Stephen Fry Talks TWELFTH NIGHT on \"Colbert' BWW TV Exclusive: A New World for MURDER FOR TWO: Part 2 BWW TV: Green Day Documentary BROADWAY IDIOT Comes to the Big Screen STAGE TUBE: In Rehearsal with the Cast of MCC's SMALL ENGINE REPAIR BWW TV: Watch Highlights of Mary-Louise Parker & More in THE SNOW GEESE on Broadway BWW TV: Watch Highlights of David Hyde Pierce, Julia Murney & More in THE LANDING MEGA STAGE TUBE: Danielle Hope, Stuart Matthew Price & More Sing <mark>Jonathan Reid</mark> Gealt's HERE FOR YOU in London! VIDEO: New Clip from Disney's FROZEN Features Josh Gad, Jonathan Groff BWW TV Exclusive: First Look at Tony Winner Steve Kazee on Lifetime's DROP DEAD DIVA VIDEO: Spike Lee Talks DO THE RIGHT THING Broadway Musical on GMA BWW TV EXCLUSIVE: CHEWING THE SCENERY WITH RANDY RAINBOW - Randy Gives THE SOUND OF MUSIC Tips to Carrie Underwood STAGE TUBE: Jared Zirilli Chats with WICKED & MAMMA MIA!'s Carrie Manolakos on BROADWAY BOO'S STAGE TUBE: WICKED Flies into 10th Year on Broadway; Idina Menzel, <mark>Stephen Schwartz</mark> & More on the Show's Lasting Legacy BWW TV Exclusive: Liza Minnelli, <mark>Nick Adams</mark>, Brian Stokes Mitchell & More Perform at Lorna Luft's PINK PARTY! VIDEO: Comedy Central's @ MIDNIGHT Takes on\" Hashtag Wars #Slutty Musicals' Photos: In the Recording Studio - The Nuns of NBC's THE SOUND OF MUSIC! Spooky New INTO THE WOODS Village Shots! Pine, Corden, Blunt On Set; Depp Goes Blond VIDEO: Kristin Chenoweth Talks WICKED's 10 Year Anniversary on \"Leno' Photo Flash: First Look at Daniel Craig, Rachel Weisz and Rafe Spall in BETRAYAL on Broadway!"}, {"articleID": "2010082904_00641454_W", "names": {"Daniel Davis": ["Q16214385", "Q16395611", "Q280198", "Q49962435", "Q50576805", "Q5216080"]}, "date": "2010-08-29", "url": "http://newsok.com/what-players-coaches-and-media-are-saying-about-redshirting-in-college-football/article/3489965?custom_click=rss", "content": "what players, coaches and media are saying about redshirting in college football oklahoma football: freshman class breakdown 08/28/2010 here's a look at ou's freshman class, listed from least likely to most likely to redshirt: 1. trey millard, fullback: brent venables calls him \"a.. . 08/28/2010 here's a look at oklahoma state's true freshman class, ranked from least likely to redshirt to most likely to redshirt: 1. justin gilbert, cornerback: one...08/28/2010 across the country, college football teams are redshirting players less and less. why? the reasons are many: players are more prepared than they used to be,...even the state's best football players redshirt from...08/28/2010 here's a year-by-year look at some of the state's top recruits who went out of state for college, and their redshirt status in the first year on campus:...\"coaches today in the current college football landscape are starting to understand, they have to win now, in order to keep their jobs. gone are the days when a coach has a long tenure. and juniors and seniors are entitled to playing time, where freshman come in, redshirt and wait their turn. coaches are realizing they need to win, or they will get fired, or they will get bought out .\" texas \"it will definitely be midseason before we talk about it. we feel like now with the numbers in college football, and the fact that if they're playing well after their junior year, they very well might go ahead and go to the nfl, so you might as well not redshirt anybody until after the seventh ballgame and it looks like you're going to be okay and they're not going to play .\" alabama \"we don't really decide early on that we're going to redshirt guys. we coach our guys as much as we can and try to continue to develop them and i think there are a lot of factors that come into whether you redshirt a guy or not. we want to continue to develop players so that if we lose somebody, maybe somebody we thought we may be able to redshirt all of a sudden that guy becomes the next guy that can .\" millwood cornerback and texas commitment josh turner \"if texas asked me to redshirt, that wouldn't change a thing for me. texas is a great program, and i would respect that that's what they thought was best. but i think i'll have a shot to play .\" <mark>daniel davis</mark> \"depth at your position is hand in hand with playing time. when you look at a college you should really see how deep they are at your position so you can see if it's a good fit .\" thank you for joining our conversation on newsok.com. we encourage your discussion but ask that you stay within the bounds of our commenting and posting policy. please help by flagging comments that violate these guidelines. posts that contain obscene or vulgar language will be immediately flagged and not posted. southwestern oklahoma state university vs. emporia state: wednesday, aug. 25, 2010 oklahoma high school football scrimmages: aug. 20 oklahoma high school football scrimmages. photos from around the oklahoma city metro area of football scrimmages between yukon, putnam city, southmoore and del city. high school scrimmages, thursday, august 19, 2010 view pictures of high school scrimmages in the oklahoma city area thursday night, august 19, 2010. ou football notes: wide receivers still competing for starting jobs former oklahoma agency official pleads guilty to embezzling from state"}, {"articleID": "2010030820_00029997_W", "names": {"Roy Bradshaw": ["Q4097404", "Q7372593"], "Brock Lesnar": ["Q220556", "Q25421397"]}, "date": "2010-03-08", "url": "http://cagepotato.com/mma-fightpicker-recap-wec-47-ruins-everybodys-life", "content": "mma fightpicker recap: wec 47 ruins everybody's life (left: wec 47's ugliest bloodbath. right: wec 47's second-ugliest bloodbath .) to the general public, march 6th seemed like any other saturday. but for those of us who watched by dominick cruz and became the first fighter to be stopped by cruz in the wec. stoppages outscored decisions, 8-3. the fight of the night went to mma fightpicker pools. even our great leader aaron rampey didn't win first place in any of his, though he did manage to tack on 112 chips to his grand total, and still sits comfortably in first place. this seems like a good time to mention that i, bg, tied with rampey in our contender pool, while bf failed about as hard as we all figured he would. surf_finland won our pool (congrats!), which helped him move to the #2 spot in fightpicker's current top 5: aaron rampey: 1,758 surf_finland: 800 toothguy: 796 now that that's behind us, what do we have to look forward to this week? well, we're not going to lie to you: it's kind of a slow week. luckily, king of the cage always has fights going on somewhere. for example, this friday at \"uprising ii\" in vancouver island, adam gabel (7-1) and charlie zak (4-2) will battle for kotc's canadian lightweight title, while belgium's marcus vinicios meet in an \"international super fight .\" the next day at scottie merritt throw down in a 160-pound headlining match. for more info, hit up kingofthecage.com. we also have four questions related to sportfight 27 in grand ronde, oregon, where <mark>roy bradshaw</mark>. to get some big-name heat in this week's pools, we've included joshua clottey, which goes down this saturday at cowboys stadium in arlington, texas. let us know who wins (steampunk22 says: mon, 03/08/2010 - 13:08 half amazing says: mon, 03/08/2010 - 13:07 frank mir recently apologized for saying he wants <mark>brock lesnar</mark> to be the first person to die in the octagon. your thoughts?: mir was completely out of line. as shane carwin put it, he's \"either a terrible human being or mentally unfit to fight .\" i don't see the problem. it's just trash-talk, and mir's certainly not the first person to invoke death while hyping a fight."}, {"articleID": "2009123111_00147917_W", "names": {"Andy Gray": ["Q4760733", "Q4760735", "Q4760736", "Q4760737", "Q516216", "Q525927", "Q525943"], "Chris Evans": ["Q17490263", "Q178348", "Q21538587", "Q23418578", "Q27918241", "Q2964709", "Q2964710", "Q303577", "Q466583", "Q5106513", "Q51990270", "Q5392352"], "John O'Shea": ["Q13157342", "Q16733883", "Q306351", "Q3809517", "Q6251030"]}, "date": "2009-12-31", "url": "http://skysports.com/story/0,19528,11095_5814141,00.html", "content": "super 6 guess scores and win £ 100,000 jackpot match highlights every game from the football league arsene wenger expects key arsenal duo cesc fabregas and theo walcott to be sidelined for around 10 days. fabregas aggravated a hamstring problem after coming on as a substitute to inspire the gunners to a 3-0 victory over aston villa on sunday. wenger's captain was taken off after a decisive 27-minute cameo but it was initially unclear whether he would be ruled out for just a few days or a number of weeks. the spain international midfielder was not fit enough to feature against portsmouth and wenger has now confirmed he will also miss the fa cup clash with west ham and the premier league match at home to bolton next wednesday. question mark fabregas could then return for the visit of everton to emirates stadium on 9th january. walcott might also make his return to action in the same match after missing the 4-1 success at pompey in midweek. the england winger, who has not been able to put together a run of consecutive appearances this season, is struggling with a side injury. \"let's say the only question mark we have is does cesc make everton or not,\" said wenger. barclays premier league 19:45 barclays premier league 20:00 skysports.com looks at the best and worst moments from the latest round of top-flight fixtures. james dall previews the winter transfer window in the premier league and what each club needs. <mark>andy gray</mark> picks out his team of the decade from the premier league on sky sports. see if you agree...coyle - trotters not for me burnley boss owen coyle has ruled himself out of the running for the vacant managerial post at premier league rivals bolton. <mark>evans</mark> rules out bolton job bolton caretaker boss <mark>chris evans</mark> has ruled himself out of the running for the manager's job on a permanent basis. n'zogbia tempted by blues wigan winger charles n'zogbia has revealed that he could be persuaded to join birmingham in january. carlo unfazed by jose talk carlo ancelotti has told jose mourinho he will have to wait if he wants to become chelsea manager again. <mark>o'shea</mark> set for lengthy lay-off sir alex ferguson has confirmed <mark>john o'shea</mark> is facing a possible two more months on the sidelines with a thigh injury. scotland v england win an exclusive scotland vs england rugby experience with ford make the difference villa v liverpool - have your say on the big match. get sky get sky + starter from as little as £ 18.50 a month with free broadband and calls. wallpapers decorate your desktop with a sky sports wallpaper."}, {"articleID": "2017101310_00405228_W", "names": {"John Cusack": ["Q106175", "Q16203619"]}, "date": "2017-10-13", "url": "https://www.her.ie/news/celebs-boycotting-twitter-support-rose-mcgowan-369596", "content": "News | 23 minutes ago Twitter 6 shares Celebs encourage Twitter boycott in support of Rose McGowan By Louise Carroll Earlier this week Twitter temporarily suspended Rose McGowan's account after she continued to Tweet negative comments about movie produce Harvey Weinstein. In the past two weeks Weinstein has been met with numerous claims of sexual harassment and assault. Women including the actress Rose McGowan, Angelina Jolie, Gwyneth Paltrow, Kate Beckinsale, Cara Delevigne and a string of others (some anonymous) have made claims against the producer. Harvey Weinstein and his wife Georgina Chapman, who reportedly left him this week. Rose McGowan used the platform to tell actor Ben Affleck to \"fuck off,\" accusing him of lying about the lack of knowledge he had in relation to Weinstein's history of sexual assault. She also claimed that Amazon CEO, Jeff Bezos knew Weinstein had raped her and called on him to \"stop funding rapists, alleged pedos and sexual harassers .\" According to Twitter she was banned because she posted a telephone number which violates Twitter's terms of service. 3) @ Jeffbezos I forcefully begged studio head to do the right thing. I was ignored. Deal was done. Amazon won a dirty Oscar .--rose mcgowan (@ rosemcgowan) October 12, 2017 After being suspended, (she has now been allowed to return) both women and men in Hollywood have come to defend Rose and show solidarity by boycotting Twitter today. People including Chrissy Teigen, Alyssa Milano and Mark Ruffalo have been encouraging the boycott, and it has absolutely exploded under the hashtags #womenboycotttwitter #boycotttwitter and #istandwithrose. Ok ok Jesus, let me clear this up. #WomenBoycottTwitter will not silence us, but @ Twitter will make much less $$b/c of fewer clicks. I'm in pic.twitter.com/LPEbKJwpgM--Kathy Griffin (@ kathygriffin) October 13, 2017 Advertisement Tomorrow I follow the Women. #WomenBoycottTwitter--Mark Ruffalo (@ MarkRuffalo) October 13, 2017 Tomorrow. And maybe even forever. #WomenBoycottTwitter--christine teigen (@ chrissyteigen) October 13, 2017 #IStandWithRose. @ rosemcgowan and all the other victims. #WomenBoycottTwitter tomorrow. https: //t.co/XTXtFMv2CM--Anna Paquin (@ AnnaPaquin) October 13, 2017 Tomorrow (Friday the 13th) will be the first day in over 10 years that I won't tweet. Join me. #WomenBoycottTwitter pic.twitter.com/xoEt5Bwj5s--Alyssa Milano (@ Alyssa_Milano) October 13, 2017 In in:) https: //t.co/ylX1BQBwDs--<mark>John Cusack</mark> (@ johncusack) October 13, 2017 Read more about: Twitter, celeb, boycott 6 shares Share"}, {"articleID": "2018040108_00163270_W", "names": {"David Mckay": ["Q1175601", "Q15500677", "Q46515282", "Q47541485", "Q5237382", "Q5237386", "Q55942880"]}, "date": "2018-04-01", "url": "https://www.fin24.com/Markets/International-Markets/tokyo-stocks-close-higher-20180401-2", "content": "1678,96 (0.00%) Loading...We're currently experiencing serious technical problems on the site, and as a result are unable to update the news--even though our market data is running as per normal. We sincerely apologise for any inconvenience caused and hope to be up and running again this evening. Thank you for your patience in this regard .--<mark>David McKay</mark> (editor) & team Tokyo stocks close higher Gold forges best run since 2011 as stars align for bullion bulls Tokyo - Tokyo stocks jumped on Friday after Wall Street rallied and tensions over North Korea eased, with investors on the sidelines ahead of a holiday weekend overseas. The benchmark Nikkei 225 index rose 1.40%, or 295.22 points, to 21 454.30, marking a weekly gain of 4.06%. The broader Topix index was up 0.72%, or 12.30 points, at 1 716.30. It advanced 3.08% over the week. \"Higher US stock prices sent the market here higher,\" said Toshihiko Matsuno at the investor information division of SMBC Nikko Securities. \"Further easing of tension over North Korea has also contributed to improving investor sentiment,\" he added. Before the long Easter holiday weekend, US stocks closed higher Thursday with the technology sector rallying after two bruising sessions. Investors will focus on Japan's closely watched \"tankan\" quarterly business confidence survey on Monday. \"We want to check the impact of the recent strong yen on corporate sentiment,\" Yoshihiro Okumura, general manager at Chibagin Asset Management, told AFP, adding that investors would also be looking at US payroll figures on Friday. Nissan shares were up 0.86% at 1 104 yen after Bloomberg news agency said Renault was talking to the Japanese automaker about a merger that would create a new group that trades as a single stock. The French company's shares gained almost six percent on Thursday. Matsuno said investors were waiting for further details or official comment on the news before making a large move. Honda gained 0.52% to 3 660 yen but Toyota lost 0.24% to 6 825 yen. Mobile operator and IT investor SoftBank Group surged 3.01% to 899.1 yen and Sony gained 0.70% to 5 146 yen. The dollar was trading at 106.25 yen against 106.45 yen in New York on Thursday. Follow Fin24 on Twitter, Facebook, Google + and Pinterest. 24. com encourages commentary submitted via MyNews24. Contributions of 200 words or more will be considered for publication. WHAT TO READ NEXT"}, {"articleID": "2018101111_00198690_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2018-10-11", "url": "http://www.gamereactor.eu/?sid=f224e6ebdabe616a371c20ffe117a0c6", "content": "Written by <mark>Sam Bishop</mark> on the 11th of October 2018 at 12:05 <mark>Sam</mark> took to the post-apocalyptic world to try and survive. 0 Written by <mark>Sam Bishop</mark> on the 11th of October 2018 at 11:59 \"Will you answer the call?\" 0 Written by <mark>Sam Bishop</mark> on the 11th of October 2018 at 11 Launching alongside the North American version. 0 Written by David Caballero on the 11th of October 2018 at 11:20 Capcom will release the title update on October 23. 1 Written by <mark>Sam Bishop</mark> on the 11th of October 2018 at 10:39 Including the first official pictures. 0 Written by David Caballero on the 11th of October 2018 at 10:35 Another impressive stat for Playground Games. 0 Written by <mark>Sam Bishop</mark> on the 11th of October 2018 at 10 $1 million USD is on the line. 0 Written by David Caballero on the 11th of October 2018 at 09:49 Get a taste before the reveal at TwitchCon. 0 Written by <mark>Sam Bishop</mark> on the 11th of October 2018 at 09 It has an average of almost 700,000 viewers. 0 Written by David Caballero on the 11th of October 2018 at 09:04 Some i3-based configurations can run it. 0 Written by <mark>Sam Bishop</mark> on the 11th of October 2018 at 08 Including more breaks for teams. 0 Written by David Caballero on the 10th of October 2018 at 18:33 It's been going around the rumor mill for a while, now it looks like it's finally happening. 0 Written by David Caballero on the 10th of October 2018 at 17:41 Full feature availability scheduled for early 2019. Prices listed. 0 Written by David Caballero on the 10th of October 2018 at 17:15 It's been MIA for more than 12 years now, but it just got a brand-new website. 0 Written by Sergio Figueroa on the 10th of October 2018 at 16:30 Become an influencer or an actor."}, {"articleID": "2016121520_00130473_W", "names": {"Gary Clark": ["Q2899040", "Q50527655", "Q5524847", "Q5524848", "Q5524849"]}, "date": "2016-12-15", "url": "http://www.brewbound.com/news/capital-brewery-merkts-partner-craft-beer-cheese", "content": "Capital Brewery and Merkts Partner on Craft Beer Cheese Press Release Dec. 15, 2016 at 3:00 PM Middleton, WI--Do you like beer? Do you like cheese? If you answered \"Yes' to both you are in luck!--Merkts (a division of Bel Brands USA) now produces two unique craft beer cheese offerings: Merkts Beer Cheese with Capital Supper Club Beer and Merkts Beer Cheese with Capital Mutiny IPA Beer .\" I grew up in Milwaukee, and my parents served Merkts cheese at every party they hosted--and they had a lot of parties! \"said Scott Wiener, President of Capital Brewery .\" When I got the call from the fine people at Merkts I was more than happy to co-operate on this product launch \"he added. Both products are aged cheddar cheese spreads, and are packaged in 7 oz. containers. You can find them for sale in over 14 states throughout much of the Midwest and Great Plains. More markets will continually be added as the product launch rolls on. Find it in your area by entering your zip code and either\" 7 oz. Capital Supper Club Beer' or \"7 oz. Capital Mutiny IPA Beer' in the\" Find a Flavor' field at: www.merkts.com/Locators.aspx Both styles of cheese are also available in the Capital Brewery Gift House in Middleton, WI--just in time for the holiday season. Founded on March 14, 1984, Capital brewed its first batch of beer in the spring of 1986. The company has received over 240 major awards in both domestic and international competitions in over 15 categories, and the beer has been available in cans since 1997. Capital was named Grand National Champion in the 2013 US Open Beer Championship, winning six medals. \"Capital Brewery' is a registered trademark of Capital Brewery Company .\" Merkts \"is a registered trademark of Bel Brands USA, Inc.. Capital Brewery Co, Inc No overview provided. Learn More Update Info Breweries Capital Brewery Co, Inc capital-brewery. com Founded: Unknown Recommend on Facebook Follow on Twitter Follow on Instagram Latest News Craft Brew Alliance to Acquire Minority Stake in Miami's Wynwood Brewing Pabst to up Marketing, Distribution with Investment in New Holland Ska Brewing Hires Former Stone Sales Director Industry Marketplace Beverage Glides / Merchandising View All Post a Listing Featured Jobs Sales Representative - Champion Brewing Company Original Sin Cider Chicago Based Sales Person -...South Bay Sales Representative - Golden State...North Bay Sales Representative - Golden State C.. . Business Development - Natural Brew, Inc.. Market Sales Manager - Deschutes Brewery View All Jobs Post a Job Additional News Schlafly Beer Co-Founder to Depart at Year's End Press Clips: Finch Beer in Flux; Another Chicago Recall; White Labs Eyes January Asheville Opening Tapping Trends: BeerBoard Ranks Top Poured Beers in November Asahi Group to Purchase Pilsner Urquell and Other Beer Brands for $7.8 Billion Craft Beer Industry Jobs Head Brewer - Austin, Texas - based Brewery Brewer/Cellar-person/Packaging - Production - Brothers Craft Brewing Sales Representative - Bay Area, CA - Founders Brewing Company Sales Wizard - Pacific Northwest - Modern Times Beer View All Jobs Post a Job Recent Articles Newswire Features Spirits Craft Brew Alliance to Acquire Minority Stake in Miami's Wynwood Brewing Pabst to up Marketing, Distribution with Investment in New Holland Ska Brewing Hires Former Stone Sales Director Schlafly Beer Co-Founder to Depart at Year's End Press Clips: Finch Beer in Flux; Another Chicago Recall; White Labs Eyes January Asheville Opening Capital Brewery and Merkts Partner on Craft Beer Cheese Epic Brewing Releasing Son of a Baptist Imperial Stout New Belgium Hires Sustainability Specialist at Asheville Brewery Oskar Blues Fooderies to Open Restaurant in Downtown Colorado Springs San Francisco Brewers Guild Announces Official 2017 Collaboration Beer for SF Beer Week Global Spirits USA Restructures Sales Team to Support Growth G.K. Skaggs Named Exclusive Importer of Emperador Brandy Old Elk Distillery Introduces\" Nooku,' Bourbon Cream Jose Cuervo Launches $4k Rolling Stones Special Edition Jameson & <mark>Gary Clark</mark> Jr.. Support Artists with \"Jameson Music' Launch First Vintage of Richland Rum's 2016 Single Estate Released Deep Eddy Vodka Adds Austin-Area Distillery View All Submit News Tweets by @ Brewbound"}, {"articleID": "2009012301_00042515_W", "names": {"Thomas Barnett": ["Q381984", "Q7787407", "Q7787408"]}, "date": "2009-01-23", "url": "http://outsidethebeltway.com/archives/america_and_the_world_after_bush_economics_and_globalization/", "content": "james joyner | thursday, january 22, 2009 on barack obama's second day in office, the bush administration is fast fading into memory. as accidental tax evader timothy geithner prepares to to do that, we'll once again turn to <mark>thomas barnett</mark>'s forthcoming book great powers: america and the world after bush. i'll attempt to weave a unified thread out of chapter 4, the economic realignment: racing to the bottom of the pyramid; chapter 7, the network realignment: the rise of the sysadmin-industrial complex; and chapter 8, the strategic realignment: resurrecting the progressive agenda. america is being replaced as \"the global demand\" center by rising powers india and china. this means that we're no longer the only agenda setters. this is \"the price of our success in projecting the american system globally .\" china's economic growth is the key factor in the global economy and the rise of the bric quartet (brazil, russia, india, and china) and smaller emerging powers means \"3 billion new capitalists who joined globalization over the past quarter century .\" about the author: james joyner is the publisher of note: my spam filter automatically deletes any trackbacks that do not actually link and refer to this post. those doing it manually should ensure they have linked the post before sending the trackback ping. please use the \"link\" button atop the comment box or otherwise insert html tags around links to other pages rather than just pasting in a url. doing the latter reformats the page if the url is long, since it will not break. comments for this post will be closed on 5 february 2009."}]