[{"articleID": "2018102117_00108215_W", "names": {"James Matthews": ["Q16215416", "Q29643199", "Q30512782", "Q5979722"]}, "date": "2018-10-21", "url": "http://www.harpersbazaar.com/celebrity/latest/a24021080/pippa-middleton-new-baby-boy-photos-kate-middleton-sister/", "content": "Oct 21, 2018 Getty Images HGL Following the exciting reports that Pippa Middleton gave birth to a baby boy, Kate's sister has been seen out and about with a pram for the first time. Related Story See Pippa Middleton's Perfect Wimbledon Style Advertisement - Continue Reading Below Per the Daily Mail's royal correspondent, Rebecca English, Pippa allegedly gave birth to a baby boy at approximately 1:58 p.m. London time, on October 15, 2018. While a name is yet to be announced, it was revealed that the baby boy weighed in at 8 pounds and 9 ounces. And now, the is reporting that Pippa and her husband, <mark>James Matthews</mark>, have stepped out for the first time with their newborn baby. Sharing a series of photos of Pippa walking the couple's dog, while <mark>Matthews</mark> pushed their baby in a pram, the reports that Kate's sister was wearing a Kate Spade dress for the outing. Head over to the Daily Mail to see the photos of Pippa now. Daily Mail Daily Mail As for the Kate Spade wild roses, ruffle wrap dress that Pippa donned for the occasion, it's still available to shop: wild roses ruffled wrap dress KATE SPADE NEW YORK nordstrom.com $398.00 Earlier this month, Pippa attended Princess Eugenie's wedding while 9 months pregnant. Arriving with her husband, Pippa wore a dark green, long-sleeved dress, with mock-turtleneck detail, which she paired with a green fascinator with bow on it. Getty Images Max Mumby/Indigo Throughout her pregnancy, Pippa has written a column for magazine, in which she's discusses the different forms of exercise she's been partaking in during each trimester. In her most recent column, Pippa describes how \"movement is certainly getting more awkward\" as her pregnancy progresses (via). Waitrose Weekend People Advertisement - Continue Reading Below"}, {"articleID": "2011102814_00051585_W", "names": {"Jeff Hall": ["Q1975504", "Q19867493", "Q6173990", "Q6173992"]}, "date": "2011-10-28", "url": "http://GreenvilleOnline.com/article/20111028/NEWS/310280007/Plan-keeps-more-water-in-Upstate-lakes?odyssey=tab|mostpopular|text|FRONTPAGE", "content": "the username or password you entered is incorrect. please try again. if you continue to have problems, please contact customer service at 1-888-285-3956. enter your email address to verify your identity and we'll send a new password to your account. to protect your account, we automatically reset your password and sent it to enter your e-mail to verify your identity, and we will resend an account confirmation e-mail to your address. remember to check your spam folder if necessary. check your e-mail and click on the link to activate your account. you must click on the activation link in the sent e-mail we do not have this account number in our system. please try again or call customer service at 1-888-285-3956. we've detected that more than 5 accounts are associated with this paid subscription. if you believe this is an error, please call customer service at 1-888-285-3956. find your account number on your invoice or call customer service at 1-888-285-3956. drop all beginning zeros and include the \"is .\" e.g., is00012345 becomes is12345. this combination of phone number and house number does not match our records. please try again or call customer service at 1-888-285-3956. greenville police officers and greenville county sheriffs deputies are responding to reports of...the 4,000 or so runners for saturday's 7th annual spinx run fest will see a damp start from a.. . tennessee's recent offensive struggles have come against three of the top six defenses in the...with china's middle class growing and the country becoming a major market for u.s. firm to sell anderson office elliott davis llc announced thursday that its anderson office will be sold to suggsjohnson llc by...at the beginning of every masterworks concert by the greenville symphony orchestra, music director...the season began earlier this month for the east coast hockey league affiliates, but the pucks will...witches, demons, ghouls and other supernatural forces have been around since time immemorial,...tradition versus progress. conservation versus development. greenville news editorial: the work is not done in iraq throughout the last half century, dramatic advances in infrastructure and technology have led to an...plan keeps more water in upstate lakes updated weather forecasts show a dry winter and spring ahead, and the u.s. army corps of engineers has called on federal and state agencies to turn the faucet down at the lake thurmond dam and keep more water in upstate lakes, a u.s. army corps of engineers official said thursday. anderson - updated weather forecasts show a dry winter and spring ahead, and the u.s. army corps of engineers has called on federal and state agencies to turn the faucet down at the lake thurmond dam and keep more water in upstate lakes, a u.s. army corps of engineers official said thursday. col. <mark>jeff hall</mark>, commander of the corps' savannah district, said that will happen as soon as all agencies involved agree to plans similar to action taken in 2007 as the last drought gripped the region. \"conditions are eerily similar to what we saw in 2007,\" <mark>hall</mark> told greenvilleonline.com. a la nina is strengthening in the pacific, which typically means a drier winter and spring along the savannah river basin, <mark>hall</mark> said. could lake hartwell sink to the historic low seen in 2008 as that drought continued? it's possible, <mark>hall</mark> said. on the other hand, the upstate could get rain in the spring and go to full pool, he said. or the lakes could drop to a new low. the corps is taking proactive actions and following the steps it took in 2007, working with other agencies, to do what it can under current policy, <mark>hall</mark> said. currently, the corps is letting the minimum amount of water out of the dam allowed under its current drought plan. with the cooperation of the other agencies, the amount would be reduced another 200 cubic feet per second to 3,600 cubic feet per second, <mark>hall</mark> said. <mark>hall</mark> was in anderson to speak with members of the lake hartwell association, which has pushed for earlier action to lower the flow out of upstate lakes in drought. one of the things herb burnham, president of the more than 2,000-member association, wants to know is why the proposed action couldn't have been taken sooner. hartwell was full in july, <mark>hall</mark> said, and the corps must follow its current guidelines, which were adopted in 2006. to make major changes, the corps drought plan has to be changed, and a comprehensive study is needed to do that, he said. the latest holdup has been that south carolina hasn't been able to come up with its share, even as an in-kind contribution. that soon could change, <mark>hall</mark> said. \"we're working an out-of-the-box solution,\" <mark>hall</mark> said. the nature conservancy has offered to make south carolina's contribution, and paperwork details with lawyers are in the works to begin phase two, <mark>hall</mark> said. the first phase of the study was done a few years ago. the second phase of the plan could allow the corps to move trigger levels higher, which means restricting flow out of the thurmond dam earlier in drought, <mark>hall</mark> said. that depends on what the study finds as the entire stretch of the savannah river is studied from water supplies for drinking and industry to protection of endangered species including the short nose sturgeon, which need a decent flow to spawn. <mark>hall</mark> is excited about another new tool that will be available through clemson university's intelligent river project. the project will place computerized sensors along the length of the savannah that will provide real-time data. the savannah \"will be the most monitored river in the world,\" <mark>hall</mark> said."}, {"articleID": "2014052501_00044793_W", "names": {"Damon Thomas": ["Q21013519", "Q44702022", "Q5212888", "Q5212889"], "Eric Anderson": ["Q10468648", "Q17437673", "Q3731452", "Q5386020", "Q5386021", "Q5386024", "Q5386025", "Q58338151"]}, "date": "2014-05-24", "url": "http://accesshollywood.com/kim-kardashian-and-kanye-west-wed_article_94653", "content": "It's official - Kim Kardashian and Kanye West have tied the knot! The reality TV superstar and the rapper said \"I do\" on Saturday in front of friends and family at Forte di Belvedere in Florence, Italy. The 33-year-old bride and her 36-year-old groom were married by Miami pastor Rich Wilkerson Jr., according to PHOTOS: The Many Men Of Kim Kardashian Sharon Sacks served as wedding planner for the event, according to the mag. (She also planned Kim's baby shower and wedding to Kris Humphries .) Andrea Bocelli sang while Kim's stepdad, Bruce Jenner, walked her down the aisle, the mag reported. PHOTOS: Stars Who Tied The Knot In 2014 The nuptials come on the heels of a Kardashian invasion of the City of Light, which saw Kim joined by the entire Kardashian-Jenner family in Paris, in the days leading up to the big event. On Thursday night, it was ladies night out, as Kim was joined by seven of her closest girlfriends as they posed in front of the Louvre, the Eiffel Tower - and even a reported trip to famed burlesque club Crazy Horse, where sisters Khloe and Kendall also joined in on the festivities. PHOTOS: Kim Kardashian & Kanye West On Friday, Kim, Kanye, North and the family enjoyed a lunch at designer Valentino Garavani's home outside Paris. sharing a photo on Instagram of the gorgeous grounds with lights showing through the clouds - something she took as a celestial sign of approval. \"Little angels in the sky blessing us #TheyDidntShowUpInAnyoneElsesPicture #Valentino,\" she captioned the pic. The rehearsal dinner took place on Friday night at the famed Palace of Versailles. 600 guests were on hand for the bash, which included a performance by Lana Del Rey (one of Kim's favorite singers), and a 7-minute fireworks show. The marriage marks the first for Kanye, whose most famous relationship before Kim was with model Amber Rose, who Kanye dated until 2010. However, his longest relationship was with designer Alexis Phifer, who he dated on and off from 2002 - 2008. The couple even got engaged in 2006 before calling things off. For Kim, it's her third trip down the aisle. In 2000, at age 19, Kim married R & B producer <mark>Damon Thomas</mark>. The marriage lasted four years before they split in 2004. In October 2010, Kim began dating NBA star Kris Humphries. They became Kim filed for divorce on October 31, 2011. The divorce wasn't officially finalized until June 2013 .--<mark>Eric Anderson</mark> & Erin O'Sullivan Copyright? 2013 by NBC Universal, Inc.. All Rights Reserved. Part of NBCU Digital Entertainment."}, {"articleID": "2014021508_00053086_W", "names": {"David Horsey": ["Q1174765", "Q3018085", "Q3018088"], "Ricardo Santos": ["Q10361246", "Q16849445", "Q25190224", "Q2794023", "Q464911", "Q53705451", "Q716813"], "John Hahn": ["Q15877095", "Q20631164"], "Fabrizio Zanotti": ["Q3738138", "Q590399"], "Michael Hoey": ["Q15994517", "Q2846845", "Q43380468"], "Dustin Johnson": ["Q1002293", "Q30015838"], "Francesco Molinari": ["Q1363419", "Q15791396", "Q55965506"]}, "date": "2014-02-14", "url": "http://betting.betfair.com/golf/the-punter/the-punters-in-play-blog-walker-in-the-mix-yet-again-140214-167.html", "content": "The Punter' The Punter's In-Play Blog: Off the pace South Africans could be worth siding with at East London The Punter's In-Play Blog: Off the pace South Africans could be worth siding with at East London <mark>David Horsey</mark> - in-contention in Africa \"Every Africa Open so far has gone to one of the home contingency and two winners have come from six back and one from five off the pace at halfway .\" Steve takes a look at the state of play at the Africa Open. Can pre-event pick, <mark>David Horsey</mark>, gallop on to the winning line? After the morning's rain delay, a few groups are yet to finish round two of the It looked highly likely that <mark>Ricardo Santos</mark> would lead at halfway but then young American Tour School graduate, <mark>John Hahn</mark>, played his second nine holes, the easier front-nine, in 28! pre-event selection, <mark>David Horsey</mark>, in the thick of things but I've added two more now also. Every Africa Open so far has gone to one of the home contingency and two winners have come from six back and one from five off the pace at halfway. So with poor weather forecast tomorrow we could see much change and I've added South African duo, Garth Mulroy and Dawie Van Der Walt. I can see defending champ, Darren Fichardt, and course specialist, Jaco Van Zyl, getting into the argument too but I'm not as keen about their prices. Northern Trust Open is well underway and that will be live on Sky Sports 4 at 22.00. I'll be back in the morning with a look at the state of play at halfway. I've not had the best of weeks so far and could do with my selections doing a bit better than they are just to cheer me up a bit! The week started with both kids off school ill so I was more than happy to escape the sick bay and make my way to the Manchester City - Sunderland match on Wednesday but that descended into farce. High winds meant the game was called off and so home I trudged eventually on a badly delayed and crammed train. And by the time I got home, the bug had kicked in and I've felt pants ever since. Africa Open but didn't see a single stroke at the At the Africa Open, <mark>Ricardo Santos</mark> is setting the early pace and currently 14-under-par, having just completed round two. He leads by three over <mark>Fabrizio Zanotti</mark> but the afternoon starters are yet to start. Hopefully we'll get the second round completed today but it might be touch-and-go as we lost an hour or so because of rain this morning and it didn't do my main fancy, <mark>Michael Hoey</mark>, any good at all. I was getting quite excited when he played the first five holes in three-under-par to get within five of the lead but he then failed to birdie the par 5 15th or the easy 16th and when he came back after the rain delay, he double-bogeyed the 17th and that was that. I'll return to this event at the close of play - if I haven't gone back to bed that is! Northern Trust Open, pre-event favourite, <mark>Dustin Johnson</mark>, leads after round one following a five-under-par 66 but with 11 players tied for second on -4, it's bunched to say the least. <mark>Francesco Molinari</mark>, is one of those tied for second, as is the bang-in-form Northern Trust Open: Schwartzel can build on last year's debut, says The Punter Our man runs the rule over the field in California this week for the Northern Trust Open. Read his comprehensive Africa Open: <mark>Hoey</mark> can go one better at East London, says The Punter Parental supervision (e.g. using ICRA, NetNanny, CyberPatrol) is advised and encouraged. Please Gamble Responsibly BETFAIR? and the BETFAIR LOGO are registered trade marks of The Sporting Exchange Limited. Data on Betfair website (s) (including pricing data) is protected by? and database rights. It may not be used for any purpose without a licence .? The Sporting Exchange Limited. All rights reserved. TSE (Gibraltar) LP is licensed by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner under the Gambling Act 2005. RGL No. 049. Address: Units 2/4 and 2/5 Waterport Place, Gibraltar. Betfair Pty Ltd is licensed and regulated to offer Australian Markets by the Tasmanian Gaming Commission."}, {"articleID": "2017020115_00469778_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-02-01", "url": "http://www.derehamtimes.co.uk/sir_henry_bellingham_calls_for_sensible_perspective_and_says_former_breckland_councillor_charles_carter_comments_in_different_league_to_donald_trump_1_4872420", "content": "Sir Henry Bellingham calls for \"sensible perspective\" and says former Breckland councillor Charles Carter comments in \"different league\" to <mark>Donald Trump</mark> Annabelle Dickson annabelle.dickson @ archant.co.uk @ newsannabelle 01 February, 2017 - 14:30 Charles Carter at the Boxing Day hunt at Raynham Hall. He has been suspended following an incident while hunting with the Middleton Hunt. Picture: Ian Burt A Norfolk MP has claimed a former Breckland councillor and hunt master's comments to a female protestor were in a \"different league\" to <mark>Donald Trump</mark> and needed \"sensible perspective\". Share 3 Comments Email this article to a friend To send a link to this page you must be logged in. Sir Henry Bellingham claimed that while Charles Carter's comments were \"completely inappropriate and out of order for someone of his standing\" , they had been made in a \"purely private context\". Mr Carter, who was master of the West Norfolk Fox Hounds until last May, was filmed when he was approached by 41-year-old mum-of-four Linda Hoggard to challenge him over his activities. As he took out his own phone to video her, he asked her name and then told her: \"I'd quite like to **** you, actually\" , before adding: \"Can I take you to bed, please?\" Smiling, he then added: \"You're very pretty,\" before finally asking: \"Can I have your number, please?\" In a letter to the Eastern Daily Press, Sir Henry, the MP for North-West Norfolk, praised the former Saham Toney councillor's \"many different achievements\" , claiming it would be \"very sad\" if they were undermined by his \"10 second aberration\". He said: \"My starting point is that the remarks he made during what he thought was a private conversation were completely inappropriate and out of order for someone of his standing .\" However, I do believe that we need to keep this in some sort of perspective. Indeed, if you compare his remarks to some of the completely vile ones about women made by <mark>Donald Trump</mark>, and some of the anti-Semitic remarks made by Labour MPs, then Charles Carter's remarks are in a different league. \"He went on to say that there appeared to be\" growing tendency these days to give someone a good kicking when they are down, and completely fail to acknowledge their success and achievements over many years \". He claimed Mr Carter was very\" conscientious, incisive and professional \"as a councillor, and he had provided a\" great deal of leadership and effort \"in his job as Joint Master and Amateur Huntsman of the West Norfolk Hunt. Tory councillor Charles Carter resigned from Breckland Council last Wednesday. A notice of vacancy for the Saham Toney ward is on the council website at www.breckland.gov.uk/article/3430/Elections-2016-2017"}, {"articleID": "2012100905_00080210_W", "names": {"John Allen": ["Q1254163", "Q16020150", "Q16146490", "Q16197280", "Q16902080", "Q1699130", "Q18626469", "Q20086555", "Q28747989", "Q51585343", "Q5546881", "Q5546939", "Q55941536", "Q55949585", "Q615356", "Q6218727", "Q6218730", "Q6218735", "Q6218737", "Q6218744", "Q6218747", "Q6218751", "Q6251486", "Q6253741"]}, "date": "2012-10-09", "url": "http://abcnews.go.com/International/wireStory/panetta-allen-reassure-nato-insider-attacks-17429259", "content": "by lolita c. baldor associated press nato defense leaders gathering here this week remain committed to the war in afghanistan, according to u.s. and alliance officials, but there are growing signs that the afghan political and military hostilities against the coalition are starting to wear on the coalition. defense secretary leon panetta and other u.s. officials heading to the meetings say they expect to reassure allies that military commanders are doing all they can to stem the tide of insider attacks, in which afghan troops or insurgents dressed in their uniforms turn their guns on the coalition forces that they are training and fighting alongside. compounding those military threats, however, is a recent spike in political tensions between afghanistan's government leaders and the u.s. afghan president hamid karzai complained that the war effort is wrongheaded, and that coalition forces are not fighting the right enemy. just days ahead of the nato meeting, panetta was uncharacteristically sharp, criticizing karzai for complaining rather than thanking the troops who have sacrificed their lives for his country. karzai's argument that nato is wrongly going after the taliban in afghanistan when it should be fighting insurgents in pakistan's safe havens could further erode support for the war, particularly among members of congress. panetta's pique reflects the frustration of his military commanders, who have seen more than 2,000 u.s. troops die in the 11-year war. and it can only fuel the increasingly strident grumbling by american lawmakers who are facing hotly contested elections next month, and are hearing from constituents wondering why the u.s. is pouring billions of dollars into a fight that afghanistan's shaky and corruption-plagued government may no longer support. still, panetta and allied leaders, including nato secretary-general anders fogh rasmussen, insist that the war strategy and the timeline remain firm. they say the coalition will stick to the withdrawal schedule, which has combat forces leaving and afghan forces taking over security of the country by the end of 2014. panetta told reporters traveling with him that the ministers will discuss the progress that has been made since they met for a summit in chicago earlier this year. \"i'll also reassure allies of our strong commitment to finishing the job in afghanistan alongside our allies,\" he said. defense ministers on wednesday will also hear from marine gen. <mark>john allen</mark>, the top u.s. commander in afghanistan, who will discuss measures the military has taken to reduce the insider attacks. the attacks, which have killed more than 53 coalition troops this year, have imperiled the strategy by eating away at the trust between the allied forces and the afghans they were sent there to mentor and train. \"my goal is to make clear to nato and to our allies that we are taking all steps necessary to confront this issue and that it should not be allowed to deter us from the plan that gen. <mark>allen</mark> put in place,\" said panetta. with support for the war ebbing across america and much of the world, there have been growing calls for a speedier withdrawal. watch: roundtable ii: this week in politics watch: roundtable i: debate fallout"}, {"articleID": "2019122113_00099565_W", "names": {"Harry Dunn": ["Q5668498", "Q59196545"]}, "date": "2019-12-21", "url": "http://www.winsfordguardian.co.uk/news/national/18116975.harry-dunns-family-hits-back-us-government-suspects-lawyers/", "content": "<mark>Harry Dunn</mark>'s family hits back at US government and suspect's lawyers By Press Association 2019 <mark>Harry Dunn</mark> <mark>Harry Dunn</mark>'s family has criticised lawyers acting on behalf of the US intelligence officer's wife accused of killing their son after they claimed she had \"co-operated fully\" with the investigation. The family has led a high-profile campaign for justice after Anne Sacoolas returned to the US after the car she was driving collided with the 19-year-old's motorbike on August 27. Sacoolas, 42, and her family had been based at RAF Croughton in Northamptonshire and she sparked public outrage after claiming diplomatic immunity due to her husband's job. It was only after she left the UK on a military flight directly from the air base that the Foreign Office wrote to the family to say immunity in her case was not valid. Chief Crown Prosecutor Janine Smith said: \"Following the death of <mark>Harry Dunn</mark> in Northamptonshire, the Crown Prosecution Service has today authorised Northamptonshire Police to charge Anne Sacoolas with causing death by dangerous driving .\" More: https: //t.co/d1BA9a56Nd--CPS (@ cpsuk) December 20, 2019 After the <mark>Dunn</mark> family's campaign--which included a trip to the White House--the Crown Prosecution Service announced on Friday that Sacoolas has been charged with causing death by dangerous driving. Prosecutors have begun the extradition process to bring her back to the UK. A statement from Amy Jeffress, Sacoolas's lawyer, said she had \"co-operated fully with the investigation\". She added: \"Anne will not return voluntarily to the United Kingdom to face a potential jail sentence for what was a terrible but unintentional accident .\" Please see statement issued on behalf of the Parents of #HarryDunn. #Justice 4harry @ Justice4Harry https: //t.co/j4KaF3A7c0--Radd Seiger (@ RaddSeiger) December 21, 2019 <mark>Dunn</mark> family spokesman Radd Seiger said: \"I know (Ms Jeffress) to be one of the finest and most outstanding lawyers in the USA. Her statement however boggles the mind and is deeply disturbing .\" For Ms Jeffress to seek to undermine one of the most mature, well-developed legal systems in the world, which has fairness at its heart, and which many countries around the world have modelled their legal systems on, is unbecoming of any lawyer, let alone someone of her stature. \"Mr Seiger urged Sacoolas to\" put that defence forward in court here rather than ventilate it publicly \". He added:\" Like everyone else (in the UK) she will get a fair trial. \"After the CPS decision on Friday, a spokesman for the US State Department said it was\" disappointed \", adding it feared the move would\" not bring a resolution closer \". The department maintained that Sacoolas had diplomatic immunity at the time of the incident. It added:\" It is the position of the United States government that a request to extradite an individual under these circumstances would be an egregious abuse. \""}, {"articleID": "2018121600_00915162_W", "names": {"Mike Thomas": ["Q16207321", "Q17511846", "Q24007200", "Q3313561", "Q42807736", "Q6849033", "Q6849035", "Q6849036", "Q6849038"]}, "date": "2018-12-16", "url": "https://www.wjhg.com/content/news/Height-incentives-are-no-longer--502841651.html", "content": "Panama City Beach leaders vote to remove height incentives, buildings must now be built to code Posted: Sat 5:47 PM, Dec 15, 2018 | Updated: Sat 5:51 PM, Dec 15, 2018 PANAMA CITY BEACH, Fla. (WJHG/WECP) - Developers in Panama City Beach will have now have to build to code now that height incentives have been given the thumbs down by council members. The Panama City Beach City Council voted to remove the incentives during this week's meeting. Buildings can now be no higher than 150 feet tall, which is 15 stories. \"Those incentives were something that you just can't enforce, you can't give somebody extra height for something and then take it away,\" said Panama City Beach Mayor <mark>Mike Thomas</mark>. \"Our community is not set up to fight those things and make people do them .\" The city will also welcome a new Busy Bee gas station. The fuel station is a joint venture between the St. Joe Company and Johnson and Johnson, Inc.. City leaders said it's one of the first new businesses to come to the city since Hurricane Michael hit. \"We lost so much property value with Bay County because of this storm,\" said Mayor <mark>Thomas</mark>. \"This will help property value at least on the beach, that tax money goes to Bay County .\" The new gas station station will be located on Panama City Beach Parkway and Nautilus Street. The gas station is expected to have an approximately 13,000 square foot convenience store and 14 fueling pumps. City leaders said it's expected be the largest convenience store in the region and the first of many stores in the northwest Florida."}, {"articleID": "2009111521_00000789_W", "names": {"Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"], "John Howard": ["Q1467025", "Q51330", "Q5670833", "Q58363217", "Q6228200", "Q6236889", "Q6240028", "Q6240032", "Q6240035", "Q6240041", "Q6240047"]}, "date": "2009-11-15", "url": "http://stuff.co.nz/world/europe/3065725/Brits-sorry-for-sending-children-to-colonies", "content": "the british government will apologise for shipping thousands of poor children, often without the knowledge of their parents, to its former colonies, including new zealand, during the 20th century. as many as 150,000 poor british children were shipped off to the colonies over three and a half centuries, often taken from struggling families under programmes intended to provide them with a new start - and the empire with a supply of sturdy white workers. forty years after the programme stopped, britain and australia are saying sorry to the child migrants, who were promised a better life only to suffer abuse and neglect thousands of miles from home. the british government said on sunday that prime minister <mark>gordon brown</mark> would apologise for child migrant programmes that sent boys and girls as young as three to new zealand, australia, canada and other former colonies. many ended up in institutions where they were physically and sexually abused, or were sent to work as farm labourers. australian prime minister kevin rudd will offer his own apology on monday to the child migrants, as well as to the \"forgotten australians,\" children who suffered in state care during the last century. sandra anker, who was six when she was sent to australia in 1950, said the british government has \"a lot to answer for .\" \"we've suffered all our lives,\" she told the bbc. \"for the government of england to say sorry to us, it makes it right - even if it's late, it's better than not at all .\" the british government has estimated that a total of 150,000 british children may have been shipped abroad between 1618 - when a group was sent to the virginia colony - and 1967, most of them from the late 19th century onwards. most sent to australia after 1920, most of the children went to australia through programmes run by the government, religious groups and children's charities. a 2001 australian report said that between 6000 and 30,000 children from britain and malta, often taken from unmarried mothers or impoverished families, were sent alone to australia as migrants during the 20th century. many of the children were told that they were orphans, though most had either been abandoned or taken from their families by the state. siblings were commonly split up once they arrived in australia. authorities believed they were acting in the children's best interests, but the migration also was intended to stop them from being a burden on the british state while supplying the receiving countries with potential workers. a 1998 british parliamentary inquiry noted that \"a further motive was racist: the importation of\" good white stock' was seen as a desirable policy objective in the developing british colonies. \"ad feedback british children's secretary ed balls said the child migrant policy was\" a stain on our society. \"\"the apology is symbolically very important,\" he told sky news television. \"i think it is important that we say to the children who are now adults and older people and to their offspring that this is something that we look back on in shame,\" he said. \"it would never happen today. but i think it is right that as a society, when we look back and see things which we now know were morally wrong, that we are willing to say we're sorry .\" making amends britain has been trying to make amends since the late 1990s by funding trips to reunite migrants with their families in britain. <mark>brown</mark>'s office said officials would consult with representatives of the surviving children before making a formal apology next year. official apologies for historical wrongs have proved controversial. former australian prime minister <mark>john howard</mark> initially resisted calls to apologise to institutionalised children and australian aborigines, arguing that contemporary australians should not take responsibility for mistakes made by past generations. rudd reversed the policy after he was elected in 2007 and apologised to aborigines for 200 years of injustice since european settlement. at a ceremony on monday in canberra that hundreds of former child migrants are expected to attend, rudd will apologise for his country's role in the migration and say sorry to the 7000 survivors of the programme who still live in australia."}, {"articleID": "2012012810_00076210_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2012-01-28", "url": "http://news.sky.com/home/world-news/article/16158383", "content": "<mark>david cameron</mark> and hamid karzai pictured meeting in afghanistan last july 10:34 am uk, saturday january 28, 2012 <mark>david cameron</mark> and afghanistan's president hamid karzai are to discuss what support is needed from the international community after troops withdraw from the country in 2014. it comes as france said it plans to pull out most of its military personnel by the end of 2013 - a year earlier than the nato deadline. french president nicolas sarkozy made the announcement following talks with his afghan counterpart. at the prime minister's country residence chequers, mr <mark>cameron</mark> and mr karzai will discuss security progress and will sign a pledge setting out the next stage in relations between britain and afghanistan. the \"enduring strategic partnership\" renews a 2005 agreement and sets out a shared vision of a secure, stable and prosperous afghanistan able to maintain its own security and stop international terrorists using it as a safe haven, officials said. it also ensures the uk is supporting the development of afghanistan at the grassroots level with concrete action that directly benefits civilians, according to downing street. british troops are due to leave afghanistan in 2014 some of that work is already under way, including the creation of new police stations, education schemes for women and a uk-funded afghanistan business innovation fund. british troops are to end their combat role at the end of 2014. asked about troop withdrawals during a pre-christmas visit to soldiers serving in afghanistan, mr <mark>cameron</mark> said: \"i don't want to see some massive cliff-edge in 2014 - i don't think that's practical .\" but i don't think we need to make hard and fast decisions at this stage. \"he said there was\" an ongoing conversation with our allies \"about how and when nato forces would be withdrawn over the next three years .\" i'm absolutely clear that the british public deserve to know there is an endpoint to our involvement in afghanistan and that endpoint is 2014. \"today's meeting follows the last-minute cancellation of talks in december after a series of bombings in afghanistan in the first serious resurgence of sectarian violence in a decade. a british soldier has died after suffering a gunshot wound while on patrol in helmand province, afghanistan, the ministry of defence has said. the 1st battalion the yorkshire regiment soldier was serving as a member of an international security assistance force foot patrol to disrupt insurgent activity when he came under attack."}]