[{"articleID": "2018070318_00161567_W", "names": {"John Mcnamara": ["Q16227873", "Q23616982", "Q3182071", "Q6248201", "Q6248203", "Q6248205"], "Rebecca Smith": ["Q30907428", "Q39072694", "Q43525202", "Q440719", "Q45729447", "Q47452564", "Q7301927"]}, "date": "2018-07-03", "url": "http://www.siouxlandmatters.com/news/hundreds-celebrate-the-life-of-slain-maryland-journalist/1280250169", "content": "Suspect wrote he aimed to kill everyone at Maryland newsroom By: Posted: Jul 03, 2018 01:12 PM CDT Updated: Jul 03, 2018 01:12 PM CDT BALTIMORE (AP) - A man charged with slaying five people at a Maryland newspaper sent three letters on the day of the attack, police said, including one that said he was on his way to the Capital Gazette newsroom with the aim \"of killing every person present.\" Sgt. Jacklyn Davis, a spokeswoman for Anne Arundel County police, said the letters were received Monday. They were mailed to an attorney for The Capital newspaper, a retired judge of the Maryland Court of Special Appeals and a Baltimore judge. The letter Ramos sent to the Annapolis newspaper's Baltimore-based lawyer was written to resemble a legal motion for reconsideration of his unsuccessful 2012 defamation lawsuit against the paper, a columnist and then-publisher Tom Marquardt. Marquardt shared a copy of the letter with The Associated Press. \"If this is how the Maryland Judiciary operates, the law now means nothing,\" Ramos wrote. He quoted a description of the purpose of a defamation suit, saying it was intended for a defamed person to \"resort to the courts for relief instead of wreaking his own vengeance.\" \"\"That' is how your judiciary operates, you were too cowardly to confront those lies, and this is your receipt,\" Ramos wrote. He signed it under the chilling statement: \"I told you so.\" Below that, he wrote that he was going to the newspaper's office \"with the objective of killing every person present.\" In a letter attached to what appeared to be the faux court filing, he also directly addressed retired special appeals court Judge Charles Moylan, who decided against Ramos in his defamation case. Ramos sued the paper after pleading guilty to harassing a high school classmate. \"Welcome, Mr. Moylan, to your unexpected legacy: YOU should have died,\" he wrote. He signed it: \"Friends forever, Jarrod W. Ramos.\" Douglas Colbert, a University of Maryland law professor, described the letters as \"very powerful\" evidence of intent that the state will make full use of at trial. Colbert said as long as it's established in court that Ramos authored the letters, they will be used to show his \"planning and deliberate actions\" on the day of the attack. The apparent admissions by the defendant will weaken a defense lawyer's strategy of suggesting that he was \"suffering from a mental disease or defect\" that would impair his ability to understand the consequences of his actions, Colbert said. Ramos, 38, has a well-documented history of harassing the paper's journalists. The defamation suit was thrown out as groundless, and he often railed against current and former Capital staff in profanity-laced tweets. Police found him hiding under a desk after Thursday's attack and jailed him on five counts of first-degree murder. At a memorial service Monday night for one of those killed, editor Rob Hiassen, Marquardt said he once slept with a baseball bat by his bed because he was so worried about Ramos. He also said that they \"stepped up security\" at the newspaper years ago, and posted Ramos's photo around the office. \"But then he went dormant for about two years and we thought the problem has been solved. Apparently, it was just building up steam,\" he said. The mourning in Annapolis continued Tuesday, marked by a lowering of U.S. flags to honor the victims. President Donald Trump ordered flags flown at half-staff on federal property through sunset. Annapolis Mayor Gavin Buckley said Monday that Trump, who has repeatedly called journalists the \"enemy of the people,\" said he had been told his request to lower the flags had been denied. The White House said Tuesday that Trump ordered the flags lowered as soon as he learned of the mayor's request. Buckley expressed frustration Monday afternoon when he was told by a Maryland congressman's office the request had not been granted. He said he considered lowering flags on his own, but decided to follow protocol. He said he received a call from White House Press Secretary Sarah Huckabee Sanders just after 11 p.m. Monday, asking him for confirmation if he personally was making the request. \"She was very sympathetic,\" Buckley said in an interview. \"She felt for our community. She said\" I'll get back to you in the morning,' and she called me 7:16 this morning to say the president had issued a proclamation, and we're very grateful for that. \"Hiaasen was remembered Monday evening in stories, poems, prayers and songs at the\" celebration of life \"ceremony Monday evening. He was fatally shot last week at the Capital Gazette along with colleagues Gerald Fischman, <mark>John McNamara</mark>, <mark>Rebecca Smith</mark> and Wendi Winters. ___"}, {"articleID": "2016071919_00818371_W", "names": {"James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}, "date": "2016-07-19", "url": "http://atimes.com/2016/07/travel-hallelujah-mountains-on-earth/", "content": "Travel In all probity, you have watched the blockbuster \"Avatar\" once, if not multiple times. You're also probably familiar with \"Pandora\" and \"unobtanium\" by now and were blown away by the hallucinatory floating mountains of the <mark>James Cameron</mark> film. What if those Hallelujah (floating) mountains are on Earth? Well, come to Hubei (Hu-bay) Province of Central China for such an out-of-the-world experience. Hubei's capital Enshi is home to China's Grand Canyon. Its soaring mountains, deep canyons, meandering rivers, heavenly waterfalls and the beauty that they exhibit can give you a feel of being in Pandora's misty and mythical mountains. Enshi proudly displays the peaks and valleys of what is known today as China's Grand Canyon. A Daily Mail report had stated that the Hallelujah (floating) mountains were inspired from such Chinese mountains and <mark>James Cameron</mark>'s film came after a Hollywood photographer spent time shooting in Southern Hunan in 2008. As film fans started to flock to see the mountain columns, the column was officially named as the \"Avatar Hallelujah Mountain.\" Zhangjiajie branch of China International Travel Service Corp offers tourists two packages: \"Magical tour to Avatar-Pandora\" or a \"Miracle tour to Avatar's floating mountain.\" Visit www.citszjj.com for more details. Share this:"}, {"articleID": "2015060805_00022248_W", "names": {"Paul Molitor": ["Q1972377", "Q93152"], "Kyle Gibson": ["Q14878777", "Q24283915", "Q6451161"], "Paul Allen": ["Q162005", "Q24062169", "Q3370450", "Q37834596", "Q7149040"], "Mark Rosen": ["Q56610769", "Q57431876"]}, "date": "2015-06-08", "url": "http://startribune.com/three-twins-postgame-thoughts-from-len3-hunter-the-desginated-hitter-graham/306357031", "content": "Here are three thoughts following the Twins 10-5 loss to Milwaukee THE MISSED CATCH: Visions of Ray Durham and Mark Kotsay were running through my mind as Torii Hunter got locked up trying to catch Adam Lind's rocket and had it get past him for a RBI double. Durham and Kotsay's were worse, because they came against Oakland in the playoffs. \"He hit it, line drive in the lights,\" Hunter said. \"And it stayed in the lights. If it's on a line it is going to stay in there. All I could do is make the adjustment, jump as high as I could on the run. But, that was hit hard.\" ROSTER NEEDS WORK: What are the Twins going to do about their DH spot? Eduardo Nunez was 1-for-4 on Friday, but this lineup could use some pop, and there's a speed bump after Trevor Plouffe bats. Kennys Vargas apparently is just doing OK at Rochester and Josmil Pinto has tailed off after a hot start. It has forced the manager to come up with some eye-popping lineups. \"It's been challenging,\" Twins manager <mark>Paul Molitor</mark> said. \"It is kind of where we are at right now, especially with our hand being forced to use our bullpen tomorrow we need depth. We are a little limited on the bench, so we have have to rendez-vous through the DH and the middle of the lineup for now. We're looking for people to come up and help us but I don't think anyone is jumping out at us right now.\" TOMORROW!!!: The Twins need a solid start from J.R. Graham tomorrow or things could get interesting. It sounds like Ryan Pressly will be the first one out of the bullpen once Graham is done. Brian Duensing and Tim Stauffer could be used but they did pitch tonight and the bullpen was gassed when it left for Boston. That's why the Twins were relieved that <mark>Kyle Gibson</mark> was able to go seven innings on Friday when it looked like he was going to hit the showers early. La Velle E. Neal III has covered baseball for the Star Tribune since 1998 (the post-Knoblauch era). Born and raised in Chicago, he grew up following the White Sox and hating the Cubs. He attended both the University of Illinois and Illinois-Chicago and began his baseball writing career at the Kansas City Star. He can be heard occasionally on KFAN radio, lending his great baseball mind to <mark>Paul Allen</mark> and other hosts. <mark>Mark Rosen</mark> borrows him occasionally for WCCO-TV. StarTribune.com welcomes and encourages readers to comment and engage in substantive, mutually respectful exchanges over news topics. Commenters must follow our Terms of Use. Keep it civil and stay on topic. No profanity, vulgarity, racial slurs or personal attacks. Comments with web links are not permitted. Comments that violate the above will be removed. Repeat violators may lose their commenting privileges on StarTribune.com. Graham tries to save the bullpen and lead the Twins over Brewers Woman falls to her death in abandoned Mpls. grain elevator Brodkorb: Downey's plan for cutting deputy's salary draws criticism"}, {"articleID": "2019121914_00187901_W", "names": {"Ann Taylor": ["Q332843", "Q4766700"], "Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"]}, "date": "2019-12-19", "url": "https://www.wlfi.com/content/news/566340862.html", "content": "Our Apps More than 9,300 stores closed in 2019 2019 was another bruising year for many American retailers, despite healthy consumers and a strong economy. This year, US retailers announced 9,302 sto...Posted: Dec 19, 2019 9:44 AM Posted By: CNN 2019 was another bruising year for many American retailers, despite healthy consumers and a strong economy. This year, US retailers announced 9,302 store closings, a 59% jump from 2018 and the highest number since Coresight Research began tracking the data in 2012. Bankruptcies in the retail sector intensified this year and many struggling chains cut stores. That led to a spike in closings. Payless, Gymboree, Charlotte Russe and Shopko all filed for bankruptcy and closed a combined 3,720 stores, according to Coresight. The majority of those were because of Payless, which filed for its second bankruptcy in February and shuttered 2,100 US stores. Discount chain Fred's filed for bankruptcy in September and closed 564 stores. Forever 21 also filed for bankruptcy that month and said it will close up to 178 stores. Forever 21's closures are not in Coresight's report since they are not finalized. Other retailers, such as <mark>Ann Taylor</mark> parent Ascena Retail, Family Dollar, GNC, Walgreens, Signet Jewelers, Victoria's Secret and JCPenney, slashed their store footprints to save money and prop up higher-performing stores. Family Dollar closed 359 this year, while Signet, the parent company of mall stalwarts Kay, Jared and Zales, announced 159 closures. Thousands more store closings could be on the way in the coming years as online shopping continues to replace purchases at physical stores and eat into retailers' profits. High debt levels and rent have also burdened traditional retailers. Online sales make up around 16% of retail sales today, but they will rise to 25% by 2026, UBS analysts estimated in a research report. That could force up to 75,000 mores stores to close by 2026, including more than 20,000 clothing stores and about 10,000 consumer electronics stores, UBS estimates. Thousands of home furnishings and sporting goods stores will also need to close as online shopping grows rapidly. Even thriving retailers such as Walmart and Best Buy quietly closed a handful of their stores--although those companies are opening some, too. And department stores such as Nordstrom and Kohl's are shuttering a few stores each. As of Monday, Macy's was the worst stock on the S & P 500 this year, losing 49%, while Gap, L Brands, Kohl's and Nordstrom were in the bottom 20 on the index. Moody's lowered its outlook for department stores heading into the holiday season. \"Despite a very favorable consumer spending environment, department stores have yet to catch a break,\" analyst Christinia Boni said in a research report. <mark>Michael Brown</mark>, partner in the consumer and retail practice of consulting firm AT Kearney, said that he expects store closings to outplace openings in 2020 as retailers continue to \"right size\" their footprints. Some retailers are opening stores, however. The Coresight report noted that this year, retailers announced 4,392 openings this year. The discount sector in particular is growing. Dollar General announced it opened 975 stores this year, a similar number to previous years. \"We continue to believe we operate in one of the most attractive sectors in retail,\" Dollar General CEO Todd Vasos said on a call with analysts earlier this month. Dollar General will open 1,000 new stores next year and it plans for an additional 13,000 around the country. Meanwhile, discount chains like Ollie's Bargain Outlet and Five Below expanded this year. Discount grocer Aldi and opened hundreds of stores in the United States to reach customers who want to shop for cheap groceries, and TJX continued its rapid growth, opening nearly 200 stores. Some parts of the retail business could bounce back next year. \"Malls are benefiting from the refreshing influence of Generation Zers, who prefer to shop in stores and are driving traffic back to brick-and-mortar retail,\" real estate firm CBRE analysts said in a research report. Online brands will open stores, food and beverage concepts are growing, gyms and fitness concepts are spreading, and pop-up stores continue to be a popular tool for many retailers. A healthy economy should also continue to bolster many retailers and malls in the coming year. \"We expect continued growth and strength for both retailers and shopping center owners as consumer fundamentals remain strong,\" said JLL CEO Greg Maloney. Related Content"}, {"articleID": "2015033112_00074275_W", "names": {"Gene Kim": ["Q55153249", "Q5531290"], "Andrew Phillips": ["Q17385572", "Q28868053", "Q4758268", "Q4758269", "Q4758271"]}, "date": "2015-03-31", "url": "http://www.sys-con.com/node/3318741", "content": "Mike Kavis News Feed Item Oxysure (OXYS) Reports Fourth Quarter and Full-Year 2014 Results FRISCO, TX--(Marketwired - March 31, 2015) - OxySure Systems, Inc. (OTCQB: OXYS) (\"OxySure,\" or the \"Company\" ), today announced financial and operating results for the fourth quarter and year ended December 31, 2014. Revenues were $2.4 million, up 35%, led by an 83% increase in revenues in the US Model 615 shipments up 18%; Replacement cartridge shipments up 35% Replacement cartridges up to 144% of Model 615 shipped Julian T. Ross, Chairman of the Board and Chief Executive Officer of OxySure stated, \"We are pleased to have grown the business once again, while remaining focused on building a solid medical device platform to leverage growth opportunities going forward. We are now remarkably well-positioned as an emerging medical device leader to achieve our goals for 2015 and beyond. These goals include rapidly growing our direct sales force, expanding overseas, launching a direct to consumer (DTC) campaign, uplisting our company to NYSE or Nasdaq, and making strategic acquisitions.\" For the fiscal year ended December 31, 2014, revenues increased by 35% to $2,437,402 from $1,800,327 in 2013. The increase was primarily driven by an 83% surge in revenues in the United States. The revenue increase in the US was driven primarily by an increase in sales from products for the military in connection with a teaming agreement. For the Company's Model 615 portable emergency oxygen product, unit cartridge reorder rates continued to increase as the installed base of Model 615 increases, continuing the trend of a very \"sticky\" customer relationship with the product upon adoption. Unit cartridge shipments as a percentage of Model 615 shipments increased to 144% in FY2014 from 125% in FY2013. Cartridges as a percentage of the Model 615 installed base as at December 31, 2014 increased to 45%, up from 39.3% as at December 31, 2013. During FY2014, Model 615 shipments increased 18% versus FY2013, and replacement cartridge shipments increased 35% versus FY2013. This continues to be consistent with historical trends of rising reorders as customers become more accustomed to OxySure's products. Gross profit was $1,018,355 for the twelve months ended December 31, 2014, a decrease of 15.7% from $1,207,341, primarily due to the effect of an increase in absorbed rent expense and labor cost. Adjusted for these rent and labor expenses gross profit was $1,352,746 representing a gross margin of 56%. Selling, general and administrative expenses for 2014 were $2,469,711 compared to $1,339,624 for fiscal year 2013. The Company increased sales and marketing expenses by 104% to $718,705 as it expanded its sales and marketing, branding and investor relations efforts. General and administrative expenses also increased by 78% to $1,751,006 primarily as a result of an increase in employee stock option expense, an increase in salaries and wages, and an increase in professional fees. Professional fees increased primarily due to legal and accounting fees related to an acquisition transaction the Company pursued during the second half of 2014 but did not consummate during FY2014. Interest expense increased to approximately $907,612 in the twelve months ended December 31, 2014, as compared to $249,979 in the twelve months ended December 31, 2013, primarily as a result of the amortization of debt discount and beneficial conversion features (BCF). The Company recorded approximately $747,612 in non-cash interest related to debt discount amortization during the twelve months ended December 31, 2014, as compared to $207,239 during the twelve months ended December 31, 2013. Net loss during fiscal year ended December 31, 2014 was $2,753,560, or $0.10 per share, as compared to $712,452 or $0.03 per share for fiscal year ended December 31, 2013. The weighted average shares outstanding were 26,367,254 and 23,754,402 for fiscal year 2014 and 2013, respectively. The Company's balance sheet remained strong. Cash was $647,093 at December 31, 2014 as compared to $657,673 at December 31, 2013. Working capital was a surplus of $418,734 at December 31, 2014 as compared to a surplus of $747,473 at December 31, 2013. The Company's current ratio was 1.3 as at December 31, 2014. Cash from financing activities was down 24% to $1.16 million during FY2014 from $1.52 million during FY2013. The Company had deferred income tax assets of $5,588,365 and $4,733,483 for the years ended December 31, 2014 and 2013 respectively which were offset in full by a valuation allowance. OxySure enters 2015 in a remarkably strong position as an emerging medical device leader. Over the past 12 months, the Company: Expanded its international distribution footprint by adding new distributors such as HTM Medico for Singapore, and Ajad Medical for Saudi Arabia; Received CE Mark Approval for the OxySure Model 615 Portable Emergency Oxygen Device, a critical step toward launching the product into the 30 countries belonging to the European Economic Area (EEA); Commenced a pilot for a cloud-based tracking and incident reporting system; Made significant progress on the development of new products for the military; Secured Cliff Meidl, two-time Olympian and Team USA Olympic Flag Bearer to be a Spokesman and Special Advisor exclusively to the Company; Was selected by the United States Patent and Trademark Office (USPTO) as one of 10 companies, including Caterpillar, Qualcomm and others to exhibit its product and related technologies at the Innovation Expo held at the Smithsonian; Made significant staffing additions to enhance medical device platform capability, including a VP of Resuscitation Sales, Director of Regulatory Affairs and Quality Assurance, and additions in engineering, manufacturing and territory sales management; and Opportunistically invested in operational efficiencies. The Company plans to continue its focus on growth by expanding its direct sales force and its global distribution channel. The Company also plans to ramp up its sales and marketing activities to raise market awareness and grow its brand, while maintaining a focus on regulatory approvals and compliance and reductions in product costs and operational costs. These initiatives and investments will result in higher sales for OxySure in the future, and at the same time expand OxySure's leadership position in the emergency/short-duration oxygen market and the pre-hospital medical emergency market in general. \"We are excited about 2015 as we anticipate continued growth, new opportunities and even the possibility of catalytic events,\" said Mr. Ross. \"We plan to continue to work hard to improve our products, our competitive position, and our category leadership, while striving to maintain our culture of innovation as we grow.\" OxySure's CEO Julian Ross will host the conference call to discuss the Company's fiscal year 2014 results. Date: Tuesday, March 31, 2015 Time: 9:00 am ET US Dial-In: 1 (800) 697-5978 Audience US Toll Free International Dial-In: 1 (630) 691-2750 Audience US Toll OxySure Systems, Inc. (OXYS) is a medical technology company that focuses on the design, manufacture and distribution of specialty respiratory and medical solutions. The company pioneered a safe and easy to use solution to produce medically pure (USP) oxygen from inert powders. The company owns numerous issued patents and patents pending on this technology which makes the provision of emergency oxygen safer, more accessible and easier to use than traditional oxygen provision systems. OxySure's products improve access to emergency oxygen that affects the survival, recovery and safety of individuals in several areas of need: (1) Public and private places and settings where medical emergencies can occur; (2) Individuals at risk for cardiac, respiratory or general medical distress needing immediate help prior to emergency medical care arrival; and (3) Those requiring immediate protection and escape from exposure situations or oxygen-deficient situations in industrial, mining, military, or other \"Immediately Dangerous to Life or Health\" (IDLH) environments. Statements in this earnings release that are not historical facts are considered to be forward-looking statements. Such statements include, but are not limited to, statements regarding management beliefs and expectations, based upon information available at the time the statements are made, regarding future plans, objectives and performance. All forward-looking statements are subject to risks and uncertainties, many of which are beyond management's control and actual results and performance may differ significantly from those contained in forward-looking statements. OxySure Systems, Inc. intends any forward-looking statement to be covered by the Litigation Reform Act of 1995 and is including this statement for purposes of said safe harbor provisions. Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date of this news release. OxySure Systems, Inc. undertakes no obligation to update any forward-looking statements to reflect events or circumstances that occur after the date as of which such statements are made. A discussion of certain risks and uncertainties that could cause actual results to differ materially from those contained in forward-looking statements is included in OxySure Systems, Inc.'s Annual Report on Form 10-K for the year ended December 31, 2014. OXYSURE SYSTEMS INC.. BALANCE SHEETS December 31, 2014 2013 ASSETS----------------------------------------------Current assets Cash and cash equivalents $647,093 $657,673 Accounts receivable, net 369,575 47,183 Inventories 277,346 287,666 License fee receivable 463,308 500,000 Prepaid expenses and other current assets 53,588 107,305 Total current assets 1,810,910 1,599,827 Property and equipment, net 91,537 70,249 Intangible assets, net 362,764 392,746 Other assets, net 246,237 289,532 TOTAL ASSETS $2,511,448 $2,352,354 LIABILITIES AND STOCKHOLDERS' EQUITY----------------------------------------------Current liabilities Accounts payable and accrued expenses $558,338 $147,719 Related party payable 154,850 118,627 Deferred revenue - 2,976 Capital leases - current 149 309,129 Notes payable - current, net of discount 40,897 44,000 Convertible notes payable, net of discount 637,942 229,903 Total current liabilities 1,392,176 852,354 Long-term liabilities Capital leases - 554 Notes payable, net of discount 44,484 76,072 Total long-term liabilities 44,484 76,626 TOTAL LIABILITIES 1,436,660 928,980 COMMITMENTS AND CONTINGENCY (NOTE 9) STOCKHOLDERS' EQUITY----------------------------------------------Preferred stock, par value $0.0005 per share; 25,000,000 shares authorized; 593,750 Series A convertible preferred shares issued and outstanding as of December 31, 2014 and 743,750 shares issued and outstanding as of December 31, 2013. 296 371 1,145 Series B convertible preferred shares issued and outstanding as of December 31, 2014 and 750 shares issued and outstanding as of December 31, 2013. 1 - Common stock, par value $0.0004 per share; 100,000,000 shares authorized; 28,438,631 shares of voting common stock issued and outstanding as of December 31, 2014 and 25,854,307 shares issued and outstanding as of December 31, 2013 11,377 10,343 Additional Paid-in Capital 19,104,322 16,700,307 Accumulated deficit (18,041,208) (15,287,647) TOTAL STOCKHOLDERS' EQUITY 1,074,788 1,423,374 TOTAL LIABILITIES AND STOCKHOLDERS' EQUITY $2,511,448 $2,352,354 OXYSURE SYSTEMS INC.. STATEMENTS OF OPERATIONS For the year ended December 31, 2013 2014 Revenues, net $2,437,402 $1,800,327 Cost of goods sold 1,419,047 592,986 Gross profit 1,018,355 1,207,341 Operating expenses Research and development 583,435 356,015 Sales and marketing 718,705 353,156 Other general and administrative 1,751,006 986,468 Loss from operations (2,034,791) (488,298) Other income (expenses) Other income (expense) 188,843 25,825 Interest expense (907,612) (249,979) Total other income (expenses) (718,768) (224,154) Net loss $(2,753,560) $(712,452) Basic net income (loss) per common share $(0.10) $(0.03) Diluted net income (loss) per common share $(0.10) $(0.03) Weighted average common shares outstanding: Basic 26,367,254 23,754,402 Diluted 26,367,254 23,754,402 OXYSURE SYSTEMS INC.. STATEMENTS OF CASH FLOWS Year Ended December 31, 2014 2013 CASH FLOWS FROM OPERATING ACTIVITIES: $(712,452) Net income (loss) $(2,753,560) Adjustments to reconcile net income (loss) to net cash from operating activities: 53,159 Depreciation and amortization expense 42,151 Amortization of debt discount and beneficial 207,239 conversion features 747,612 - Gain on forgiveness of debt 14,466 - Gain on settlement of debt (90,912) - Derivative liability fair value adjustment 3,001 37,335 Expenses paid by related parties 4,374 - Expenses paid on behalf of third party 150,000 61,480 Stock based compensation 136,944 126,756 Common stock issued for services 64,873 Changes in operating assets and liabilities: (28,697) Accounts receivable (322,392) (66,321) Inventories 10,320 (500,000) License fees receivable 36,692 106,148 Other assets 125,531 (72,601) Accounts payable and accrued liabilities 763,046 - Prepaid expense (28,519) (72,837) Deferred revenue (2,976) (860,791) NET CASH USED IN OPERATING ACTIVITIES (1,099,349) CASH FLOWS FROM INVESTING ACTIVITIES (12,105) Purchase of property and equipment (68,080) (4,262) Purchase of intangible assets (198) (16,367) NET CASH USED IN INVESTING ACTIVITIES (68,278) CASH FLOWS FROM FINANCING ACTIVITIES 347,364 Common stock issued for cash 29,701 Series B preferred stock issued for cash and 750,000 warrants 525,000 216,800 Common stock issued for cash and warrants - 42,470 Cash received from related parties 9,800 (268,950) Payments made to related parties (227,951) - Payments made on notes payable - 431,500 Cash received from convertible notes payable 1,168,200 - Payments made on convertible notes payable (200,201) (2,254) Payments on capital leases (151,872) 4,388 Exercising of warrants 4,370 1,521,318 NET CASH PROVIDED BY FINANCING ACTIVITIES 1,157,047 644,160 Net change in cash and cash equivalents (10,580) Cash and cash equivalents, at beginning of 13,513 period 657,673 $657,673 Cash and cash equivalents, at end of period $647,093 Supplemental disclosure of cash flow information: Cash paid during the period for: $18,792 Interest $- $- Income taxes $- Supplemental non-cash investing and financing activities: $- Initial value of derivative $28,009 48,012 Capitalization of deferred loan costs - Common stock issued for services and rent 179,710 extension - Common stock issued for capitalized website 114,180 development costs - Common stock issued in connection with lease - extinguishment 66,750 Cashless exercise of warrants for forgiveness 14,700 of debt - 447,748 Conversion of convertible notes payable 625,913 317,609 Benefical conversion feature 951,423 Conversion of Series A preferred stock to 38 common stock 74 423,413 Conversion of accrued rent to common stock - www.redchip.com / Published March 31, 2015 Copyright © 2015 SYS-CON Media, Inc. - All Rights Reserved. SYS-CON Events announced today that Creative Business Solutions will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. Creative Business Solutions is the top stocking authorized HP Renew Distributor in the U.S. Based out of Long Island, NY, Creative Business Solutions offers a one-stop shop for a diverse range of products including Proliant, Blade and Industry Standard Servers, Networking, Server Options and...SOA Software has changed its name to Akana. With roots in Web Services and SOA Governance, Akana has established itself as a leader in API Management and is expanding into cloud integration as an alternative to the traditional heavyweight enterprise service bus (ESB). The company recently announced that it achieved more than 90% year-over-year growth. As Akana, the company now addresses the evolution and diversification of SOA, unifying security, management, and DevOps across SOA, APIs, microser...The webinar, hosted by XebiaLabs, will feature 4 experts including Special Host <mark>Gene Kim</mark>, author of The Phoenix Project, along with IT thought leaders Gary Gruver, Randy Shoup and XebiaLabs' <mark>Andrew Phillips</mark>. The panel brings more than 30 years of collective experience surrounding microservices transformations at major companies including Google, eBay and Tripwire. \"The story around microservices and containers is pretty compelling and the attraction of more flexibility is obviously alluring,\" ...Wearable technology was dominant at this year's International Consumer Electronics Show (CES), and MWC was no exception to this trend. New versions of favorites, such as the Samsung Gear (three new products were released: the Gear 2, the Gear 2 Neo and the Gear Fit), shared the limelight with new wearables like Pebble Time Steel (the new premium version of the company's previously released smartwatch) and the LG Watch Urbane. The most dramatic difference at MWC was an emphasis on presenting we...SYS-CON Events announced today that FierceDevOps will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. FierceDevOps keeps software developers and IT operations personnel updated on the latest news and trends around the rapidly evolving role of the traditional IT worker. WHOA.com has announced the newest addition to its data center footprint with the expansion into Equinix's newest state-of-the-art facility: DC-11 Washington, DC IBX +. Located in Ashburn, VA, this data center expands Whoa.com's presence to meet rapidly expanding customer demand for secure cloud solutions. Equinix, Inc. operates International Business Exchange ™ (IBX ®) data centers in 32 markets across 15 countries in the Americas, EMEA, and Asia-Pacific. Equinix is committed to operating faciliti...SYS-CON Events announced today that robomq. io will exhibit at SYS-CON's @ ThingsExpo, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. robomq. io is an interoperable and composable platform that connects any device to any application. It helps systems integrators and the solution providers build new and innovative products and service for industries requiring monitoring or intelligence from devices and sensors. Today, IT is not just a cost center. IT is an enabler and driver of business. With the emergence of the hybrid cloud paradigm, IT now has increasingly more capabilities to create new strategic opportunities for a business. Hybrid cloud allows an organization to utilize multi-tenant public clouds, dedicated private clouds, bare metal hosting, and the associated support and services for the right use cases through an on-demand, XaaS model. This model of IT creates tremendous opportunities for busi...SYS-CON Events announced today that the DevOps Institute has been named \"Association Sponsor\" of SYS-CON's DevOps Summit, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. The DevOps Institute provides enterprise level training and certification. Working with thought leaders from the DevOps community, the IT Service Management field and the IT training market, the DevOps Institute is setting the standard in quality for DevOps education and training. Business as usual for IT is evolving into a \"Make or Buy\" decision on a service-by-service conversation with input from the LOBs. How does your organization move forward with cloud? In his general session at 16th Cloud Expo, Paul Maravei, Regional Sales Manager, Hybrid Cloud and Managed Services at Cisco, discusses how Cisco and its partners offer a market-leading portfolio and ecosystem of cloud infrastructure and application services that allow you to uniquely and securely combine cloud busi...Businesses are looking to empower employees and departments to do more, go faster, and streamline their processes. For all workers - but mobile workers especially - utilizing the cloud to reconnect documents and improve processes without destructing existing workflows can have a dramatic impact on productivity. In his session at 16th Cloud Expo, Mark Grilli, vice president of Acrobat Solutions marketing at Adobe Systems Incorporated, will outline new ways that the cloud is changing the way peo...WSM International has launched a DevOps services division that offers assessment, consulting and implementation to large enterprises and organizations with complex infrastructures. The concept of DevOps is to blend information technology (IT) software development with operations to optimize the computing infrastructure according to the specific needs of the organization. According to a recent press release from Gartner, \"By 2016, DevOps will evolve from a niche strategy employed by large cloud...SYS-CON Events announced today that Solgenia will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY, and the 17th International Cloud Expo ®, which will take place on November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA. Solgenia is the global market leader in Cloud Collaboration and Cloud Infrastructure software solutions. Designed to\" Bridge the Gap \"between Personal and Professional S.. . SYS-CON Events announced today that QTS Realty Trust, one of the nation's largest and fastest-growing providers of data center facilities and cloud services and a leader in security and compliance, will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. QTS Realty Trust, Inc. (NYSE: QTS) is a leading national provider of data center solutions and fully managed services, and a leader in security and compliance...SYS-CON Events announced today that WSM International (WSM), the world's leading cloud and server migration services provider, will exhibit at SYS-CON's 16th International Cloud Expo ®, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. WSM is a solutions integrator with a core focus on cloud and server migration, transformation and DevOps services. Making Financial Sense of PaaS, Part Deux Microsoft Opening Keynote | NoOps! = No Operations DevOps Summit Keynote | Purpose-Defined Computing: The Next Frontier in Automation General Session | Verizon Pay-As-You-Go Model for Oracle Database Licenses Means Costs Savings and Business Benefits Creating a Faster, More Secure Cloud General Session | [Podcast] Hybrid Cloud - Different Clouds for Different Needs SAP General Session | Innovation with Cloud and Big Data Solutions That Will Revolutionize Your Business - Join SAP and Partners General Session | How to Architect and Optimize Your Cloud for Consistent Performance Lunch Power Panel at 15th Cloud Expo | Choosing the Right Cloud Option View Dr. Kristof Kloeckner Keynote: Cloud Needs DevOps Microsoft Azure for Enterprise: What and Why Big Data Management System: Smart SQL Processing across Hadoop and your Data Warehouse Real-time Big Data: An Agile Approach Day 2 Keynote | How to Maintain Relevancy in a Cloud World: A Step-by-Step Approach to the Future Business of IT Day 2 Lunch Keynote | Application Delivery in the Cloud: Debunking Myths and Showcasing the Realities Day 3 Keynote | Navigating Storage in a Cloudy Environment Lighten Your Data Center TCO with Helium Storage Solutions Fear & Loathing in the Enterprise Cloud (with apologies to Hunter S. Thompson) Being a huge supporter of Platform-as-a-Service (PaaS), specifically, container-based PaaS, such as CloudFoundry and Heroku, I decided to apply my pricing experience to hacking up an estimate for delivering a mobile application inclusive of development through operations. The goal for me was to see if my own assertions that PaaS actually reduced both development and operating costs could be suppor...Mar. 31, 2015 08:00 AM EDT Reads: 1,295 WebRTC, un standard du Web, pas un produit WebRTC? Si vous n'en avez pas encore entendu parlé, il est important que vous découvriez une technologie qui va profondément changer les modes de communication de tous vos collaborateurs. Je vais m\" intéresser en priorité aux potentiels à moyen terme de cette technologie; il existe encore des limites techniques importantes, mais elles vont sauter dans les mois qui viennent. Les entreprises peuve...Mar. 31, 2015 08:00 AM EDT Reads: 1,766 One of the most difficult things to do today is to identify a legitimate user. Part of the problem is that the definition of a legitimate users depends greatly on the application. Your public facing website, for example, may loosely define legitimate as \"can open a TCP connection and send HTTP request\" while a business facing ERP or CRM system requires valid credentials and group membership as wel...Mar. 31, 2015 08:00 AM EDT Reads: 1,088 DevOps & Hybrid Clouds: A Match Made in Heaven? It seems today we are in a constant state of business and technology disruption. The convergence of the social, mobile, analytics, and cloud (SMAC) disruptions have both forced and enabled organizations to move at breakneck speeds addressing the needs and expectations of the lines of business/end users. This speed requires the development teams to be agile. They must be able to respond quickly to...Mar. 31, 2015 08:00 AM EDT Reads: 683 Containers & Microservices at Cloud Expo The 16th Cloud Expo has added coverage containers and microservices to its program for New York, to be held June 9-11 at the Jacob Javits Convention Center. Cloud Expo has long been the single, independent show where delegates and technology vendors can meet to experience and discuss the entire world of the cloud. This year will be no different. Containers are an old concept that saw renewed...Mar. 31, 2015 07:00 AM EDT Reads: 2,256 Making Financial Sense of PaaS, Part Deux As pointed out by Mark, it's very easy to make the cloud look financially attractive when pricing out a single application versus a portfolio of applications. Indeed, I would have to agree one of the most difficult things is to formulate an apples-to-apples comparison of cloud to data center. Even with the concept of reservations, the cloud cannot come close to the amortization of capital allocati...Mar. 31, 2015 04:30 AM EDT Reads: 474 Internet of Things Becomes High Fashion Wearable technology was dominant at this year's International Consumer Electronics Show (CES), and MWC was no exception to this trend. New versions of favorites, such as the Samsung Gear (three new products were released: the Gear 2, the Gear 2 Neo and the Gear Fit), shared the limelight with new wearables like Pebble Time Steel (the new premium version of the company's previously released smartw...Mar. 31, 2015 03:00 AM EDT Reads: 1,525 Our guest on the podcast this week is Jason Bloomberg, President at Intellyx. When we build services we want them to be lightweight, stateless and scalable while doing one thing really well. In today's cloud world, we're revisiting what to takes to make a good service in the first place. microservices Listen in to learn why following \"the book\" doesn't necessarily mean that you're solving key bu...Mar. 31, 2015 03:00 AM EDT Reads: 1,144 How You Integrate Network Services Matters Polymorphism is a concept central to object-oriented programming. The notion of polymorphism is used to extend the capabilities of a basic object, like a mammal, to specific implementations, like cats or dogs or honey badgers, even though they don't care about such technical distinctions. A good example of this is cats and dogs, which are both of the type \"mammal\" but that \"speak\" in a different v.. . Mar. 31, 2015 02:00 AM EDT Reads: 1,195 State of Application Delivery 2015: Full-stack Security Confidence Security is one the more prominent of the application service categories, likely due to its high profile impact. After all, if security fails, we all hear about it. The entire Internet. Forever. So when one conducts a survey on the state of application delivery (which is implemented using application services) you kinda have to include security. Which of course, we did. Mar. 31, 2015 02:00 AM EDT Reads: 1,410 In celebration of International Women's Day, we'd like to shine the spotlight on our very own Anita Engleder, DevOps Lead at ruxit. DevOps is definitely a male-dominated domain so \"doing DevOps #LikeAGirl\" is no small achievement here. I met with Anita earlier this week and asked her a few questions about the #LikeAGirl movement, working in the male-dominated tech industry, and whether or not t.. . Mar. 30, 2015 10:00 PM EDT Reads: 1,537 I first met Alan in New York City at the 2014 CloudExpo just after starting my new role at VictorOps. Known as \"Shimmy\" to most in the DevOps community, Alan launched DevOps.com as a resource for DevOps education and community building. Shimmy and I reconnected again in Houston where I gave a talk on ChatOps at Camp DevOps. A self-described serial entrepreneur and business executive, Alan has f.. . Mar. 30, 2015 06:15 PM EDT Reads: 1,361 Our guest on the podcast this week is Mark Thiele, EVP of Data Center Technology at Switch. We discuss the idea that private clouds are often equated with do-it-yourself and why that should be changed. Taking sure you are receiving the private environment you need at a cost that can support your business. Listen in to learn the different ways to own and manage a private cloud. Mar. 30, 2015 05:00 PM EDT Reads: 2,047 WHOA.com \"Bronze Sponsor\" of Cloud Expo SYS-CON Events announced today that WHOA.com, an ISO 27001 Certified secure cloud computing company, has been named \"Bronze Sponsor\" of SYS-CON's 16th International Cloud Expo ® New York, which will take place June 9-11, 2015, at the Javits Center in New York City, NY. WHOA.com is a leader in next-generation, ISO 27001 Certified secure cloud solutions. WHOA.com offers a comprehensive portfolio of...Mar. 30, 2015 04:00 PM EDT Reads: 1,321 The Era of the IoT On-Demand Economy The presentation describes the emergence of the On Demand Economy, how new super-scale ventures like Uber taxis, Airbnb and others are transforming the fundamental operating models for corporations and consequently destroying the competition in the industries they are disrupting. They do so by leveraging the peer to peer model, cultivating marketplace models for dynamically matching demand and su...Mar. 30, 2015 03:00 PM EDT Reads: 633 Increasingly, Pay Per Use Is Paying Off You hear the terms \"subscription economy\" and \"subscription commerce\" all the time. And with good reason. Subscription-based monetization is transforming business as we know it. But what about usage? Where's the \"consumption economy\" ? Turns out, it's all around us. When most people think of usage-based billing, the example that probably comes to mind first is metered public utilities - water, g.. . Mar. 30, 2015 02:45 PM EDT Reads: 779 Recent announcements from Google about the future of Glass naturally ignited an explosion of commentary in the tech media. For those of us in the Glass at Work world, the news that Glass has \"graduated\" from Google [x] into a true business unit headed by Tony Fadell is very promising. Yet many outlets' coverage focused on the end of the Glass Explorer program for consumers, characterizing it as the...Mar. 30, 2015 02:30 PM EDT Reads: 967 File Governance Policies and Features With recent high profile data breaches companies should ensure they have the five following file governance policies in place in their company to secure their file assets. Ensure that an Identity Management policy is in-place, is clear, and if one exists that it is validated and checked regularly. Check whether services and applications can take advantage of existing Identity Management to enabl...Mar. 30, 2015 02:00 PM EDT Reads: 625 Optimizing IoT and Mobile Communications There's a lot of focus on the performance of mobile communications given the incredible rate at which mobile is outpacing legacy PC (did you ever think we'd see the day when we called it that?) usage. There's been tons of research on the topic ranging from the business impact (you really can lose millions of dollars per second of delay) to the technical mechanics of how mobile communications is im...Mar. 30, 2015 02:00 PM EDT Reads: 1,376 This month I want to revisit supporting infrastructure and datacenter environments. I have touched (some would say rant) upon this topic since my post in April 2014 called \"Take a Holistic View of Support\" . My thoughts and views on this topic have not changed at all: it's critical for any organization to have a holistic, comprehensive strategy and view of how they support their IT infrastructure a.. . Making Financial Sense of #PaaS, Part II @ DevOpsSummit [#DevOps] FierceDevOps to Exhibit at @ DevOpsSummit New York | @ FierceDevOps [#DevOps] Solgenia to Exhibit at @ CloudExpo NY & Silicon Valley | @ Solgenia_Corp [#Cloud] Declarative vs. Imperative Models By @ ScriptRock | @ DevOpsSummit [#DevOps] Containers and Microservices On the Agenda at @ CloudExpo By @ IoT2040 [#DevOps] DevOps Institute \"Association Sponsor' of @ DevOpsSummit | @ DevOpsInst [#DevOps] Technology Hype Lifecycle: Google Glass By @ KyleSamani | @ ThingsExpo [#IoT]. @ OmniTI Announces DevOps Customer Successes | @ DevOpsSummit [#DevOps] Rackspace to Present at @ CloudExpo New York | @ Rackspace [#Cloud] Increasingly, Pay-Per-Use Is Paying Off By @ AriaSystemsInc | @ CloudExpo [#Cloud] Internet of Things and Internet of Everything By @ CiscoGovt | @ ThingsExpo [#IoE #IoT] Painless Polyglot Persistence By @ IBMCloud | @ CloudExpo [#Cloud] State of Application Delivery By @ LMacVittie | @ DevOpsSummit [#DevOps] The Digital Application Economy By @ JackieKahle | @ ThingsExpo [#IoT] The Largest WebRTC Resource Launched By @ ThingsExpo [#IoT #WebRTC] Welcome to the Slope of Enlightenment By @ bcferrycoder | @ DevOpsSummit [#DevOps] Announcing @ MangoSpring to Exhibit at @ CloudExpo New York & Silicon Valley Introducing App Deployment in 25 Seconds By @ ActiveState | @ DevOpsSummit [#DevOps] Sematext's @ DevOpsSummit Blog Exceeds 30,000 Reads | @ Sematext [#DevOps] Engineering-Driven Delivery Model By @ Dynatrace | @ DevOpsSummit [#DevOps] File Governance Policies and Features By @ JimLiddle | @ CloudExpo [#Cloud] Announcing @ Creative_Busine to Exhibit at @ CloudExpo New York [#Cloud] Windows Server 2003 Migration By @ AppZero_Inc | @ CloudExpo [#Cloud] Availability Is a Coat of Many Colors By @ LMacvittie | @ CloudExpo [#Cloud] Cloud Expo Launches\" Microservices Journal \"| @ CloudExpo [#Microservices] ThingsExpo World's Most Influential M2M Media Brand @ ThingsExpo [#IoT] Will Automated Alerting Replace the NOC? By @ PagerDuty | @ DevOpsSummit [#DevOps] Securing the SDDC with @ TufinTech at @ CloudExpo New York [#Cloud] SafeLogic's\" Kosher Data Encryption \"at @ CloudExpo | @ SafeLogic [#Cloud] Announcing @ Plutora to Exhibit at @ DevOpsSummit New York [#DevOps] Surviving a Datacenter Outage By @ PagerDuty | @ DevOpsSummit [#DevOps] SDK Support for @ Atmel Internet of Things By @ PubNub | @ ThingsExpo [#IoT] WebRTC Startup @ TemasysRTC Appoints Leaders | @ ThingsExpo [#WebRTC] WebRTC + Internet of Things By @ LiveOps | @ ThingsExpo [#IoT #WebRTC] Containers and Microservices at @ CloudExpo New York By @ IoT2040 [#Cloud] MTA Awards @ VicomComputer Long Term Technology Agreement | @ CloudExpo [#Cloud] Monetizing Big Data with Hadoop By @ MapR | @ BigDataExpo [#BigData] Jesse Proudman of @ Bluebox with @ MadGreek65 | @ DevOpsSummit [#DevOps] The Automation Opportunity By @ Automic | @ DevOpsSummit [#DevOps] Financial Sense of #PaaS By @ JPMorgenthal | @ DevOpsSummit [#DevOps] SoftLayer\" Platform Track \"at @ CloudExpo | @ SoftLayer | [#IoT #DevOps] Secure Cloud @ WhoaCloud Named\" Bronze Sponsor \"of @ CloudExpo [#Cloud] OpenShift Commons Latest in Battle with Cloud Foundry By @ IoT2040 | @ DevOpsSummit [#DevOps] Operational Hadoop for Streaming Data By @ MapR | @ CloudExpo [#BigData] Moore's Law & Hadoop By @ MasonKatz | @ CloudExpo [#Cloud #BigData] Internet of Things Is the New Big Data? By @ JimKaskade | @ ThingsExpo [#IoT #BigData] UX for the\" Internet of Things' By @ PARCinc | @ ThingsExpo [#IoT] Monetize This! Internet of Things By @ MetraTech | @ ThingsExpo [#IoT] DevOps Can Learn from Enterprise By @ Plutora | @ DevOpsSummit [#DevOps] Internet of Things New York Keynote Proposals | @ ThingsExpo [#IoT #M 2M] Data Lake and Data Refinery - Gartner Controversy! | @ CloudExpo [#BigData] Locking Down Data with @ Vormetric's Derek @ Tumulak | @ CloudExpo [#Cloud] Private vs Public Cloud with Erik Levitt of @ OpenDataCenters | @ CloudExpo [#Cloud] Microservices Unplugged By @ DavidSprott | @ DevOpsSummit [#DevOps] DevOps Summit Was a Terrific Event! By @ QubellInc | @ DevOpsSummit [#DevOps] Modern Collaborative Troubleshooting By @ AppDynamics | @ DevOpsSummit [#DevOps] Announcing @ IsomorphicHQ to Exhibit at @ DevOpsSummit New York [#DevOps] IGEL thin clients to integrate with Imprivata ® OneSign ™ to deliver secure, No Click Access ™ to virtual desktops Red Hat Governance For DevOps | @ RedHatNews @ DevOpsSummit [#DevOps] Cloud Is All About Workload By @ ABridgwater | @ CloudExpo [#Cloud] Cloud Computing - Big Data - Internet of Things SDDC - WebRTC - DevOps Cloud computing is become a norm within enterprise IT. The competition among public cloud providers is red hot, private cloud continues to grab increasing shares of IT budgets, and hybrid cloud strategies are beginning to conquer the enterprise IT world. Big Data is driving dramatic leaps in resource requirements and capabilities, and now the Internet of Things promises an exponential leap in the size of the Internet and Worldwide Web. The world of SDX now encompasses Software-Defined Data Centers (SDDCs) as the technology world prepares for the Zettabyte Age. DevOps into the mix, and you have three days of pure cloud computing that you simply cannot miss. Cloud Expo - the world's most established event - offers a vast selection of 130 + technical and strategic Industry Keynotes, General Sessions, Breakout Sessions, and signature Power Panels. The exhibition floor features 100 + exhibitors offering specific solutions and comprehensive strategies. The floor also features two Demo Theaters that give delegates the opportunity to get even closer to the technology they want to see and the people who offer it. Save $600 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires March 31, 2015! Speaker Opportunities Submit your speaking proposal for the upcoming Cloud Expo in New York [June 9-11, 2015] Exhibitor Info. Copyright © 1994-2014 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. ."}, {"articleID": "2019091015_00023387_W", "names": {"Mark O'Sullivan": ["Q2266912", "Q29107850", "Q6769090"], "Alan Bennett": ["Q2059152", "Q21453425", "Q21997412", "Q4706167", "Q654730"]}, "date": "2019-09-10", "url": "http://www.eveningecho.ie/corksport/Cork-City-showed-enough-in-Dundalk-to-finish-disappointing-season-on-a-high-13051f0b-1a9d-463a-9a85-abaedc4136b9-ds", "content": "Cork City showed enough in Dundalk to finish disappointing season on a high Denis Hurley WHILE Friday's clash with Dundalk resulted in a third straight loss for Cork City under head coach Neale Fenn, the new boss was pleased with the level of application shown. City went down 1-0 to a disputed late goal from Georgie Kelly, but Fenn was impressed with the response following the defeat at home to Waterford last Monday. \"I was gutted for the boys, really,\" he said. \"I know that it's a tough place to come but we were disciplined. We restricted them to nothing of note in the first-half, we knew the pressure was going to come in the second half but I felt we weathered it quite well.\" It was always going to be tough, we had a lot of injuries and a lot of lads missing, but I can't complain or be disappointed with any of the players. I was disappointed with the result, obviously, but the performance of the boys was excellent. \"I was critical of the boys on Monday night and I think they'll admit that they didn't defend properly, or on Friday [against Sligo Rovers].\" Against Dundalk, when the chips were down, they really defended well, restricted Dundalk to a couple of half-chances before the goal. It was unfortunate, the boys were saying that he punched it in, he never headed it, so it's disappointing from that point of view but I can't fault the overall performance. \"Dundalk's Andy Boyle with <mark>Mark O'Sullivan</mark> of Cork City. Picture: INPHO/Morgan Treacy Ultimately, Dundalk's quality told, with City missing a number of key players which deprived Fenn of options from the bench in the second half.\" Our bench was kids, apart from <mark>Alan Bennett</mark>, \"he said.\" We've got [Kevin] O’Connor out, [Garry] Buckley out, [Gearóid] Morrissey out, [Karl] Sheppard out, [Joel] Coustrain out--that's five players you would imagine would be near the starting 11. \"Alec Byrne came in against Dundalk and was excellent, but at the time, we're just going through a little bit of a time with injuries and it's tough, especially with three games in a week.\" Without a game this weekend, it gives us a chance to get those boys back and then we'll have a bench and a squad to choose from and you've got decisions. At the moment, we're just playing the lads that are fit. \"City's next league game is at home to Finn Harps on Friday week, with this Saturday seeing <mark>Alan Bennett</mark>'s testimonial take place. Fenn is glad of the opportunity to take stock.\" I won't lie, I've had a tough couple of weeks! \"he laughed.\" I was extremely disappointed with the result on Friday, nobody wants to go up there and lose, but the performance gave me hope and gave the lads hope too that they can dig out a result. \"They didn't on Friday but, with a fully fit squad and options off the bench--and that's no disrespect to the young lads--it gives you a different dimension.\" The break's coming at a good time, it gives the injured players time to get fit. \""}, {"articleID": "2014110910_00027683_W", "names": {"Douglas Adams": ["Q28421831", "Q932869"]}, "date": "2014-11-09", "url": "http://www.yakimaherald.com/news/latestnews/2627035-8/top-25-signs-you-might-be-a-band", "content": "As the marching band season draws to a close, band geeks everywhere are putting away their lyres, taking off their face paint and quietly reverting to the wintertime discipline of the concert band. The days of stressing over field maneuvers have come to a close, and the public starts to forget that their beloved band exists. That is, until basketball season, when it's summoned to try to make everyone excited about their great (or losing) team...again. The life of an always-on-call, always-spirited, I-believe-that-we-will-win pep band is one of multiple personality characteristics. As a concert band member, students will sit and tune, play the dynamics, pretend to listen to the director and focus on the balance of the band like a good musician is supposed to do. Shy band members avoid attention, and attention avoids them. Meanwhile, the school newspaper reporters groan when they have to go take photographs at the concerts. Then the big game rolls around, and all of a sudden the band is all-out screaming and singing and cheering and playing as loud as it can without a care for intonation. Nobody listens to anybody else, least of all the director. And meanwhile, mysteriously so, the newspaper gets every picture of the pep band in its stadium habitat. As one of these band geeks, I'll miss marching season like everybody else. However, I also know how necessary the concert band is to all of our lives. So now, as band fades for a few weeks from the memory of the general public, the rules by which every band geek lives, during both concert and pep band seasons, deserve some attention. In other words, you know you're a band geek when...1. You don't step on a scale every morning. You play one. 2. You walk by someone playing music in their car and you start marching in step. 3. Despite the claim by author <mark>Douglas Adams</mark> in \"The Hitchhiker's Guide to the Galaxy,\" the ultimate answer to Life, the Universe, and Everything is no longer 42. It's unison octaves. 4. When listening to pop music, you feel isolated by the lack of wind instrumentation. 5. You're watching a movie, and there's machine-gun fire. Your reaction: \"Who invited the snare drum?\" 6. You start comparing varsity track to wind ensemble. 7. You're prejudiced against the string players in the orchestra because they perform like dead people. That is, they don't have to breathe. 8. You dream of Disneyland...the music studio, not the theme park. 9. Someone's singing their favorite song and you wince because they're 20 cents flat in the wrong key. 10. When you're bored, you compose songs in your head and hum them aloud, to the harmony of your friends' complaints. 11. You know what a bass clarinet looks like. (Rare) 12. You know what a bass clarinet sounds like. (Rarer) 13. Same thing about the contrabass flute, soprano sax, English horn, sousaphone and bassoon. 14. The movie \"Drumline\" touched you more deeply than any other sports comeback story. 15. You know how to fix a broken music stand. But you have also perfected the art of avoiding the task. 16. You hum in tune with your refrigerator. 17. You know who Mendelssohn was. And how to spell \"Mendelssohn.\" 18. For you, time is only relative to the metronome. 19. People ask if you're bilingual; because you are in band you respond that you speak Italian. 20. You know the names of at least five music professors at the closest college. 21. In social studies class, you sit on the front six inches of your chair. Because you know it's best for your diaphragm. 22. The majority of your wardrobe is sweatshirts and pep shirts sporting your school's colors. 23. You use phrases like \"variations on the same theme\" in common conversation and don't even notice. 24. In addition to the inner and outer personas, you have a \"band persona.\" 25. Upon reflection...all your friends are band geeks like you."}, {"articleID": "2018012005_00402996_W", "names": {"Jeffrey Smith": ["Q42699211", "Q57441012"], "David Campos": ["Q12054131", "Q56509186", "Q56558506"], "Miguel Marquez": ["Q6014815", "Q6844663"]}, "date": "2018-01-20", "url": "https://patch.com/california/cupertino/campaign-embracing-immigrants-launches-santa-clara-county-wide", "content": "health & fitness Campaign Embracing Immigrants Launches Santa Clara County-Wide \"This is a campaign to say,\" You are not you, and we are not we. We are all. Immigrants are all .' \"0 SANTA CLARA COUNTY, CA--The County of Santa Clara's Office of Immigrant Relations launched a coordinated media campaign this morning to emphasize the county's support and resources for immigrants living in the county. County officials gathered with the consuls general from Mexico, El Salvador, Guatemala and Nicaragua in front of a Valley Transportation Authority bus with one of the campaign ads to make remarks on how and why the campaign was created. The campaign, advertised with posters that read,\" One county, one future, \"is designed to focus on\" the value of differences in the community, \"County Executive <mark>Jeffrey Smith</mark> said. The campaign will primarily highlight public health and social services, though the county offers many more resources available to the immigrant community, according to <mark>Smith</mark>. This campaign comes in the wake of recent U.S. Immigration and Customs Enforcement raids in four Bay Area counties on Jan. 10, when 21 people were arrested and ordered to appear in immigration court. The event was a follow-up operation that stemmed from a 2013 investigation, according to a statement from ICE. County Office of Immigrant Relations Director Maria Love also said that the county works to make sure that immigrants arrested by ICE have access to legal defense, including through a $3.5 million investment in community organizations that offer free legal services. The Rapid Response Network of Santa Clara County and the County Office of Immigration Relations have been working together, Love said. The RRN has a 24/7 hotline with attorneys standing by in the event that someone wants to report a raid happening or has had a family member picked up by ICE during a raid. The Santa Clara County Sheriff's Office had two representatives present in solidarity. <mark>Smith</mark> said that they are\" liberal \"and honor the sanctuary county rules, meaning that they do not report undocumented immigrants to ICE and keep their information confidential. They will not be following federal threats or ICE threats in the effort to deport undocumented residents, <mark>Smith</mark> said. <mark>Smith</mark> described Love, an immigrant from El Salvador, as\" the mastermind of the campaign. \"Love said that the Santa Clara County Board of Supervisors tasked her department with creating the campaign. According to <mark>Smith</mark>, about 100 county employees worked on it. Love said that her department talked to immigrants that live in Santa Clara County to determine what messages were most important. Love said that the campaign's objective is for the community to know that no matter what happens at the federal level, the county will support both documented and undocumented immigrants by giving them the resources that they need.\" Our immigrants are good people, the vast majority of them work hard, are documented and contribute significantly to our community, \"<mark>Smith</mark> said.\" The people who are not documented are only undocumented because we have a very abhorrent and very ineffective immigration policy nationwide. \"Deputy county executive <mark>David Campos</mark> highlighted that several employees who worked on the campaign are\" Dreamers themselves, \"individuals who entered the country as minors and were largely raised in the U.S. Santa Clara County Chief Operating Officer <mark>Miguel Marquez</mark> echoed <mark>Smith</mark>'s statement, telling his own sibling's stories of success as\" one of the true stories of immigrants. \"<mark>Marquez</mark> spoke of the two nationwide injunctions against President Trump's executive orders, one that protects sanctuary jurisdictions nationwide and one that allows\" Dreamers \"to renew their Deferred Action for Childhood Arrivals status that allowed them to reside in the United States. According to <mark>Marquez</mark>, county officials are doing all they can for each resident of the county, but especially for those foreign-born residents that make up more than 70 percent of the Silicon Valley workforce. All of the consul generals spoke in accord with county officials and the significance of the campaign in helping the immigrant community.\" We are all people, no matter our color, no matter our race and no matter our immigration status, \"said Consul General of El Salvador Ana Valuenzuela. Consul General of Guatemala Patricia Lavagnino called the campaign\" brave. \"\"This is a campaign to say,\" You are not you, and we are not we. We are all. Immigrants are all,' \"Lavagnino said. The campaign has a budget of about $40,000, and can be expanded as needed, according to <mark>Smith</mark>.\" Our major issue is trying to get the message out to our clients, \"<mark>Smith</mark> said.\" We are here to provide services for people who are typically underserved. \"The campaign ads will be posted at buses and bus stops with the reasoning that the targeted community needs those transportation services to get to the community resources the county can provide. They will also be in government buildings and advertised in a mail campaign, <mark>Smith</mark> said. By Bay City News Service Photos courtesy County of Santa Clara Office of Public Affairs"}, {"articleID": "2011050704_00003479_W", "names": {"Scott Baker": ["Q3476174", "Q3476175", "Q3476178", "Q47005459", "Q492525", "Q57821152", "Q7435935", "Q7435936"], "Angel Hernandez": ["Q4762191", "Q6173214", "Q8076840", "Q8076842"], "Joe West": ["Q12698725", "Q1691649", "Q42209694", "Q6212952"]}, "date": "2011-05-07", "url": "http://statesman.com/sports/red-sox-routed-again-1460264.html", "content": "minnesota twins' <mark>scott baker</mark> pitches in the first inning of a baseball game against the boston red sox, friday, may 6, 2011, in boston. (ap photo/michael dwyer) enlarge photo boston red sox's jacoby ellsbury makes the catch on a line drive hit by minnesota twins' denard span to end the top of the fourth inning of a baseball game on friday, may 6, 2011, in boston. (ap photo/michael dwyer) - red sox manager terry francona was upset with one of the umpires when he charged out of the dugout and had a beef with two of them by the time he returned. francona's outburst after tim wakefield was called for a balk in the second inning got him a quick trip to the clubhouse, where he watched his slumping club lose 9-2 to the minnesota twins. he could be looking at a suspension. \"i got thrown out because i came out. and since i was already thrown out i figured i could get an explanation,\" francona said. francona was ejected for storming out to argue the call, which he proceeded to do for several minutes after plate umpire <mark>angel hernandez</mark> tossed him. crew chief <mark>joe west</mark> kept francona away from <mark>hernandez</mark> and was bumped a few times while francona fumed about the decision, which cost the red sox a run and the third out of the inning. francona was more critical of <mark>west</mark> than <mark>hernandez</mark> after the game. \"that was me and <mark>angel</mark>. <mark>joe</mark> didn't have anything to do with it. i didn't really appreciate what he did,\" francona said. \"he was grabbing me. i didn't appreciate that. i thought it was wrong. i thought he was out of line.\" francona threw his gum to the infield turf, getting a boisterous cheer from the fenway park fans who didn't know they were in for another long night just a day after boston lost 11-0 to the los angeles angels. trevor plouffe homered in the first inning and <mark>scott baker</mark> pitched eight strong innings for the twins, who capitalized on several boston blunders. minnesota scored twice on balks and took advantage of a pair of errors by the red sox, who have allowed 21 runs in their last two games. <mark>baker</mark> (2-2) allowed seven hits, struck out eight and walked one for the twins, who have won three straight for just the second time this season. j.d. drew homered in the second and adrian gonzalez went deep in the fourth, but that was all the offense for boston, which has lost three straight. the homers and francona's furor were about the only highlights for the home fans. wakefield (0-1) allowed eight runs, six earned, and nine hits in 4 1-3 innings. \"i had a little trouble today,\" wakefield said. \"obviously i walked four guys and couldn't find the strike zone and when i did, one ball was hit out of the park and the other one was a double.\" minnesota got a little help from the red sox, who fell to 3-5 on an 11-game homestand. the twins scored three in the second after loading the bases with no outs. wakefield nearly got out of it by getting drew butera to fly out and striking out alexi casilla, but denard span got a grounder past first baseman gonzalez and two runs scored. ben revere, who reached on a single, then came in from third when wakefield was called for a balk while trying to pick off span. boston got span in a rundown and tagged him, but the out was waved off when <mark>hernandez</mark> made the balk call. francona was ejected moments after leaving the dugout. he continued to argue for several minutes after <mark>hernandez</mark> tossed him and his arms tangled a few times with <mark>west</mark>. gonzalez's long drive in the fourth struck one of the giant signs above the seats on the green monster and cut minnesota's lead to 4-2. but boston unraveled again defensively in the fifth. danny valencia doubled to left with the bases loaded, driving in two more runs for the twins. wakefield was replaced by alfredo aceves, who inherited runners on second and third. aceves struck out revere and got butera to hit a grounder to shortstop jed lowrie, who misplayed the ball. the error allowed two more runs and the twins led 8-2. the twins got another run in the sixth on two more mistakes by the red sox. plouffe, who reached on a fielder's choice, stole second and went to third when lowrie missed the throw from home. plouffe then scored when aceves was called for a balk before he could get off the next pitch. \"yeah, it was about as much of a balk as you're going to,\" francona said. \"i wanted to run back out and tell him he got it right.\" notes: <mark>baker</mark> struck out leadoff batter jacoby ellsbury on his first three pitches ....twins manager ron gardenhire said lhp francisco liriano's scheduled start monday will depend on how he feels saturday. liriano was sick friday and stayed at the team's hotel ....francona said before the game he might go to the heat-celtics playoff game after the twins and red sox play saturday afternoon - but don't look for him courtside. \"my seats are in hiding position,\" he said. \"they're up where you can get in and out and you're not bringing notice to yourself.\" texas vs. texas-pan american, 04.19.11 mcneil vs. brownsville porter, 04.15.11 frisco wakeland 2, vista ridge 1, 04.16.11 vista ridge vs. denton ryan, 04.14.11 dripping springs 1, lake travis 0, 04.05.11 the other side of the conference fence won't be so green for nebraska"}, {"articleID": "2011110821_00082490_W", "names": {"John Caine": ["Q27648985", "Q6224760"]}, "date": "2011-11-08", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://biz.yahoo.com/prnews/111108/ny02802.html?.v=1", "content": "finance search tue, nov 8, 2011, 4:46 pm est - u.s. markets closed {\"s\" : \"pcln\" , \"k\" : \"a00, a50, b00, b60, c10, g00, h00, l10, p20, t10, v00\" , \"o\" : \"\",\" j \":\" \"} press release source: priceline.com / prnewswire /--after a freak october nor'easter left them without heat, light or power for desktop computers, many residents of new york and connecticut fired up their mobile devices to book last-minute hotel rooms through priceline.com's (nasdaq: pcln - news) hotel negotiator app for the iphone, ipad, android and ipod touch. beginning saturday, when heavy snows began to take down power lines, priceline.com saw a 270% surge in hotel bookings in those states through its various mobile apps. by comparison, desktop-generated bookings in those three states increased 38%. priceline.com also noticed some interesting hotel booking trends associated with the power outage. immediately following the outage (presumably when residents thought it would be short-lived), priceline.com mobile customers in those states booked 3 - and 4-star hotels for one-night stays. over 99% booked same-day check-ins. beginning sunday, when reports started surfacing that the outage could be up to a week or more in some places, there was an immediate booking shift to lower-priced hotels of 2.5 stars and below for multiple-day stays. on saturday, when the snow began falling, priceline.com mobile customers were a median distance of 5 miles away from the hotels that they booked. by monday, after nearby hotels rapidly filled up, mobile customers were booking hotels at a median distance of 69 miles away to get out of the cold and dark. that 60 + mile median distance remained in effect for several days until sections of the three states regained power and hotel rooms freed up.\" incidents like the october nor'easter demonstrate the value that mobile devices and apps can bring to the travel industry and to travel consumers, \"said <mark>john caine</mark>, priceline.com's senior vice president, marketing.\" without apps like hotel negotiator, many consumers would have been forced to go the \"old school' route of finding a hotel via the phone book (and a flashlight). such a time-consuming alternative may well have left them out in the cold as area hotels filled up quickly.\" priceline's hotel negotiator app for the iphone, ipad and ipodtouch can be downloaded for free at. the android version of the app can be downloaded for free from the android market https: //market.android.com/details? id=com.priceline.android.negotiator. hotel negotiator includes the following features: winning bids recommendations. choose a city and hotel negotiator displays multiple recent winning bids made by other priceline.com customers for hotels in different parts of the city at different star levels. shake-down geo-locator-triggered hotel search. shaking the device establishes your location using location-based features and then performs a winning bids search for hotels in the surrounding areas. instant bid results. you'll know instantly whether your bid is accepted. if it is, you'll immediately receive all the details on your hotel and its location. two booking options. if you're using priceline.com's name your own price? hotel service, you can enter your bid using your smartphone. for published-price hotel rooms, you can book the room with your device. hotel negotiator hotel listings can be sorted by star level, price, proximity and popularity. hotel listings include address, star level, customer reviews and satisfaction scores, zoomable maps, pictures and descriptions. about the priceline group the priceline group (nasdaq: pcln - news) is a leader in global online hotel reservations, with over 200,000 participating hotels worldwide. the group is composed of four primary brands - booking.com, priceline.com, agoda.com and traveljigsaw - and several ancillary brands. the priceline group provides online travel services in over 150 countries in, the asia-pacific region, the africa. booking.com is the number one online hotel reservation service in the world, offering over 170,000 hotels (as of november 7, 2011), and is available in 41 languages. more recent hotel counts are available on the booking.com website. priceline.com gives leisure travelers multiple ways to save on their airline tickets, hotel rooms, rental cars, vacation packages and cruises. in addition to getting compelling published prices, travelers can take advantage of priceline.com's famous name your own price? service, which can deliver the lowest prices available. agoda.com is an priceline com inc files sec form 8-k, results of operations and financial condition, regulation fd disclosure, financ fannie and freddie got us into this mess, but fhfa won't let them help get us out quotes delayed, except where indicated otherwise. delay times are 15 mins for nasdaq, nyse and amex. see also delay times for other exchanges. quotes and other information supplied by independent providers identified on the yahoo! finance partner page. quotes are updated automatically, but will be turned off after 25 minutes of inactivity. quotes are delayed at least 15 minutes. all information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. neither yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. by accessing the yahoo! site, you agree not to redistribute the information found therein. capital iq. historical chart data and daily updates provided by commodity systems, inc. (csi). international historical chart data, daily updates, fundanalyst estimates data provided by"}]