[{"articleID": "2011032401_00009152_W", "names": {"Brad Wall": ["Q2923492", "Q437816"]}, "date": "2011-03-23", "url": "http://theglobeandmail.com/news/politics/saskatchewan-tables-surplus-budget/article1953891/?utm_medium=Feeds%3A%20RSS%2FAtom&utm_source=Prairies&utm_content=1953891", "content": "saskatchewan is using soaring oil revenue to pump out a pre-election budget aimed at wooing voters with tax cuts. the budget increases how much people can earn before having to fork over cash to the government. the basic personal and spousal exemptions increase by $1,000 each and the exemption for dependant children increases by $500 per child. h4 class = \"regseriflbl large\" > more related to this story finance minister ken krawetz said wednesday that the changes combined with a low-income tax credit introduced in 2008 mean a family of four will pay no tax on the first $45,550 of combined income. \"that's the highest income threshold in canada,\" said mr. krawetz. \"in other words, that family and most saskatchewan families with dependant children can now earn more tax-free income in saskatchewan than any place else in canada .\" a family of four with an income of $50,000 will save $2,447 a year. the budget also brings long-awaited cuts to the education portion of property taxes and slices the small business tax rate to two per cent from 4.5 per cent beginning july 1. it's the last budget before the provincial election in november. however, premier <mark>brad wall</mark> said the government is not priming people for the vote. \"this is not constructed to be an election budget. it's constructed to be a budget that keeps our promises and builds on the saskatchewan advantage,\" said mr. <mark>wall</mark>. \"however, i would be happy to campaign on it .\" other goodies include $216.8-million for municipalities, which finally get their promised one-point share of the provincial sales tax, and $285-million for highway repaving and infrastructure projects. there's $12.6-million for the saskatchewan cancer agency to allow for a doubling of bone marrow transplants, additional colorectal screenings and more cancer treatments. another $15.3-million will be spent to address recommendations made in last year's child welfare review, including $750,000 to add 30 new child protection workers. the budget projects revenue of $10.79-billion - up 8.5 per cent from 2010-2011 - and total spending of $10.67-billion, which is up 5.5 per cent. that leaves a surplus of $115-million in the general revenue fund. on a summary basis, which takes into account all areas of government including crown corporations, the surplus is expected to be $54.3-million. the government plans to take $325-million from its rainy-day savings account to pay down general revenue fund debt. the payment brings the debt to $3.81-billion - the lowest level since 1987-88. it's different than last year when the government tabled a budget where spending outpaced revenue and the province relied on savings to keep the books in the black. but the opposition new democrats argued the budget doesn't go far enough to help low-income people, seniors on fixed incomes or students. \"for all the money that's being announced, it lacks vision and i don't find it very inspiring,\" said ndp leader dwain lingenfelter. \"it will impact some, but my sense is that the families, many of them who we've been talking to up in the flooded area, won't be paying any income tax this year because they have no income. or many people who are on low or minimum income, who aren't paying any income tax, aren't going to feel the benefit of this budget at all .\" the ndp also raised concerns about growing crown debt, which budget documents suggest will increase by $810 million. other reaction to the budget was mixed. the saskatchewan urban municipalities association said getting one point of the pst gives communities revenue predictability, which allows for better future planning. the saskatchewan chamber of commerce said \"it's a pretty good budget,\" but the government could have gone further on property tax breaks. \"it's clearly an election budget. there's little bits and pieces for everybody. everybody should at least have an appetizer-size feeling that they've achieved something here,\" said chamber ceo steve mclellan. \"they're moving in the right direction and the minister said,\" we've taken some steps forward. we're sending the message that property tax is important .' but at the end of the day, i would like to have seen this to be a very significant step forward. it's an election year - we didn't see that. \"but it was anti-poverty advocates who were most upset. they noted there's just $1.7-million for two new initiatives to create affordable housing in saskatchewan .\" i really think it's quite unbelievable that at a time of an economic boom and massive resource wealth that there's really so little in this budget for low-income people, to improve the pocketbook of low-income people, \"said peter gilmer with the regina anti-poverty ministry .\" this is really a very limited response to the housing crisis in the province right now. \"mr. gilmer said the income tax break won't help either .\" you have to have a significant income to make ends meet. a tax cut on nothing is nothing, \"said mr. gilmer .\" we need to improve people's incomes. we also have to make sure that their cost for basic needs like housing are affordable and this budget, quite frankly, doesn't do that. \"there are also some concerns about unbudgeted expenses down the road, including contracts with labour groups or potential disasters. the watershed authority has already warned there's a high likelihood of flooding again this year, especially in southern saskatchewan. disclaimer? copyright 2011 the globe and mail inc. all rights reserved. m5v 2s9 phillip crawley, publisher"}, {"articleID": "2015080918_00066017_W", "names": {"Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"], "Darren Wilson": ["Q17543917", "Q5225246", "Q5225247"], "Christian Taylor": ["Q1751", "Q5110185", "Q5110187"]}, "date": "2015-08-09", "url": "http://news.sky.com/story/1532938", "content": "Play video \"Ferguson's Tribute To <mark>Michael Brown</mark>\" Video: Ferguson's Tribute To <mark>Michael Brown</mark> Share on Twitter Share on Facebook Share on Google + Share on Whatsapp Share by email By Sky News US Team Several hundred people have gathered in Ferguson, Missouri, to mark one year since the death of <mark>Michael Brown</mark>. Crowds of white and black people marched to remember the black teenager whose shooting by a police officer sparked a national debate on race and justice. They observed four-and-a-half minutes of silence at midday to represent the roughly four-and-a-half hours the 18-year-old's body lay in the middle of the street after he was shot. Two doves were released at the end. <mark>Michael Brown</mark>'s death spawned the Black Lives Matter movement The crowd then began a silent march from the spot where the unarmed <mark>Brown</mark> was fatally shot by Ferguson officer <mark>Darren Wilson</mark> on 9 August last year. A service commemorating the anniversary was held at a church in the St Louis suburb. Play video \"Activists Shove White House Hopeful\" Video: Activists Shove White House Hopeful Rallies were planned in other cities, including New York. Mr <mark>Brown</mark> Snr said his family is still grieving, but he believes his son's legacy can be seen in the increased awareness of police shootings. \"Everybody grieves differently,\" he told Sky News. \"I hurt every day .\" People know what happened was just wrong and all they are doing is just showing their respect and their love as for what has happened right here in this community. \"Mr <mark>Brown</mark> Sr also led a parade of several hundred people on Saturday. Some people in the parade wore T-shirts with likenesses of <mark>Brown</mark> or messages such as\" Hands up! Don't shoot! \"Play video\" Ferguson: How The Protests Grew \"Video: Ferguson: How The Protests Grew The slogan became a rallying cry after the shooting, even though witness claims that <mark>Brown</mark> had his hands up when he was shot were discredited by federal investigators. A grand jury and the US Department of Justice declined to prosecute <mark>Wilson</mark>, who resigned last November. But the shooting spawned the Black Lives Matter movement, which focuses on cases of unarmed young black men shot by police. Another name was added to that list on Friday when 19-year-old <mark>Christian Taylor</mark>, a black Texas college student, was shot dead by a white police officer responding to a burglary report. <mark>Brown</mark> had graduated from high school weeks before the shooting and planned to go to trade school to study to become an air conditioning technician. Relatives and friends described the 6ft 3in teenager as a gentle giant. Play video\" What Happened In Ferguson? \"Video: What Happened In Ferguson? But police said on the morning of his death <mark>Brown</mark> stole items from a store and shoved the owner who tried to stop him. Moments later, he and a friend were walking down the road when <mark>Wilson</mark> told them to move on to the pavement and the fatal confrontation ensued. Though the Justice Department cleared <mark>Wilson</mark>, it also cited racial bias and profiling in Ferguson's police and court system. Ferguson's city manager, police chief and municipal judge resigned within days. The new judge, interim city manager and interim police chief are all African American. By posting a comment you are agreeing to abide by our Terms & Conditions. See our House Rules and FAQs."}, {"articleID": "2019122116_00100054_W", "names": {"Andrew Bailey": ["Q1059981", "Q21592083", "Q4756258", "Q51561618"], "Sam Kelly": ["Q20877870", "Q2419414"], "John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "Mervyn King": ["Q1375680", "Q1922188", "Q6820917", "Q6820919"], "Philip Hammond": ["Q18388174", "Q332987"]}, "date": "2019-12-20", "url": "http://brazilbusiness.einnews.com/article/505450927/d26y4Hb7nIPvdzO-", "content": "News> Business Close <mark>Andrew Bailey</mark> named next Bank of England governor as Mark Carney steps down Head of City watchdog takes over on 16 March 2020 after nine-month long search to find Canadian's replacement Samuel Lovett @ samueljlovett Friday 20 December 2019 09:45 {{^ moreThanTen}} {{total}} comments {{/ moreThanTen}} <mark>Andrew Bailey</mark>, the current head of the Financial Conduct Authority, has been named as the next governor of the Bank of England. The 60-year-old replaces incumbent Mark Carney, who steps down from the position on 15 March after more than six years of service. Chancellor Sajid Javid announced the appointment on Friday morning, describing Mr <mark>Bailey</mark> as \"the stand-out candidate in a competitive field\". Download the new Indpendent Premium app Sharing the full story, not just the headlines Download now \"He is the right person to lead the Bank as we forge a new future outside the EU and level-up opportunity across the country,\" he said. Mr <mark>Bailey</mark> said it was a \"tremendous honour\" to be named the Bank's 121st governor and acknowledged that his appointment came at a \"critical time for the nation\". Shape Created with Sketch. UK news in pictures Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. UK news in pictures 1/50 19 December 2019 Queen Elizabeth II and her son Prince Charles walk behind the Imperial State Crown as they proccess through the Royal Gallery, before the Queen's Speech, during the State Opening of Parliament AFP via Getty 2/50 18 December 2019 Luke Jerram's art installation \"Gaia', a replica of planet earth created using detailed Nasa imagery of the Earth's surface, hangs on display at the Eden Project in St Austell, Cornwall PA 3/50 17 December 2019 A surfer gets into the festive spirit at the inland surfing lagoon at The Wave, near Bristol PA 4/50 16 December 2019 Snowy conditions near Deepdale in the Yorkshire Dales National Park as snow hits parts of the UK PA 5/50 15 December 2019 Oisin Carson, 5, picks a Christmas tree at Wicklow Way Christmas tree farm in Roundwood PA 6/50 14 December 2019 First Minister, Nicola Sturgeon, takes a selfie as she joins the SNPs newly elected MPs for a group photo outside the V & A Museum in Dundee, Scotland Getty Images 7/50 13 December 2019 Prime Minister Boris Johnson and Carrie Symonds arrive back at Downing Street after the results for the general election were announced. The Conservative Party won with an overall majority EPA 8/50 12 December 2019 A dog outside a polling station during the general election in Northumberland Reuters 9/50 11 December 2019 Liberal Democrat leader Jo Swinson stands between a Stop Brexit sign as she attends a general election campaign event at Esher Rugby Club, south west London. Britain will go to the polls tomorrow to vote AFP via Getty 10/50 10 December 2019 A surfer off the North East coast at Tynemouth PA 11/50 9 December 2019 Leah Rossiter (left) and Ceara Carney, dressed as mermaids, join members of the Irish Wildlife Trust and Extinction Rebellion Ireland protesting outside Leinster House in Dublin, against overfishing in Irish Waters PA 12/50 8 December 2019 Labour party leader Jeremy Corbyn poses for selfies with supporters at a general election rally in Colwyn Bay, north Wales AFP via Getty 13/50 7 December 2019 Speedo Mick outside the stadium before the Premier League match between Everton and Chelsea at Goodison Park Action Images via Reuters 14/50 6 December 2019 A climate activist wearing a mask and holding a placard reading\" Fossil fuel era is over' outside Millbank Studios in London AP 15/50 5 December 2019 SNP leader Nicola Sturgeon with the SNP campaign bus in front of the Queensferry Crossing, while on the General Election campaign trail in Scotland PA 16/50 4 December 2019 The Christmas tree in Trafalgar Square, which is given every year by the city of Oslo as a token of Norwegian gratitude to the people of London for their assistance during the Second World War PA 17/50 3 December 2019 Protesters against the visit of US President Trump during a demonstration near Buckingham Palace on the first day of the Nato Summit in London EPA 18/50 2 December 2019 England captain Joe Root celebrates reaching his double century during day 4 of the second Test match against New Zealand at Seddon Park in Hamilton, New Zealand Getty 19/50 1 December 2019 A hard frost is seen on the first day of the meteorological winter in Pitlochry, Scotland Reuters 20/50 30 November 2019 A police officer looks at flowers left at London Bridge in central London, after a terrorist wearing a fake suicide vest who went on a knife rampage killing two people, and was shot dead by police PA 21/50 29 November 2019 School children and students take part in the Youth Strike for Climate in London as part of the Fridays for Future Global Climate Strike Angela Christofilou/The Independent 22/50 28 November 2019 Cyclists make their way up a tree lined hill near to Moor Crichel in Dorset. November's dismal weather will finally change, with drier and colder conditions coming for the start of December, forecasters have said PA 23/50 27 November 2019 The moment a swan flew over a flock of 60,000 starlings as dusk fell on Whixall Moss Nature Reserve in Shropshire <mark>Andrew</mark> Fusek Peters / SWNS 24/50 26 November 2019 SNP leader Nicola Sturgeon plays with local children during a visit to the Jelly Tots & Cookies Play Cafe in Uddingston, South Lanarkshire PA 25/50 25 November 2019 Prime Minister Boris Johnson poses with sheep as he visits the Royal Welsh Showground, in Llanelwedd, Builth Wells, whilst on the General Election campaign trail PA 26/50 24 November 2019 Cush Jumbo attends the 65th Evening Standard Theatre Awards at London Coliseum Getty Images 27/50 23 November 2019 Labour Party leader Jeremy Corbyn meets a supporter on a train on his return from a visit to Sheffield PA 28/50 22 November 2019 Gallery assistants adjust \"The Ancient Town of Uglich' by Konstantin Yuon, 1913, estimated at £ 600,000 to £ 800,000, during a press preview of the sale of works by some of the most pre-eminent creators of Russian art at Sotheby's in London PA 29/50 21 November 2019 A mother seal appears to hug her pup as grey seals return to Donna Nook National Nature Reserve in Lincolnshire, where they come every year in late autumn and winter to give birth PA 30/50 20 November 2019 After Mauricio Pochettino's sacking the eveninfg before newly appointed Tottenham head coach, Jose Mourinho, takes his first training session in charge Tottenham Hotspur FC via Getty 31/50 19 November 2019 Prime Minister Boris Johnson during a visit to Jimmy Egan's Boxing Academy at Wythenshawe, while on the campaign trail ahead of the General Election PA 32/50 18 November 2019 Mist over Buttermere lake in the Lake District PA 33/50 17 November 2019 Stefanos Tsitsipas lifts the winners trophy after beating Dominic Thiem at the ATP World Tour Finals tennis tournament in London EPA 34/50 16 November 2019 Duke of York, speaking for the first time about his links to Jeffrey Epstein in an interview with BBC Newsnight's Emily Maitlis BBC/PA 35/50 15 November 2019 Brazilian indigenous leader, Kreta Kaingang from the Kaingang People, holds a petition letter with over 200,000 signatures asking the UK government to suspend trade talks with Brazil until the Amazon and its people are protected, as he poses outside 10 Downing Street AFP via Getty 36/50 14 November 2019 Spanning all four spaces and the corridor of the White Cube Bermondsey gallery Anselm Kiefer's new exhibition encompasses large-scale painting and installation Rex Features 37/50 13 November 2019 Labour leader Jeremy Corbyn wears a pair of mittens that say\" Pick Pam', referring to Labour MP Pam Duncan-Glancy (not pictured) as he visits the Heart of Scotstoun Community Centre in Glasgow Getty 38/50 12 November 2019 Head glass conservator <mark>Sam Kelly</mark> inspects the Angeli Laudantes and Angeli Ministrantes stained glass windows at Salisbury Cathedral as restoration work to clean, conserve and restore the windows, installed in 1879, gets underway PA 39/50 11 November 2019 Flooding in the village of Fishlake near Doncaster after a month's worth of rain fell in 24 hours PA 40/50 10 November 2019 World War II Supermarine Spitfire fighter performs a flyover over White Cliffs of Dover during Remembrance Sunday celebrations Reuters 41/50 9 November 2019 Snow falling in Glyn Ceiriog near Llangollen in Denbighshire Steffan Williams/PA 42/50 8 November 2019 Scottish National Party candidates, including SNP Westminster leader Ian Blackford (centre left) and Nicola Sturgeon (centre), with a Brexit message at the party's General Election campaign launch in Edinburgh PA 43/50 7 November 2019 Delivery lorry stuck in flood water at Coston Ford, Leicestershire after heavy rainfall in the area PA 44/50 6 November 2019 British Prime Minister Boris Johnson makes a statement to announce the general election at Downing Street in London, Britain Reuters 45/50 5 November 2019 Liberal Democrat leader Jo Swinson speaking at the launch of their general election campaign at the Institute of Civil Engineers in London PA 46/50 4 November 2019 Pelicans in St James's Park in central London AFP/Getty 47/50 3 November 2019 Dancers perform a mass Ghoomar dance during Diwali celebrations in Trafalgar Square, London Reuters 48/50 2 November 2019 Campaigners listen as SNP leader Nicola Sturgeon addresses a rally calling for Scottish independence in Glasgow AFP via Getty 49/50 1 November 2019 Police and recovery workers remove a damaged bus from the scene of a crash in Sevenoaks Road, south-east London. A man has been arrested on suspicion of causing death by dangerous driving after a person died and 15 others were injured PA 50/50 31 October 2019 Labour Party leader Jeremy Corbyn gestures as launches the party's election campaign in south London. Britain will go to the polls on December 12 AFP via Getty 1/50 19 December 2019 Queen Elizabeth II and her son Prince Charles walk behind the Imperial State Crown as they proccess through the Royal Gallery, before the Queen's Speech, during the State Opening of Parliament AFP via Getty 2/50 18 December 2019 Luke Jerram's art installation \"Gaia', a replica of planet earth created using detailed Nasa imagery of the Earth's surface, hangs on display at the Eden Project in St Austell, Cornwall PA 3/50 17 December 2019 A surfer gets into the festive spirit at the inland surfing lagoon at The Wave, near Bristol PA 4/50 16 December 2019 Snowy conditions near Deepdale in the Yorkshire Dales National Park as snow hits parts of the UK PA 5/50 15 December 2019 Oisin Carson, 5, picks a Christmas tree at Wicklow Way Christmas tree farm in Roundwood PA 6/50 14 December 2019 First Minister, Nicola Sturgeon, takes a selfie as she joins the SNPs newly elected MPs for a group photo outside the V & A Museum in Dundee, Scotland Getty Images 7/50 13 December 2019 Prime Minister Boris Johnson and Carrie Symonds arrive back at Downing Street after the results for the general election were announced. The Conservative Party won with an overall majority EPA 8/50 12 December 2019 A dog outside a polling station during the general election in Northumberland Reuters 9/50 11 December 2019 Liberal Democrat leader Jo Swinson stands between a Stop Brexit sign as she attends a general election campaign event at Esher Rugby Club, south west London. Britain will go to the polls tomorrow to vote AFP via Getty 10/50 10 December 2019 A surfer off the North East coast at Tynemouth PA 11/50 9 December 2019 Leah Rossiter (left) and Ceara Carney, dressed as mermaids, join members of the Irish Wildlife Trust and Extinction Rebellion Ireland protesting outside Leinster House in Dublin, against overfishing in Irish Waters PA 12/50 8 December 2019 Labour party leader Jeremy Corbyn poses for selfies with supporters at a general election rally in Colwyn Bay, north Wales AFP via Getty 13/50 7 December 2019 Speedo Mick outside the stadium before the Premier League match between Everton and Chelsea at Goodison Park Action Images via Reuters 14/50 6 December 2019 A climate activist wearing a mask and holding a placard reading\" Fossil fuel era is over' outside Millbank Studios in London AP 15/50 5 December 2019 SNP leader Nicola Sturgeon with the SNP campaign bus in front of the Queensferry Crossing, while on the General Election campaign trail in Scotland PA 16/50 4 December 2019 The Christmas tree in Trafalgar Square, which is given every year by the city of Oslo as a token of Norwegian gratitude to the people of London for their assistance during the Second World War PA 17/50 3 December 2019 Protesters against the visit of US President Trump during a demonstration near Buckingham Palace on the first day of the Nato Summit in London EPA 18/50 2 December 2019 England captain Joe Root celebrates reaching his double century during day 4 of the second Test match against New Zealand at Seddon Park in Hamilton, New Zealand Getty 19/50 1 December 2019 A hard frost is seen on the first day of the meteorological winter in Pitlochry, Scotland Reuters 20/50 30 November 2019 A police officer looks at flowers left at London Bridge in central London, after a terrorist wearing a fake suicide vest who went on a knife rampage killing two people, and was shot dead by police PA 21/50 29 November 2019 School children and students take part in the Youth Strike for Climate in London as part of the Fridays for Future Global Climate Strike Angela Christofilou/The Independent 22/50 28 November 2019 Cyclists make their way up a tree lined hill near to Moor Crichel in Dorset. November's dismal weather will finally change, with drier and colder conditions coming for the start of December, forecasters have said PA 23/50 27 November 2019 The moment a swan flew over a flock of 60,000 starlings as dusk fell on Whixall Moss Nature Reserve in Shropshire <mark>Andrew</mark> Fusek Peters / SWNS 24/50 26 November 2019 SNP leader Nicola Sturgeon plays with local children during a visit to the Jelly Tots & Cookies Play Cafe in Uddingston, South Lanarkshire PA 25/50 25 November 2019 Prime Minister Boris Johnson poses with sheep as he visits the Royal Welsh Showground, in Llanelwedd, Builth Wells, whilst on the General Election campaign trail PA 26/50 24 November 2019 Cush Jumbo attends the 65th Evening Standard Theatre Awards at London Coliseum Getty Images 27/50 23 November 2019 Labour Party leader Jeremy Corbyn meets a supporter on a train on his return from a visit to Sheffield PA 28/50 22 November 2019 Gallery assistants adjust \"The Ancient Town of Uglich' by Konstantin Yuon, 1913, estimated at £ 600,000 to £ 800,000, during a press preview of the sale of works by some of the most pre-eminent creators of Russian art at Sotheby's in London PA 29/50 21 November 2019 A mother seal appears to hug her pup as grey seals return to Donna Nook National Nature Reserve in Lincolnshire, where they come every year in late autumn and winter to give birth PA 30/50 20 November 2019 After Mauricio Pochettino's sacking the eveninfg before newly appointed Tottenham head coach, Jose Mourinho, takes his first training session in charge Tottenham Hotspur FC via Getty 31/50 19 November 2019 Prime Minister Boris Johnson during a visit to Jimmy Egan's Boxing Academy at Wythenshawe, while on the campaign trail ahead of the General Election PA 32/50 18 November 2019 Mist over Buttermere lake in the Lake District PA 33/50 17 November 2019 Stefanos Tsitsipas lifts the winners trophy after beating Dominic Thiem at the ATP World Tour Finals tennis tournament in London EPA 34/50 16 November 2019 Duke of York, speaking for the first time about his links to Jeffrey Epstein in an interview with BBC Newsnight's Emily Maitlis BBC/PA 35/50 15 November 2019 Brazilian indigenous leader, Kreta Kaingang from the Kaingang People, holds a petition letter with over 200,000 signatures asking the UK government to suspend trade talks with Brazil until the Amazon and its people are protected, as he poses outside 10 Downing Street AFP via Getty 36/50 14 November 2019 Spanning all four spaces and the corridor of the White Cube Bermondsey gallery Anselm Kiefer's new exhibition encompasses large-scale painting and installation Rex Features 37/50 13 November 2019 Labour leader Jeremy Corbyn wears a pair of mittens that say\" Pick Pam', referring to Labour MP Pam Duncan-Glancy (not pictured) as he visits the Heart of Scotstoun Community Centre in Glasgow Getty 38/50 12 November 2019 Head glass conservator <mark>Sam Kelly</mark> inspects the Angeli Laudantes and Angeli Ministrantes stained glass windows at Salisbury Cathedral as restoration work to clean, conserve and restore the windows, installed in 1879, gets underway PA 39/50 11 November 2019 Flooding in the village of Fishlake near Doncaster after a month's worth of rain fell in 24 hours PA 40/50 10 November 2019 World War II Supermarine Spitfire fighter performs a flyover over White Cliffs of Dover during Remembrance Sunday celebrations Reuters 41/50 9 November 2019 Snow falling in Glyn Ceiriog near Llangollen in Denbighshire Steffan Williams/PA 42/50 8 November 2019 Scottish National Party candidates, including SNP Westminster leader Ian Blackford (centre left) and Nicola Sturgeon (centre), with a Brexit message at the party's General Election campaign launch in Edinburgh PA 43/50 7 November 2019 Delivery lorry stuck in flood water at Coston Ford, Leicestershire after heavy rainfall in the area PA 44/50 6 November 2019 British Prime Minister Boris Johnson makes a statement to announce the general election at Downing Street in London, Britain Reuters 45/50 5 November 2019 Liberal Democrat leader Jo Swinson speaking at the launch of their general election campaign at the Institute of Civil Engineers in London PA 46/50 4 November 2019 Pelicans in St James's Park in central London AFP/Getty 47/50 3 November 2019 Dancers perform a mass Ghoomar dance during Diwali celebrations in Trafalgar Square, London Reuters 48/50 2 November 2019 Campaigners listen as SNP leader Nicola Sturgeon addresses a rally calling for Scottish independence in Glasgow AFP via Getty 49/50 1 November 2019 Police and recovery workers remove a damaged bus from the scene of a crash in Sevenoaks Road, south-east London. A man has been arrested on suspicion of causing death by dangerous driving after a person died and 15 others were injured PA 50/50 31 October 2019 Labour Party leader Jeremy Corbyn gestures as launches the party's election campaign in south London. Britain will go to the polls on December 12 AFP via Getty \"The Bank has a very important job and, as Governor, I will continue the work that Mark Carney has done to ensure that it has the public interest at the heart of everything it does,\" he added. The Treasury revealed that, in order to \"provide for a smooth transition\" , Mr Carney would extend his term until mid-March, at which point his successor will officially take charge. Mr <mark>Bailey</mark> has been appointed on an eight-year contract and will receive a salary of £ 495,000. The search for the 121st governor began in April, with London School of Economics director Minouche Shafik, Santander UK chairwoman Shriti Vadera and a former member of the US Federal Reserve's board of governors, Kevin Warsh, also in contention to replace Mr Carney. Although Mr <mark>Bailey</mark> is viewed as a safe pair of hands on account of his experience as head of the City watchdog, The Independent understands that there is concern within the Bank that \"nothing will change\" under the 60-year-old. Ms Shafik, who served as the deputy governor between August 2014 and February 2017, was among the favourites to succeed Mr Carney. The decision to overlook the 57-year-old has been met with \"disappointment\" among some insiders at the Bank. Shadow chancellor <mark>John McDonnell</mark> expressed his concern over the appointment, tweeting: \"As an establishment figure with what some consider is a less than inspiring record at the FCA <mark>Andrew Bailey</mark> will need to demonstrate early that he appreciates the need to address the deep structural problems of our economy & like Mark Carney understands the climate change threat .\" Mr Carney, who twice extended his tenure, was the first non-Briton to be become governor of the Bank of England. The Canadian succeeded Sir <mark>Mervyn King</mark> in July 2013 and later said he would stay for an extra year after his tenure ended--until June 2018--but was then persuaded by then chancellor <mark>Philip Hammond</mark> to extend his term by another seven months to help ease disruption from Brexit. More about Bank Of England | <mark>Andrew Bailey</mark> | Mark Carney | Minouche Shafik | Show {{#moreThan 3_total}} {{value_total}} {{/ moreThan3_total}} comments Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences Comments Share your thoughts and debate the big issues Learn more {{#singleComment _ p}} {{value_p}} Independent Premium comment {{/ singleComment_p}} {{^ singleComment_p}} {{value_p}} Independent Premium comments {{/ singleComment_p}} {{#singleComment _ open}} {{value}} open comment {{/ singleComment_open}} {{^ singleComment_open}} {{value}} open comments {{/ singleComment_open}} Open Comments Join the discussion Create a commenting name to join the debate Submit Please try again, the name must be unique Only letters and numbers accepted Post Loading comments...{{^ comments}} There are no comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} Loading comments...{{^ comments}} There are no comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} {{#showMore}} Read more {{/ showMore}} Minds Comments Join the discussion {{^ nickname}} Create a commenting name to join the debate Submit Please try again, the name must be unique {{/ nickname}} Post Loading comments...{{^ comments}} There are no Independent Premium comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} Loading comments...{{^ comments}} There are no Independent Premium comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} {{#showMore _ p}} Read more {{/ showMore_p}} Follow comments Enter your email to follow new comments on this article. Subscribe Thanks for subscribing! {{errorMessage}} Vote Are you sure you want to submit this vote? Submit vote Cancel You must be logged in to vote. Report Comment Are you sure you want to mark this comment as inappropriate? Cancel Flag comment This comment has been flagged. Subscribe to Independent Premium to debate the big issues Want to discuss real-world problems, be involved in the most engaging discussions and hear from the journalists? Start your Independent Premium subscription today. Subscribe Already registered? Log in Report Comment Are you sure you want to mark this comment as inappropriate? Flag comment Cancel This comment has been flagged. Delete Comment Are you sure you want to delete this comment? Cancel Delete comment Deleting comment...This comment has been deleted. This comment has been deleted. About The Independent commenting Independent Premium Comments can be posted by members of our membership scheme, Independent Premium. It allows our most engaged readers to debate the big issues, share their own experiences, discuss real-world solutions, and more. Our journalists will try to respond by joining the threads when they can to create a true meeting of independent Premium. The most insightful comments on all subjects will be published daily in dedicated articles. You can also choose to be emailed when someone replies to your comment. The existing Open Comments threads will continue to exist for those who do not subscribe to Independent Premium. Due to the sheer scale of this comment community, we are not able to give each post the same level of attention, but we have preserved this area in the interests of open debate. Please continue to respect all commenters and create constructive debates. Subscribe Already registered? Log in {{shortHeadline}} Most popular {{title}} Sponsored features {{title}} Popular videos {{title}}"}, {"articleID": "2009091019_00083584_W", "names": {"Robert Singer": ["Q16187311", "Q30601636", "Q7349815"]}, "date": "2009-09-10", "url": "http://hollywoodchicago.com/news/8602/blu-ray-review-fourth-season-of-underrated-supernatural-rocks", "content": "chicago - with the fifth and reportedly final season of \"supernatural\" starting tonight, september 10th, 2009, on the cw, what better time to sing the praises of this often clever and always underrated show via a review of the recently released fourth season blu-ray and dvd editions? if you've never seen \"supernatural\" start at the beginning, but if you've seen the first three seasons, don't give up on number four. blu-ray rating: 4.0 / 5.0 by its fourth year, \"supernatural\" had settled into a confident, unpredictable groove, beautifully weaving individual urban legends in a mystery-of-the-week format while also telling an interesting overall story. of course, i don't expect to see \"supernatural\" on ten-best lists next to shows like \"lost\" or \"mad men,\" but there's something to be said for a show that's been consistently entertaining for four years and counting. \"supernatural\" has been incredibly entertaining. \"supernatural\" works for the same two reasons that most shows succeed - quality writing and an effective ensemble to deliver it. if the show has a weakness, it's that they've never quite developed the supporting ensemble effectively but the two leads - jared padalecki and, particularly, jensen ackles - have gotten better every year. supernatural: the complete fourth season was released on blu-ray and dvd on september 1st, 2009. photo credit: warner brothers home video padalecki and ackles play sam and dean winchester, respectively, a pair of supernatural investigators, men trying to come to terms with both the details of their own dark pasts and with the constant battle between heaven and hell. dean knows a thing or two about the latter as the third season ended with him literally being dragged to the fiery underneath. of course, there's no show without dean and the more rebellious of the winchester brothers finds himself back on solid ground at the beginning of the fourth season of \"supernatural,\" sometimes accompanied by an angel who reports that god himself needed dean back in the real world for an important battle to come. why? dean will play a role in the stopping of the ultimate villain in the history of the show, lucifer himself. so, sam and dean are back traveling the world and stopping the forces of the supernatural wherever they go with a group of writers who seem downright inspired by being able to weave issues of classical angels and demons into the overall fabric of the show. knowing that the overall arc of the season would be incredibly dark, the mysteries of the week in \"supernatural\" display a lighter tone in season four, including battles with a 7-foot teddy bear and an episode that opens with dean running in terrified fear from a tiny dog. what's great about \"supernatural\" is how quickly the show can turn on itself. take for example the great \"it's the great pumpkin, sam winchester,\" which opens by playing with the urban legend of razor blades in halloween candy, hinting at a lighter-toned episode, but becomes both honestly scary and one of the more important episodes in the character arcs of the entire season. watching the fourth season of \"supernatural,\" i was struck by two thoughts - one, that the show has arguably never been more consistently entertaining (in part due to the switch in focus from sam to dean and the developed acting ability of ackles), and, two, that i'll be disappointed if the fifth season is truly the last. if one of your favorite shows is coming to blu-ray and dvd, you should hope that warner brothers is the studio releasing it. they do tv on blu-ray right. \"supernatural\" looks amazing in hd and even the dvd version is better than average technically for the format. blu-ray 1080p is absolutely the way to go - the video and audio are flawless - but if you haven't jumped to the next-gen format yet, the standard dvd looks much better than average. the special features on \"supernatural\" are the same on blu-ray and dvd and are presented in high definition on the former. special features include the 3-section featurette \"the mythologies of supernatural from heaven to hell,\" extended/unaired scenes, gag reel, and the following commentary tracks: episode 4.3 \"in the beginning\" - executive producer eric kripke and writer jeremy carver episode 4.21 \"when the levee breaks\" - writer sera gamble and director <mark>robert singer</mark> episode 4.22 \"lucifer rising\" - writer/director eric kripke \"supernatural: the complete fourth season' is released by warner brothers home video and stars jared padalecki and jensen ackles. it was created by eric kripke. the fourth season was released on september 1st, 2009. it is not rated and runs 924 minutes. by brian tallerico content director hollywoodchicago.com brian @ hollywoodchicago.com chicago - with the fifth and reportedly final season of\" supernatural \"starting tonight, september 10th, 2009, on the cw, what better time to sing the praises of this often clever and always underrated show via a review of the recently released fourth season blu-ray and dvd editions? if you've never seen\" supernatural \"start at the beginning, but if you've seen the first three seasons, don't give up on number four. chicago - writing about disney's nature documentary\" earth, \"now available on blu-ray and dvd, is complicated because the movie itself contains undeniably beautiful imagery but, for a lot of people, it's footage that they've seen before and the film never really registers as a complete experience. it's a slice of nature mostly meant for children and, if you keep that in mind, it's sometimes effective."}, {"articleID": "2012072820_00062269_W", "names": {"James Holmes": ["Q55363276", "Q5925769", "Q6136182"]}, "date": "2012-07-28", "url": "http://wkrn.com/story/19137786/romney-closing-israeli-fundraiser-to-reporters", "content": "sandusky shower abuse victim to sue penn state key sandusky accuser, who says he was abused in shower, says he plans to sue penn state sherman hemsley of tv's \"the jeffersons\" dies <mark>holmes</mark> attorney: colo. shooting suspect's mother misquoted <mark>holmes</mark> attorney: colo. shooting suspect's mother misquoted penn state sanctions echo through community penn state sanctions echo through community penn state's hometown, a passenger in football team's success, may face its own tough time sally ride, first us woman in space, dies at 61 sally ride, first american woman to fly in space, dies of cancer at age 61 shooting suspect in court with orange-red hair colorado massacre suspect appears with orange-red hair in court for first time since shootings ncaa slams penn state, fines it $60 million ncaa slams penn state with $60 million fine, strips joe paterno of title as winningest coach gun range owner describes colo. massacre suspect glenn rotkovich, owner of lead valley range in byers, called <mark>james holmes</mark> to invite him to a mandatory orientation the following week glenn rotkovich, owner of lead valley range in byers, called <mark>james holmes</mark> to invite him to a mandatory orientation the following week, rotkovich said he heard a message on <mark>holmes</mark>' voicemail that was \"bizarre - guttural, freakish at best .\" associated press tel aviv, israel (ap) - u.s. presidential candidate mitt romney plans to raise campaign money in private while in israel, so what he tells wealthy american supporters abroad will be kept quiet from voters at home. romney's campaign is barring reporters from a fundraiser at jerusalem's king david hotel and not saying why. at u.s. events, romney's remarks to donors in communal spaces such as hotels are typically public. president barack obama allows reporters to hear his words at fundraisers, though he generally bars them from listening to question-and-answer sessions with those in attendance. the president sometimes allows coverage of his remarks at events in private homes. romney traveling press secretary rick gorka, asked to comment, simply said, \"closed press, closed press, closed press,\" as he walked down the aisle of the candidate's campaign plane during the flight from london to tel aviv. some of romney's wealthiest u.s. supporters plan to attend monday's fundraiser. they include casino mogul sheldon adelson, who's donated millions to a group backing romney and is a leading backer of republican jewish groups in the u.s. donors at the event were asked to contribute $50,000 or to raise $100,000. romney advisers say the event is expected to raise more than $1 million. the fundraiser will be relatively small, likely with about 50 attendees, giving romney the chance to interact more personally than he does in many of the larger events. romney sometimes has given donors more policy specifics than he includes in his standard campaign speeches. at a fundraiser this spring in florida, for example, he offered new details on how he might cut government and which deductions he might eliminate as part of his tax plan. the event was overheard by reporters standing on a public sidewalk. throughout his career and campaign, romney has released information that the law demands, including the list of donors that the federal election commission requires and financial disclosures that give a broad outline of up to $250 million in assets. but he repeatedly has broken with the practice of presidential candidates in both parties in disclosing more. he's refused to release the names of the fundraisers who tap friends and business networks to raise hundreds of thousands of dollars for his campaign, and has said he'll release only two years' worth of tax returns. searchers have found the bodies of two u.s. mountaineers who perished on their way down from a glacier-capped peruvian peak in mid-july. searchers on saturday found the bodies of two u.s. mountaineers who apparently plunged to their deaths off a ridge after ascending a glacier-capped 20,000-foot (6,100-meter) peruvian peak, the rescue coordinator said. meta itemprop = \"datepublished\" content = \"2012-07-28 19:34:36\" > romney closing israeli fundraiser to reporters romney closing israeli fundraiser to reporters u.s. presidential candidate mitt romney plans to raise campaign money in private while in israel, so what he tells wealthy supporters while abroad will be kept quiet. u.s. presidential candidate mitt romney plans to raise campaign money in private while in israel, so what he tells wealthy american supporters abroad will be kept quiet from voters at home. meta itemprop = \"datepublished\" content = \"2012-07-28 19:44:58\" > by the associated press ap's jenna fryer reports from the streets of london: by the associated press eric \"the eel\" moussambani made being bad at the olympics good. or cool, anyway. meta itemprop = \"datepublished\" content = \"2012-07-28 18:34:54\" > spain bringing aid workers home from algeria spain bringing aid workers home from algeria spain says it is repatriating all spanish aid workers who have been working in refugee camps in tindouf, western algeria spain says it is repatriating all of its aid workers and three other foreign nationals from refugee camps in tindouf in western algeria out of fears for their security. meta itemprop = \"datepublished\" content = \"2012-07-28 10:44:35\" > by the associated press and the first gold medal has gone to china. yi siling has just triumphed in the women's 10-meter air rifle shooting. by the associated press american 16-year-old ariel hsing was tickled about reaching the second round in table tennis on saturday. but meeting michelle obama on friday might have been even better. meta itemprop = \"datepublished\" content = \"2012-07-28 06:24:07\" > warm reception expected as romney lands in israel warm reception expected as romney lands in israel mitt romney's support for israel will likely earn the presumptive republican presidential nominee a warm welcome from israeli leaders when he visits on sunday - and a frosty reception from palestinians, who fear...mitt romney's support for israel will likely earn the presumptive republican presidential nominee a warm welcome from israeli leaders when he meets with them sunday - and a frosty reception from palestinians, who fear he...meta itemprop = \"datepublished\" content = \"2012-07-28 09:14:29\" > syrian rebels survive regime onslaught in aleppo syrian rebels survive regime onslaught in aleppo syrian activists say the government is pounding the country's second city, aleppo, with military helicopters. beirut (ap) - the syrian government launched an offensive saturday to retake rebel-held neighborhoods in the nation's commercial hub of aleppo, unleashing artillery, tanks and helicopter gunships against poorly armed...meta itemprop = \"datepublished\" content = \"2012-07-28 02:04:54\" > queen tours olympic park after debut as bond girl queen tours olympic park after debut as bond girl queen elizabeth ii has made her acting debut as a bond girl - and it was done in one take. meta itemprop = \"datepublished\" content = \"2012-07-28 19:04:57\" > lochte wins 400 im in blowout; phelps finishes 4th lochte wins 400 im in blowout; phelps finishes 4th ryan lochte turned his much-anticipated duel with michael phelps into a blowout, pulling away to win the olympic 400-meter individual medley by more than 3 seconds saturday night. even more stunning: phelps...ryan lochte turned his much-anticipated duel with michael phelps into a blowout, pulling away to win the olympic 400-meter individual medley by more than 3 seconds saturday night. even more stunning: phelps didn't win...meta itemprop = \"datepublished\" content = \"2012-07-28 17:44:23\" > ark. man sentenced to death for killing officer ark. man sentenced to death for killing officer a judge has sentenced an arkansas man to death for killing a police officer who was pleading for his life. an arkansas man who shot a police officer during a traffic stop last year, then coldly shot him again in the face while he was pleading for his life, was sentenced to death on saturday. meta itemprop = \"datepublished\" content = \"2012-07-28 20:24:25\" > hundreds gather in conn. to name rare white bison hundreds gather in conn. to name rare white bison lakota tribe members from south dakota were among hundreds of people who gathered at a connecticut farm to celebrate the birth of one of the rarest animals in the world - a white bison. lakota tribe members from south dakota were among hundreds of people who gathered at a connecticut farm to celebrate the birth of one of the rarest animals in the world - a white bison. meta itemprop = \"datepublished\" content = \"2012-07-28 14:04:17\" > 3 shot dead in pa.; girl taken, found safe in ohio 3 shot dead in pa.; girl taken, found safe in ohio police say a man in south-central pennsylvania shot three people to death, then fled with his 4-year-old daughter before the pair was found about 250 miles away across the state line in ohio. authorities in south-central pennsylvania say a man confronting his estranged wife about custody arrangements for their daughter shot her to death and also killed her boyfriend and his mother, then fled with the 4-year-old...meta itemprop = \"datepublished\" content = \"2012-07-28 19:54:25\" > navy christens last of 3 ships honoring 9/11 sites navy christens last of 3 ships honoring 9/11 sites the uss somerset - the last of three navy ships named for 9/11 attack sites - was christened saturday in honor of the passengers and crew of the plane that crashed short of terrorists' intended target after...the uss somerset - the last of three navy ships named for 9/11 attack sites - was christened saturday in honor of the passengers and crew of the plane that crashed short of terrorists' intended target after passengers...meta itemprop = \"datepublished\" content = \"2012-07-28 13:34:16\" > us sees israel, tight mideast ally, as spy threat us sees israel, tight mideast ally, as spy threat the cia station chief opened the locked box containing the sensitive equipment he used from his home in tel aviv, israel, to communicate with cia headquarters in virginia, only to find that someone had tampered with...the cia station chief opened the locked box containing the sensitive equipment he used from his home in tel aviv, israel, to communicate with cia headquarters in virginia, only to find that someone had tampered with it. he...meta itemprop = \"datepublished\" content = \"2012-07-28 06:24:07\" > warm reception expected as romney lands in israel warm reception expected as romney lands in israel mitt romney's support for israel will likely earn the presumptive republican presidential nominee a warm welcome from israeli leaders when he visits on sunday - and a frosty reception from palestinians, who fear...mitt romney's support for israel will likely earn the presumptive republican presidential nominee a warm welcome from israeli leaders when he meets with them sunday - and a frosty reception from palestinians, who fear he...meta itemprop = \"datepublished\" content = \"2012-07-28 09:14:29\" > syrian rebels survive regime onslaught in aleppo syrian rebels survive regime onslaught in aleppo syrian activists say the government is pounding the country's second city, aleppo, with military helicopters."}, {"articleID": "2017041108_00007050_W", "names": {"Alok Kumar": ["Q22006072", "Q50133870", "Q59543464"]}, "date": "2017-04-11", "url": "https://www.northeasttoday.in/assam-cm-launches-mygov-website-for-participatory-governance/", "content": "0  Share 0  Tweet 0  +1 0  Share Assam CM Launches MyGov Website for Participatory Governance Home \"\"Assam CM Launches MyGov Website for Participatory Governance Assam April 11?? by Northeast Today  0 Comments NET Bureau Assam on Monday became the third state after Maharashtra and Haryana to launch the MyGov website, an online platform for people to interact with the government including feedback on its activities, policy decisions and projects. Chief minister Sarbananda Sonowal launched the website at the Janata Bhawan in Dispur. Terming the moment as memorable, Sonowal said,\" The launch is a democratic step to bridge the gap between the people and the government. \"The Chief Minister highlighted aspects of the platform said that not only can people provide feedback and ideas about different projects, they can also keep watch on all government activities and can directly inform any instances of corruption or misutilisation of government funds. Sonowal also called out to the people of Assam and outside to realize the full potential of the website .\" The duty of the people does not end with voting, all should come together to bring in good governance, \"he added. Prime Minister Narendra Modi had launched the pan national MyGov. in website in July 2014. All states were asked to create their own subsequently. Assam incidentally has more than 1.2 lakh registered user on the national platform. To be available in both Assamese and English, the Assam MyGov website will also feature surveys, blogs and quizzes as interactive means for the people to take part in governance. Speaking at the launch, Gaurav Dwivedi, CEO, MyGov India said that the website aimed to bring a larger group of people into the ambit of governance following PM Modi's\" Do, Discuss & Disseminate \"strategy. Chief secretary V.K. Pipersenia, <mark>Alok Kumar</mark>, additional chief secretary, IT, Assam, DGP Mukesh Sahay, MLA Prashanta Phukan and others were also present in the function. Tags"}, {"articleID": "2015022022_00024058_W", "names": {"Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"], "Eric Simonson": ["Q1351634", "Q5387515"], "David Bell": ["Q1173497", "Q1173700", "Q15111593", "Q20810479", "Q21505911", "Q3017488", "Q421455", "Q5231276", "Q5231278", "Q5231280", "Q5231281", "Q5231282", "Q5231283", "Q5231286", "Q57560893"]}, "date": "2015-02-20", "url": "http://www.chicagotribune.com/entertainment/theater/chi-palace-theater-wisconsin-dells-2015-season-20150220-story.html?track=rss", "content": "The Palace Theater, the relatively new dinner theater in the Wisconsin Dells, announced its 2015 season on Thursday. \"Pinkalicious,\" the family musical by John Gregor based on the children's book by Victoria Kann, begins March 14 and continues through April 12. The show will then return in the summer, running June 13 through August 29. It's particularly suitable for young children. New dinner theater set to debut in the Dells As a serial theatrical and banquet entrepreneur of the old school, Anthony Tomaska has had his hits - such as the hugely profitable Chicago production of \"Tony n' Tina's Wedding,\" which ran for more than a decade at Piper's Alley. And he's had his misses - most notably, the...As a serial theatrical and banquet entrepreneur of the old school, Anthony Tomaska has had his hits - such as the hugely profitable Chicago production of \"Tony n' Tina's Wedding,\" which ran for more than a decade at Piper's Alley. And he's had his misses - most notably, the...(<mark>Chris Jones</mark>) \"The Little Mermaid\" (May 20 - Sept 6), the stage adaptation of the Disney film with songs by Alan Menken and Howard Ashman, plays in spring and summer. <mark>Eric Simonson</mark>'s Broadway play \"Lombardi\" (Sept. 25 - Nov. 1), a biography of the Green Bay Packers coach Vince Lombardi then runs through the fall. The first of two holiday offerings is <mark>David Bell</mark>'s \"A Christmas Carol: The Musical\" (Nov. 13 - Dec. 27). And filling the final days of 2015 is \"The Nutcracker,\" Marc Robin and Curt Dale Clark's theater adaptation of the Christmastime Tchaikovsky ballet."}, {"articleID": "2017022709_00944472_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"], "Eric Holder": ["Q312644", "Q3591180"]}, "date": "2017-02-25", "url": "http://www.nytimes.com/2017/02/25/technology/farhads-and-brians-week-in-tech-ubers-very-bad-month.html?partner=rss&emc=rss", "content": "Technology Farhad's and Brian's Week in Tech: Uber's Very Bad Month Bits By FARHAD MANJOO and BRIAN X. CHEN FEB. 25, 2017 Continue reading the main story Share This Page Photo Travis Kalanick, the chief executive of Uber, has pledged an investigation into allegations of sexism at the company. Credit Marlene Awaad/Bloomberg Each Saturday, Farhad Manjoo and Mike Isaac, technology reporters at The New York Times, review the week's news, offering analysis and maybe a joke or two about the most important developments in the tech industry. This week, Brian X. Chen, the Times's personal technology writer, filled in for Mike. Farhad: Hello, Brian! You're stepping in for Mike this week because he has again locked himself out of the office. You really can't count on that guy. So thank you for filling in. Anyway, I wanted to start with some real talk: Science news is very cool right now. You must have seen how astronomers discovered seven Earth-size planets orbiting a star just 40 light years away. Meanwhile, physicists are puzzling over how quickly the universe is expanding; it seems to be going faster than physics predicts it should, which could be a clue that our understanding of the universe is missing something. I don't have any jokes here. I just think this stuff is awesome. Brian: Forty light years is pretty far away. I was hoping I could find another planet to live on for the next four to eight years. I guess I'll have to settle for Vancouver. Farhad: Eh, Canada. O.K., things picked up in the tech industry this week. For the first time in a long time, there was some news that didn't have anything to do with <mark>Donald Trump</mark>. Instead, it pretty much all had to do with Uber. Continue reading the main story But we'll get to that in a bit. Here are some other things that happened. First, Apple announced that its huge new headquarters building in Cupertino, Calif., would be completed in April. This is the spaceship building that Steve Jobs unveiled to the Cupertino City Council in the summer of 2011, in his last public appearance before he died that fall. Apple has named the new campus Apple Park, and it has named the campus auditorium after Jobs. The building will house 12,000 employees. I bet more than a few of them will have roller-skate races around the huge circular hallways. Steve Jobs Presents to the Cupertino City Council (6/7/11) Video by Cupertino City Channel Brian: Apple's campus renovations are long overdue. Have you tried to find parking there recently? It's a nightmare--the place is flooded with Teslas and Mustangs. Anyway, Apple's chief executive, <mark>Tim Cook</mark>, has been talking about this new campus for years now. The way it's shaped--kind of like a U.F.O.--is supposed to foster stronger collaboration between different departments across Apple, whereas historically the divisions (hardware, software, special projects, Apple Minivan or whatever the heck they're doing, iOS, Mac, etc.) have been very siloed. Let's see if that happens. (Maybe one day we'll be able to plug the iPhone charging cable into the ports on the new MacBook Pros--what a concept .) Farhad: If it takes a $5 billion building to eliminate dongles, I'm all for it. So a shocking thing happened this week: A subsidiary of Facebook copied a feature from Snapchat. I'm sorry, I should be above easy sarcasm as a joke. But this week the president used \"NOT!\" in a tweet, and it took me back to the fourth grade. Remember when people used to say, \"Psych?\" Brian: Tcha. I mean, totes. Farhad: Anyway, WhatsApp, which Facebook purchased for more than $19 billion a few years ago, r olled out a number of features this week that borrow heavily from Snapchat. This follows another Facebook-owned app, Instagram, rolling out Stories, a way to make collections of short videos that Snapchat also pioneered. I have no problem with this; as I've argued repeatedly, I think it's generally good for consumers and innovation online when companies freely copy each other's best software ideas. Still, it's got to be just a little bit embarrassing for Facebook, which has been at the forefront of the social game for so long, to have completely run out of original ideas. As a columnist, I know that feeling well. Brian: Tell me about it. I just did my third advice column on phone plans in the last two years. Anyway, I'm used to social media giants cloning each other's features, but I don't think WhatsApp should have gone in this direction. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up Receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. See Sample Manage Email Preferences Not you? Privacy Policy People loved WhatsApp partly because it is a zero-nonsense, intuitive chatting app. So now WhatsApp's new feature, called Status, basically lets people share images, GIFs or videos before they self-destruct in 24 hours. But do you know anyone who uses WhatsApp and desires features like these? I mostly see people using WhatsApp to keep in touch with others overseas. I'm not sure this will stick with consumers or help Facebook lure people away from Snapchat. All it does is add a layer of complexity to what was otherwise a perfectly solid messaging app that everyone knew how to use. Farhad: WhatsApp is great because it just works without any fuss. This all feels like a big fuss. Now let's talk Uber. What a cluster. So, last weekend, a former Uber engineer named Susan Fowler published a lengthy blog post in which she went into lots of detail about sexual harassment and discrimination at Uber. She described a culture in which women were treated terribly and the human resources department did nothing. Then Mike, our Uber beat writer, published a really good piece detailing a whole bunch of other explosive stories about the company's unrestrained culture. Then on Thursday, another shoe dropped: Waymo, a unit of Google's parent company, Alphabet, filed suit against Uber. Waymo said that a former member of Google's self-driving car project stole thousands of technical documents about the project before starting Otto, his own company--which Uber bought last year. And all this follows another controversy at Uber--C.E.O. Travis Kalanick's one-time plan to join a presidential advisory council, which led to an outcry from employees and customers. Uber has pledged an investigation on the sexism charges, but it's not at all clear that will be enough to quell the mounting anger against the company both internally and externally. So, where do you think this goes next? Brian: As these things often tend to go, Uber is going to be in damage-control mode for the coming months. It will probably release the results of the investigation and announce a mandatory sexual harassment training program for its employees. Mike's reporting on this fiasco was truly stunning, and Uber's response--\"We are totally committed to healing wounds of the past and building a better workplace culture for everyone\" --is remarkable in that there is no denial or justification whatsoever of the aggressive, chauvinistic work culture. Their next step, PR-wise, is to show the steps they are taking to \"heal .\" Farhad: I think that was the plan, but the script is already falling apart. Two of Uber's early investors, Mitch Kapor and Freada Kapor Klein, published an open letter to Kalanick expressing their disappointment in how Uber has handled the crisis so far. The company has tasked <mark>Eric Holder</mark>, the former attorney general under President Obama, to lead an investigation into its culture. But the investors--who have long fought for better representation of women in tech companies--say that such an investigation will not be truly independent. \"To us, this decision is yet another example of Uber's continued unwillingness to be open, transparent and direct,\" they said. This is something new in tech--you don't ordinarily see investors calling out their companies. So it seems like Uber is going to have to do something much bigger and less superficial here.... I think. Brian: What an epic disaster. I guess Travis will have to make his employees do more than a few trust falls before they recover from this one. Farhad: This is one of those sagas that might never end. Well, thanks for being Mike this week, Brian. Brian: No problem. Did I sound childish enough? Smell ya later. Continue reading the main story We're interested in your feedback on this page. Tell us what you think."}, {"articleID": "2019032007_00414382_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"], "Mark Wilson": ["Q1388440", "Q15990366", "Q16196771", "Q1922662", "Q19661240", "Q1993337", "Q20022466", "Q28059691", "Q3849582", "Q42717787", "Q44270625", "Q47542215", "Q50294072", "Q55704489", "Q6770379", "Q6770380", "Q6770381", "Q6770382", "Q6770383", "Q6770384", "Q6770385"]}, "date": "2019-03-20", "url": "https://kztv10.com/news/ap-world-news/2019/03/20/the-latest-erdogan-says-mosque-gunman-no-different-from-is/", "content": "The Latest: Erdogan says mosque gunman no different from IS Associated Press CHRISTCHURCH, New Zealand (AP)--The Latest on the mosque attacks in New Zealand (all times local): 7:30 p.m. Turkish President Recep Tayyip Erdogan says the gunman who killed 50 people at two New Zealand mosques is no different from the militants of the Islamic State group. In an opinion piece published in The Washington Post on Wednesday, Erdogan also called on Western leaders to learn from \"the courage, leadership and sincerity\" of New Zealand's Prime Minister Jacinda Ardern and \"embrace Muslims living in their respective countries .\" The opinion piece's headline read: \"The New Zealand killer and the Islamic State are cut from the same cloth .\" Erdogan said the West \"must reject the normalization of racism, xenophobia and Islamophobia .\" Separately, the Turkish president has been criticized for showing excerpts from video of the mosque attacks and for comments about the Gallipoli campaign in World War I. ___ 6 p.m.. A father and son who fled the civil war in Syria for \"the safest country in the world\" have been buried before hundreds of mourners, the first funerals for victims of shootings at two mosques in New Zealand that horrified a nation known for being welcoming and diverse. The funerals Wednesday of 44-year-old Khalid Mustafa and 15-year-old Hamza Mustafa came five days after a white supremacist methodically gunned down 50 worshippers at two mosques in Christchurch--a massacre that he broadcast live on Facebook. Hamza's high school principal described the student as compassionate and hardworking, and said he was an excellent horse rider who aspired to be a veterinarian. ___ 5:25 p.m. New Zealand Police Commissioner Mike Bush says he believes police officers stopped the gunman who killed 50 people at two mosques on his way to another attack. Bush says they believe they know where the gunman was going but won't say more because it's an active investigation. In a 74-page manifesto he released before the attack, accused Australian gunman Brenton Tarrant said he was going to attack mosques in Christchurch and Linwood, and then one in the town of Ashburton if he made it that far. Bush also revised his timeline, saying officers rammed the suspect off the road and arrested him 21 minutes after the first emergency call rather than 36 minutes. Bush says FBI agents have traveled to New Zealand to help with the investigation. ___ 4 p.m. Australia's prime minister says he has asked the Turkish president to withdraw his accusation of an anti-Islam motive behind Australia and New Zealand sending troops to Turkey in the World War I Gallipoli campaign. Turkish President Recep Tayyip Erdogan was denouncing Islamophobia after an Australian was arrested in the killings of 50 worshippers in two mosques in New Zealand. Australian Prime Minister <mark>Scott Morrison</mark> said \"all options are on the table\" if Erdogan does not withdraw his comments. Turkish ambassador Korhan Karakoc said he had a \"frank\" conversation with <mark>Morrison</mark> when the envoy was summoned to Parliament House on Wednesday. Thousands of Australian and New Zealand citizens gather at the Gallipoli peninsula on April 25 each year to commemorate the start of the failed British-led campaign in 1915 to open a new front in the war against Germany. ___ 3:10 p.m.. A man accused of sharing video of a massacre in New Zealand has been jailed by a judge until his next court appearance in mid-April. Philip Arps, 44, appeared in a Christchurch court Wednesday on two charges of distributing the killer's livestream video of last week's attack on Al Noor mosque, a violation of the country's objectionable publications law. Each charge carries a maximum sentence of 14 years in prison. Arps, heavily tattooed and dressed in a T-shirt and sweatpants, hasn't entered a plea. He remained expressionless during the hearing, his hands clasped behind his back. Judge Stephen O’Driscoll denied him bail. Charging documents accuse Arps of distributing the video on Saturday, one day after the massacre. ___ 1:15 p.m.. The first two people to be buried after last week's mosque attacks that killed 50 people are a father and his son. Khalid Mustafa was 44 and Hamza Mustafa was 15. The teen was a student at Cashmere High School and was compassionate and hard-working, according to the principal <mark>Mark Wilson</mark>. Hamza was an excellent horse rider who aspired to be a veterinarian, <mark>Wilson</mark> says. Hamza's younger brother Zaed, 13, suffered gunshot wounds to the leg in the attack. Mourners on Wednesday carried the bodies to a freshly dug gravesite, where hundreds gathered around to watch. Some were invited to scoop handfuls of dirt on top of the bodies. Authorities spent four days constructing a special grave at a city cemetery that is designated for Muslim burials. ___ 12:35 p.m.. The first funeral for two of 50 victims of last week's shootings at two mosques in New Zealand has begun. Hundreds of people are at the services in Christchurch. The identity of the victims was not immediately known. Authorities spent four days constructing a special grave at a city cemetery that is designated for the Muslim burials. An Australian white supremacist killed 50 worshippers in two mosques last Friday. ___ 11:50 a.m. Australia's Prime Minister <mark>Scott Morrison</mark> says he will protest to the Turkish ambassador on Wednesday against the Turkish president's accusation of an anti-Islam motive behind Australia and New Zealand sending troops to Turkey in the World War I Gallipoli campaign. Turkish President Recep Tayyip Erdogan was denouncing Islamophobia after an Australian white supremacist killed 50 worshippers in two mosques in the New Zealand city of Christchurch. <mark>Morrison</mark> said the comments were not helpful. Thousands of Australian and New Zealand citizens gather at the Gallipoli peninsula on April 25 each year to commemorate the start of the failed British-led campaign in 1915 to open a new front in the war against Germany. ___ 11:30 a.m. New Zealand Prime Minister Jacinda Ardern has visited a school where two boys killed in last week's mosque attacks were students. In a speech at Cashmere High School, Ardern renewed her call for people to focus on the victims rather than the perpetrator. She says there will be interest in the terrorist but asked the students not to say his name or dwell on him. The Cashmere High students killed were 14-year-old Sayyad Milne and 15-year-old Hamza Mustafa. A third Cashmere student, Mustafa's 13-year-old brother Zaed, is recovering from gunshot wounds to his leg. ___ 10:45 a.m. Wednesday New Zealand Police Commissioner Mike Bush says police have now formally identified and released the bodies of 21 people out of the 50 who were killed in last week's mosque attacks. Bush said that releasing the bodies was a priority for family reasons, compassionate reasons and cultural reasons. Islamic law says that people should be buried as soon as possible after death, preferably within 24 hours. Bush's comments came after it was announced that the first two burials of the victims are scheduled to take place Wednesday morning. He says they hope to finish formally identifying most victims by the end of the day although some will take longer. Associated Press"}, {"articleID": "2016070806_00552833_W", "names": {"Cameron Smith": ["Q27840142", "Q27840143", "Q28343824", "Q2934778", "Q44614454", "Q5026380"], "Corey Parker": ["Q2997266", "Q5170422"]}, "date": "2016-07-08", "url": "http://www.qt.com.au/news/gallen-deserves-proper-send-off-says-thurston/3058953/", "content": "LAST HURRAH: Paul Gallen of the Blues is tackled by <mark>Cameron Smith</mark> and Matthew Gillett of the Maroons during State of Origin game one. DEAN LEWINS Popular Stories Why police had to issue warning to \"Pokémon trainers' Greyhound move to Bundamba will be a winning trifecta Driver hurt in two-vehicle crash at Redbank Plains check it out! Subscribe Now HIGHLY decorated Queenslander Johnathan Thurston says it will be very sad if New South Wales captain Paul Gallen plays his last Origin match in front of only 60,000 fans at ANZ Stadium on Wednesday night. While Queensland doesn't care how many Blues fans turn out for game three, having already wrapped up the series 2-0 for the 10th time in 11 years, Thurston said Gallen deserved better than to play his 23rd Origin, the most by any NSW forward, in front of a half-empty stadium. The Blues haven't pulled a crowd of less than 80,000 at home since 2010 when 61,259 fans turned out to see Queensland complete Origin's last clean sweep. NRL officials are worried the crowd may struggle to top 60,000 and are urging rugby league fans to say farewell to Gallen .\" It will be a real shame if their captain runs out in front of 60,000, \"Thurston said .\" He's played over 20 Origin games for them, it would be sad, I think. \"Regardless, Thurston said he expected the Blues to come out all guns blazing .\" It's Gal's last game and apparently Robbie's (Farah) last game, so they'll come out fired up and play well, which will be a real challenge for us, \"he said .\" I've only been part of one whitewash (2010) and we have all got a chance to be part of something special on Wednesday night. \"They've got a lot to play for too. The pressure is on them, they're under the pump .\" Thurston said whoever coach Laurie Daley picked opposite him in the No. 6 jumper--Matt Moylan or Jack Bird--they would be \"dangerous\". \"Matt is more of a ball player while Jack is a ball runner,\" Thurston said. With <mark>Corey Parker</mark> the latest member of the team to retire on Wednesday night, Thurston admitted it felt like his own Origin career was winding down. \"It seems like it is starting to come to an end but I am still loving it like my first series. It's quite special and I know I will miss it when that day comes,\" he said. \"Cozza (<mark>Parker</mark>) hasn't said anything to the boys and those that know him know he won't. He'll just go about his business .\" The best way for us to send him out the way he deserves is to prepare the best we can and play the best we can. \"johnathan thurston Read More Login to follow new south wales blues Read More Login to follow origin2016 Read More Login to follow paul gallen Read More Login to follow Topics: johnathan thurston, new south wales blues, origin2016, paul gallen 0 PRINT Have your say"}]