[{"articleID": "2017071119_01173176_W", "names": {"Stefan Huber": ["Q2336572", "Q25415666", "Q50021147", "Q670225"]}, "date": "2017-07-11", "url": "http://www.pokernews.com/news/2017/07/world-series-of-poker-donates-bracelet-to-reg-charity-28477.htm", "content": "Team PokerStars Pro Liv Boeree revealed this week that the World Series of Poker has donated one of its gold bracelets to the Raise for Effective Giving charity. Boeree and her boyfriend Igor Kurganov, who is also a member of Team PokerStars, won Event #2: $10,000 Tag Team No-Limit Hold ’em Championship at the beginning of the 2017 WSOP and each were awarded a coveted gold bracelet. As their team consisted of only two members, there were two bracelets left over, as Boeree explained on social media. \"As there were only two of us in our Tag Team, there were two WSOP bracelets left over from the event.\" The kind folks at the WSOP have given us one to auction off in aid of Raising for Effective Giving - REG Charity's Charities...so if you haven't won your bracelet yet, here's your chance! Not only will you get your very own World Series gold bracelet, but 100% of your winning bid will go directly to the world's most effective charities and save lives. \"The bracelet has been put up for sale on the auction site eBay and, at time of writing, had attracted a total of nine bids, the highest of which weighed in at $3,150, which is under the unknown reserve price set by Boeree and Kurganov. Every cent from the eventual sale will go to the REG charity which was co-founded by Boeree and Kurganov, along with fellow poker players Philipp Gruissem and <mark>Stefan Huber</mark>. Anyone can become a REG member by pledging at least two percent of their income to the organisation, which it then distributes in the most effective way possible. REG seeks to help alleviate poverty, looks after animal welfare, and prevent risk from emerging technologies. Some of the charities recommended by REG include: Against Malaria Foundation Schistosomiasis Control Initiative Animal Charity Evaluators Animal Ethics Humane Slaughter Association Foundational Research Institute Machine Intelligence Research Institute Anyone interested in placing a bid for the WSOP bracelet can head to eBay now. Bidding ends at 3 a.m. on July 20. For more information about the REG charity, including how to donate, more on the recommended charities and more, click here. Have you ever wanted to write your own articles about poker? Maybe you've got some experiences or opinions about poker that you'd like to share. PokerNews is proud to launch The PN Blog where you can have a platform to make your voice heard. Learn more here."}, {"articleID": "2020021906_00066428_W", "names": {"Mike Kelly": ["Q1431761", "Q3857414", "Q543294", "Q6378243", "Q6847486", "Q6847487", "Q6847488", "Q6847490", "Q6847491", "Q6847492", "Q6847493"]}, "date": "2020-02-19", "url": "http://www.whitsundaytimes.com.au/news/contract-up-soon-for-snakes-coach-of-the-year/3948469/", "content": "MELBOURNE, AUSTRALIA--FEBRUARY 16: <mark>Mike Kelly</mark> of the Taipans poses with the award for Coach of the Year during the 2020 Andrew Gaze MVP and Awards Night at Crown Palladium on February 16, 2020 in Melbourne, Australia. (Photo by Graham Denholm/Getty Images) Basketball Contract up soon for Snakes' coach of the year by Jordan Gerrans 19th Feb 2020 3:00 PM premium_icon Subscriber only 0 <mark>Mike Kelly</mark> is a basketball coach in a unique situation. Over the past week, the second-year Snakes mentor has lifted his club into the finals and won the coach of the year trophy in a landslide. But, if his club are sent packing by the Perth Wildcats in a few weeks time, the smiling <mark>Kelly</mark> has no certainty around his coaching future, with his two-year contract set to expire at the end of the 2019-20 NBL campaign. All season, the 52-year-old has said negotiations between he and the club are positive. But, it does present a curious circumstance: arguably the best coach in the NBL right now is not locked up into season 2020-21 and beyond. MELBOURNE, AUSTRALIA--FEBRUARY 13: Taipans head coach <mark>Mike Kelly</mark> reacts during the round 20 NBL match between Melbourne United and the Cairns Taipans at Melbourne Arena on February 13, 2020 in Melbourne, Australia. (Photo by Daniel Pockett/Getty Images) <mark>Kelly</mark>, who was 26 votes clear in voting for the Lindsay Gaze Trophy - Coach of the Year ahead of Sydney's Will Weaver, is not too fussed about his potential future deal with a semi-final just around the corner. \"I am not going to talk about contract stuff...I love it here and everything is going great with the club,\" <mark>Kelly</mark> said following training on Wednesday. \"Everything is looking great for myself and the club. MELBOURNE, AUSTRALIA--FEBRUARY 16: <mark>Mike Kelly</mark> of the Taipans speaks after being awarded Coach of the Year during the 2020 Andrew Gaze MVP and Awards Night at Crown Palladium on February 16, 2020 in Melbourne, Australia. (Photo by <mark>Kelly</mark> Defina/Getty Images)\" I appreciate everything that we have been through as a club and for me it has been a great learning experience and a great way to come out at the end of the regular season, winning the award. \"It is all positive right now.\" Stretch forward Majok Deng missed training on Wednesday morning with the flu. With Deng not at the session, local training player Mason Khalu saw game time in the scrimmage to finish practice. The young combo-guard did not look out of place playing against the professional Snakes roster. Meanwhile, the total attendance for the 2019-20 NBL regular season increased by 21 per cent, with all clubs enjoying bigger crowds as the league continues to grow. The Cairns Taipans had 61,917 fans attend games at the Cairns Convention Centre, a two per cent increase on last season as they rose from bottom of the ladder to the finals. More Stories Aussie superstar calls out rude NBA fan premium_icon Taipans' superb Serb smiling premium_icon The two losses that cost Bullets shot at NBL title premium_icon Wright: I'm to blame for Sixers woes United secure last-gasp NBL finals spot Show More More Stories Aussie superstar calls out rude NBA fan premium_icon Taipans' superb Serb smiling premium_icon The two losses that cost Bullets shot at NBL title premium_icon Wright: I'm to blame for Sixers woes United secure last-gasp NBL finals spot Show More 0 basketball Read More Login to follow cairns taipans Read More Login to follow <mark>mike kelly</mark> Read More Login to follow nbl Read More Login to follow basketball cairns taipans <mark>mike kelly</mark> nbl"}, {"articleID": "2009031614_00045873_W", "names": {"Richard Bell": ["Q16107215", "Q1724725", "Q21466374", "Q21466378", "Q43127297", "Q57413908", "Q57942711", "Q7324077", "Q7324080", "Q7324082", "Q7324083"]}, "date": "2009-03-16", "url": "http://breakingnews.ie/sport/eyaucwsngbgb/", "content": "16/03/2009 - 14:06:09 shirts worn by defenders who were tormented by george best are among rare items for sale in an auction of memorabilia owned by the family of the late footballing legend this week. a miniature replica of the european cup commemorating the manchester united star's goal in the 1968 final triumph against benfica will also be going under the hammer in belfast. the 110-lot collection, which is expected to fetch up to £ 100,000 (€ 108,000), belonged to best's father dickie, who died last year aged 88. other notable collector pieces on offer at wilsons auction house on thursday night include a letter opener presented to the forward to mark his two goals in another stunning victory over benfica, this time two years before the european cup final. best's two goals in portugal that night in 1966 earned him the nickname \"el beatle\" . framed photographs signed by best's contemporaries at old trafford, including legendary manager matt busby, are also in the catalogue, as is a cine camera given to the star by his old team in belfast, cregagh boy club, when he joined united. this lot is accompanied by a photograph of george being presented with the gift in 1963 alongside his mother and father. the collection also holds recent items, including a framed copy of the order of service from the star's funeral in belfast in 2005. dickie best stipulated in his will that both the family home at 16 burren way in the cregagh estate and its contents were sold upon his death. <mark>richard bell</mark> from wilsons auctioneers said it was huge honour to have been asked to conduct the sale. \"george best is an iconic figure and perhaps the most talented and charismatic sportsman to come from northern ireland,\" he said, revealing that the auction has already attracted interest from around the world. \"i had an email this morning from san diego from a gentleman who had found out about the sale and he's interested in two or three different items,\" he added. \"we would expect that, obviously there's a big connection with northern ireland football and man united football. i mean it's just phenomenal the number of fans he had.\" among the shirts for sale are ones george swapped with international opponents while playing for northern ireland. the england, scotland, holland and switzerland jerseys are all framed and signed by best. \"they have attracted quite a bit of interest and we would expect that there would be a lot of people wanting to own those,\" said mr <mark>bell</mark>. while reluctant to indulge in too much speculation on possible prices, the auctioneer said he was confident the economic downturn would not have a negative impact. \"i think and i hope there will be items here for everybody to get a chance to buy and i hope there will be a few gasps from the audience,\" he said. \"but how do we put a value on items that once belonged or were handed to other people by george best?\" he was undoubtedly one of the most iconic sportsmen every to come from northern ireland so that's going to make the difference between what's a good price and an absolutely phenomenal price. \"how or when are you ever going to get the opportunity again to own something from this particular collection and that's what makes it so exciting for us as auctioneers.\" "}, {"articleID": "2019051004_00224959_W", "names": {"Richard Woods": ["Q21467109", "Q7330085"]}, "date": "2019-05-10", "url": "https://www.wsaz.com/content/news/Australian-fire-official-comes-to-learn-from-crews-in-West-Virginia--509733781.html", "content": "Australian fire official comes to learn from crews in West Virginia By WSAZ News Staff | Updated: Fri 12:05 AM, May 10, 2019 CHARLESTON, W. Va. (WSAZ)--A man who has spent his entire life working to stop fires in Australia is spending time in West Virginia because he wants to learn from crews in the Mountain State. <mark>Richard Woods</mark> is the director of Wildfire Investigations and Analysis in Canberra, Australia. <mark>Woods</mark> has been spending time this week meeting with the division of Forestry's Special Operation Canine Unit to see how they use bloodhounds to investigate arson cases. He says West Virginia's way is unique because the offenders are not only identified but they work to deter future fires. \"You have a skill here and tool that is very, very effective, and we have a problem of wildfire arson in Australia, and I can see this application being very useful down under,\" <mark>Woods</mark> said. Wildfire arson is a problem all over the world, and <mark>Woods</mark> sees West Virginia's program as a big step in the right direction. <mark>Woods</mark> has has worked to solve cases and teach courses at home in Australia, Europe and Asia."}, {"articleID": "2015041221_00039260_W", "names": {"Quincy Jones": ["Q193645", "Q25190073"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2015-04-12", "url": "http://www.nme.com/news/various-artists/84450", "content": "April 12, 2015 22:03 Record label and studio owner in fight over Chris Cornell-featuring supergroup's tapes A & M Records and the co-founder of Seattle's London Bridge studios, Rajan Parashar, are fighting over the master recordings of grunge supergroup Parashar's brother Rick, who he co-founded the studio with and was the producer of the recordings, failed to honour a deal made in 1993 in which he agreed to give the tapes and the subsequent rights to A & M for £ 24,000 ($35,000). Rick Parashar died in August of last year and left the tapes in his brother's possession. Rolling Stone reports that the record label believed the members of the supergroup, which included Soundgarden's Chris Cornell, had possession of the tapes but learnt that that was not the case. Rajan Parashar's attorney Warren Rheaume told the Seattle Times: \"He's had them all along. They're his.\" 2016 marks the 25th anniversary of the release of the \"Temple Of The Dog' album, with the record now considered a grunge classic having gone platinum despite originally being overlooked in 1991. Nelly will be cleared of drugs charges\" when facts come out', says lawyer Chance The Rapper shares short film for Social Experiment single \"Sunday Candy' - watch Este Haim joins Hozier on stage at Coachella to cover The Time's\" Jungle Love' <mark>Quincy Jones</mark> says <mark>Michael Jackson</mark> had \"no idea what we were doing' making...Idlewild unveil\" Every Little Means Trust' video starring Jay Baruchel - watch Zack de la Rocha and Travis Barker join Run The Jewels onstage at Coachella"}, {"articleID": "2012032705_00067298_W", "names": {"Paolo Ferrari": ["Q1044903", "Q3894032", "Q43269545"]}, "date": "2012-03-27", "url": "http://hollywoodreporter.com/news/eric-clapton-ferrari-spc-12-epc-car-304511?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+thr%2Fmusic+%28The+Hollywood+Reporter+-+Music%29", "content": "prior to the car's delivery, a video clip of the custom built coupe has hit the web. <mark>paolo ferrari</mark> named president of the international rome film festival in a video posted to the web, the british rocker's new ride can be seen leaving a london dealership to be delivered to its new home. according to yahoo's motoramic blog, the one-of-a-kind coupe took two years to build and has been dubbed the spc-12 epc, for \"special project car, number 12, eric patrick clapton.\" the car was designed to pay tribute to the singer's favorite 1970s <mark>ferrari</mark> 512bb, which he previously crashed. it is powered by a v-8 engine, because a v-12, which was used in the 512bb, is too large for the 458 italia frame on which the custom car is based. the car also features a two-tone color scheme, oversized wheels and angular headlights. \"the big bang theory': leonard nimoy reminds sheldon of his human half (exclusive video) behind the scenes of thr's\" hunger games' cover shoot (exclusive photos) \"hunger games' haul promises payday bump for stars jennifer lawrence, josh hutcherson and liam hemsworth what's hot on the hollywood reporter"}, {"articleID": "2008101600_00038174_W", "names": {"James Bamford": ["Q1680004", "Q6129324"], "Michael Hayden": ["Q1226020", "Q449604", "Q6831016"]}, "date": "2008-10-16", "url": "http://haaretz.com/hasen/spages/1029006.html", "content": "in 2006 the check point software technologies company, which specializes in protecting computer systems from hackers and data theft, wanted to acquire an american company called sourcefire, which works in the same field. the great advantage of sourcefire was that its clients include the american defense department and the national security agency. the u.s. administration, however, by means of the committee on foreign investment in the united states, did not approve the acquisition. the committee made its decision based on an opinion by the federal bureau of investigation and nsa security officers. the two organizations were afraid that check point, which was founded by gil shwed and fellow graduates of unit 8200, the israel defense forces' high-tech intelligence unit, would have access to top-secret information, which it could pass on to israel's intelligence community. the fear and suspicion currently is directed not only toward check point, but also other israeli high-tech companies like verint, comverse, nice systems and persay voice biometrics, some of which work in data mining and engage in software development for tapping telephones, fax machines, e-mail and computer communications. the above accusations come from journalist and writer <mark>james bamford</mark>, whose new book, \"the shadow factory: the ultra-secret nsa from 9/11 to the eavesdropping on america\" (doubleday), came out this week in the united states. <mark>bamford</mark>, a former producer for the abc television network, has spent the last 30 years writing about the nsa - one of the most important and least-known intelligence agencies in the united states, but usually in the shadow of the central intelligence agency. the nsa is responsible for eavesdropping on telephones, fax machines and computers; intercepting communications and electromagnetic signals from radar equipment, aircraft, missiles, ships and submarines; and decoding transmissions and cracking codes. it has contributed immeasurably to u.s. intelligence and national security. in this respect, the united states resembles israel: successes attributed to the mossad should often be credited to other intelligence units - first and foremost unit 8200, the israeli equivalent of the nsa. this is <mark>bamford</mark>'s third book, and it affords a look into the mazes of the nsa. in 1982 the justice department threatened to prosecute him for revealing agency secrets in his first book, \"the puzzle palace: inside the national security agency, america's most secret intelligence organization.\" in his second book, \"body of secrets: anatomy of the ultra-secret national security agency,\" he described the nsa with a great deal of enthusiasm, which made him the organization's hero of the day. the nsa even organized a party in his honor at headquarters in fort meade, maryland. his new book, which is critical of the nsa, has sent him back to his starting point. <mark>bamford</mark>'s main thesis is that before september 11, 2001, the agency failed along with other intelligence agencies in understanding the al-qaida threat, even though it had intercepted members' phone calls and e-mails. this stemmed in part from excessive caution for upholding laws and respecting citizens' privacy. in april 2000, then-nsa director general <mark>michael hayden</mark> (currently the director of the cia), vividly described to a congressional committee how, if at that very moment osama bin laden were to step onto the peace bridge at niagara falls and cross into the united states, \"my people must respect his rights.\" after the september 11 attacks on the world trade center and the pentagon, the organization swung over to the other extreme. according to <mark>bamford</mark>, since september 11 the nsa has had no compunctions about violating the constitution and has been eavesdropping on american citizens. one of the outstanding examples in the book, which has been well-covered in the american media, is the fact that the nsa has listened in on bedroom conversations of journalists, military officers and officials serving in iraq. the nsa may eavesdrop on and intercept transmissions outside the united states, but cannot do so to american citizens without a court order. another of <mark>bamford</mark>'s important assertions, which also concerns israel, is that the largest telephony and communications companies in the united states - in fact all of them except qwest - have cooperated with the nsa, allowing it to tap their lines and optic fibers. the above-mentioned israeli companies and others are important software and technology suppliers for not only the american telephony companies, but for the nsa itself. <mark>bamford</mark> claims that 80 percent of all american telephone transmissions are conducted by means of the israeli companies' technology, know-how and accessibility. thus, <mark>bamford</mark> believes, the american intelligence community is exposing itself to the risk that the israeli companies will access its most secret and sensitive digital information. <mark>bamford</mark> does not provide any backing for this thesis; he only points to a circumstantial relationship. the israeli companies were largely established by graduates of 8200, and therefore he says they are connected by their umbilical cords to israeli intelligence, and their ceos and boards of directors include senior shin bet officials like arik nir or former mossad chief ephraim halevy (nir is the ceo of athlone global security, a hedge fund that has invested inter alia in persay voice biometrics, and ephraim halevy is a member of the athlone advisory board). to put it mildly, <mark>bamford</mark> has no love lost for israel. in his articles, he publishes claims by american navy officials who believe israel maliciously attacked the american spy ship liberty during the 1967 six-day war. he holds that the september 11 attack did not stem from radical islam's basic hatred of america, but rather from its anger at the united states' support for israel. he calls the nineteen september 11 terrorists \"soldiers\" and describes them with a great deal of sympathy - davids who \"only\" demolished four airplanes of the american goliath. in this context, and apparently because of his deep hostility, <mark>bamford</mark> asserts that in light of the problematic record of israel, which did not hesitate to spy against america on american soil, israeli companies should not have been given the keys to the kingdom of america's secrets. his attitude toward israel apparently pushes him over the psychological brink, as his book hardly mentions the close cooperation between the two countries' intelligence communities, mainly in the war against international jihad terror or in monitoring iran. fattal hotel chain perfectly located hotels on best resorts of israel. us citizens vote for real change. request your ballot today! haaretz.com, the online edition of haaretz newspaper in israel, offers real-time breaking news, opinions and analysis from israel and the middle east. haaretz.com provides extensive and in-depth coverage of israel, the jewish world and the middle east, including defense, diplomacy, the arab-israeli conflict, the peace process, israeli politics, jerusalem affairs, international relations, iran, iraq, syria, lebanon, the palestinian authority, the west bank and the gaza strip, the israeli business world and jewish life in israel and the diaspora."}, {"articleID": "2012010207_00004254_W", "names": {"Anthony Rogers": ["Q24006212", "Q30609128"], "Bill Young": ["Q18043631", "Q19668664", "Q28037560", "Q28037714", "Q2903413", "Q4911459", "Q4911460", "Q4911461", "Q862673", "Q862680", "Q973956"]}, "date": "2012-01-02", "url": "http://ocolly.com/sports/rogers-asked-to-help-team-in-fiesta-bowl-1.2737365", "content": "<mark>anthony rogers</mark> has always been a team player. he takes the extra rep at practice, he plays hard until the final whistle, and good never is never satisfying to him. now, in his team's biggest game of the season, <mark>rogers</mark> has been asked to step up and be a team leader once again. when oklahoma state plays stanford on monday, <mark>rogers</mark> will play more snaps at defensive tackle, a position coaches would rather rotate players every other play instead of leaving someone in for long drives. sophomore from north little rock, ark. spent most of the season at defensive tackle switching with christian. <mark>rogers</mark>' counterpart was suspended for the bowl game when he was charged with possession of drug paraphernalia. despite having to play more than he had all season, coach mike gundy thinks his maturity will help him, a trait his family helped him develop into the teammate he is today. gundy said. \"his mom, she did a great job of raising him and he's got values and understands the importance of team. he is willing to do whatever we ask him to do.\" littlehead started the first game, <mark>rogers</mark> earned a spot in the starting lineup against arizona and started sever more games during the season. in what was his first full season, <mark>rogers</mark> finished with 17 tackles, 2.5 for a loss, and one sack. \"he's done a really good job for us,\" defensive coordinator <mark>bill young</mark> said. \"he's really intense guy and just really wants to play well.\" for <mark>rogers</mark>, the adjustment to playing defensive tackle in the big 12 was his biggest challenge. he had occasionally played the position at times in high school, but was used predominately as a pass rushing defensive end. when he arrived in stillwater, <mark>rogers</mark> weighed 235 pounds, not the ideal size for a defensive tackle who would be rushing at linemen weighing more than 300 pounds. the weight room in boone pickens stadium quickly became his new home during his first summer camp. after three months of training, <mark>rogers</mark> had gained 60 pounds of muscle. redshirt and freshman years learning the technique to his new position. all he needed was experience, an opportunity he was able to advantage of this season. \"last year was where i put my foot in the water testing it,\" <mark>rogers</mark> said. \"this year was more of getting more mature as each game goes on.\" by the first game this season, i was making a decent amount of mental mistakes. as the season progressed, i limited the mental mistakes that i made. \"now with minimal depth at his position for the fiesta bowl, <mark>rogers</mark> has even more responsibility in disrupting stanford's efficient offense. forcing heisman runner-up andrew luck out of his comfort zone is key for the defensive line, but <mark>rogers</mark> understands that stanford will also use an offensive line featuring two all-american linemen to block for a powerful running attack.\" we've got to be physical, attack them and just become a man, \"<mark>rogers</mark> said.\" you can't be a little boy down there. you've got to be a man, hold your gaps and don't get pushed back. \"even if <mark>rogers</mark> struggles in the opening minutes, <mark>young</mark> trusts him to find a way to fix it. <mark>rogers</mark> isn't one that likes to be down and out. he always fights through and makes sure he fixes his mistakes.\" he's a guy if he doesn't do it right, it bothers him, \"<mark>young</mark> said.\" you like that as a coach be the first to comment on this article! mike gundy and todd monken grow close through football and family mike gundy and todd monken grow close through football and family"}, {"articleID": "2015081512_00079141_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2015-08-15", "url": "http://thegazette.com/subject/opinion/blogs/lynda-waddington/binders-full-of-x2026-hypocrisy-20150815", "content": "Binders full of...hypocrisy Lynda Waddington, Exact Change August 15, 2015 | 7:00 am Pardon the dust, but it's time we brush off one of the Republican Party's binders full of women. And, no, I'm not talking about Mitt Romney's fictional debate binders, but the very real autopsy report commissioned by the Republican National Committee in the wake of the 2012 election. Romney garnered support from male voters, but experienced an 11-point deficit among female voters. And, when single women were singled out, the gap became a cavern of 36 percentage points. The report concluded women are not a \"coalition,\" and appealing to them should be integrated into all activities. GOP talkers \"need to use language that addresses concerns that are on women's minds in order to let them know we are fighting for them.\" Among the findings was that women voters are interested in hearing facts. \"Many of them run the economies of their homes and understand economics better than the men in their families.\" Give props to baby steps; maybe next time the RNC will notice women also dare to run businesses. Additional baby steps: \"They feel like they are smart, engaged and strong decision-makers, but that their opinions are often ignored.\" Acknowledging that women \"feel\" they have brains is a start, albeit a very small one. The report does not call for reconsideration of issue stances that led to the \"War on Women.\" Instead, Republicans are encouraged to point fingers, making sure \"feeling\" women understand Democratic positions also impact them. Psst: Next time, tell us something we don't know. Republicans, the report admonished, need to put women on the national stage, not only as candidates, but as spokeswomen because...wait for it...they \"are far better at connecting with these voters because they are more likely to understand them.\" The real kicker is that existing Republican officials and the 2016 field can't even be bothered to attempt to follow these meager and condescending recommendations. U.S. Sen. Joni Ernst, arguably a benefactor of the RNC report, reacted to secretly-recorded videos of Planned Parenthood staffers discussing how the organization engages in the legal practice of accepting reimbursement costs when supplying fetal tissue to researchers by sponsoring a bill prohibiting the flow of women's health care dollars to Planned Parenthood. Republican Mitch McConnell, who championed the law that opened the door on fetal tissue sales, was her co-sponsor. The measure held the same ick factor as <mark>Donald Trump</mark> telling women how pretty we look on our knees--you know, when we aren't bleeding out of our wherever. Ernst's proposal was not to ban fetal tissue use in research, or to change the reimbursement framework. It was not an attempt to end abortion, because the targeted funding provided birth control, STI testing and prenatal care. The RNC binder should have noted that even the breast-burdened understand the hypocrisy of launching a program, then demonizing those who play by your established rules. Having Ernst as the messenger makes no difference. Hypocrisy is like recently renovated Target toy aisles: gender neutral. • Comments: @ LyndaIowa, (319) 339-3144, lynda.waddington @ thegazette.com Have you found an error or omission in our reporting? Is there other feedback and/or ideas you want to share with us? Tell us here."}, {"articleID": "2015081410_00088843_W", "names": {"Chen Long": ["Q45375068", "Q45435348", "Q45441513", "Q45441731", "Q45449492", "Q45452930", "Q45464073", "Q45498661", "Q45552931", "Q45629509", "Q45641681", "Q715563"], "Wei Nan": ["Q15041093", "Q45525012", "Q45708293"], "Wang Shixian": ["Q443201", "Q45469412", "Q45473076", "Q45484720", "Q45494257", "Q45506435", "Q45525991", "Q45572498", "Q45586705", "Q45593361", "Q45643667", "Q45644600", "Q45669497"], "Lin Dan": ["Q1390341", "Q45357783", "Q45370224", "Q45568304"], "Hu Yun": ["Q45411652", "Q45497983", "Q45567421", "Q45580655", "Q45631951", "Q45724354", "Q45727059", "Q45727361", "Q45727422", "Q56064933", "Q933753"]}, "date": "2015-08-14", "url": "http://www.thejakartapost.com/news/2015/08/14/badminton-chen-pushed-brink-axelsen-jakarta.html", "content": "Tokyo 2020 Olympic logo designer faces fresh plagiarism claims <mark>Chen Long</mark> fought off a stubborn Viktor Axelsen at the world championships Friday, with the plucky Dane pushing the top seed to the limit in an epic quarter-final showdown in Jakarta. <mark>Chen</mark> claimed the first game but the seventh-seeded Axelsen put up a dogged defense in the second, dragging the contest beyond an hour before succumbing 21-18, 30-29. \"I was starting to prepare for the third game, but luckily I got it,\" <mark>Chen</mark> told reporters via a translator. It's not the first time the 21-year-old Dane has punched above his weight against the Chinese champion, narrowly losing in a three-set battle for gold in the Australian Open in May. A devastated Axelsen said he struggled to find rhythm and get the best of his formidable opponent. \"I was so close to getting the second set, but <mark>Chen Long</mark> played better than me here,\" the young hopeful told reporters after the match. \"Of course when I look back in a few days I can be proud of my performance today...but when you are so close to winning it's pretty disappointing.\" <mark>Chen</mark> progresses to the semi-finals where he will face fourth seed Kento Momota, who dispatched Hong Kong's <mark>Wei Nan</mark> 21-6, 21-14. The 20-year-old Momota, who won the Indonesian Open in June, said he was hoping to face Axelsen but is determined to do his best against the defending champion. \"<mark>Chen Long</mark> is the number one seed, so I hope to prove myself against him,\" the Japanese star said through a translator. In the women's singles, world number one Carolina Marin appeared at her most confident as she charged past her toughest opponent yet, seventh seed <mark>Wang Shixian</mark> of China, 21-17, 21-19. The Spaniard showed no sign of the ankle injury she incurred on Thursday and kept her cool even as <mark>Wang</mark> put her through her paces in the second game. Marin will next face the winner of another quarter-final match scheduled later on Friday between ninth-seeded Korean Sung Ji-Hyun or India's P.V. Sindhu. \"I don't care if it's going to be Sung Ji-Hyun or Sindhu,\" a confident Marin said. \"We will see who wins.\" Indonesia's unseeded shuttler Lindaweni Fanetri upset Taiwan's Tai Tzu Ying, bouncing back from a slow start to defeat the fourth seed 14-21, 22-20, 21-12 before a roaring home crowd. Unseeded Japanese pair Naoko Fukuman and Kurumi Yonao, who dismissed the second-ranked Chinese pair on Thursday, continued their rampage in the women's doubles with a 25-23, 21-14 win over 13th seeded Indian pair Jwala Gutta and Ashwini Ponnappa. There were fewer surprises in the mixed doubles, with the top three pairs - two from China and one from Indonesia - progressing to the semi finals. Five-time world champion <mark>Lin Dan</mark> and second seed Jan O. Jorgensen go head-to-head later Friday in what is expected to be one of the tournament's fiercest contests to date. The winner of that match will likely face Malaysia's Lee Chong Wei who has returned from an eight-month doping ban guns blazing. The unseeded former world number one has already knocked off two seeded opponents in Jakarta, and is expected to do the same with Hong Kong's <mark>Hu Yun</mark> later Friday. (+ + +) Read also:"}]