[{"articleID": "2019111102_00068158_W", "names": {"Frances Fitzgerald": ["Q540812", "Q5478653"]}, "date": "2019-11-11", "url": "https://www.herald.ie/news/dail-hopeful-sorry-for-tweets-as-she-hits-out-at-smear-campaign-38678925.html", "content": "Dail hopeful sorry for tweets as she hits out at \"smear campaign' Conor Feehan--11 November 2019 02:30 AM Fianna Fail Dail candidate Senator Lorraine Clifford-Lee Senator Lorraine Clifford-Lee has apologised for tweets she posted in the past in which she used the words\" knacker' and \"Traveller' in a derogatory manner. One Twitter message written by the Fianna Fail politician said celebrity Kim Kardashian had a\" fat arse \", while another told how a\" black Brazilian dwarf with ginger hair \"sat beside her on a bus. Ms Clifford-Lee is a candidate in the Fingal constituency by-election which will be held on November 29, and has branded the publicity surrounding the tweets as a smear campaign. The controversial social media posts will be a headache for Fianna Fail leader Micheal Martin. Wrong Attention has been drawn to the historical tweets on social media over the weekend and Ms Clifford-Lee last night apologised for any offence caused by the posts and admitted they were wrong. In July 2011, she tweeted:\" Just doing up inventory of items in my car when it was stolen by some knacker. I think I'm going to cry. \"In June the same year, she had responded to a tweet about fashion, which is now no longer available, with:\" I think some pieces are cute but others look like something from a traveller wedding. \"In October 2011, Ms Clifford-Lee tweeted:\" Was on Dublin Bus for the first time in about a year yesterday. Forgotten how much fun it is. Black Brazilian dwarf with ginger hair sat beside me. \"Then in June 2012 she wrote\" Fat arse Kardashian is in Dublin apparently with her fella. \"Ms Clifford-Lee is the Fianna Fail Seanad spokesperson on Justice and Equality, as well as Children and Youth Affairs. Her Twitter biography describes her as a solicitor, mother and feminist. Asked by the Herald for a comment on her controversial tweets, Ms Clifford-Lee issued a statement. She said the tweets referred to are from as far back as 2011 and were posted long before she became involved in electoral politics .\" I want to be absolutely clear, the tweets were wrong and I apologise for any hurt or offence caused by them, \"Ms Clifford-Lee said .\" While it does suit some people to take my tweets out of context for their own right-wing agenda, I hope that the people of Dublin Fingal will not be distracted by personal smear campaigns such as this. \"Anyone who has worked with me since my election to the Seanad three years ago can confirm the role I have played in promoting progressive policies .\" I also actively supported the marriage equality referendum and the campaign to repeal the Eighth Amendment, \"added Ms Clifford-Lee. She said she wants the by-election campaign to focus on\" the very real issues that people face every day \". Triggered Ms Clifford-Lee listed these as solutions to transport, housing, health, childcare, climate change and protecting communities from crime. She was elected to the Seanad in 2016 following an unsuccessful bid for a Dail seat in the same constituency in that year's general election. Ms Clifford-Lee got more than 3,300 first preference votes in 2016. Fianna Fail has high hopes she will join Dublin Fingal party colleague Darragh O'Brien in the Dail in this month's election. The by-election was triggered by former Independents4Change TD Clare Daly winning a European Parliament seat in May. There is also a by-election in Dublin Mid-West caused by former tanaiste <mark>Frances Fitzgerald</mark> becoming an MEP in the same election."}, {"articleID": "2010101501_00143441_W", "names": {"Doug Collins": ["Q18352424", "Q3162841", "Q5300375", "Q919954"]}, "date": "2010-10-15", "url": "http://slcdunk.com/2010/10/14/1751460/game-thread-phoenix-suns-utah-jazz-pre-season-game-4", "content": "very interested to see how g-money playes in the starting role tonight...fun to see jerry throw these young kids into the starting line-up to see how they react. tonight we'll get a good look at how gordon will play with the first team and how he plays with deron running the point. smell that people???? it's b-ball season!!!!! \"any time detroit scores more than 100 points and holds the other team below 100 points, they almost always win .\" - <mark>doug collins</mark> (thanks for the insight <mark>doug</mark>) finally get to see what's going on-not just listen to what others say. well, finally see the game for the first time since the first preseason game .:) that new thing where you watch stuff instead of just listening? i think i've heard of it somewhere. through astrally projecting myself to the arena through deep meditation and sleep deprivation...slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com his wisdom has been a highlight for about 20 years. popcorn: popped wife: understanding homework: neglected spirits: high hayward: starting! oh daddy. \"deep, deep in my heart i'm a jazzman. all this summer, i knew i was\" deep, deep in my heart i'm a jazzman. all this summer, i knew i was slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com i'm not the only one!!!!! i'm not crazy!!!!! i think there a few of us here who are all about comrade kirilenko slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com i wrote about 6000 words throwing fits about the ak-diaw trade rumor \"deep, deep in my heart i'm a jazzman. all this summer, i knew i was no, but i've been called all sorts of things for saying that on this site crazy, delusional, uneducated, irrational, emotional, ignorant, stupid, etc. not by you, not by the other dudes on the thread right now, but by some how dare i suggest watching games gives different kind of info. i only see white people...is this accurate? slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com there's a whole lot of caucasian, and not much of anything else. when my wife moved here from california (she was in high school) she stopped in the school hall one day, stunned to suddenly realize that everyone was white .\" deep, deep in my heart i'm a jazzman. all this summer, i knew i was slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com sign he is delusional or that he can laugh at himself? he looked pretty serious \"deep, deep in my heart i'm a jazzman. all this summer, i knew i was may make him wet himself\" deep, deep in my heart i'm a jazzman. all this summer, i knew i was slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com \"deep, deep in my heart i'm a jazzman. all this summer, i knew i was slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com can't type and watch at the same time .\" deep, deep in my heart i'm a jazzman. all this summer, i knew i was i've got a 27 \"imac and an ipad to handle all my gameday fun\" deep, deep in my heart i'm a jazzman. all this summer, i knew i was slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com liking the range. \"deep, deep in my heart i'm a jazzman. all this summer, i knew i was slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com born leader .\" deep, deep in my heart i'm a jazzman. all this summer, i knew i was slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com early observation follow me on twitter: i was talking about off-ball movement on other side of court though slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com and harp is so good as well follow me on twitter: slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com \"deep, deep in my heart i'm a jazzman. all this summer, i knew i was slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com that's what i'm dreaming to see a gajillion times this year slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com he needs the same kind of 1-on-1 lessons harpring gave wesley and cj last playoffs slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com slcdunk.com...e-mail me at: allthatjazzbasketball @ hotmail.com>\" src = \"\"/> if fesenko indeed does not play tonight, reserve big man kosta koufos -...deron williams attempted thursday to clarify his twitter message from the...death blow 2010, ranking the utah sports radio personalities, bolerjack/parks the downbeat - 14 october 2010 - #338 - the all you can read edition hogs haven - redskins nfc west"}, {"articleID": "2019090300_00086484_W", "names": {"Brandon Allen": ["Q14950651", "Q24005402", "Q936391"], "Andrew Beck": ["Q4756308", "Q57374557"], "Kevin Hogan": ["Q16195119", "Q19874350", "Q6083815", "Q6396509"]}, "date": "2019-09-02", "url": "https://www.thedenverchannel.com/sports/broncos/broncos-add-seven-new-players-begin-preparation-for-raiders", "content": "Broncos add seven new players, begin preparation for Raiders Raiders week arrives with Broncos making moves Posted: 5:50 PM, Sep 02, 2019 Updated: 2019-09-02 19:50:28 -04 By: Troy Renck ENGLEWOOD--The churn raised eyebrows. The Broncos remade the bottom of their roster with seven new players, or 13 percent of their 53-man squad. So it was a on surface-of-the-sun practice Monday--the 100 degrees marked the hottest September Colorado day ever--coach Vic Fangio began assimilating quarterback <mark>Brandon Allen</mark>, punt returner Diontae Spencer, linebacker Corey Nelson, tight end <mark>Andrew Beck</mark>, cornerbacks Duke Dawson and Devontae Harris and offensive lineman Corey Levin. \"It's actually easier to come in and learn in a game week than it is in training camp because things are paired down and dialed in more,\" said Fangio, whose team lacked quality depth throughout the preseason. \"We're not the only team that's had this roster gymnastics. It happens every year. (General manager) John (Elway) and his guys were keeping track of everyone around the league. We just felt that with each and every move it would make us better .\" In one week, the Broncos face the Oakland Raiders. It's hard to overstate the importance of starting well in the division. Anything less than 3-3 in the AFC West spells trouble. And the Broncos have dropped three straight games in Oakland, outscored 78-48. Time to microwave the development of the new guys because all contributors are needed and necessary. \"It's going to get poppin'. We have to go out there and execute,\" Pro Bowl running back Phillip Lindsay said. \"One, you can't make mistakes. Crowd noise, you have to stay tuned in. You have to make big plays, you have to hold onto the football and your defense has to create some turnovers .\" Eyes shifted to the quarterback drills because the position demands attention. <mark>Allen</mark>, wearing No. 2, is the new backup, someone who played against the Broncos in Los Angeles last month. He is not established, but was considered an upgrade over <mark>Kevin Hogan</mark>, who finished with four interceptions in the exhibition games. For <mark>Allen</mark>, the past 24 hours became a whirlwind as he was cut, claimed and cuddled up with a new playbook. \"A lot of the concepts are similar as far as terminology wise,\" said <mark>Allen</mark>, who called himself \"a good luck charm\" for quarterbacks because in his previous two stops in Jacksonville and Los Angeles the starters stayed healthy. \"A lot goes into getting ready, especially in the huddle. You want to be familiar with what you are saying. There will be a lot of extra preparation for me, but I am not new to that so I should be fine .\" So why <mark>Allen</mark>? Fangio explained the reasoning. \"He's a good athlete. Throws a good ball. We like the way he runs an offense,\" Fangio said. One player walks from parking lot to the top of the depth chart. The plan is for Spencer, pictured above, to handle punts on Monday. Fangio cited Spencer's experience and his quickness. Spencer was claimed off waivers from the Steelers after posting a 14.7 average with a long of 38 yards this summer. Spencer returned a staggering 191 punts for a 11.3 average in the past four seasons for Ottawa and Toronto. He handled nine straight in practice during media viewing with no issues. Spencer remains motivated by the murder of his father in Louisiana during his college career at McNeese State, adopting his dad's motto \"Can't Stop, Won't Stop .\" \"It's still pushes me. It always will,\" Spencer told me, before articulating what makes a good punt returner. \"The key is trusting yourself, trusting the guys that are out there blocking for you. And you have to be consistent. That's the biggest thing, putting the offense in good field position, and if you can score, it's a bonus .\" FOOTNOTES The Broncos rounded out their practice squad, adding lineman Jake Rodgers and former CSU star linebacker Josh Watson ....Linebacker Corey Nelson returns to Denver with a new number (56), and a plan to contribute right away. He told me he should be ready to go on special teams and the defense, if needed ....Receiver Emmanuel Sanders on what fans should expect from Joe Flacco this season. \"He's a baller. He's probably one of my favorite quarterbacks to play with all-time, him and Peyton (Manning).\" Copyright 2019 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}, {"articleID": "2018091216_00433600_W", "names": {"Richard Martin": ["Q16203893", "Q16266799", "Q3431026", "Q7327662", "Q7327664", "Q7327665"]}, "date": "2018-09-13", "url": "http://www.channelnewsasia.com/news/sport/spanish-anti-doping-agency-investigates-russia-winger-cheryshev-10710326?cid=cna_flip_070214", "content": "Spanish anti-doping agency investigates Russia winger Cheryshev Toggle share menu Spanish anti-doping agency investigates Russia winger Cheryshev close breaking news Sport Spanish anti-doping agency investigates Russia winger Cheryshev Spain's anti-doping agency said on Wednesday it had opened an investigation into Valencia and Russia winger Denis Cheryshev, following remarks from his father Dmitri in the Russian media about an injection the player took to treat an injury. Soccer Football - UEFA Nations League - League B - Group 2 - Turkey v Russia - Medical Park Arena, Trabzon, Turkey - September 7, 2018 Russia's Denis Cheryshev celebrates scoring their first goal REUTERS/Murad Sezer13 Sep 2018 12:36 AM Bookmark BARCELONA: Spain's anti-doping agency said on Wednesday it had opened an investigation into Valencia and Russia winger Denis Cheryshev, following remarks from his father Dmitri in the Russian media about an injection the player took to treat an injury. \"We can confirm we have started an investigation to find out more information about the case,\" said a spokesman from the AEPSAD, the Spanish Agency for Health Protection in Sport, which is responsible for the fight against doping. Advertisement \"The investigation is being carried out with the co-operation of Russia's anti-doping agency and is in contact with the World Anti-Doping Agency (WADA).\" Cheryshev, who scored four goals in Russia's surprise run to the World Cup quarter-finals, has denied ever taking a banned substance. The investigation stems from an interview which Dmitri Cheryshev gave to Russian publication Sport Weekend during the World Cup, in which he was quoted saying his son had received an injection containing \"growth hormone\" in the run-up to the tournament to treat injury. On the eve of Russia's last-16 game against Spain, Cheryshev said: \"I have never used any prohibited substances and you don't even have to think twice about it .\" Advertisement Advertisement The Russian Football Union (RFU) said at the time that the treatment the player received had been a platelet-rich plasma (PRP) injection which is legal and said the journalist had incorrectly interpreted Dmitri Cheryshev's words. Cheryshev joined Valencia on loan from Villarreal in August. He scored in Russia's 2-1 win at Turkey in the UEFA Nations League last Friday. Valencia's director general Mateu Alemany said on Wednesday the club was unaware of the investigation, adding he believed the player's father had been misquoted. \"We haven't been notified about what has been published. If the player was involved in an investigation then they (the agency) should have told the club and the player,\" Alemany said. \"We have had no communication in any form, he was subject to controls at Villarreal and at the World Cup. After reading everything, I think it's an error in the transcription, because growth factors are not the same as growth hormones .\" (Reporting by <mark>Richard Martin</mark>; Editing by Toby Davis) Source: Reuters"}, {"articleID": "2008091313_00032751_W", "names": {"Calvin Johnson": ["Q857634", "Q942680"], "Barry Sanders": ["Q809092", "Q809097"], "Roy Williams": ["Q17414660", "Q18391329", "Q18706111", "Q21035306", "Q2170754", "Q30716994", "Q321623", "Q3445837", "Q3445839", "Q7373500", "Q7373502", "Q7373504", "Q7373505", "Q7373506"], "Randy Moss": ["Q16193260", "Q462925"], "Greg Jennings": ["Q1544938", "Q5605252"], "Mike Mccarthy": ["Q1933317", "Q21062541", "Q22279122", "Q506866", "Q6847875", "Q6847876", "Q6847877"]}, "date": "2008-09-13", "url": "http://nbcsports.msnbc.com/id/26676775", "content": "detroit (ap) - <mark>calvin johnson</mark> is the quietest spectacular athlete to play for the detroit lions since <mark>barry sanders</mark> played his final season a decade ago. the no. 2 pick in the nfl draft last year usually says just a few words when reporters ask him questions and rarely makes eye contact. \"i'm just quiet,\" <mark>johnson</mark> insists. \"the media can twist words even when you don't say much, and i've been burned a couple of times. it happened in college and here .\" while being understated and standoffish comes naturally, it's also a calculated move by <mark>johnson</mark> because he figures the media will leave him alone at times. clearly, <mark>johnson</mark> would rather let his skills speak for him, and the next time they'll be on display will be sunday in detroit's home opener against the green bay packers. if he plays anything like he did in last week's loss at atlanta, his game will have a lot to say. he matched a career high with seven catches and broke a personal mark with 107 yards, 38 of which came on a short crossing pattern that left the falcons in the dust. \"that play impressed me,\" teammate <mark>roy williams</mark> said. \"two guys were coming at him and he pulled away. that's awesome. you can't coach that. receivers coach shawn jefferson agrees, saying he's working with a player who physically looks like a young <mark>randy moss</mark> - with a better attitude .\" that's exactly what he is, but i think he'll be better, \"jefferson said .\" i'm not taking a jab at <mark>randy moss</mark>, but this guy wants to block and run dummy routes down the middle of the field if that helps the team. and, this kid has the mental makeup to be great, and this year he's taking a step toward that because he has worked so hard on his footwork. \"<mark>johnson</mark>'s rookie year was stunted after he hurt his back in week 3, limiting him the rest of the year. he finished with a respectable 48 receptions, 756 yards and four touchdowns .\" it took me a whole offseason to truly get healthy, \"he said .\" now, everything has slowed down for me. \"that's a scary thought for anyone trying to defend him .\" he's going to do things in this league that will make people say, \"i haven't seen that before,\" ' detroit quarterback jon kitna predicted. <mark>greg jennings</mark>, a second-round pick in 2006 from western michigan, led the team with 12 touchdown receptions last year. he also had 920 yards receiving despite missing two games with an ankle injury, and resting with other banged-up starters in the regular-season finale against detroit. \"i think he got everybody's attention last year,\" packers coach <mark>mike mccarthy</mark> said. unlike <mark>johnson</mark>, the 5-foot-11, 198-pound <mark>jennings</mark> doesn't dominate competition with his size and speed. \"one thing about playing receiver, it's not about the size of a guy, it's about the heart,\" <mark>jennings</mark> said. \"it's about going up and getting the ball and making sure that either you get it, or nobody gets it .\" <mark>jennings</mark> consistently finds a way to get open, rack up yards after the catch and make big plays such as the 56-yard, leaping reception that set up green bay's first td in its win over the vikings. <mark>jennings</mark> finished with five receptions for 91 yards on the receiving end of passes from aaron rodgers in his starting debut. \"<mark>greg jennings</mark> is definitely an up-and-coming front-line player in this league,\" <mark>mccarthy</mark> said. \"i thought the performance that he had on monday night was hopefully a start of a great season for him .\" chances are, <mark>jennings</mark> is going to follow with another strong performance in front of friends and family about 125 miles east of his hometown kalamazoo. he has eight catches for 161 yards and three scores in two games at ford field against the lions. his mom handles the ticket requests for the homecoming game, and the total will fall somewhere between \"a whole bunch,\" and fewer than 100. some would use the same word to describe the lions, who are an nfl-worst 31-82 since 2001 and have won only one playoff game since winning the nfl title in 1957. but <mark>jennings</mark> knows when the lions are counted out, sometimes they put together a surprising performance. \"i've been watching them all my life,\" <mark>jennings</mark> said, \"been rooting for them practically all my life, and they're a scary team because you don't know what team's going to show up .\" © 2008 the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2009053106_00018666_W", "names": {"Charles Payne": ["Q2215790", "Q5081545", "Q5081547"]}, "date": "2009-05-31", "url": "http://fayobserver.com/article?id=328029", "content": "what email address would you like us to send it to? washington - surely, stanley dunham was gazing skyward 65 years ago, on d-day. dunham, the man whom barack obama would one day call gramps, was a 26-year-old supply sergeant stationed near the english channel with the u.s. army air forces when the invasion of normandy at last began. six weeks later, he crossed the channel, too, and followed the allied front across france. a year later, he was on track to fight in japan when the atom bomb sent him home instead. dunham, who died 17 years ago, was the kansas-born grandfather with the outsized personality who helped to fill the hole in the future president's life created by the absence of obama's kenyan father. sgt. dunham's war years have been something of a mystery, the details of dates and places lost with the passage of time. the units that he served in were unknown even to the white house. but a life-size portrait emerges from interviews and records unearthed by the associated press. on d-day, documents place him at stoney cross, england, in the 1830th ordnance supply and maintenance co., aviation. \"this was the day we had all been waiting for,\" dunham's commanding officer wrote the night of june 6 from their base near the english channel. \"planes by the hundreds took off and landed at our field from dusk until dawn .\" his company supported the 9th air force as it prepared for the assault on normandy and took part in the drive that carried the allies across france. dunham and the men of the 1830th came across six weeks after the initial normandy invasion and followed the front through france, servicing airfields known by numbers - a-2, a-44, a-71, and more - in places such as brucheville, cricqueville, st.-jean-de-daye, peray, clastres, juvincourt and saint-dizier. on this coming saturday, the 65th anniversary of d-day, obama will visit the gravesites and beaches of normandy and look out across the channel that his grandfather crossed from a staging area at southampton, england. \"i knew him when he was older,\" obama said of his grandfather in 2007. \"but i think about him now and then as he enlisted - a man of 23, fresh-faced with a wise-guy grin .\" to the 75 men of dunham's company, he was a good guy to have around. for one thing, he taught the men how to use their new gas masks. he also came up with a radio, games and books for a day room that dunham's commanding officer described as \"a swell place to spend an evening .\" and when the 1830th had a party in the gym three days after d-day, they had dunham to thank for it. on may 31, 1944, payday, dunham had taken up a collection of 35 british pounds - about $150 in today's dollars - to finance the event. he lined up a convoy of girls from southampton who, the men hoped, would be \"simply smashing,\" as his commanding officer, frederick maloof, wrote in his diary. \"the party was a huge success, except that the beer ran out about 10:30 p.m.,\" 1st lt. maloof later reported. \"all agreed that the orchestra was good. a few of the die-hards were still crooning over the empty beer barrels at an early morning hour .\" for all the good times, the strains of war were ever present for dunham and his fellow soldiers. on the evening after d-day, dunham's unit dug 27 foxholes. \"this was done in case of a retaliation by the germans,\" maloof wrote. on june 11, the first hospital ships returned from france, bringing tales of the \"hardships encountered on invasion day .\" that same day, maloof wrote that \"our mail has not been reaching home, and the wives and sweethearts are beginning to wonder if we have gone across the channel on the first wave .\" the wives included madelyn dunham, back home in wichita, kan., with stanley ann, a toddler who would grow up to be obama's mother. madelyn, the beloved grandmother known as \"toot\" who helped raise the future president, did her part for the war effort, working the night shift as a supervisor on the b-29 bomber assembly line at the boeing plant. her brother is part of the war story, too. <mark>charles payne</mark>, obama's great-uncle, in 1945 helped liberate a sub-camp of the nazi concentration camp at buchenwald, which obama will visit this friday. stanley dunham's older brother ralph, another great-uncle to obama, also is a branch in the wartime family tree. ralph was called up after stanley enlisted. he landed at normandy's omaha easy red beach on d-day plus four, then worked his way through france, italy and germany as an assignment and personnel officer. in the months before the invasion, the brothers met up twice in england while on leave. once, they came across each other by happenstance in london, where ralph was staying at the russell hotel. \"i walked down the steps, and there was my brother, sitting on a settee,\" 92-year-old ralph dunham said in interview with the ap. late in july, six weeks after d-day, stanley dunham's unit crossed the english channel and landed at omaha beach. \"after looking over the atlantic wall, with its pill boxes, we all agreed it was a miracle that the allies were able to land,\" maloof wrote. in his autobiography, obama reports that during the war his grandfather was \"sloshing around in the mud of france, part of patton's army .\" that's right, at least for a few months. in february 1945, at saint-dizier, dunham's unit was assigned to patton's 3rd army, and dunham remained in that company until early april. prior to february, dunham's unit had supported 1st army operations. obama sketches dunham as a man with a wild streak early on who settled down to sell furniture and life insurance. by the time he joined the army, he already had lived large. dunham also had fallen in love with a woman from the other side of the tracks - the good side - and married her. he eloped with madelyn <mark>payne</mark> just before the bombing of pearl harbor, on dec. 7, 1941, and he was quick to enlist after the japanese attack. \"he was really gung-ho,\" remembers ralph. \"he didn't have to go because he was married. he could have held off .\" he was inducted at fort leavenworth, kan., on jan. 15, 1942."}, {"articleID": "2014021114_00015779_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Jeremy Hunt": ["Q333533", "Q929730"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "Philip Hammond": ["Q18388174", "Q332987"], "Theresa May": ["Q264766", "Q30161835"], "William Hague": ["Q19596830", "Q58282"], "Owen Paterson": ["Q197894", "Q345827"], "Patrick Mcloughlin": ["Q333267", "Q7147184"], "Maria Miller": ["Q23020994", "Q334261"], "David Jones": ["Q10450056", "Q1174792", "Q1174894", "Q1174896", "Q16105375", "Q16945194", "Q17314899", "Q18350685", "Q18921618", "Q19665551", "Q20655901", "Q20732856", "Q21467224", "Q21467227", "Q24007312", "Q24007313", "Q260857", "Q2747788", "Q27906151", "Q27983475", "Q3018172", "Q312803", "Q4042624", "Q458276", "Q49193215", "Q50633601", "Q51397308", "Q52356357", "Q5235721", "Q5235722", "Q5235734", "Q5235735", "Q5235742", "Q5235743", "Q5235745", "Q5235746", "Q5383", "Q54666079", "Q56248428", "Q56507984", "Q56596961", "Q56604601", "Q57497739", "Q57552289", "Q728167"], "Simon Clark": ["Q19665441", "Q2082072", "Q7518465", "Q7518467"]}, "date": "2014-02-11", "url": "http://www.timesofmalta.com/articles/view/20140211/world/uk-mps-vote-to-ban-smoking-in-cars.506271", "content": "Press Association Commons votes to ban smoking in cars carrying children Campaigners have welcomed plans backed by MPs which could save hundreds of thousands of children from being exposed to second-hand smoke in cars. Leading medical charities said they were \"delighted\" that the House of Commons had voted in favour of paving the way for for legislation which could outlaw smoking in vehicles carrying children. The Commons gave the Health Secretary the power to impose a ban despite the opposition of some MPs, including leading members of the Cabinet. Ministers were granted a free vote on the measure - successfully introduced by Labour in a House of Lords amendment to the Children and Families Bill - meaning they were not tied to a party line. The British Medical Association (BMA), which has campaigned for a ban since 2011, said the vote was an \"important step forward in reducing tobacco harm\". Dr Penny Woods, chief executive of the British Lung Foundation, said: \"Having campaigned on this issue for many years, we're absolutely delighted that MPs have backed the ban on smoking in cars carrying children .\" This could prove a great leap forward for the health of our nation's children. \"The introduction of a law that would help prevent hundreds of thousands of children from being exposed to second-hand smoke in the car is now within reach .\" With both Houses of Parliament having made their support for the ban clear, the onus is now on the Government to act accordingly and make this crucial child protection measure law at the earliest opportunity. \"The charity estimates that in England more than 430,000 children aged 11 to 15 are exposed to second-hand smoke in cars every week. Research published by the organisation last year concluded that 185,000 children of the same age are exposed to smoke while in the family car on\" most days \", if not every day. Deborah Arnott, chief executive of health charity Ash (Action on Smoking and Health) described the vote as\" an historic victory for Parliament and for children's health \". Tory and Liberal Democrat MPs joined forces with Labour MPs to approve the ban by 376 votes to 107, majority 269. Prime Minister <mark>David Cameron</mark> missed the vote while visiting flood-stricken areas in the south west. Mr <mark>Cameron</mark>'s official spokesman declined to say which way the Prime Minister would have voted had he been able to attend Parliament. But he told a regular Westminster media briefing:\" While he understands the concerns that some have expressed, his view is that the time for this kind of approach has come. \"Health Secretary <mark>Jeremy Hunt</mark> was in favour of the move, together with Chancellor <mark>George Osborne</mark>, Chief Secretary Danny Alexander, Defence Secretary <mark>Philip Hammond</mark> and Education Secretary Michael Gove, International Development Secretary Justine Greening, Scotland Secretary Alistair Carmichael and Energy Secretary Ed Davey. Justice Secretary Chris Grayling was in the\" no \"camp of those who said it was unenforceable. Home Secretary <mark>Theresa May</mark>, Work and Pensions Secretary Iain Duncan Smith and Northern Ireland Secretary Theresa Villiers also opposed the ban. Deputy Prime Minister Nick Clegg missed the vote but has spoken out against attempts to\" sub-contract responsible parenting to the state \". Also missing were Foreign Secretary <mark>William Hague</mark>, Business Secretary Vince Cable, Communities Secretary Eric Pickles, Environment Secretary <mark>Owen Paterson</mark>, who is out recovering from eye surgery, Transport Secretary <mark>Patrick McLoughlin</mark>, Culture Secretary <mark>Maria Miller</mark> and Wales Secretary <mark>David Jones</mark>. Shadow public health minister Luciana Berger welcomed the result as a\" great victory for child health \"but warned ministers not to\" kick this into the long grass \". But pro-smoking groups branded the move as an\" unnecessary intrusion \". <mark>Simon Clark</mark>, director of the smokers' group Forest, said he was\" disappointed but not surprised \"by the decision and accused the Government of being\" spineless \". He added:\" Legislation will have very little impact because so few adults still smoke in cars carrying children. Those that do will carry on because it will be very difficult to enforce. \"Government has banned smoking in public places. Now they're going to ban it in a private place. The home will be next .\" Health Minister Jane Ellison told MPs the success of a smoking ban in cars carrying children will not be measured by the number of times the police enforce it. Instead, she said, its success would be gauged by the reduction in exposure to second-hand smoke. AA president Edmund King said: \"As has been the case with enforcing the ban on hand-held phones while driving, campaigns and legislation have been shown to reduce illegal behaviour afterwards. If a new law manages to make more adults think twice before lighting up with the kids on board, it will have helped .\" Comments are submitted under the express understanding and condition that the editor <mark>may</mark>, and is authorised to, disclose any/all of the above personal information to any person or entity requesting the information for the purposes of legal action on grounds that such person or entity is aggrieved by any comment so submitted. A subscription is required to access Times of Malta content from overseas."}, {"articleID": "2014122320_00049307_W", "names": {"Shawn Levy": ["Q323076", "Q39444311"]}, "date": "2014-12-23", "url": "http://tuscaloosanews.com/article/20141223/NEWS/141229878/1226/ENT?Title=Seth-Rogen-James-Franco-others-react-to-The-Interview-release", "content": "Seth Rogen, James Franco, others react to \"The Interview\" release FILE - In this Dec. 11, 2014 file photo, actors Seth Rogen, right, and James Franco attend the premiere of the Sony Pictures' film \"The Interview\" in Los Angeles. Sony Pictures Entertainment announced Tuesday a limited theatrical release of \"The Interview\" beginning Thursday, putting back into the theaters the comedy that prompted an international incident with North Korea and outrage over its cancelled release. Sony Entertainment CEO Michael Lynton said Tuesday that Seth Rogen's North Korea farce \"will be in a number of theaters on Christmas Day .\" He said Sony also is continuing its efforts to release the film on more platforms and in more theaters. (Photo by Dan Steinberg/Invision/AP, File) Published: Tuesday, December 23, 2014 at 2:15 p.m.. Last Modified: Tuesday, December 23, 2014 at 2:16 p.m. LOS ANGELES | Celebrities and others react to Sony's announcement Tuesday that it will release Seth Rogen and James Franco's embattled North Korean satire, \"The Interview,\" in some theaters on Christmas: - \"The people have spoken! Freedom has prevailed! Sony didn't give up! The Interview will be shown at theaters willing to play it on Xmas day!\" - Rogen on Twitter. - \"VICTORY!!!!!!! The PEOPLE and THE PRESIDENT have spoken!!! SONY to release THE INTERVIEW in theaters on XMAS DAY! CELEBRATING!!!!!\" The Interview \"starring Seth Rogen and James Flacco saved by President Obacco! I MEAN PRESIDENT OBAMA!!!!! Sorry!!!\" - Franco on Instagram. - \"Thanks to everyone who didn't give up on our movie! @ Sethrogen & I are humbled & overwhelmed by your support. Hope you enjoy the film!\" - \"The Interview\" co-writer-director, Evan Goldberg, on Twitter. - \"Can't wait for Ben Affleck's film about the making, marketing and release of\" The Interview. \"#OscarWatch 2019\" - \"Night at the Museum\" director <mark>Shawn Levy</mark> on Twitter. - \"...Just as I hoped, indie movie theaters step up. Good!\" - Salman Rushdie on Twitter. - \"We are proud to make it available to the public and to have stood up to those who attempted to suppress free speech .\" - Sony Entertainment chief Michael Lynton in a statement. - \"\"The Interview\" to screen Xmas day in Austin & Atlanta. So our free speech is finally safe again. Glad that's over. #Sony \"- Actor Harry Shearer on Twitter. -\" This is the best Christmas gift anyone could give us. We, both distributors and exhibitors, have collectively stood firm to our principles and for the right to freedom of expression. Two days til Christmas, and I am proud to be an American. \"- Tim League, chief of Alamo Drafthouse Cinema theaters in a statement. -\" Glad to see @ JamesFrancoTV and @ Sethrogen happy and plugged in again. Welcome back guys, we missed you! #TheInterview \"- Rob Lowe on Twitter. Witness: Car seen speeding away from fire at Rolando McClain's home"}, {"articleID": "2009021017_00022969_W", "names": {"Stephen Jordan": ["Q7609627", "Q7609628", "Q924344"], "Henry Moore": ["Q14949207", "Q16227692", "Q5725978"]}, "date": "2009-02-10", "url": "http://independent.co.uk/arts-entertainment/art/news/angel-of-the-south-to-be-giant-white-horse-1605987.html", "content": "an artist's impression of the horse by mark wallinger a giant white horse was announced today as a new £ 2 million public art commission in south-east england dubbed the \"angel of the south\". the winning design, by former turner prize winner mark wallinger, was selected from a three-strong shortlist as part of the ebbsfleet landmark project. his design will see a horse standing on all four hooves at 33 times life-size. once built, the artwork will dominate the north kent landscape, standing as high as nelson's column at around 164ft (50m). today's announcement was made at swan valley community school in swanscombe in kent, which overlooks the springhead park area where the giant statue will be built. the sculpture will be seen by up to 60 million people per year and will be more than twice as tall as antony gormley's 66ft (20m) high angel of the north sculpture in gateshead in 1998. wallinger said: \"this is a tremendously exciting project. there was some very tough competition and i am honoured that the horse has won through .\" the other two shortlisted designs included a steel latticework \"nest\" by richard deacon and a tower of stacked cubes by daniel buren. project leaders hope the work will act as a symbol for the new ebbsfleet valley development and ebbsfleet international railway station. the next stage is to start the planning process with the local authority, gravesham borough council, which is expected to last at least 12 months. wallinger said: \"i and the team very much look forward to working with gravesham borough council as the planning process progresses .\" planners aim to transform the area with up to 10,000 new homes, offices, shops and community facilities across a 400-acre site. more than 50,000 people commented on the design proposals during a public exhibition last year at the bluewater shopping centre near dartford. the board of the ebbsfleet landmark project endorsed the decision of the ebbsfleet landmark project selection panel after considering the comments. victoria pomery, chair of the ebbsfleet landmark project selection panel, said: \"our decision was made on artistic merit and mark's outstanding response to the brief. i am confident it is the right one .\" mark is a superb artist of world renown and his sculpture will become a real landmark for ebbsfleet and the whole region. \"more than £ 1 million has been raised to date by the project's founding patrons - eurostar, land securities and london & continental railways. speaking on behalf of the patrons, <mark>stephen jordan</mark>, chair of the ebbsfleet landmark project board, said:\" in spite of the current recession, this project remains important for the 25-year task of building sustainable communities in the ebbsfleet valley and strong economic development around ebbsfleet international station. \"all involved are committed to design excellence and mark's stunning concept reflects that aim .\" now we can focus the further technical development and other practical studies on just one design as we find out what the planners make of it. \"ben ruse, of london & continental railways, said it was\" impossible \"to predict a completion date after being questioned on whether it will be finished by the 2012 olympics in london. he said:\" the important thing for us is that, now we have got the design, we will not compromise and it's not something we will lumber the kent countryside with. \"born in chigwell, essex, in 1959, wallinger studied at the chelsea school of art and at goldsmiths college, where he also later taught. he exhibited throughout the 1980s and in 1993 was included in the young british artists ii exhibition at the saatchi gallery. he was also one of the artists featured in the sensation exhibition at the royal academy of arts in 1997. in 1998 he was awarded the <mark>henry moore</mark> fellowship at the british school in rome and in 2000 a retrospective of his work, credo, was exhibited at tate liverpool. in 2007, he won the turner prize for his painstaking recreation in the duveen galleries at tate britain of brian haw's protest display outside parliament at westminster. wallinger said his design was a\" symbol that's spectacular \". speaking of the significance of the site, he said:\" this has been a route in and out of the country for millennia. as an incredibly ambitious project which is going to take 25 years, it's going to be nice for people to say' i live by the white horse'. \"most new towns are known more for roundabouts than sculptures. lots of things came together quite quickly for me to decide on the white horse. tuesday, 10 february 2009 at 04:58 pm (utc)"}, {"articleID": "2018022220_00826410_W", "names": {"Barry Brown": ["Q4864046", "Q4864047", "Q4864048", "Q4864049", "Q4864052"]}, "date": "2018-02-22", "url": "http://kake.com/story/37569498/former-nfl-players-wichita-restaurants-seized-over-back-taxes", "content": "Former NFL player's Wichita restaurants seized over back taxes Posted: Follow @ KAKEnews WICHITA, Kan. (KAKE) - Authorities have seized the assets of a former NFL player's two Wichita restaurants because he owes more than $80,000 in back taxes. Agents from the Kansas Department of Revenue and Sedgwick County Sheriff's Office on Wednesday seized the assets of Wings & Things LLC. The KDOR said the delinquent state sales and withholding tax owed by 34-year-old Kamerion Wimbley totals $82,329.50. Wings & Things has two Wichita locations: 2800 East Central and 2624 East 21st Street North. The types of assets seized include all known bank accounts, on-site cash, business inventory, as well as personal property belonging to Wimbley. The business was sealed closed with a public notice posted on the outside. Andover restaurant seized over back taxes All seized assets will be sold at public auction and the proceeds will pay for the delinquent taxes. The KDOR says its policy and practice is to work with taxpayers in delinquent status to voluntarily enter into repayment agreements. \"It is only after these efforts and multiple failed collection attempts that the Department is forced to execute a tax warrant, utilizing such actions as bank levies, till taps, and ultimately asset seizure to ensure compliance with the law .\" Wimbley, a Wichita Northwest High School graduate, played for the Cleveland Browns, Oakland Raider and Tennessee Titans. Kansas students arrested stolen gun found in car at school Jace Sull (left) and Chase Weaver Authorities say a Kansas high school student has been arrested after a stolen gun was found in his car on Wednesday. Authorities say a Kansas high school student has been arrested after a stolen gun was found in his car on Wednesday. With a winter storm in the forecast, these events have been cancelled or changed. With a winter storm in the forecast, these events have been cancelled or changed. Updated: Thursday, February 22 2018 3:29 PM EST 2018-02-22 20:29:31 GMT The stepmother of a missing 5-year-old Wichita boy has been booked into the Sedgwick County Jail. The stepmother of a missing 5-year-old Wichita boy has been booked into the Sedgwick County Jail. Former NFL player's Wichita restaurants seized over back taxes Agents from the Kansas Department of Revenue and Sedgwick County Sheriff's Office on Wednesday seized the assets of Wings & Things LLC. Agents from the Kansas Department of Revenue and Sedgwick County Sheriff's Office on Wednesday seized the assets of Wings & Things LLC. House passes body camera bill The Kansas House has passed bills aimed at making law enforcement more transparent by revising laws dealing with officers' body camera footage and agencies' seizure of property. The Kansas House has passed bills aimed at making law enforcement more transparent by revising laws dealing with officers' body camera footage and agencies' seizure of property. Morris helps No. 13 Wichita State hold off Tulane, 93-86 Shaquille Morris had 25 points and nine rebounds to help No. 13 Wichita State outlast Tulane 93-86 on Wednesday night. Conner Frankamp scored six of his 18 points in the final four minutes, Shaquille Morris had 25 points and nine rebounds to help No. 13 Wichita State outlast Tulane 93-86 on Wednesday night. Conner Frankamp scored six of his 18 points in the final four minutes, <mark>Brown</mark>'s 14 second-half points pushes Kansas State past Texas <mark>Barry Brown</mark> scored 14 of his 16 points in the second half and Kansas State pulled away late to beat Texas 58-48 on Wednesday night. <mark>Barry Brown</mark> scored 14 of his 16 points in the second half and Kansas State pulled away late to beat Texas 58-48 on Wednesday night."}]