[{"articleID": "2011122608_00014441_W", "names": {"Magic Johnson": ["Q134183", "Q7490891"], "Chris Paul": ["Q1077636", "Q46040", "Q56754195"], "Mike Brown": ["Q1102021", "Q16200455", "Q16213884", "Q17306282", "Q1933055", "Q1933070", "Q2757687", "Q298913", "Q3313242", "Q3857364", "Q41790047", "Q4274643", "Q437776", "Q458065", "Q6380458", "Q6846151", "Q6846155", "Q6846156", "Q6846157"], "Troy Murphy": ["Q456702", "Q48618555"], "Bill Walker": ["Q18159074", "Q25473882", "Q4911260", "Q4911261", "Q4911262", "Q4911263", "Q4911264", "Q4911267", "Q547758", "Q862635"]}, "date": "2011-12-26", "url": "http://bleacherreport.com/articles/997589-a-mixed-bag-five-takeaways-from-the-los-angeles-lakers-first-nba-game", "content": "<mark>magic johnson</mark> answered his own question during halftime of the the lakers trailed chicago by seven points at the half of their game and l.a. just looked like a team that, despite its hustle, was a bit shorthanded and a lot out of sync. oh yeah, right, that's because they were. l.a. was playing without center andrew bynum and last year's sixth man of the year, lamar odom; the former serving a four-game suspension and the latter having become a dallas maverick after complaining to management for not informing him that he was to be part of the <mark>chris paul</mark> - to-l.a. deal that later was nixed by the league. the new-look lakers gave an inspiring performance in their 88-87 loss to the bulls sunday afternoon at staples center. the fact that they couldn't hold onto an 11-point lead late in the fourth quarter and missed big free throws that would have clinched the game were the biggest disappointments in an otherwise solid season opener for the purple and gold. lakers fans expect victories and championships, so to say it was a satisfying performance for new coach <mark>mike brown</mark> and company would not be fair. a loss stings any way you cut it. still, there were a number of positives to come from this loss, and the lakers will take those into sacramento as they take on the kings tonight in their second of three consecutive games to start the season. what can we surmise from just one game of the regular season? does this team have what it takes to win, compete and contend for the championship? <mark>magic</mark> says \"no way .\" what do you think? kobe's wrist injury affects his ability to handle the ball kobe's wrist injury is affecting his play. although bryant had 28 points (11-of-23 from the floor), seven rebounds, six assists and two steals, he also had eight turnovers-and that statistic alone is glaring. it was obvious that his injury (torn ligaments in his right wrist) affected his ability at times to handle the ball, especially in heavy traffic. true, it's the beginning of the season and teams will have more than their fair share of turnovers. but kobe's were due mainly to his inability to hold on to the basketball at key moments in the game. he actually appeared to further injure the hand late when he landed hard on the floor after making a spectacular turnaround baseline jumper over two bulls to keep l.a. in the lead. the team is taking kobe's condition day by day, and is hopeful he'll be able to go against the kings tonight and utah back at staples center on tuesday. the injury did not appear to hinder kobe's ability to make shots, but it did affect his control of the ball. the lakers can only hope their perennial all-star can play through the pain. he said he was fine, though it was obvious from his expressions that it the injury was bothering him. as kobe's health goes, so go the lakers. 2. devin ebanks gives the lakers much-needed young energy on the court small forwards devan ebanks and veteran metta world peace played about the same number of minutes against the bulls. what's obvious is that ebanks is athletic, poised and deserving of more playing time than mwp. ebanks made a number of nice plays sunday in scoring eight points on 4-of-5 shooting from the floor. he was the only lakers starter without a turnover and he brought the ball up the floor a couple of times, showing his ability to take on numerous roles. on one particular play in the second half, bryant led the team on a three-man fast break and found a streaking ebanks on the right flank for a beautiful bounce pass and finish at the basket. it reminded one of a young trevor ariza and emphasized the lakers' ongoing need for young, energetic legs to get up and down the court and spread their offense around. ebanks played a total of 23 minutes. he easily could play more and appears to have a bright future with the team. indiana and is admired by the coach for his tenacity and defense. but it was obvious sunday that <mark>brown</mark> plays no favorites. he elected to start ebanks and was happy with the outcome. 3. this team still has trouble with the three-point shot lakers starters took a total five shots from beyond the three-point arc, including two by pau gasol, which tells you something about their outside shooting. as good a shooter as gasol is from 15 to 18 feet, he should not be throwing up three-pointers. for the game, the team took 16 shots from the perimeter and made just four, which is an anemic 25 percent. <mark>mike brown</mark> feels if point guard steve blake gets enough minutes, he'll gain some confidence and knock down shots. blake played 23 minutes sunday and was on the court for the end of the game. it didn't help-he missed four of the six shots he took from downtown. the lone bright spot was rookie guard andrew goudelock, who made 2-of-3 from beyond the stripe. he has six points in 13 minutes and gave the team a catch-and-shoot option that hasn't really been in play since jordan farmar's days in l.a. several years ago. 4. the old pau gasol has not yet returned pau gasol played with a lot of heart sunday though it is obvious that his preferred position is power forward, not center. the bulls physical big men continually pushed him outside for most of his attempts and points. gasol finished with just 14 points sunday in 38 minutes of action. he took 14 shots and made six. two of those misses were from three-point range. gasol also missed four of the six free throws he attempted and two of those came in the waning minutes of the game. in essence, they cost the lakers the game. gasol needs to average 18-20 points per game for the team to be effective. he seemed to be playing out of place at times on sunday and that cost him a number of times. pau gasol can be a huge part of the lakers' success going forward. he may be playing with a chip on his shoulder at the moment, since the team was about to trade him in the <mark>chris paul</mark> deal. it's an awkward situation, yet he is handling it like the consummate professional he is. 5. <mark>mike brown</mark> was comfortable and capable in his coaching debut coach <mark>mike brown</mark> seemed unfazed by the glitz of hollywood in his debut for the lakers. he substituted players at the right time, called timeouts when the team needed them and generally gets a high mark. kobe bryant the ball with the lakers up by a point in the final minute. this time it was the player, bryant, who made the mistake. he should have held onto the ball when he was double - teamed and forced the bulls to foul him, rather than attempting to pass to pau gasol, have it intercepted and see chicago come down the court and win the game on a derek rose eight-foot floater in the lane. \"anytime we have a lead in that situation, we know a team's got to foul,\" said <mark>brown</mark> to dave mcmenamin of espnlosangeles.com. \"the shot clock was off and the ball went to the right player's hands. i'm not sure, i have not asked him why he jumped to make the pass. we would have liked for him to hold on to it and for them to foul him and him go knock down the two free throws .\" <mark>brown</mark> is missing a key player (center andrew bynum), has had a very brief time to look at several newcomers (forwards <mark>troy murphy</mark>, jason kapono and josh mcroberts) and is giving considerable minutes to a rookie (guard andrew goudelock) and small forward (devin ebanks). and yet he seemed in control of the situation on sunday and had the team ready to play. most importantly, the team's coach on the court-kobe bryant-came away impressed with a lot that went right on sunday. kobe told mcmenamin: \"they're (chicago) one of the best teams in the league and we did a phenomenal job holding them down defensively. we beat ourselves at the end with turnovers and free throws .\" what is the duplicate article? why is this article offensive? where is this article plagiarized from? amare stoudemire buys baller new mansion we'd like to send you the most entertaining what is bleacher report? the us's 4th largest sports media site with 20 million monthly readers. we deliver entertaining content about all the teams and topics in sports. we have the most popular newsletters for every major team in the us. @ bleacherreport: kevin garnett choking <mark>bill walker</mark> after losing to knicks nba predictions copyright? 2011 bleacher report, inc. all rights reserved."}, {"articleID": "2015111306_00012585_W", "names": {"Ryan Adams": ["Q27306062", "Q3453739", "Q437970"], "Kevin Hart": ["Q1740168", "Q3195712", "Q57439639", "Q618352", "Q6396452"]}, "date": "2015-11-12", "url": "http://nyblueprint.com/judd-apatow-and-friends", "content": "Shabbat & Holidays Judd Apatow and Friends Judd Apatow is one of the most important comic minds of his generation. He wrote and directed the films \"The 40-Year-Old Virgin\" (co-written with Steve Carell), \"Knocked Up,\" \"Funny People,\" and \"This is 40,\" and his producing credits include \"Superbad,\" \"Bridesmaids,\" and \"Anchorman .\" Apatow is the executive producer of HBO's \"Girls .\" He also executive produced \"Freaks and Geeks,\" created \"Undeclared,\" and co-created the Emmy Award-winning television program \"The Ben Stiller Show .\" His latest film is \"Trainwreck .\" He recently released \"Sick in the Head: Conversations About Life and Comedy,\" a collection of intimate, hilarious conversations with the biggest names in comedy from the past thirty years that spent ten weeks on the New York Times Best Seller List. All proceeds go to 826, a charity which provides free tutoring and literacy programs for kids. Judd began performing stand up at the age of seventeen, appearing on the 1992 \"HBO Young Comedians Special\" hosted by Dana Carvey. After a 20 year hiatus, Apatow recently returned to the stand up stage and performed on \"The Tonight Show with Jimmy Fallon .\" Last year he created \"An Evening with Judd Apatow and Friends,\" a comedy show at Largo at The Coronet in Los Angeles which benefits various charities and has included guests such as Randy Newman, Fiona Apple, Louis CK, Tig Notaro, <mark>Ryan Adams</mark>, Jackson Browne, <mark>Kevin Hart</mark> and Bill Burr. Having grown up on Long Island, Judd is thrilled to perform at Carnegie Hall for the first time."}, {"articleID": "2014071911_00012341_W", "names": {"Jimmy Rollins": ["Q15059522", "Q601982"]}, "date": "2014-07-19", "url": "http://bostonherald.com/sports/red_sox_mlb/mlb_coverage/2014/07/burnett_cant_solve_braves_in_messy_start", "content": "ATLANTA - A.J. Burnett was visibly upset with himself as he walked to the dugout after the last out of the fifth inning. It was easy to see why. \"Six runs in five innings pretty much nails it on the head,\" Burnett said. \"I was in counts where I should have made pitches and I didn't. That's the bottom line .\" Burnett gave up nine straight two-out hits, and the Philadelphia Phillies failed to score after the sixth in a 6-4 loss to the Atlanta Braves on Friday night. Jason Heyward homered and drove in two runs, and Andrelton Simmons had two RBIs for the Braves, who won their third straight game to take a one-game lead over Washington in the NL East. Last-place Philadelphia dropped 11 games behind Atlanta after losing its third straight. \"Not the start we wanted for the second half,\" Phillies manager Ryne Sandberg said. \"We had some good at-bats, though. I felt good jumping out with the two runs early. They came right back with four runs .\" The game was played in a steady drizzle, but the rain had nearly stopped when Braves closer Craig Kimbrel earned his 30th save in 34 chances. He got Marlon Byrd on a groundout and struck out Grady Sizemore and Cody Asche. Ervin Santana (8-6) gave up six hits, three walks and four runs - three earned - in six innings to win for the third time in four starts. He struck out one. Burnett (6-9) allowed six runs, 10 hits - the last nine with two out - and one walk in five innings. He had five strikeouts. \"Everything was up, man, everything was up,\" Burnett said. \"I was off. Heyward hit a changeup, and the curveball was up. A few innings in the middle, I got it where I wanted to, but I was inconsistent, and you can't pitch against this club and be inconsistent .\" The Phillies led 2-0 in the second on Asche's sacrifice fly and Cameron Rupp's RBI single, but they trailed 4-2 in the bottom half after Heyward hit his ninth homer, B.J. Upton had an RBI single, and Simmons drove in two runs with a double. Atlanta made it 6-2 in the fifth on RBI singles by Heyward and Tommy La Stella. Philadelphia cut the lead to 6-4 in the sixth. <mark>Jimmy Rollins</mark> reached on first baseman Freddie Freeman's fielding error and moved to third on Chase Utley's double. Both runners scored on Ryan Howard's broken-bat, two-run bloop single. <mark>Rollins</mark> led off the eighth with a walk against Jordan Walden, the third Atlanta pitcher, but he was thrown out at second base on Utley's strikeout. Heyward, the right fielder, ended the inning by charging in to make a diving catch of Howard's liner. \"In that situation, it was only a two-run game,\" Heyward said. \"If they keep having (at-bats), maybe they put up another run or two. Defense is going to win the game at the end of the day, but it's good to score runs, and it got us going a little bit .\" $ave on Boston Herald Home Delivery For back copy and collectible issue information please call 617-619-6265. Click here for Celtics, Patriots and Red Sox, and Bruins back copies Mass Literacy © Copyright by the Boston Herald and Herald Media."}, {"articleID": "2014111414_00065371_W", "names": {"Sam Kennedy": ["Q21063817", "Q7407741"], "David Connolly": ["Q1174052", "Q28672845", "Q441702", "Q5232517", "Q5232520"], "Ken Wilson": ["Q18640561", "Q6388703", "Q6388704", "Q6388705"], "Peter Nichols": ["Q50399024", "Q7176096"], "Richard Ellis": ["Q1153445", "Q41191700", "Q53952818", "Q716624", "Q7325486", "Q7325488", "Q7325489"]}, "date": "2014-11-13", "url": "http://nerej.com/79199", "content": "Counselors of Real Estate's Fall Convention in Boston Jill Hatton, CRE Members of the New England Chapter of the Counselors of Real Estate (CRE) joined counterparts from around the globe at the 2014 Annual Fall Convention at the Boston Fairmont Copley Plaza. The theme of the meeting was \"Legacy and Innovation: A Bridge to the Future of Real Estate\" and session topics were varied and included, among others, \"Real Estate Market Outlook,\" \"Where is the Capital Flood Looking to Go\" and \"The Changing Healthcare Industry and Its Impact on Doing Business .\" Mayor Walsh welcomed attendees to Boston and highlighted several of his key agenda items including: * Focus on strength of regional growth by collaborating with adjacent communities. * Targeting growth in underdeveloped areas, highlighting opportunities that will arise with 85 acres that will result at Beacon Yards. * Reiterating his platform for more housing - more senior housing, 16,000 beds of student housing to free up housing stock in neighborhoods, and creating workforce housing with tools such as potential zoning relief at transit hubs. The following are highlights of selected general sessions. Real Estate Market Outlook: Point/Counterpoint * Ray Torto, Ph.D., CRE noted real estate is in a sweet spot but all risks are not priced in, thus the potential for overbuilding exists. Ray noted the U.S. is the best of developed economies, thus attracting significant capital flows. As such, Torto notes as interest rates rise, cap rates may not rise significantly given this extensive capital in the system. * Doug Poutasse, CRE commented that some real estate is trading to bond investors and noted that while many believe U.S. interest rates are low, Spanish and Italian 10-year rates are lower than those in the U.S. with more country risk and German interest rates are .8%. 3D Printing * KC Conway, CRE treated the audience to a lively explanation of 3D Printing and how it will impact real estate and our lives. KC shared information on this evolving technology that is already being used to \"print\" BMW tire rims, breathable casts and pills. Processes are far along in \"printing\" skin, food and vaccines. * Directly relevant to real estate are printers that can \"print\" a housing shell of poured concrete in a week. * Issues that may arise from these emerging innovations include impacts to zoning, sales tax collection and disposal of waste arising from printing, some of which may be hazardous. The CRE attendees enjoyed an interactive session with <mark>Sam Kennedy</mark>, EVP/COO of Boston Red Sox and additional presentations on \"Being a Fiduciary,\" \"Emerging Trends in Real Estate,\" \"Business Issues Forums,\" and \"Samuels' Transformational Mixed-Use Development in the Fenway\" - among others - all of which provided rich content and take home value. The final New England CRE Chapter meeting of the year is planned for November 18th and will be hosted by <mark>David Connolly</mark>, Esq. at the offices of Hinckley, Allen & Snyder, LLP. <mark>Ken Wilson</mark>, CRE and CEO of Capital Hotel Management will speak on the topic \"HOTELS: Love Them or List Them? An Update of the Hospitality Market from Boston and Beyond .\" Invitations have been sent. 2014 New England CRE Chapter Officers * Jill Hatton, TurtleRock Investment Management, chapter chair and secretary. * <mark>Peter Nichols</mark>, NorthStar Ally LLC, vice-chair. * John Baczewski, Real Estate Fiduciary Services, LLC, treasurer. * Donald Bouchard, Lincoln Property Company, membership vice chair. * Julie McIntosh, Capital Crossing Servicing Co., LLC, board member. * Martha O'Mara, Corporate Portfolio Analytics, board member. * Harris Collins, CB <mark>Richard Ellis</mark> - NE Partners, board member. Jill Hatton, CRE, is the 2014 New England/Upstate N.Y. CRE chapter chair, Boston, Mass. ."}, {"articleID": "2010022707_00114287_W", "names": {"Fernando Gonzalez": ["Q12963933", "Q18637419", "Q208517", "Q5444736", "Q5444738", "Q5444739", "Q5444740", "Q5444742", "Q5859639", "Q5859641"]}, "date": "2010-02-27", "url": "http://timesofindia.indiatimes.com/sports/tennis/top-stories/Ferrer-vs-Ferrero-in-Mexican-final/articleshow/5623456.cms", "content": "acapulco: david ferrer defeated <mark>fernando gonzalez</mark> 6-7 (4), 6-0, 6-4 on friday to set up a mexican open final against best friend and fellow spaniard juan carlos ferrero. ferrero won his friday semifinal over juan monaco of argentina. ferrero took the first set 7-5 and advanced when monaco retired with a rib injury. it will be repeat of an atp final a week ago in buenos aires, where ferrero defeated ferrer for his second straight title on the latin american swing. saturday's decider could make it three. \"the streak i am on is really unexpected,\" ferrero said. \"the way tennis is right now it's very difficult to put together this kind of streak. i'm happy with the wins i am having .\" ferrer is looking for revenge--friend or no friend. \"he's my best friend on the tour, so that's good,\" ferrer said. \"but we'll try to get even with him. really, i'm happy for me and him .\" monaco was leading the opening set 5-4 when he took an injury time-out to treat an injury to the left side of his ribcage. he returned to the court and lost the next three games, handing the set to ferrero 7-5, and then retired. monaco said he felt the pain when he was leading 3-1 and it got worse, forcing him to seek treatment. he described it as a rib injury and said it was likely to keep him out of argentina's davis cup tie at sweden beginning march 3. he didn't know what caused it, and he said he'd never had a similar problem. argentina is already without injured david nalbandian and juan martin del potro. \"i was playing very well and had a good chance to win the match,\" monaco said. \"it's a shock. the impact is tough for me. surely i'll miss the davis cup .\" "}, {"articleID": "2017110723_00426156_W", "names": {"Anthony Hudson": ["Q4772753", "Q4772754"], "Tim Howard": ["Q16226269", "Q200785", "Q7803679"], "Steve Cooke": ["Q48976786", "Q7612265"]}, "date": "2017-11-07", "url": "http://www.denverpost.com/2017/11/07/claudio-lopez-colorado-rapids-overhaul/", "content": "Cyrus McCrimmon, The Denver Post Colorado Rapids director of soccer Claudio Lopez during Picture Day for the team at their headquarters in Commerce City on Thursday, March 12, 2015. By Daniel Boniface | dboniface @ denverpost.com | The Denver Post November 7, 2017 at 4:13 pm Sign up for newsletters and alerts Submit your news tips or photos Colorado Rapids director of soccer Claudio Lopez will not return for the 2018 season as part of a massive overhaul that will bring in three new front-office hires, up to 11 new players and a new head coach. Lopez, who joined the club's front office in December 2014, had his contract expire and the Rapids said they decided not to bring him back. \"There's no doubt it's going to be an offseason overhaul in here,\" Rapids interim general manager Padraig Smith told The Denver Post on Tuesday. \"Both on the field and off the field .\" Smith said the Rapids plan to restructure their front office with the hire of a new assistant general manager, director of player personnel and a head of sports science. He said the team hopes to fill the positions with outside hires by the start of preseason. Cyrus McCrimmon, The Denver Post Colorado Rapids sporting director Pádraig Smith during Picture Day for the team at their headquarters in Commerce City on Thursday, March 12, 2015. Meanwhile, Smith said the club is closing in on its new head coach, who the Rapids wanted to have in place by the beginning of November. \"We've identified the person that we want to take us forward,\" Smith said. \"And I think people can expect an announcement in the coming weeks .\" Smith said the search is \"definitely at the final stages now,\" after a global search that focused on finding someone who aligned with the club's attack-minded philosophy. Smith said the new coach will have a plan and track record of executing that vision. In recent weeks, the Rapids have been linked with New Zealand head coach <mark>Anthony Hudson</mark> in several reports, but Smith would not confirm whether <mark>Hudson</mark> was a candidate for the Rapids' job. <mark>Hudson</mark>'s New Zealand team is facing Peru in a two-match playoff series for a spot in the World Cup, with matches Nov. 11 and 15. <mark>Anthony</mark> Au-Yeung, Getty Images Head Coach <mark>Anthony Hudson</mark> of New Zealand looks on prior to the 2018 FIFA World Cup Qualifier match between the New Zealand All Whites and Solomon Island at North Harbour Stadium on Sept. 1, 2017 in Auckland, New Zealand. Asked what input a new coach would have on player acquisitions, Smith said that is why their exhaustive search was so important. \"When you identify a coach who shares the same philosophy and vision, then you obviously put yourself in a position where the players you're identifying are absolutely in line with everyone's thinking,\" Smith said. In the weeks since the season ended, Smith has had one-on-one conversations with all players on the roster and informed each one whether the club would pick up their options, but would not go into detail yet on which players would not return. \"I obviously want to speak to all the other MLS clubs as well to see if there's a potential deals in place,\" Smith said. Asked whom he considered cornerstone players that the club will build around going forward, Smith mentioned only <mark>Tim Howard</mark> by name. \"I'm excited about what we're trying to achieve this offseason,\" <mark>Howard</mark> said in a statement released by the club. \"There's a huge amount of potential at this club and I know we're all ready to get back to winning ways .\" Related Articles <mark>Anthony Hudson</mark> has caught the Rapids' eye. But for now, he's trying to lead New Zealand to the World Cup. <mark>Steve Cooke</mark> no longer being considered for Rapids head coach job Rapids enter the offseason with plenty of question marks Nicolas Lodeiro scores twice, Sounders beat Rapids in season finale Rapids beat Real Salt Lake in final home game of season Smith said the Rapids have identified a number of key additions they are targeting this offseason. In the short term, Smith said he's looking for a left wing back and an attacking midfielder. He said those players should play with intensity, urgency and boldness. \"I think what we need is a little more creativity and a little more soccer IQ and guile in the attacking midfield position centrally,\" Smith said. Smith said the Rapids have two scouts in Europe watching games and narrowing the team's search. \"I'll be heading off to Europe as well to watch some of our targets in the coming weeks,\" Smith said, adding that he may also head to South America to see some players the team is targeting."}, {"articleID": "2012091105_00063921_W", "names": {"Sam Houston": ["Q6834480", "Q7407635"]}, "date": "2012-09-11", "url": "http://houstonianonline.com/sports/bearkats-maul-incarnate-word-cardinals-in-season-opener-54-7-1.2760228", "content": "bearkats maul incarnate word cardinals in season opener, 54-7 published: tuesday, september 11, 2012 tim flanders rushed for 117 yards, breaking the shsu record for rushing yards as only a junior. bearkat running back tim flanders captured the all-time career rushing record for <mark>sam houston</mark> state university in saturday's landslide 54-7 victory against the university of incarnate word. \"i [told] all my offensive linemen\" thank you, \"i told [brian] bell\" thank you,' i told most of the receivers that i had a chance to see, \"said flanders .\" i'm blessed to have broken the record. i wanted to do it at flanders' touchdowns both came in the first quarter with a 40-yard run 45 seconds into the game and an eight yard run towards the end of the quarter. this was the running back's 16th career game with 100 plus yards, having 117 yards during the game. fieilo was carted off the field in a stretcher after sustaining an injury making a hard tackle on an incarnate word player. \"he went down with his head down,\" senior linebacker darius taylor said. \"i knew it was bad when he didn't move. eric is one of our toughest players. we just said a little prayer for him and wished him the best and now he's alright, he's been fieilo will move back to the starting lineup. sophomore back-up running back keshawn hill rotated with flanders throughout the game and showed his speed with two break-away touchdowns in the second half. hill is a heck of a back,\" head coach willie fritz said. \"sometimes having tim [flanders] back there some of the other running backs get overlooked. we got to do a good job calling plays for each of the defense, led by taylor, held the cardinals to a mere 88 yards compared to bearkat defense expected incarnate word to run the ball frequently after watching their videos against texas college the previous week .\" they couldn't run the ball, \"taylor said .\" they tried to do it early and that's what they tried to do last week [against texas college] as well. so coming into the game we knew we had to stop the run and i felt like we did had a slow start in the first quarter with a fumble on incarnate word's first punt on their opening drive. the cardinals quickly recovered the ball at their own 41-yard line. \"i thought we had a bunch of first game jitters,\" fritz said. \"we weren't very sharp and crisp. i think we calmed down a little bit [after the first half .]\" bearkats did a good job playing against incarnate word's special team formations and adjusting to their versatile punt strategy. \"they changed things up [with their punt formations],\" fritz said. \"they punted with a different guy? we had it played pretty early in the fourth quarter, senior wide receiver terrance robinson returned a punt for a 60-yard touchdown to seal the game as a to prepare for the game against baylor this saturday, coach fritz is expecting a week of corrections on both sides of the ball to be ready for the big 12 baylor bears .\" [we have] a lot of good things to correct on tape, \"fritz said .\" there are guys that earned more playing time; there are guys that earned less playing time. teams make their greatest improvements between week one and week in preparation for the baylor game this saturday, taylor is expecting a different outcome with the veteran bearkat squad compared to 2010's 3-34 loss against the bears. \"it's a big game for us. we were a young team [in 2010] and i think now we're a mature team,\" taylor said. will travel to waco and play against the baylor bears saturday at floyd casey stadium. kickoff is at 6:05"}, {"articleID": "2012071314_00094525_W", "names": {"Charles Green": ["Q17917702", "Q29514503", "Q5078396", "Q51584784"], "Steve Davis": ["Q1275803", "Q16201101", "Q30122863", "Q310450", "Q3529787", "Q7612349", "Q7612350", "Q7612351", "Q7612353", "Q7612354", "Q7612355", "Q7612356", "Q7612358"], "Steven Whittaker": ["Q1335180", "Q37379950"]}, "date": "2012-07-13", "url": "http://sportinglife.com/football/news/article/2/7897397/expert-green-player-deal-not-valid", "content": "/ expert: <mark>green</mark> player deal not valid expert: <mark>green</mark> player deal not valid last updated: july 13 2012, 15:31 bst newco rangers chief executive <mark>charles green</mark> faces a fresh blow in his battle to hold on to the the club's wantaway players as his purchase of their contracts is not valid, according to an employment law expert. <mark>green</mark>: purchase player contracts and registrations follow us on twitter the club's administrators, duff and phelps, revealed earlier this week that <mark>green</mark>'s? 5.5 million purchase of rangers' assets included a? 2.75 m payment to purchase the contracts and registrations of the players. duff and phelps, appointed by the court of session on february 14, broke down all the \"asset realisations\" and it was shown that <mark>green</mark>'s consortium paid for the club's employees to transfer to his company under tupe regulations, which protects employees' terms and conditions of employment when a business is transferred from one owner to another. however, on the advice of their union, pfa scotland, numerous players have rejected the opportunity to transfer their contracts from rangers to <mark>green</mark>'s sevco consortium. <mark>green</mark> rejects the claim that the players are free agents and the former sheffield united chief executive sent letters to clubs across the uk warning them that the players who objected to the switch to his new company were in breach of contract. international clearance for the transfers of <mark>steve davis</mark>, kyle lafferty, jamie ness, <mark>steven whittaker</mark> and steven naismith has been put on hold as <mark>green</mark> continues to dispute the players' status. naismith has moved to everton, <mark>whittaker</mark> has signed for norwich and ness has joined stoke. northern irish duo <mark>davis</mark> and lafferty are at southampton and swiss side sion respectively, while goalkeeper allan mcgregor is in talks with turkish club besiktas. despite <mark>green</mark> taking a firm stance, adrian hoggarth, the head of employment law at prolegal believes the deal struck may have been outside of the law. \"it is not legally possible for rangers and <mark>charles green</mark> to buy and sell players as part of a business transfer,\" he said. \"whether or not the players transferred in this case appears to depend on two things .\" firstly, were they assigned to the business of the football club when it transferred? this is a matter of law and this has nothing to do with any money that may have changed hands. \"secondly, were the players aware of the transfer at the time it took place? case law suggests that if you know about a transfer before it happens and don't object to it, you lose the right to object once the business transfers. if not, you don't."}, {"articleID": "2014082103_00023686_W", "names": {"Doug Smith": ["Q1251857", "Q15054504", "Q1606849", "Q18388709", "Q500575", "Q5300911", "Q5300912", "Q5300913", "Q5300915", "Q5300916", "Q5300917", "Q5300919"], "John Swan": ["Q28867802", "Q3182553"]}, "date": "2014-08-20", "url": "http://mv-voice.com/news/show_story.php?id=8436", "content": "LASD board members call it quits Two school district board trustees announce retirement following agreement with charter school Two board members at the Los Altos School District are leaving on a high note this year. Following approval of the five-year agreement with Bullis Charter School and approval of placing a facilities bond measure for the November ballot, <mark>Doug Smith</mark> and Mark Goines announced they will step down. Both <mark>Smith</mark> and Goines started working with board members at Bullis Charter School about a year ago on what would later become the five-year agreement. <mark>Smith</mark> had been on almost every one of the \"negotiating teams,\" and was one of two board members who stuck around until the early hours of the morning at mediation meetings to make sure the legal team was happy with every last comma in the agreement. But <mark>Smith</mark> won't take any special credit for the agreement. He said everyone on the board and the district staff put a significant amount of time and effort into the agreement, and helped to strike a comprehensive compromise between the district and the charter school. \"It's always a team effort,\" <mark>Smith</mark> said. He said that Randy Kenyon in particular, the district's assistant superintendent of business services, did a great job giving the board an idea of what the school district needed to provide to the charter school under Proposition 39. Though <mark>Smith</mark> did not say whether his decision to retire from the board hinged on the approval of the five-year agreement or the board's success in getting a bond measure on the November ballot, he did say that the new board members will be in a more stable position going forward. Though the five-year agreement and the ballot measure are fresh on everyone's minds, <mark>Smith</mark> said he's also proud of how much the district has improved the school programs over the years, which included throwing out the \"old model\" of teaching. \"When I ran five years ago, I really wanted to revamp the way we deliver curriculum,\" <mark>Smith</mark> said. He said the district has done a great job shifting away from lecture-style teaching and towards collaborative work and small group projects, where students divide up responsibility for the project and have specific jobs. \"If you look at kids leaving the program, they are able to work well with others, and they are inquisitive,\" <mark>Smith</mark> said. When elected to the board, one of the first things <mark>Smith</mark> had to do was hire a new superintendent for the district. He said the board's choice of Jeff Baier has worked out great, and that the board has had a \"fantastic\" relationship with him. \"We chose someone that we collaborate with well,\" <mark>Smith</mark> said. \"Jeff is always very well-prepared .\" In a statement addressed to the LASD community, Goines commended Baier and district staff for their service during his time on the board and for \"their dedication and excellent service to children .\" With <mark>Smith</mark> and Goines opting out of this year's school board election, five people will be vying for the three open seats. The decision by the two incumbents not to run gave the green light to Vladimir Ivanovic, a Gardner Bullis parent, who said his decision to run for a board seat hinged on whether <mark>Smith</mark> and Goines planned to run for re-election. He said the board has done a good job so far, and that there was no reason for him to run if all three incumbents sought re-election. Incumbent and current board president Tamara Logan will run for re-election this year. Other candidates are Martha McClatchie, a community volunteer and parent of three students at Bullis Charter School, Sangeeth Peruri, a Covington parent and member of the district's Citizens' Advisory Committee for Finance, and <mark>John Swan</mark>. About 25 percent of the district's students are Mountain View residents. More information on the candidates can be found in the July 18 edition of the Post a comment Posting an item on Town Square is simple and requires no registration. Just complete this form and hit \"submit\" and your topic will appear online. Please be respectful and truthful in your postings so Town Square will continue to be a thoughtful gathering place for sharing community information and opinion. All postings are subject to our Since this is the first comment on this story a new topic will also be started in Town Square! Please choose a category that best describes this story. * Enter the verification code exactly as shown, using capital and lowercase letters, in the multi-colored box."}, {"articleID": "2016090219_00699553_W", "names": {"Michael Heffernan": ["Q16209596", "Q55622979"], "Kirsten Hughes": ["Q16729963", "Q6416087"], "Charlie Baker": ["Q28051620", "Q5076629", "Q5084482", "Q56254750"]}, "date": "2016-09-02", "url": "http://www.thevalleydispatch.com/ci_30321674/guest-list-party-at-center-dcr-scandal-full", "content": "Guest list for party at center of DCR scandal full of VIPs The Lowell Sun Posted: 09/02/2016 03:23:20 PM EDT Roy Sun staff photos can be ordered by visiting our SmugMug site. By Colin A. Young STATE HOUSE NEWS SERVICE BOSTON--The list of guests invited to the July 3 bash thrown by two top Department of Conservation and Recreation officials using state resources is a veritable who's who of the executive branch and the state Republican Party--including cabinet secretaries, department heads, senior advisors and political big wigs. It is unclear who on the invite list--which the Executive Office of Energy and Environmental Affairs provided to the News Service on Friday--actually attended the party, which has landed DCR Commissioner Leo Roy and Deputy Commissioner Matthew Sisk in hot water and suspended from their jobs for a week without pay. Roy and Sisk have paid the state back more than $800 for the state resources they used to plan and host the party, which coincided with the Boston Pops Independence Day dress rehearsal concert at the Esplanade's Hatch Shell, a DCR property. The party was held at a condo owned by Ron Kaufman, the state's Republican national committeeman. Among those invited to the party were: Secretary of Energy and Environmental Affairs Matthew Beaton, Administration and Finance Secretary Kristen Lepore, Revenue Commissioner <mark>Michael Heffernan</mark>, state GOP chairwoman <mark>Kirsten Hughes</mark>, <mark>Baker</mark> Deputy Chief of Staff <mark>Michael</mark> Vallarelli, <mark>Baker</mark> Senior Advisor Tim Buckley, Legislative Affairs Director Ryan Coleman, Deputy Chief of Community Relations and Constituent Affairs Mindy d'Arbeloff, Commissioner of the Department of Energy Resources Judith Judson, Department of Environmental Protection Commissioner Martin Suuberg and 173 others. Advertisement The list provided contains a number of misspellings of people's names, and does not identify invitees by job title. Roy and Sisk used DCR-rented golf carts driven by DCR employees working at the Esplanade to ferry guests from the party to the Hatch Shell for a Boston Pops Independence Day dress rehearsal concert, according to a DCR memo. Earlier this week, Gov. <mark>Charlie Baker</mark> said he was not invited to the party, and said he did not learn of the bash until Beaton reported the misuse of state resources to him, according to an interview transcript provided by the governor's office. \"Let's face it, the most important thing we need to do as an administration, is to retain and manage public trust. And a big part of public trust is ensuring that we're playing by the same rules everyone else plays by,\" <mark>Baker</mark> said, according to the transcript. \"I think the fact they self-referred to the ethics commission, they've paid back any taxpayer funds sends a good message. But I also think the fact that the Secretary suspended them for a week without pay sends exactly the right type of message, which is that this is not the kind of behavior we support and we don't condone it .\" Groups representing both Democrats and Republicans have called on <mark>Baker</mark> to go beyond the one week unpaid suspension handed out to Roy and Sisk and fire both employees. But Democratic Attorney General Maura Healey said she thinks <mark>Baker</mark> has done enough to discipline Roy and Sisk, saying she does not \"think this was an issue of crimes .\" \"I think the administration took the right action. You've got to take swift immediate action. That is intolerable, unacceptable and I'm glad the administration took the action that it took,\" Healey told reporters Thursday at an event in Roxbury. \"The administration took the appropriate action, it appears. I don't know all the specifics of the matter .\" "}]