[{"articleID": "2019061406_00222656_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-06-14", "url": "http://www.gamereactor.eu/call-of-duty-black-ops-4/?sid=81f7318c7e544211aa9393726529dd2e", "content": "CALL OF DUTY: BLACK OPS 4 REVIEW. Written by Eirik Hyldbakk Furu on the 12th of October 2018 at 05 \"It sets the bar both in terms of quality and quantity for the franchise .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 7th of June 2019 at 10 See how the action will unfold between the biggest and best Call of Duty teams in California this month. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 5th of June 2019 at 12:13 This has introduced plenty for PS4 players to see, including changes to Blackout's map, new weaponry, and more. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 4th of June 2019 at 08 As the CWL Pro League goes on, Nolson is coming into the main roster as Accuracy becomes a substitute. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 23rd of May 2019 at 09 The player might have had a lot of success in the past, but he's moving to a substitute role as Ricky comes into the roster."}, {"articleID": "2009060922_00069480_W", "names": {"John Pappas": ["Q17306096", "Q42783759"], "Brent Jones": ["Q18208348", "Q19895523", "Q3373154"]}, "date": "2009-06-09", "url": "http://usatoday.com/tech/news/2009-06-09-online-poker_N.htm?csp=34", "content": "washington - an advocacy group for online poker said tuesday that the federal government has frozen more than $30 million in the accounts of payment processors that handle the winnings of thousands of online poker players. the justice department has long maintained that internet gambling is illegal, a view that the poker group challenges. poker players alliance told the associated press that the u.s. attorney for the southern district of new york instructed three banks to freeze the accounts. documents obtained by the ap show that a judge in the district issued a seizure warrant last week for an account at a wells fargo bank in san francisco, and that a federal prosecutor told a bank in arizona to freeze an account. in a letter dated friday and faxed to alliance bank of arizona, the prosecutor said that accounts held by payment processor allied systems inc. are subject to seizure and forfeiture \"because they constitute property involved in money laundering transactions and illegal gambling offenses .\" the letter was signed by arlo devlin-brown, the assistant u.s. attorney for the southern district of new york. in another letter faxed the same day, devlin-brown asks that the bank treat the funds \"as legally seized\" by the fbi, saying that the government has probable cause that the gambling payments of u.s. residents had been directed to offshore illegal internet gambling businesses. a spokeswoman at the southern district declined to comment. <mark>john pappas</mark>, executive director of the poker players alliance, called the government's move an \"unprecedented action\" against online poker players. in a letter monday night to devlin-brown, <mark>pappas</mark> said that the funds belong to the alliance's members, and requested that his group be notified and given the opportunity to be heard regarding attempts to seize the frozen funds. \"the ppa will pursue every legal course available to ensure that poker players' funds are not seized and their right to play poker online is protected,\" he wrote. to report corrections and clarifications, contact reader editor <mark>brent jones</mark>. for publication consideration in the newspaper, send comments to"}, {"articleID": "2018073015_00190752_W", "names": {"Richard Ramsey": ["Q21176501", "Q59471801"]}, "date": "2018-07-30", "url": "https://www.4ni.co.uk/northern-ireland-news/247857/charity-leaders-raise-concerns-over-ongoing-political-instability", "content": "30/07/2018 Charity Leaders Raise Concerns Over Ongoing Political Instability Charities and social enterprises in Northern Ireland are concerned about politically instability and believe action is needed to ensure decisions can be made in the absence of an Executive. The views of charity and social enterprise bosses have been revealed in the latest Ulster Bank and CO3 3rd Sector Index. Published by CO3 Chief Officers 3rd Sector, the report is a key barometer of Northern Ireland's third sector, involving a quarterly survey of CO3 members, who include the leaders of some of Northern Ireland's largest charities and social enterprises. Services they provide range from care, to counselling and support, as well as training and development. A total of 65% of respondents believe that political instability in Northern Ireland will worsen over the year ahead and almost two-thirds expect the Northern Ireland economy to deteriorate over the same period, an increase on the previous quarter (61%). As fears for the economy and political instability continue, almost three quarters (72%) of third sector leaders advocate for a shift in the political decision-making process. While opinion is mixed, only 24% believe in maintaining the status quo, opting for civil servants to make decisions about Northern Ireland in the absence of a Stormont Executive. Overall, third sector leaders believe the responsibility for making decisions about Northern Ireland should fall with the Secretary of State (27%), a joint British-Irish intergovernmental conference (25%) or a Citizens' Assembly (20%). One respondent to the survey said: \"Having no decision makers, having no decisions being made, having civil servants who are afraid to commission anything new and being stuck in contracts that are out of date, under paying us and undervaluing us is frustrating and leaving us unable to have much flexibility in responding to the needs of our groups .\" Despite the uncertain environment though, respondents say that their organisations continue to increase employment and remain optimistic that turnover will increase. The latest report shows an increase in employment levels to deal with an increasing demand for services, with 33% of organisations increasing their headcount in the past quarter, the highest rate of increase over the previous 12 months. This comes as organisations are once again reporting continued increases in demand for their services (67%). As a result, 74% expect their turnover to increase or remain the same. Nora Smith, Chief Executive of CO3, said: \"Once again, the political situation in Northern Ireland remains a key concern for third sector organisations and one which they don't expect to improve. Our latest report demonstrates that the lack of a government is impacting on the sector however the resilience of organisations is also apparent. What is clear is that the third sector needs government decisions to be made and the majority feel that the current situation where decisions aren't being made is unsustainable .\" <mark>Richard Ramsey</mark>, Chief Economist, NI, at Ulster Bank added: \"Despite no shortage of political uncertainty, the Northern Ireland economy has been resilient in the past year, with private sector activity continuing to increase and labour market statistics posting a number of records of the positive variety. The latest Ulster Bank and CO3 Third Sector Index suggests that this is being reflected in the third sector where despite issues being created by a lack of decision-making including in relation to funding, third sector organisations report that they are seeing growing demand and are increasing their headcount. Whether this is sustainable in a situation where political stalemate continues and the economy as a whole feels the increasing squeeze of rising inflation and stagnant wages remains to be seen .\" (MH/LM) Charity Leaders Raise Concerns Over Ongoing Political Instability Charities and social enterprises in Northern Ireland are concerned about politically instability and believe action is needed to ensure decisions can be made in the absence of an Executive. The views of charity and social enterprise bosses have been revealed in the latest Ulster Bank and CO3 3rd Sector Index. 30 July 2018 Britain First in Northern Ireland is \"imploding\" , according to Alliance Strangford MLA Kellie Armstrong. Ms Armstrong joined a counter-protest against the alleged far-right organisation in Newtownards, Co Down on Saturday, 28 July. 30 July 2018 Police are appealing for information and witnesses following a report of criminal damage caused to a number of vehicles in Rostrevor. 30 July 2018 Green Party Leader Steven Agnew To Step Down Green Party leader and MLA, Steven Agnew, has announced that he will step down from his position later this year. Mr Agnew, who has led the party for seven years, will continue as MLA for his North Down constituency. The Green Party will now begin the process to elect a new leader, which is expected to conclude in the autumn. 30 July 2018 Four DUP MLA's Accused Of Failing To Declare Donations For Israel Trip Four out of six DUP MLA's who made trips to Israel have allegedly failed to make complete donation reports, according to a report by BBC News NI. According to the report, six MPs from the party declared receiving donations from NI Friends of Israel of £ 2,700 each, which was used to pay for a four-day trip they undertook in May. 30 July 2018 Police Appeal For Information On North Belfast Burglary Police have issued an appeal for information following the burglary of an elderly woman's home in north Belfast. Thieves broke into the property on the Old Cave Hill Road at about 8am on Sunday, 29 July. It is understood that the elderly homeowner was in the house at the time of the burglary but was not harmed. 30 July 2018 Loyalist Paramilitaries Order North Belfast Woman To Leave Her Home - SF A woman in North Belfast has allegedly been threatened and ordered to leave her home by loyalist paramilitaries, according to Sinn Féin MLA Carál Ní Chuilín. The North Belfast MLA said that the woman's son \"died tragically only days ago\" and reported that her home was attacked hours after a warning was issued on Sunday, 29 July. 30 July 2018 Suspected Hate Crime At Kingsmill Memorial Investigated An investigation has been launched into a suspected sectarian hate crime after an Irish flag was nailed to a Kingsmill memorial. 27 July 2018 Men Arrested After Drugs Found At Carrickfergus Crash Site Two men have been arrested for motoring and drug offences after a quantity of drugs were discovered following a road traffic collision in Carrickfergus. Police responded to reports of a collision on the Larne Road at around 1.15 am this morning, 27 July. 27 July 2018 The jailing of a 59-year-old west Belfast woman for non-payment of her TV license has been described as \"an appalling misuse of justice and tax payers money\". Northern Ireland Weather This Evening and Tonight: Scattered showers this evening will soon die out leaving plenty sunshine to end the day. After dusk, dry with clearer skies, this will allow it to turn quite cool in rural inland areas. Cloud thickening towards dawn. Minimum temperature 9 ° C."}, {"articleID": "2017031211_00023131_W", "names": {"John Wallace": ["Q14946934", "Q14949339", "Q15485470", "Q17113779", "Q18163162", "Q21612064", "Q2343394", "Q43911228", "Q57941720", "Q57941797", "Q6223637", "Q6226385", "Q6228353", "Q6230968", "Q6248666", "Q6262780", "Q6262782", "Q6262785", "Q794473"]}, "date": "2017-03-12", "url": "http://lancasteronline.com/news/pennsylvania/zika-is-still-a-threat-pennsylvania-officials-remind-travelers/article_832b111e-069c-11e7-aee1-23c1d41ff635.html", "content": "Close Andre Penner A female Aedes aegypti mosquito; the Aedes aegypti is a vector for transmitting the Zika virus. (AP Photo/Andre Penner) Zika is still a threat, Pennsylvania officials remind travelers (...) Andre Penner A female Aedes aegypti mosquito; the Aedes aegypti is a vector for transmitting the Zika virus. (AP Photo/Andre Penner) If you are heading to a warm destination for vacation, state and federal health officials would like to remind you that Zika is still out there. Yes, college students getting ready for spring break travel should know that the virus linked to serious birth defects hasn't gone away. The U.S. Centers for Disease Prevention & Control still has a travel alert for places where mosquitoes could spread the virus to people--a list that includes parts of Florida and Texas, as well as Mexico, Puerto Rico, Dominican Republic and nearly all of central and south America. Pregnant women should consider postponing nonessential travel to those areas, the CDC says, and all travelers should take extra precautions against mosquito bites both during the trip and three weeks after returning, to avoid spreading the virus. Because the virus can also be transmitted sexually, the CDC also counsels travelers to avoid unprotected sex with a woman who is or may become pregnant for at least six months after being in a Zika-infected region. State officials are reminding potential travelers to be cautious. \"The threat of the Zika virus exists in every part of the state due to global travel,\" said Nate Wardle, the emergency preparedness public information officer a the state Department of Health, which has been \"using social media to reach students and their families to urge the importance of education and awareness about Zika, the dangers and how to protect oneself .\" The CDC recently estimated that Zika made certain types of birth defects 20 times more likely in the U.S., with a previous rate of 3 per 1,000 births rising to 60 per 1,000 births among mothers who had contracted the virus. One of those defects is microcephaly, which is characterized by abnormally small heads and brains. Mosquito transmission hasn't been documented in Pennsylvania yet, but to date department data shows 177 confirmed cases of Zika since the state started tracking them last year, and 32 probable ones. The department doesn't provide local details on those cases, but as of November local health officials said 12 pregnant women in Lancaster County had Zika and there had not yet been any reports of associated birth defects. Updates on county cases and their outcomes were not available this week. In the continental U.S., the CDC says there have been 5,109 cases of Zika in the states, including 1,143 in pregnant women that resulted in 47 babies born with birth defects and 5 pregnancy losses with birth defects. And in Puerto Rico--which has strong ties to the Lancaster area--the CDC says there have been nearly 37,000 cases, and information on pregnancy outcomes is not yet available. Locally, a type of mosquito thought capable of spreading Zika but not likely to do so was found in Lancaster County last year, but Millersville University professor <mark>John Wallace</mark> said that at this point, he doesn't think people need to worry about Zika if they're not traveling outside Pennsylvania. The warm winter here has pushed mosquito season earlier, <mark>Wallace</mark> said, with some flying around now. \"Wear repellent and light-colored clothing; reduce mosquito habitat,\" he said. Call"}, {"articleID": "2018042406_00182298_W", "names": {"Ken Chen": ["Q22774027", "Q6387439"], "Han Wang": ["Q40418557", "Q42932186", "Q45464785", "Q45532219", "Q45548312", "Q45705530", "Q56027720", "Q57629190"]}, "date": "2018-04-24", "url": "http://www.bloomberg.com/news/articles/2018-04-24/china-stocks-get-adrenaline-shot-from-policy-easing-speculation", "content": "China Stocks Get Adrenaline Shot From Policy Easing Speculation - Bloomberg Bloomberg the Company & Its Products Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Terminal Demo Request Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 MENU China Stocks Get Adrenaline Shot From Policy Easing Speculation By Shanghai Composite Index advances most in two months Authorities signal willingness to ease policy if needed Photographer: Johannes Eisele/AFP via Getty Images Chinese stocks got a much-needed shot in the arm Tuesday, rallying the most in two months amid signs the government is willing to ease its tightening campaign to avoid an overly sharp economic slowdown. The rally followed a meeting where policy makers mentioned the need to boost domestic demand for the first time since 2015, and dropped a reference to deleveraging. Government bonds, which had been rallying at the fastest pace since 2008, declined. It's a change for China's equity investors, where virtually nothing worked only days ago. A $1 trillion rout had left banks and other onshore giants flirting with a bear market, while foreign-listed tech was having its worst start to a year since 2013, and previously profitable Wall Street strategies tracking the cheapest stocks or biggest dividend payers had all but unraveled. Even small caps, which enjoyed a brief moment in the sun in March, had resumed a multiyear rout. \"The Politburo meeting sends a signal that China may roll out fiscal stimulus and supportive monetary policies to resolve financial risk and stabilize markets,\" said <mark>Ken Chen</mark>, a Shanghai-based analyst with KGI Securities Co. \"That has boosted sentiment on the market, especially for blue chips .\" Bulls returned in full force Tuesday, at one point sending the FTSE China A50 Index toward its biggest daily gain since 2016. All industry groups on the broader CSI 300 Index rose, with property developers and banks leading gains. Even tech rebounded from a two-day slump. Firms tied to materials advanced as strength in cement companies outweighed declines for aluminum makers. While the rally helped patch some of the damage inflicted on Chinese stocks this year, the country's benchmarks are still among the world's worst performers since their January peaks. For Bocom International Holdings Co.'s Hao Hong, onshore equities are still going through a volatile period, with valuations, a slowing economy and limited inflation pressure tipping the balance in favor of bonds. \"The general trend for the stock market is down,\" he said. \"If you were buying Chinese banks for their dividend yield, then you might as well buy Chinese government bonds .\" The gap between dividend yields and bond yields has been watched by investors after the Shanghai Composite Index's best start to a year in a decade made stocks pricey relative to government debt. That spread widened again Tuesday. Hints from the Politburo meeting suggest policy makers are well aware of what's been causing market jitters. A trade spat with the U.S. has added another layer of uncertainty to an economy already grappling with the effects of the government's goal to curb leverage and reduce risk in the financial sector. The shift in tone is \"a sign that China is paying attention to the downward pressure in the economy,\" <mark>Han Wang</mark>, chief macro analyst at Industrial Securities Co., wrote in a note Tuesday. \"This would cushion part of investors' worries about the economy due to trade concern and would boost the risk appetite of the market .\" --With assistance by Amanda <mark>Wang</mark>, and Jeanny Yu Quotes from this Article"}, {"articleID": "2009042111_00001301_W", "names": {"Andre Durand": ["Q4754772", "Q518409"], "Jonathan Schwartz": ["Q21400587", "Q24252837", "Q6274348"]}, "date": "2009-04-21", "url": "http://it.sys-con.com/node/928105", "content": "jackbe the big a (architecture in ajax) instantiations eclipse rich internet platform with taylor and milinkovich yahoo! applying ajax to speed user's journey enerjy webcast java code quality management app server shoot-out with microsoft, ibm, jboss, sun, bea, and oracle web apps for the iphone: duplicating the iphone look and feel in safari michelle2 wrote: really i don't see whats so hard about creating iphone web apps. you can use the same tools you use for plain \"old\" web 2.0 apps see here. apr. 20, 2009 08:32 pm edt user environment management - the third layer of the desktop cloud computing for business agility architecting an enterprise service router (esr) - a cost-effective way to scale soa across the enterprise return on assests: bringing visibility to your soa strategy managing hybrid endpoint environments get \"rich' quick: rapid prototyping for ria with zero server code designing for and managing performance in the new frontier of rich internet applications how can ajax improve homeland security? beyond widgets: what a ria platform should offer from the wires ping identity launches internet identity security platform ping identity ® today announced pingfederate ® 6.0, a standards-based internet identity security platform designed to meet today's changing business requirements for secure internet identity. pingfederate 6.0 software extends ping identity's internet single sign-on capabilities to include support for secure application-to-application transactions over web service and service-oriented architectures (soas).\" users and the applications they access are becoming increasingly distributed. collaboration, saas, virtualization, web 2.0, cloud computing and outsourcing are all driving toward a future state where the enterprise effectively becomes de-perimeterized, \"said ping identity ceo <mark>andre durand</mark>.\" knowing user identity as transactions traverse the internet in increasingly sophisticated ways is critical to securing today's connected enterprise. pingfederate 6.0 is the first internet identity security platform to integrate critical identity-based security use-cases, including internet sso, identity-enabled web services and automated internet account management. with pingfederate 6.0, internet identity security can be implemented with the simplicity, scale and speed that customers have come to expect from ping identity. \"pingfederate 6.0 includes common configuration, administration and runtime services for: secure, standards-based internet single sign-on decreases the threat of identity theft and phishing attacks scales with an enterprise's internet application adoption plans new identity-enabled web services securely shares identity information between web services to support personalized customer, partner and supplier transactions integrates easily into existing security infrastructures expanded internet user account management capabilities saves money by eliminating administrative redundancies improves security and regulatory compliance\" as applications continue to move out of the traditional data center and into the cloud, the combination of these three capabilities into one product provides compelling business value for enterprises, government entities and service providers alike, \"said enterprise management associates analyst scott crawford .\" with little or no business disruption, organizations can readily deploy pingfederate 6.0 today rather than pinning their hopes on what tomorrow's approaches may bring. \"pingfederate 6.0 data sheet to learn more about ping identity's internet identity security platform. pingfederate 6.0 is available now via website. about ping identity corporation ping identity is the market leader in internet identity security, delivering on-premise software and on-demand services for internet single sign-on (sso), identity-enabled web services and internet user account management. more than 300 enterprises, government agencies, software-as-a-service (saas) vendors and online service providers worldwide rely on ping identity to streamline application access, reduce administrative costs, generate additional revenue and improve security. visit www.pingidentity.com for additional information. ping identity, pingfederate, pingconnect, pingenable, the ping identity logo, signon.com, auto-connect and single sign-on summit are registered trademarks, trademarks or servicemarks of ping identity corporation. all other product and service names mentioned are the trademarks of their respective companies. about business wire copyright © 2008 business wire. all rights reserved. republication or redistribution of business wire content is expressly prohibited without the prior written consent of business wire. business wire shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon. enterprise open source magazine latest stories...oracle-sun: <mark>jonathan schwartz</mark> writes his toughest ever email\" to me, this proposed acquisition totally redefines the industry, \"wrote <mark>jonathan schwartz</mark> this morning to sun's employees in a company-wide email announcing the acquisition of sun by oracle. among other remarks, <mark>schwartz</mark> adds:\" let me assure you [oracle is] single minded in [its] focu...novell client for windows revved novell has updated its client for windows, the widgetry that enables novell open enterprise server connectivity. novell calls it a major revision of the novell client and says it allows a vista workstation to log in to open enterprise server or netware. it includes performance enhancem...start-up seeks to exploit memcached market gear6, the two-and-a-half-year-old start-up that kicked off accelerating nfs, is branching out into memcached, figuring the open source widgetry is going to turn into one of those industry pulse points like web servers used to be before they got ubiquitous. memcached is a general-purpo...infobright aims to challenge mpp data warehouses infobright, the toronto-based open source data warehousing company, is pushing out rev 3.1 of its low-cost software. it adds x86 solaris 10 support to its enterprise edition and an enhanced sql framework to both its enterprise and community editions so the widgetry should appeal to a w.. . power-saving nettop with suse linux operating system as with earlier shuttle mini-pcs with pre-installed linux operating system, the x270v uses opensuse - now in version 11. all pc functions are configured after the first start-up in only a few steps and can then be used immediately. expansion with program packages is possible at any tim...ulitzer responds to published reports we would like to take this opportunity to thank our readers, authors, and the newly born ulitzer community for making our march 29 beta launch an astonishing success! ulitzer is on its way to becoming one of the fastest growing professional viral sites on the internet. subscribe to our rss feeds & get your sys-con news live! publish your article! please send it to editorial (at) sys-con. com! universal middleware: what's happening with osgi and why you should care 4th international cloud computing conference & expo: call for papers copyright © 1994-2008 sys-con publications, inc. all rights reserved. all marks are trademarks of sys-con media."}, {"articleID": "2019111313_00066156_W", "names": {"Joe Gomez": ["Q17505113", "Q6210068"]}, "date": "2019-11-13", "url": "https://www.caughtoffside.com/2019/11/13/raheem-behaved-like-a-child-more-details-on-gomez-sterling-england-bust-up-revealed-ahead-of-montenegro-qualifier/", "content": "Lorenzo Martín November 13, 2019 A lot has been made of <mark>Joe Gomez</mark> and Raheem Sterling's bust-up whilst on England duty lately, and now, it seems even more details on the incident have revealed by certain sources. <mark>Gomez</mark> and Sterling's beef seemed to start during Liverpool's 3-1 win over Man City on Sunday, after the two squared up with one another following a challenge by <mark>Gomez</mark> on Sterling. This beef seemed to carry on into international duty, with the Daily Mail noting that Sterling and <mark>Gomez</mark> had yet another bust-up in the England canteen, something that lead to Southgate dropping the player from his match-day squad to take on Montenegro. And now, even more details regarding the duo's bust-up have been revealed by reliable source The Athletic. As per the report, sources confirmed that the incident took place at around midday on Monday at England's training ground, St James' Park, with Sterling trying to get <mark>Gomez</mark> in a headlock after confronting him in the canteen. One source even confirmed \"It was a pretty full-on thing and food went everywhere. Sterling behaved like a bit of a child\". Sterling and <mark>Gomez</mark>' beef continued on into Monday according to the Athletic Given that England need to win one of their two Euro 2020 qualifiers this week in order to qualify for the tournament proper, this incident couldn't really have come at a worser time. More Stories / Latest News"}, {"articleID": "2012072519_00032099_W", "names": {"Moussa Traore": ["Q313242", "Q3326238", "Q472581"], "John Evans": ["Q10385951", "Q13129324", "Q16105614", "Q16186658", "Q16728876", "Q21460963", "Q21461285", "Q21461440", "Q21933486", "Q22004228", "Q22667541", "Q23540971", "Q23583498", "Q23988322", "Q30608333", "Q328527", "Q334048", "Q47477100", "Q47546711", "Q47546739", "Q535213", "Q56597697", "Q56604616", "Q6228141", "Q6231982", "Q6232000", "Q6232009", "Q6232022", "Q6246877", "Q6247286", "Q6254706", "Q6255105"]}, "date": "2012-07-25", "url": "http://modernghana.com/news/408080/1/mali-crisis-plan-teeters-amid-calls-for-pms-resign.html", "content": "mali crisis plan teeters amid calls for pm's resignation 7/25/2012 8:00:09 pm - bamako (afp) - mali's efforts to escape a post-coup crisis faced further upset wednesday after key political parties called for the prime minister to resign days before a deadline to form a new unity government. interim prime minister cheick modibo diarra has until july 31 to formulate a unity government which regional mediators demanded to deal with the deepening hold of hardline islamists on the north, which they occupied four months ago. but as diarra--an astrophysicist and american citizen--cobbles together this new regime, a grouping of key political parties and civil society organisations on tuesday demanded he step down. \"three months after its formation, the transition government led by cheick modibo diarra has only become bogged down in incompetence and amateurishness and mali is only sinking deeper,\" the united front for the defence of the republic and democracy (fdr) said in a statement. the fdr criticised his roadmap to escape the post-coup crisis as being vithout vision and \"clearly concocted under the pressure of events and in which the burning priorities of the nation are scarcely in evidence\". the grouping notably accused diarra of having \"no strategy to free, through war or negotiation\" the north of the country. one of the parties in the fdr is the malian democratic alliance, whose leader is president of the transition government dioncounda traore. <mark>traore</mark> has been in paris for two months after being violently mobbed in his office by opponents to his appointment. \"indeed, the ship is pitching,\" said an african diplomat based in bamako on condition of anonymity. \"we are a number of countries in the sub-region who have observed the current transition government is struggling to resolve urgent problems .\" armed islamist groups which security experts say are acting under the aegis of al-qaeda in the islamic maghreb, took advantage of a power vacuum after the march 22 coup to seize an area larger than france. since the formation of the 12-month transition government, the islamists have only deepened their hold, implementing strict sharia law and destroying ancient world heritage sites in the city of timbuktu. the occupation has also led to the displacement of some 400,000 malians, more than half of which are living in refugee camps in neighbouring countries, according to the un refugee agency. while diarra's interim government's main task was to solve the northern crisis, it has made no headway. the economic community of west african states (ecowas) ordered them to form a unity government uniting disparate political forces by july 31 or face suspension from the bloc. ecowas wants to send a 3,000-strong military force to mali, but is waiting for united nations approval and a formal request from bamako. \"it is up to the malians to decide who must be their prime minister and the make up of their government,\" a source within the mediation team in burkina faso told afp. he added that mediators want <mark>traore</mark> back in bamako by july 31. in paris ivory coast leader and current ecowas chief alassane ouattara is due to meet french president francois hollande on thursday as west africa's biggest crisis looms large. regional heads of state will meet in abidjan on wednesday to examine a report by military experts who carried out an \"audit\" of the foundering malian army to determine its needs. \"the situation in mali is getting worse every day,\" ivorian army chief soumaila bakayoko said at a ceremony opening the abidjan meeting. diarra, who worked for the national aeronautics and space administration (nasa) and was also the microsoft chairman for africa, is the son in law of <mark>moussa traore</mark> who became president of mali after ousting a previous regime and ruled for 23 years until 1991. many in mali see him as too close to the former putschists led by amadou sanogo, who has remained influential despite handing power over to a civilian government and has been accused of meddling in political affairs. 25-07-2012 top rights lawyer praises senegal \"turnaround' in habre case 25-07-2012 rawlingses express condolences to mills' family 25-07-2012 akufo-addo suspends campaign in honour of mills 25-07-2012 tunisia pardons 1,300 prisoners on national day 25-07-2012 two charged in sudan protest\" terrorist' case 25-07-2012 liberia welcomes sanctions lift against ex-taylor officials 25-07-2012 mali crisis plan teeters amid calls for pm's resignation 25-07-2012 statement from ghana decides on the death of president mills 25-07-2012 girl jilted for refusing to bleach her private parts 25-07-2012 with sudden greenland ice melt, reiterating declaration of planetary ecological emergency 25-07-2012 rawlings: mills' death could have been avoided 25-07-2012 biography of professor <mark>john evans</mark> fiifi atta mills?. deceased president of the repub 25-07-2012 most government offices inactive following presidents mills \"death 25-07-2012 death of president mills affects woyome trial 25-07-2012 former president rawlings mourns president mills 25-07-2012 ghanaians abroad complain of exorbitant prices of passport forms 25-07-2012 ndc germany expresses condolence to ghanaians 25-07-2012 top rights lawyer praises senegal\" turnaround' in habre case 25-07-2012 tunisia pardons 1,300 prisoners on national day 25-07-2012 two charged in sudan protest \"terrorist' case 25-07-2012 liberia welcomes sanctions lift against ex-taylor officials 25-07-2012 mali crisis plan teeters amid calls for pm's resignation 25-07-2012 french archaeologists unearth pharaoh boat 25-07-2012 uk foreign secretary welcomes appointment of new egyptian prime minister 25-07-2012 dispatch of a japan self-defense force instructor to the international peace support traini 25-07-2012 mobile phones help bolster uganda's fight against hiv 25-07-2012 ghana mourns after sudden death of president 25-07-2012 madagascar rivals hold first reconciliation talks 25-07-2012 selsouli axed from games in drug scandal 25-07-2012 senegal: agreement on habr court / after world court ruling, plan to try chad's ex-dictato 25-07-2012 emergency malaria intervention treats 10,000 people a month in katanga province, democratic 25-07-2012 michele scannavini, coty prestige president, is named company's new chief executive officer 25-07-2012 mali ex-junta forcibly disappeared 20 soldiers: hrw 25-07-2012 man jailed over nude mugabe cartoon freed by court 25-07-2012 madagascar rivals meet for landmark talks"}, {"articleID": "2019120416_00206725_W", "names": {"David Brooks": ["Q16105043", "Q19948555", "Q27909737", "Q28498255", "Q31151243", "Q5231788", "Q5231789", "Q5231790", "Q938475"]}, "date": "2019-12-04", "url": "https://www.sciencedaily.com/releases/2019/12/191204090753.htm", "content": "Follow all of ScienceDaily's and! latest research news top science headlines Science News New screening method identifies potential anticancer compounds that reawaken T cells The technique may be useful in developing new combination-immunotherapy regimens against cancers and persistent infections Date: Scripps Research Institute Summary: Scientists have developed a method for rapidly discovering potential cancer-treating compounds that work by resurrecting anti-tumor activity in immune cells called T cells. Cancerous tumors often thrive because they render T cells dysfunctional or \"exhausted .' The new method uncovers medicinal compounds that can restore the function of these T cells, making cancers vulnerable to them again. Share: FULL STORY Scientists at Scripps Research have developed a method for rapidly discovering potential cancer-treating compounds that work by resurrecting anti-tumor activity in immune cells called T cells. advertisement Cancerous tumors often thrive because they render T cells dysfunctional or\" exhausted. \"The new method uncovers medicinal compounds that can restore the function of these T cells, making cancers vulnerable to them again. The approach, described in a study published in Cell Reports, may also help restore T-cell responses to persistent infections from viruses or other pathogens. It therefore should speed the development of new cancer and infectious-disease immunotherapies, including those that can be combined with existing immunotherapy drugs to enhance their effects. The scientists demonstrated the potential utility of the approach by using it to rapidly screen a collection of more than 12,000 drug compounds--uncovering 19 that can reawaken exhausted T cells .\" This new screening method should be particularly useful because we can use it not only to identify compounds that restore needed function to exhausted T cells, but also to quickly analyze these T cells to determine how these compounds work on them, \"says senior author Michael Oldstone, MD, Professor Emeritus in the Department of Immunology and Microbiology at Scripps Research. The new screening system--and to some extent, the wider field of cancer immunotherapy--is based in part on research over the past several decades by Oldstone's laboratory and several former lab members including Rafi Ahmed, <mark>David Brooks</mark>, and John Teijaro, along with other scientists that have conducted animal-based research on how the immune system responds to lymphocytic choriomeningitis virus (LCMV). A unique variant of LCMV known as\" clone 13 \"establishes a persistent infection by exhausting the virus-specific T cells that are required to clear the infection. It does this by boosting signals through T-cell receptors such as PD-1 and IL-10. The discovery that LCMV clone 13 can survive by switching off anti-LCMV T cells was quickly followed by the recognition that cancers often persist using the same trick. advertisement Immunotherapies that block signaling from PD-1 or similarly acting receptors to restore T cells' anti-cancer responses are among the most powerful cancer medicines available today. These therapies save many patients who in the past had seemingly untreatable tumors. But because treatment with these drugs typically works well for only a few cancers, including melanoma--and less often on other cancers--scientists suspect that cancers usually hijack multiple inhibitory T-cell pathways. This suggests that a combination of immunotherapies directed to different molecular pathways could be more effective than the current therapy .\" The idea now is to develop more immunotherapy drugs and find the best combinations of them, \"Oldstone says. A promising hit The new screening system is designed to enable scientists to swiftly find such drugs--in this case, pharmacologically active small-molecule compounds that might work better than, or augment, the current injectable antibody immunotherapies now available. The system uses T cells that have been exhausted by LCMV clone 13 and detects signs of renewed activity in these cells when a tested compound works to reawaken them. An advantage of the new screening system is that it is specific and highly automated; thus, thousands of compounds can be tested within days, with the\" hits \"verified in experiments involving mice. Oldstone and colleagues applied the new screening system to a drug repurposing library of more than 12,000 compounds that either are FDA-approved or have been tested as potential drugs. They quickly identified 19 hits--compounds that, at modest doses, can effectively resurrect the activity of exhausted T cells. One of these compounds, ingenol mebutate, is a plant-derived molecule that is already used in gel form (Picato) to treat actinic keratosis, a pre-cancerous skin condition. The researchers employed elements of their screening system to study the reactivated T cells and determined that ingenol mebutate restores function for these cells largely by activating signaling enzymes called protein kinase C enzymes, a known pathway of activity for this compound. Co-first authors of the study, postdoctoral fellows Brett Marro, PhD and Jaroslav Zak, PhD, in the Department of Immunology and Microbiology, are currently collecting and exploring the therapeutic potential of other reported hits that may work in combination with treatments that block PD-1 - and another T-cell-inhibitory receptor, CTLA-4. Indeed, one such hit in combination with antibody to PD-L1 is already undergoing evaluation in patients. Oldstone notes that the new screening approach is flexible enough to adapt for finding compounds that have other effects on T-cells, such as reducing T-cell activity to treat autoimmune conditions. make a difference: sponsored opportunity Story Source:"}, {"articleID": "2009080206_00022892_W", "names": {"Chris Anderson": ["Q19609580", "Q2536856", "Q29051924", "Q30121842", "Q40360340", "Q4065282", "Q5105727", "Q5105729", "Q5105730", "Q706222", "Q943061"], "John Morris": ["Q19276793", "Q19325579", "Q203188", "Q21501583", "Q24844367", "Q3048680", "Q48744064", "Q53774610", "Q54635355", "Q56036931", "Q6249470", "Q6249477", "Q6249486", "Q6249491", "Q6249494", "Q6249495", "Q6249496", "Q6249497", "Q931890", "Q958669"]}, "date": "2009-08-02", "url": "http://newsobserver.com/105/story/1035261.html", "content": "there are two surefire, easy-to-spot signs of a downtown's cultural vitality: places to see art and the prevalence of bicycles. the art clearly means creativity, and bikes mean people live in the city's center, or nearby, and are probably headed somewhere interesting. both benchmarks are celebrated in an informal art tour called bike first friday, which began in april 2007 when victor lytvinenko, a jeans designer, celebrated his fiancee's birthday by inviting friends on a bicycle parade. it grew each month and now draws as many as 60 riders. \"in a way, we're making a statement that it's a lot easier getting around downtown on bikes than to drive,\" lytvinenko said. raleigh cultural blogs have begun showing up like renovated buildings downtown. along with local blogs that cover a lot of ground--politics, urban planning, neighborhoods, personal diaries--about half a dozen blogs report exclusively on the cultural changes going on. together, they are defining a city that is still trying to figure out what it's going to be when it grows up. typical of blogs, they are often quicker than print media. but unlike many such sites, these have not attracted hysterical rants and unchecked rumors. www.dtraleigh.com). most of them showed up after the suspension last summer of raleighing (raleighing.com), a boosterish site that seems to have been the first to regularly document the downtown transformation, and at its peak had 3,000 regular readers each day, according to creator <mark>chris anderson</mark>. \"when it stopped, everyone said\" hey, i can do that,' \"said photo blogger <mark>john morris</mark> of goodnight, raleigh!\" a lot of people saw an opening when that site shut down. \"food and tunes if on a friday night you find yourself at the north end of downtown in that interesting little pocket near peace college called seaboard station, it might be a pleasant surprise to encounter free music to accompany your dinner or drink al fresco. capital city grocery, owned by a partnership of people who live nearby, will have mellow tunes every friday evening through september. there is seating for 40 and room to stand on the store's patio. a sandwich, salad or prepared meals to go can be enjoyed with a beer or a glass of wine. pam letendre, one of the store's managers, says the vibe is family-friendly. an art gallery and three restaurants are nearby. rickshaw, anyone? here's how it all ties together: say you've had a bite to eat in seaboard, it's too far to walk to other galleries, and you like the benefits of cycling but don't have a bike. your answer is the rickshaw. every night, 16 pedal-powered carriages range from cameron village to mordecai. there's no fare but drivers wouldn't mind a tip, maybe a buck or so a block. they've been plying the boulevards since april 2007, and the number of rickshaws has been more than doubled because of the demand on first fridays. there is also a free trolley on first fridays. the news & observer is pleased to be able to offer its users the opportunity to make comments and hold conversations online. however, the interactive nature of the internet makes it impracticable for our staff to monitor each and every posting. since the news & observer does not control user submitted statements, we cannot promise that readers will not occasionally find offensive or inaccurate comments posted on our website. in addition, we remind anyone interested in making an online comment that responsibility for statements posted lies with the person submitting the comment, not the news and observer."}]