[{"articleID": "2016051921_00655933_W", "names": {"Richard Keys": ["Q21555285", "Q7327063"], "Alison Paterson": ["Q43393986", "Q47482413"]}, "date": "2016-05-19", "url": "http://home.nzcity.co.nz/nl.aspx?3582790", "content": "Helen Twose Personal finance and KiwiSaver columnist at the NZ Herald Open strategy the answer to building trust 8:45 AM Friday May 20, 2016 Not saved Facebook 0 Twitter 0 LinkedIn 0 Google + 0 Email Print Investment Companies Work Life Accessibility is vital, says CEO. <mark>Richard Keys</mark> became Abano's chief financial officer at the age of 33. Photo / Doug Sherring If you want to get hold of Abano Healthcare's chief executive <mark>Richard Keys</mark>, just give him a call - the number's on the company website, alongside his personal email. When he gets the occasional phone call from a shareholder, says <mark>Keys</mark>, they're genuinely taken aback to be speaking directly to the boss rather than his PA.. The 45-year-old says having calls filtered through a gatekeeper is not what Abano is about. \"We want shareholders to invest in our group and the best way to do that is if they understand the strategy, they understand what we're doing and it builds up trust, so the more information we can give them, the more they can use that information to make a proper informed decision to know what they're buying.\" That approach to open communication has been recognised by Abano's corporate peers at the annual Infinz finance industry awards. A finalist each year since it first entered the Infinz Emerging Leaders Best Corporate Communicator category in 2013, Abano took the honour that year and last year. \"Abano is about no surprises - that's key for us,\" says <mark>Keys</mark>. \"No one likes surprises and if there is a surprise it is how you deal with it, so we like to be open, transparent and accessible.\" The trust that comes with good communication is earned, not automatic, says <mark>Keys</mark>, and has resulted in very loyal shareholders who provide the support needed when divestment and acquisition opportunities arise. As well as shareholders, current and future, <mark>Keys</mark> needs to be talking to banks, analysts, brokers, fund managers, customers and most importantly, he says, his staff. Continued below. Related Content Andy Symons: How can big businesses become innovation leaders? The art of networking: Liam Dann meets the queen of connectivity Driving environmentalism through competition He liked the way former Air New Zealand chief executive Rob Fyfe kept staff in the loop with personable communication, and he rates compassion and listening as key leadership traits. \"You can't be on a pedestal,\" says <mark>Keys</mark>. \"You need to do that because otherwise you'll find that they'll tell you what you want to hear, not what you need to hear.\" <mark>Keys</mark> has been officially heading the firm for a little over six months, taking over from Alan Clarke, who finished up after 15 years to take the top job at Hellaby Holdings. In the background, <mark>Keys</mark> - previously Abano's chief financial office and chief operating officer - and Clarke had operated interchangeably to cover each other. <mark>Keys</mark> compares it to playing in a rugby team. \"If Alan had the ball, he didn't need to look to the left because he could just pass it and know I was there.\" It made for an easy transition to the top job without the burden of a period of uncertainty. \"If the board wanted a revolution rather than evolution they wouldn't have appointed me.\" <mark>Keys</mark> says he did ensure he put himself in the frame for the chief executive's role, including a leadership programme in 2013 at the INSEAD business school in France. It was professional director and former Abano chair Dame <mark>Alison Paterson</mark> who suggested the course to <mark>Keys</mark>, having seen the impact the residential programme had on several chief executives she knew. Not only did the course provide the leadership smarts he needed to move into the CEO role, it had him sitting alongside 20 international executives, many in charge of multi-billion-dollar businesses, who he now counts as confidants and friends. No one likes surprises and if there is a surprise it is how you deal with it. <mark>Richard Keys</mark> It's one of several points in his career where <mark>Keys</mark> says he has challenged himself to take a step up. In his mid-20s, <mark>Keys</mark> binned a dream job offer from a New York consultancy when the late Graham Collins, a former client from his time at accounting firm Ernst and Young, offered him the job of chief financial officer of his retirement village business, Primecare. A few years later it was Clarke who was calling <mark>Keys</mark>, to pick his brains about an issue at Abano, then known as Eldercare. <mark>Keys</mark> joined Clarke for a special project, taking on the CFO role as a 33-year-old in 2002 before adding the chief operating officer title in 2011. \"Each of the opportunities that have been given to me have been fantastic opportunities.\" You have to say that I had confidence to deliver on them but there was also nervousness, there's big expectations and I guess I've been very fortunate to be given opportunities, which I've just grabbed and ran with. \"<mark>Keys</mark> says he has been privileged throughout his career to have strong people in his life - his family, teachers and business leaders - providing advice and inspiration. It's support he's keen to give others within his own company and the wider business community.\" I don't judge a person if they make a mistake if their intention was good, \"he says.\" If they make a mistake we'll sit down and go \"OK, what did we expect and why did it not pan out? What did we learn about it?', because I judge a person on how they react to things, not that they've made a mistake.\" Clearly if it happens again it's a different issue but if we're going to stop people trying things we're going to stop growth. \"- NZ Herald Read more by Helen Twose Email Helen Twose Email Print Get the news delivered straight to your inbox Receive the day's news, sport and entertainment in our daily email newsletter SIGN UP NOW Loading Currency Compare and convert world currencies. Discover more Loading Loading"}, {"articleID": "2018041123_00103632_W", "names": {"Marc Jacobs": ["Q2986077", "Q313108", "Q45789717"]}, "date": "2018-04-11", "url": "https://pagesix.com/2018/04/11/saint-laurent-heir-may-not-be-happy-with-new-book/", "content": "Saint Laurent heir may not be happy with new book Richie Sambora to reunite with Bon Jovi The reclusive heir to the Saint Laurent fashion fortune is said to be unhappy with a new book. Garden designer Madison Cox, 59, is a key figure in \"Loulou & Yves: The Untold Story of Loulou de La Falaise and the House of Saint Laurent\" by Christopher Petkanas, out Tuesday from St. Martin's Press. The handsome Cox got married to Saint Laurent's longtime business partner, Pierre Bergé, a few months before Bergé died this past September at the age of 86, leaving Cox an estate believed to be worth more than $1 billion. Petkanas was set to speak next month at Boscobel House and Gardens in Garrison, NY, but the event was mysteriously canceled, and the author believes friends of Cox lobbied to quash it. \"I had a signed contract, and they pulled the rug out from under me,\" Petkanas told me. A spokeswoman for Boscobel said: \"We came upon an unanticipated conflict and had to cancel the lecture.\" A spokesman for Cox said he was \"unavailable for any comment.\" Cox is also director of the Saint Laurent museums in Paris and Marrakech, Morocco, and president of the Pierre Bergé-Yves Saint Laurent Foundation. \"Madison is enormously rich and has a huge budget at his disposal. His friends are fiercely protective,\" Petkanas said. Cox might be upset because the book adds color to the rumors that despite his marriage to Bergé, he has a longtime boyfriend, Jaimal Odedra. The marriage took place possibly to ensure Bergé's will couldn't be contested. Cox's friends were unable to put the kibosh on the book's Tuesday launch at <mark>Marc Jacobs</mark>' Bookmarc store on Bleecker Street, or on Petkanas' talk with Fern Mallis the following night at the 92nd Street Y on a panel with Pat Cleveland and Simon Doonan. Share this:"}, {"articleID": "2018122708_00901988_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2018-12-27", "url": "http://www.gamereactor.eu/games/29421/Hearthstone", "content": "HEARTHSTONE: HEROES OF WARCRAFT REVIEW. Written by Ricardo C. Esteves on the 19th of April 2018 at 14 \"Witchwood is yet another quality expansion for Hearthstone.\" 0 REVIEW. Written by Kristian Kask on the 17th of August 2016 at 12 \"It's a good entry point for all the old World of Warcraft players who want to feel a bit nostalgic.\" NEWS. Written by Fabrizia Malgieri on the 29th of November 2018 at 17:22 Blizzard shows its hand. NEWS. Written by Łukasz Dąbrowski on the 26th of November 2018 at 11:51 This time, however, the plague will be intentional. 0 NEWS. Written by <mark>Mike Holmes</mark> on the 6th of November 2018 at 09:31 Blizzard's CCG is a bonafide smash hit. 0 NEWS. Written by Ricardo C. Esteves on the 5th of November 2018 at 12:29 Sixteen cards and a brand new mechanic for Hearthstone's next expansion."}, {"articleID": "2015121212_00180092_W", "names": {"Helen Macdonald": ["Q18921880", "Q5702738", "Q5702741"]}, "date": "2015-12-12", "url": "http://www.latimes.com/la-greatreads-html-20151212-htmlstory.html", "content": "Great Reads: Of love and loss, of hawks and holidays Robyn Hey there. I'm Kari Howard, and I edit the Great Reads (a.k.a. Column Ones) for the Los Angeles Times. Two of my biggest loves are narrative journalism and music, and I'm lucky that my days are filled with both: When reading the stories, I get inspired by songs I think fit the article's theme--a soundtrack. This week, much of the staff is still devoting its talents and resources to the aftermath of the San Bernardino shootings, and only one Great Read ran. So here's an abbreviated newsletter, focusing on a few of my favorite things outside the lovely world of the L.A. Times. Subscribe to the newsletter She decided she didn't want to be a \"white madam\" anymore I've been to South Africa three times now, and I've loved it deeply while at the same time been made deeply uneasy by its inequality. Its racist privileges may no longer be mandated by the government, but they linger poisonously on. This story by the wonderful Robyn Dixon tells of a terrifying home invasion, and how it changed one woman in unexpected, and inspiring, ways. Tracey Lomax was a liberal white lawyer, known for taking on pro bono work for poor blacks. Yet during the attack, she found herself, instantly and uneasily, assuming the apartheid-era role of the \"white madam\" : calm, firm, in control and used to telling black people what to do, even if they had guns. As the ordeal wore on, the most aggressive of the gunmen forced her into the master bedroom. \"He threw me down on the bed and said,\" If you don't give me jewelry now, I'll stick you .' I knew he meant rape. \"She replied firmly,\" We don't behave like that. We're not savages. \"After that night five years ago, Lomax decided she didn't want to be that person anymore.\" Your instinctive reaction is to lock your windows and recoil and yell, but if I'd gone that way I'd have ended up a very bitter person, \"she said.\" I started keeping my car window open when hawkers and beggars came up. I started greeting them and asking them how they were. I started reaching out to people of color in a way I hadn't before. \"Tracey Lomax, a South African lawyer, with daughter Jaime at their cottage home, where the family moved after a terrifying home robbery five years ago outside Johannesburg. (Robyn Dixon / Los Angeles Times) The soundtrack:\" Never Goin' Back, \"by Spiritualized. I've probably used Spiritualized for more soundtracks than any other band. They just speak to me, somehow. Pain and redemption and vulnerability and joy. What I'm reading online When was the last time you went to an old-fashioned newsstand? Not one inside a bookstore, or, worse, an airport. No, I mean one with the word\" News \"in its name, the kind where you walk in and are hit by the smell of ink and paper. My favorite one, Bungalow News in Pasadena, died a slow death years ago. My replacement newsstand was in the Montrose neighborhood, and it too endured a painful descent marked by thinning shelves and late-arriving issues. Still, its death was a shock. I remember the day I found out--I always parked behind the shop and came in the back way. On that Sunday morning, the back door was locked, and I thought the owner must have forgotten it when she opened up. I walked around to the front and saw that the shop was empty, like the Grinch had swept in and taken even the last crumb. For years I had coveted the vintage tin L.A. Times sign inside, and always intended to buy it from the owner if I ever left the paper. I felt a strange loss when I knew that would never be. All of this flitted through my mind when I read the Columbia Journalism Review piece headlined,\" Print is the new \"new' media.\" Everyone who has bought a magazine just because it feels good in your hands will love this piece. It even name-checks a magazine I've done just that with: Kinfolk (ahh, that thick, uncreasable paper). \"Old people like it because they're nostalgic,\" one back-to-the-future maverick says, and hipsters \"swarm all over it like they just found this new, trendy, nostalgic thing.\" Print--it's the new vinyl. What's on my bedside table Loss and love and endings and beginnings have been on my mind lately, so I started reading a book that had long been on my wish list: \"H Is for Hawk\" by <mark>Helen Macdonald</mark>. Written after her father died suddenly of a heart attack, this book is a meditation on all of those things. This passage near the beginning of the book captures the feeling of love through the flight of two hawks: They were loving the space between each other, and carving it into all sorts of beautiful concentric chords and distances. A couple of flaps, and the male, the teircel, would be above the female, and then he'd drift north of her, and then slip down, fast, like a knife-cut, a smooth calligraphic scrawl underneath her, and she'd dip a wing, and then they'd soar up again. And loss: Here's a word. Bereavement. Or, Bereaved. Bereft. It's from the Old English bereafian, meaning \"to deprive of, take away, seize, rob.\" Robbed. Seized. It happens to everyone. But you feel it alone. Shocking loss isn't to be shared, no matter how hard you try. I'm a third of the way through the memoir, and it's impossibly, impossibly lovely. The soundtrack: I don't usually offer a soundtrack to a book I'm reading, but a lyric from the Nada Surf song \"When I Was Young\" has been circling in a loop through my head with \"H Is for Hawk\" : \"And my aimless dreaming has found a target.\" The line is about love, but it fits with <mark>Macdonald</mark>, and finding her purpose, after loss, in a goshawk named Mabel. What's on my turntable Although I spend most of my time listening with headphones to Spotify, sometimes I want to hear the needle touching down on vinyl. That's why I have a turntable in my office--and two at home (one inside, and a battery-powered one outside when the weather's fine--which it usually is in Southern California). This week's vinyl: \"To Wish You a Merry Christmas,\" by Harry Belafonte. My latest thrift store purchase (along with \"A Swedish Christmas,\" which may be unlistenable but has an irresistible cover). I haven't felt the holiday vibe yet this year, but Belafonte is so easy on the ears--and the eyes--he seemed like a good place to start. Want to chat? Have a great idea for a Great Read? I'm @ karihow on Twitter and kari.howard @ latimes.com on email."}, {"articleID": "2013101819_00031395_W", "names": {"Kate Middleton": ["Q10479", "Q17506155"], "Andrew Mitchell": ["Q333261", "Q4758038", "Q4758039", "Q4758043", "Q48796982", "Q54310554", "Q57820261"], "David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2013-10-18", "url": "http://www.ibtimes.co.uk/articles/514976/20131018/pleb-plebgate-andrew-mitchell-police-federation.htm", "content": "Penumbral Lunar Eclipse 2013: Where to Watch the Moon in Earth's Shadow Manchester United Given Green Light To Bid? 18m for French Midfielder UK Consumer Credit Card Lending Hits Fastest Growth Rate Since February 2010 Shale Gas Fracking: US Moves Ahead of Russia in Oil and Gas Output Halloween 2013: Craziest Halloween Costumes of Heidi Klum [PHOTOS] <mark>Kate Middleton</mark> wants Prince George's Christening to be \"Different': Will Duchess of Cambridge Break Royal Tradition? Divalicious Demands of Beyonce, Lady Gaga, Naomi Campbell Revealed <mark>Andrew Mitchell</mark> is owed an apology for the Plebgate scandal, said PM <mark>David Cameron</mark> PIC: Reuters <mark>Andrew Mitchell</mark> is owed an apology for the Plebgate scandal, said PM <mark>David Cameron</mark> PIC: Reuters The Plebgate saga took a new twist after a former top Tory MP claimed he had heard <mark>Andrew Mitchell</mark> use the slur\" several times \". Michael Portillo, the former Conservative Defence Secretary, said <mark>Mitchell</mark> had used the word\" pleb \"in private on several occasions. <mark>Mitchell</mark> resigned from his Cabinet job as Chief Whip in 2012 when police officers claimed they had been called\" f ****** plebs \"by him at the gates of Downing Street. He has always denied using the term,\" pleb \"during the verbal spat, which lasted no more than 45 seconds. Speaking on BBC1\" slate night politics TV talk show This Week, Portillo told viewers he had \"heard <mark>Mitchell</mark> use that word a few times in private conversation\" . Portillo's claim appeared to contradict <mark>Mitchell</mark>'s own proclamation that he thought \"pleb\" was a toxic word and he would \"never use it\" .. However, Portillo added he believed <mark>Mitchell</mark> had not used the slur to police officers: \"I did not believe he could have used it at the gate.\" <mark>Mitchell</mark> was sacked from the the Chief Whip's officer post only weeks after sitting down at his desk for the first time, last year. He clung on for almost a month after the allegations broke. But his reputation looked as though it might be recovering this week after police accounts of the incident fell apart under close scrutiny. Police have some tough questions to answer over plebgate PIC: Reuters The Independent Police Complaints Commission (IPPC) this week intervened after no disciplinary action was taken against three police officers who were exposed for misrepresenting <mark>Mitchell</mark> at a meeting. The trio and <mark>Mitchell</mark> met for \"clear the air' talks during which <mark>Mitchell</mark> repeatedly denied using the word. But a secret recording indicated they later gave a false account of what he said. Confined to the backbenches since the scandal, <mark>David Cameron</mark>, the Prime Minister, this week said an\" apology \"was owed to <mark>Mitchell</mark> by the police. It was <mark>Cameron</mark> who accepted <mark>Mitchell</mark>'s resignation when the storm was at its height. A later decision by West Mercia police not to pursue disciplinary action against the trio was condemned by the IPCC. The Police Federation union led calls for him to resign at the same time as pursuing a high profile and successful campaign to protect pay and conditions for members. Myanmar: Three More Bomb Blasts Leave One Dead and Six Wounded in Namkham British Gas and Centrica Energy Price Hikes Inflict more Pain on Households Ofsted brands Muslim Free School Al-Madinah in Derby\" Inadequate and in Chaos' Public Accounts Committee Slams BBC's Salford Relocation Expenses"}, {"articleID": "2018120321_00107980_W", "names": {"Michael Page": ["Q16104944", "Q18635469", "Q6833333", "Q6833334"]}, "date": "2018-12-03", "url": "https://www.mercurynews.com/2018/12/03/rubin-saudi-women-activists-jailed-and-tortured-still-trump-supports-mohammed-bin-salman/", "content": "In this Nov. 15, 2018 photo, President Donald Trump speaks during a conference at the Eisenhower Executive Office Building on the White House complex in Washington. Trump said in a statement Tuesday that the U.S. does not condone the killing of the U.S-based Saudi columnist, but that \"foolishly\" canceling $110 billion in arms sales _ as some in Congress have suggested _ would only mean that Saudi Arabia would go to other countries to acquire them. (AP Photo/Manuel Balce Ceneta) By Trudy Rubin | Philadelphia Inquirer PUBLISHED: December 3, 2018 at 12:45 pm | UPDATED: December 3, 2018 at 12:59 pm By Trudy Rubin Philadelphia Inquirer Saudi Crown Prince Mohammed bin Salman (known as MBS) is eager to restore his reformer image after the CIA, and most of the world, has concluded he ordered the killing of Saudi journalist Jamal Khashoggi. President Trump is eagerly trying to aid the prince, disputing the CIA's conclusion and refusing to let CIA Director Gina Haspel testify to the Senate on this revolting affair. But if you need any more warnings about the reckless temperament of the Saudi to whom Trump has hitched his entire Mideast policy, consider this: As part of his campaign to squash any dissent, even from moderates who support the monarchy, MBS has presided over the jailing of 18 women's rights activists this year. They include the best-known campaigners for Saudi women's right to drive, such as the courageous Loujain al-Hathloul. Several of the women have allegedly been tortured, according to Human Rights Watch and the Wall Street Journal, with electric shocks and lashings. At least one has been sexually assaulted, says the Journal, and one has attempted suicide. \"Under MBS, the crackdown has been unprecedented in modern Saudi society,\" says <mark>Michael Page</mark>, deputy Middle East director at Human Rights Watch. \"This treatment of women tells us this image we've been sold in the West of MBS as a reformer is a fraud.\" Yet MBS is receiving unstinting White House support. The crown prince waltzed around the Group of 20 industrial nations meeting in Buenos Aires, grinning and high-fived by Vladimir Putin, and schmoozed on the sidelines by President Trump and Ivanka, that famous women's rights champion. No word from this supposed women's rights champion about the Saudi assault on jailed female activists, nor from her husband, Jared Kushner, a big MBS booster and buddy. Of course, MBS has already become renowned in his short tenure for his determination to silence perceived critics, targeting any businessmen, relatively moderate clerics, intellectuals, and even members of the royal family. The prince's pursuit of Khashoggi typified his paranoia: The journalist had long worked for and supported the royal family and went into exile only when he realized that MBS could not tolerate the slightest criticism. But MBS's crackdown on these women activists is especially bizarre, given that, in June, he finally lifted the Saudi ban on women driving--the only such ban in the world. To better understand the prince's mind-set, I turned to a column written by Khashoggi in May for the Washington Post. \"It is appalling to see icons of reform branded as\" traitors' on the front pages of Saudi newspapers, \"he wrote, in reference to the crackdown on women (and men) who had long championed many of the same social freedoms--including women's right to drive--that the prince supposedly endorsed. Khashoggi concluded:\" These arrests are about controlling the narrative. No independent voice or counter opinion will be allowed. \"MBS could not tolerate the idea that these women might take credit for the lifting of the driving ban, or push for further freedoms for women. So it labeled the women traitors for speaking to foreign media about social change. Who are some of these\" traitors \"? Iman al-Nafjan is a mother of three and former blogger for Amnesty International who was one of the leading campaigners for women's right to drive. Aziza al-Yousef is a 60-year-old professor at Riyadh's King Saud University. And then there is Hathloul, 29, who became the face of the driving movement in 2014 when she drove from the United Arab Emirates toward Saudi Arabia, live-streaming her journey. She was arrested at the Saudi border and spent 73 days in jail. The indomitable Hathloul was kidnapped in March while driving in Abu Dhabi, where she had been studying, forcibly returned to Saudi Arabia, and banned from posting on social media. In May, she was arrested and branded a\" traitor. \"Her husband was kidnapped from a hotel room in Jordan and returned to Saudi Arabia, according to the Washington Post. According to the Wall Street Journal, the central official in the campaign vs. women's - rights activists is none other than MBS's right-hand man, Saud al-Qahtani, the same man accused by U.S. officials of playing a key role in the operation that killed Khashoggi. The U.S. Treasury has sanctioned Qahtani, and he has supposedly been fired, but he is still continuing as a key adviser to MBS. The issue here is not the U.S.-Saudi alliance. but rather Trump's reliance on a reckless prince, which will continue to backfire. Every aspect of American foreign interests that MBS has touched has failed, from his kidnapping of the Lebanese prime minister, to his failure to godfather an Israeli-Palestinian peace, to the misbegotten Yemen war into which he dragged the United States. Related Articles Rubin: China's future weapon vs. the U.S.: Its growing middle class Rubin: View from China: Will Trump and Xi avoid a new Cold War? Rubin: There's something very wrong with Trump's careless adoration of that n-word. Rubin: Trump has made it kosher for anti-Semitism to reenter the American mainstream The White House is clearly eager to whitewash the CIA's conclusions about the murder of Khashoggi. But the reports of torture of jailed Saudi women send warning signals so blinding, they must not be ignored. Trudy Rubin is a Philadelphia Inquirer columnist. © 2018, Chicago Tribune. Distributed by Tribune Content Agency. Report an error Policies and Standards Contact Us Get Morning Report and other email newsletters Sign Up Follow Us Facebook Twitter Instagram RSS"}, {"articleID": "2017100216_00193736_W", "names": {"Mohammad Amin": ["Q17516076", "Q19881928", "Q20675862", "Q59279480"]}, "date": "2017-10-02", "url": "http://aaj.tv/2017/10/myanmar-ready-to-take-back-rohingya-refugees-minister/", "content": "-- File Photo DHAKA: A Myanmar minister on Monday proposed taking back hundreds of thousands of Rohingya Muslims who fled to Bangladesh after a military crackdown, according to Dhaka's top diplomat. But no details of the planned repatriation were given by Bangladesh Foreign Minister A.H Mahmood Ali, and there was widespread scepticism over whether any of the more than 800,000 Muslim Rohingya now in Bangladesh would return. More than half a million have arrived over the last five weeks after militant attacks in Myanmar's Rakhine state sparked violent reprisals which the UN has said could amount to ethnic cleansing in the Buddhist-dominated country. The talks between Mahmood Ali and Myanmar's Minister of the Office of State Counselor Kyaw Tint Swe came as UN representatives were given their first access to Rakhine since the trouble erupted on August 25. UN officials, diplomats and aid groups were taken on a one-day visit organised by Myanmar authorities. They were flown by helicopter to Maungdaw, epicentre of the violence. Mahmood Ali held what he called \"friendly\" talks in Dhaka with the representative of Myanmar's civilian leader Aung San Suu Kyi. \"Myanmar has made a proposal to take back the Rohingya refugees,\" the minister told reporters. \"The two sides have agreed to a proposal to set up a joint working group to coordinate the repatriation process.\" Suu Kyi, who has been severely criticised for her failure to curb the military crackdown, said last month that Myanmar would take back \"verified\" refugees. This would be done according to criteria agreed in 1993, when tens of thousands of Rohingya were repatriated, she said. The Bangladesh minister gave no timeframe for repatriation and did not say whether Myanmar would also take back 300,000 Rohingya refugees who fled to Bangladesh during earlier violence. He said refugees would be verified by the joint working group, but without UN involvement. \"Bangladesh has proposed a bilateral agreement (with Myanmar) to help implement the repatriation,\" he said. There was no immediate comment from Suu Kyi's representative, who was to return to his country on Monday. Myanmar denies the Rohingya minority citizenship even though many have lived there for generations. It considers the Muslims as illegal migrants from Bangladesh .--No papers, no state--Myanmar's insistence on verifying the Rohingya could prove a \"stumbling block\" to repatriation, according to Shahab Enam Khan, an international relations specialist at Jahangirnagar University. \"Myanmar has shown good initiative but their proposal is not adequate, particularly the verification is a non-starter,\" he told AFP. \"The Rohingya fled to Bangladesh without any legal documents and it is difficult to prove their identity.\" <mark>Mohammad Amin</mark>, who arrived in Bangladesh on Sunday with two neighbours in a rickety boat, said he would consider returning if their safety was guaranteed. \"If they treat us as equals, we would go back,\" he told AFP in a coastal town near the border. Nurul <mark>Amin</mark>, a labourer who also arrived Sunday by boat with six of his family members, said they fled after Buddhist mobs threatened them with violence if they did not leave. \"If they accept us as Rohingya, and said they would not harm us, we would return,\" he told AFP at a refugee registration booth. The refugees are packed into overcrowded UN and makeshift camps along the Bangladesh-Myanmar border. Aid groups have warned that epidemics could easily spread in the desperate conditions. It remains unclear where the Rohingya would go if they were returned to Myanmar. Many of their villages have been burnt to the ground in the reprisal operations. In a speech to the UN General Assembly last month, Bangladesh's Prime Minister Sheikh Hasina proposed creating UN-supervised safe zones inside Myanmar. Hasina accused Myanmar authorities of laying landmines on the border to prevent the Rohingya from returning and said the UN must find a solution to the crisis .--AFP"}, {"articleID": "2011111717_00011110_W", "names": {"Stephen Harper": ["Q206", "Q7609425"], "Peter Kent": ["Q11331756", "Q120749", "Q20172675", "Q3376692", "Q41121896"], "Joe Oliver": ["Q16107458", "Q6211624", "Q6211627"]}, "date": "2011-11-17", "url": "http://treehugger.com/fossil-fuels/canadas-minister-environment-calls-members-parliament-who-talked-american-congressmen-about-keystone-treacherous.html", "content": "? government of canada two members of her majesty's loyal opposition, megan leslie and claude gravelle, flew to washington to speak with members of congress and their staff about the keystone xl pipeline. in a democracy, there shouldn't be anything wrong with that; as leslie says: \"i think it's perfectly legitimate for an elected official to come down and say,\" you know what? <mark>stephen harper</mark> is our prime minister, but he is not the only person who gets to speak for canada and there are different points of view in canada .' \"not according to <mark>peter kent</mark>, the minister of the environment and protector of the pipeline. he is quoted in reuters:\" one of the opposition parties has taken the treacherous course of leaving the domestic debate and heading abroad to attack a legitimate canadian resource which is being responsibly developed and regulated. \"interestingly, according to oxford and british tradition, treachery and treason are synonyms. treason is defined in the criminal code of canada: every one commits treason who, in canada, (a) uses force or violence for the purpose of overthrowing the government of canada or a province; (b) without lawful authority, communicates or makes available to an agent of a state other than canada, military or scientific information or any sketch, plan, model, article, note or document of a military or scientific character that he knows or ought to know may be used by that state for a purpose prejudicial to the safety or defence of canada; (c) conspires with any person to commit high treason or to do anything mentioned in paragraph (a); (d) forms an intention to do anything that is high treason or that is mentioned in paragraph (a) and manifests that intention by an overt act; or (e) conspires with any person to do anything mentioned in paragraph (b) or forms an intention to do anything mentioned in paragraph (b) and manifests that intention by an overt act.\" i wonder when the minister is going to press charges. natural resources minister <mark>joe oliver</mark> was a bit more circumspect. he is quoted in canadaeast.com: \"people can say what they want. i think a parliamentarian should focus criticism in canada, not go to foreign countries and denigrate our economy and undermine our economic prospects.\" i wonder when they are going to start taking away our passports. and i thought freedom of speech was under threat south of the border. follow me on twitter and friend me on facebook"}, {"articleID": "2014091418_00028986_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}, "date": "2014-09-14", "url": "http://wfmz.com/news/news-election/kerry-countries-willing-to-aid-against-isis/28055452", "content": "<mark>Kerry</mark>: Countries willing to aid against ISIS (CNN) - Secretary of State <mark>John Kerry</mark> closed a trip to the Middle East saying countries \"in the region\" and \"outside the region\" are prepared to engage in military assistance against ISIS and \"in actual strikes if that is what it requires.\" Critics have said <mark>Kerry</mark>'s efforts to build an international coalition of Arab and European nations to fight ISIS were struggling. In an interview taped Saturday in Cairo, Egypt, that aired on CBS' \"Face The Nation\" Sunday, <mark>Kerry</mark> said some nations \"are clearly prepared to take action in the air alongside the United States and to do airstrikes, if that's what they're called on to do,\" but did not get more specific. On CBS, <mark>Kerry</mark> admitted that airstrikes alone will not solve the challenge of defeating ISIS, but he reiterated the administration's stance that there is no plan to put troops on the ground outside of local Iraqi forces and Syrian rebel groups. \"Well, we're not looking to put troops on the ground. There are some (nations) who have offered to do so, but we are not looking for that at this moment anyway,\" <mark>Kerry</mark> said. Integral to the White House strategy is an effort to train and equip Syrian rebel forces. On CNN's \"State of the Union,\" White House chief of staff Denis McDonough said: \"We have had a relationship with these fighters now for a couple of years. They're getting better and more capable. And what's most important here is that the Syrian opposition on the ground fighting ISIL can count on American and coalition airpower to supercharge their effort. That's important and that's ultimately going to be what is called for in this strategy.\" ISIS, which calls itself the Islamic State, is also known by the acronym ISIL. Republican Sen. Lindsey Graham, who advocates using U.S. special forces if needed to fight ISIS, was harshly critical of the Obama administration on \"Fox News Sunday.\" \"I will not let this president suggest to the American people we can outsource our security. And this is not about our safety--there is no way in hell you can form an army on the ground to go into Syria to destroy ISIL without a substantial American component,\" Graham said. \"This is a turning point in the war on terror. We are fighting a terrorist army, not an organization,\" Graham said. \"It's going to take an army to beat an army, and this idea that we'll never have any boots on the ground to defeat them in Syria is fantasy.\" \"This president needs to rise to the occasion before we all get killed back here at home,\" Graham said. The views expressed are not those of this company or its affiliated companies. Please note by clicking on \"Post\" you acknowledge that you have read the Please set an email address for your profile. To complete your registration on this site, please supply an address. Please confirm or modify the email address to which you will have subscription offers sent. For a more personalized experience, please supply the following You have entered a forbidden character"}, {"articleID": "2011092809_00035268_W", "names": {"Hugo Chavez": ["Q732006", "Q8440"]}, "date": "2011-09-28", "url": "http://stabroeknews.com/2011/news/regional/09/28/venezuela%e2%80%99s-chavez-nationalizes-local-ferry-company/", "content": "venezuela's <mark>chavez</mark> nationalizes local ferry company email print next page? caracas (reuters) - venezuelan president <mark>hugo chavez</mark> nationalized a local ferry company on monday in his latest move to put more of the south american opec member's economy under socialist state control. the company, conferry, which operates ferries from the mainland to the resort island of margarita, had been sanctioned in the past by the state consumer protection body for delays, technical failures and repeated customer complaints. \"no more. that is a disaster. we're going to nationalize it? the safety of our people who travel to margarita is very important,\" <mark>chavez</mark> said in a telephone call to state television. company officials were not immediately available to comment. conferry is owned by a wealthy family and began operating in 1959. it has three vessels, only two of which are operating, sailing from puerto la cruz and la guaira. the 57-year-old socialist leader has put swaths of the economy under state control during his 12 years in power, including most of the crucial oil sector. he is recovering after a fourth session of chemotherapy to treat cancer, but has vowed to win a new six-year term in a presidential election due in october 2012. also drawing <mark>chavez</mark>'s ire were emergency landings on monday in the southeast of the country by two planes operated by local companies. \"we must tighten the screws on all public and private companies to ensure they maintain their aircraft,\" he said. more in regional news reader comments? the comments section is intended to provide a forum for reasoned and reasonable debate on the newspaper's content and is an extension of the newspaper and what it has become well known for over its history: accuracy, balance and fairness. we reserve the right to edit/delete comments which contain attacks on other users, slander, coarse language and profanity, and gratuitous and incendiary references to race and ethnicity. we moderate all comments, so your comment will not be published until it has been reviewed by a moderator. our comments are powered by the disqus service. you may comment as a guest by entering your comment and selecting \"post as\" . optionally, you may sign-in using your facebook, yahoo or twitter accounts. disqus' privacy policy can be read here. please read our terms of service and privacy policy."}]