[{"articleID": "2017032804_00270059_W", "names": {"Christopher Gibson": ["Q10451590", "Q32722", "Q5112406"], "Deborah Tucker": ["Q46993213", "Q5248398"], "Andrew Jackson": ["Q16844406", "Q20641045", "Q22076700", "Q2846642", "Q3816215", "Q39067934", "Q43072215", "Q46182175", "Q4757451", "Q56872130", "Q58468310"], "John Marshall": ["Q11727936", "Q16227857", "Q1700966", "Q201423", "Q20675590", "Q20675591", "Q20684714", "Q21064499", "Q28709713", "Q29033953", "Q30604090", "Q3809459", "Q47540656", "Q51588456", "Q56808914", "Q58104514", "Q6246855", "Q6246857", "Q6246861", "Q6246867", "Q6246869", "Q6246871", "Q929340"], "Peter Finch": ["Q18530607", "Q7173980"], "James Noble": ["Q1322133", "Q14951134", "Q28421980", "Q58423558"], "Charlie Mccoy": ["Q17489746", "Q2619399"], "Mike Newell": ["Q1933404", "Q30612396", "Q312088"]}, "date": "2017-03-28", "url": "http://www.valdostadailytimes.com/news/national_international/today-in-history/article_12dcd70b-13a3-5ec2-80f6-e2eeb6e5ea34.html", "content": "National/International (31601) Today Intervals of clouds and sunshine. A stray shower or thunderstorm is possible. High around 85F. Winds SW at 5 to 10 mph. . Tonight A few clouds. Low 59F. Winds WSW at 5 to 10 mph. Updated: March 27, 2017 @ 11:53 pm VALDOSTA--A former Moody Air Force Base commander passed away during the weekend--a man whose career seemed to reflect the history of the 20th century. More Headlines VALDOSTA--The Lowndes baseball team had runners in scoring position while Valdosta left-hander Dayton Hall faced a 2-2 count with a one-run lead in the bottom of the seventh inning Tuesday night. More Headlines Ashley Reaves & <mark>Christopher Gibson</mark> LEESBURG, Ga.--Thomas Shane and <mark>Deborah Tucker</mark> of Leesburg, Ga. and William Timothy and Pam Reaves of Hahira, Ga. announce the engagement of their daughter, Ashley Reaves of Bluffton, S.C., to <mark>Christopher Gibson</mark> of Bluffton, S.C., son of Hope <mark>Gibson</mark> and Kenneth R. Hughett and the late Tate...More Headlines A time capsule and park bench in the heart of Drexel Park encourages passersby to sit and enjoy the surroundings. More Headlines 16 min ago Today in History Today is Tuesday, March 28, the 87th day of 2017. There are 278 days left in the year. Today's Highlight in History: On March 28, 1942, during World War II, British naval forces staged a successful raid on the Nazi-occupied French port of St. Nazaire in Operation Chariot, destroying the only dry dock on the Atlantic coast capable of repairing the German battleship Tirpitz. On this date: In 1834, the U.S. Senate voted to censure President <mark>Andrew Jackson</mark> for the removal of federal deposits from the Bank of the United States. In 1896, the opera \"Andrea Chenier,\" by Umberto Giordano, premiered in Milan, Italy. In 1898, the Supreme Court, in United States v. Wong Kim Ark, ruled that a child born in the United States to Chinese immigrants was a U.S. citizen. In 1930, the names of the Turkish cities of Constantinople and Angora were changed to Istanbul and Ankara. In 1935, the notorious Nazi propaganda film \"Triumph des Willens\" (Triumph of the Will), directed by Leni Riefenstahl, premiered in Berlin with Adolf Hitler present. In 1941, novelist and critic Virginia Woolf, 59, drowned herself near her home in Lewes, East Sussex, England. In 1955, <mark>John Marshall</mark> Harlan II was sworn in as an associate justice of the U.S. Supreme Court. In 1969, the 34th president of the United States, Dwight D. Eisenhower, died in Washington, D.C. at age 78. In 1977, \"Rocky\" won best picture at the 49th Academy Awards; <mark>Peter Finch</mark> was honored posthumously as best actor for \"Network\" while his co-star, Faye Dunaway, was recognized as best actress. In 1979, America's worst commercial nuclear accident occurred with a partial meltdown inside the Unit 2 reactor at the Three Mile Island plant near Middletown, Pennsylvania. In 1987, Maria von Trapp, whose life story inspired the Rodgers and Hammerstein musical \"The Sound of Music,\" died in Morrisville, Vermont, at age 82. In 1990, President George H.W. Bush presented the Congressional Gold Medal to the widow of U.S. Olympic legend Jesse Owens. Ten years ago: Iran aired a video of 15 British sailors and marines who were captured five days earlier; the lone female captive, Faye Furney, wearing a white tunic and a black head scarf, said the British boats had \"trespassed\" in Iranian waters while patrolling for smugglers near the mouth of the Shatt al-Arab, a disputed waterway. (The crew members were released a week later .) In the Philippines, dozens of children were taken hostage on a bus by a day-care center owner armed with grenades and guns; the crisis ended peacefully 10 hours later with the hostage-taker's surrender. Five years ago: The U.S. Supreme Court wrapped up three days of public arguments on President Barack Obama's historic health care law. On the last day of his visit, Pope Benedict XVI demanded more freedom for the Roman Catholic Church in communist-run Cuba and preached against \"fanaticism\" in an unusually political sermon before hundreds of thousands at Revolution Plaza. Bluegrass legend and banjo pioneer Earl Scruggs, 88, died in Nashville, Tennessee. One year ago: The FBI said it had successfully used a mysterious technique without Apple Inc.'s help to hack into the iPhone used by a gunman in a mass shooting in California, effectively ending a pitched court battle. Officers shot and wounded a man who had pulled a weapon at a security checkpoint as he entered the underground U.S. Capitol Visitor Center. Winston Moseley, the man convicted of the 1964 stabbing death of bar manager Kitty Genovese, died at the Clinton Correctional Facility in Dannemora, New York, at age 81. Actor <mark>James Noble</mark>, 94, died in Norwalk, Connecticut. Today's Birthdays: Former White House national security adviser Zbigniew Brzezinski (ZBIG' - nyef breh-ZHIN' - skee) is 89. Author Mario Vargas Llosa is 81. Country musician <mark>Charlie McCoy</mark> is 76. Movie director <mark>Mike Newell</mark> is 75. Actress Conchata Ferrell is 74. Philippines President Rodrigo Duterte is 72. Actress Dianne Wiest (weest) is 71. Country singer Reba McEntire is 62. Olympic gold medal gymnast Bart Conner is 59. Rapper Salt (Salt-N-Pepa) is 51. Actress Tracey Needham is 50. Actor Max Perlich is 49. Movie director Brett Ratner is 48. Country singer Rodney Atkins is 48. Actor Vince Vaughn is 47. Rapper Mr. Cheeks (Lost Boyz) is 46. Actor Ken L. is 44. Singer/songwriter Matt Nathanson is 44. Rock musician Dave Keuning is 41. Actress Annie Wersching is 40. Actress Julia Stiles is 36. Singer Lady Gaga is 31. Thought for Today: \"A man can do his best only by confidently seeking (and perpetually missing) an unattainable perfection.\" --Ralph Barton Perry, American author and educator (1876-1957). (Above Advance for Use Tuesday, March 28) Copyright 2017, The Associated Press. All rights reserved. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags"}, {"articleID": "2019110912_00043001_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Sarah Chen": ["Q48894641", "Q710713"]}, "date": "2019-11-09", "url": "http://www.gamereactor.eu/?system=ios&sid=b98a2cde9763892a5519e5b9f41200fb", "content": "iOS Picomy has crafted a mobile puzzle-platformer that's as unique as it is charming. Preview Written by <mark>Sam Bishop</mark> on the 8th of November 2019 at 07 Com2uS' event in Paris was a success, with millions of viewers tuning in to see the tournament. Team GO Rocket leaders have arrived to the Pokémon GO realm Written by Lisa Dahlgren on the 7th of November 2019 at 17:03 The latest Pokémon GO update brings with it a trio of leaders as well as Team GO Rocket boss Giovanni. Dead Cells' Corrupted Update adds plenty of features Written by <mark>Sam Bishop</mark> on the 7th of November 2019 at 16:30 Recycling Tubes are there for experienced players, and a new mini biome has also been added to the game. Fabulous app apologises for taking Gris artwork Written by <mark>Sam Bishop</mark> on the 7th of November 2019 at 13:30 \"I fully realize that I ripped off the game now, but in the animation process that wasn't my intention at all,\" a designer said. Cardpocalypse coming to consoles on December 12 Written by <mark>Sam Bishop</mark> on the 7th of November 2019 at 11:25 We also have a brand new story trailer as well, celebrating the impending arrival on PS4, Switch, and Xbox One. Blizzard tells us all about the new Hearthstone Invoke keyword Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 14:17 This is coming with the Descent of Dragons set, and we talked with Game Designer Peter Whalen and Engineer <mark>Sarah Chen</mark> about it. Diablo Immortal gets new trailer and some fresh details Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 09:36 The game has shown its face once more after the reveal at BlizzCon 2018, and we know about the equipment and Legendary items. Fortnite pro FaZe Jarvis banned for life Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 08 He's shared videos of his use of aimbots in solos and playground, and this has led to drastic consequences."}, {"articleID": "2010020106_00006080_W", "names": {"Angel Robinson": ["Q2849402", "Q4762260"], "Jasmine James": ["Q24579383", "Q40451151"]}, "date": "2010-02-01", "url": "http://cbs42.com/sports/story/Smalley-Scores-22-As-Tigers-Defeat-9-Georgia/VhwPmEq520aH8fQ4vYzR1g.cspx", "content": "auburn coach nell fortner pumps up the tigers. (cbs 42) auburn - the auburn women's basketball team (12-10, 3-6 sec) knocked off ninth-ranked georgia (18-4, 5-4 sec), 67-53, sunday at beard-eaves-memorial coliseum. junior alli smalley led auburn with 22 points, recording her second consecutive 20-point game. morgan toles led the team in assists with 10, setting a career high. nell fortner. \"it helps get us back on track but there are many games to play. we will use this one to get us back in the ball game here and when we play south carolina on thursday.\" the tigers pulled down 17 offensive rebounds in the game, including 10 in the second half. auburn turned the rebounds into 13 second-chance points. \"that's a nice stat right there,\" said fortner. \"that definitely helped us to stay in the game early. it helped us confidence-wise. offensive rebounding is a confidence builder and it is an energy destroyer for the other team. when you are able to get on those offensive boards, it can really help you.\" keke carrier bobblehead day, led the tigers in rebounds, pulling down nine. greenleaf followed with seven boards, followed by chantel hilliard with six. \"every game i try and go in there and dominate,\" said carrier. \"i was probably a little more motivated coming off two losses and got motivated by my team.\" the win was the first over a top-10 team since the sixth-ranked tigers knocked off no. 10 tennessee, 82-68, on jan. 25, 2009. the victory also marks the second consecutive time the tigers have defeated a georgia team ranked in the top 10. georgia has suffered three consecutive defeats as starters ashley houts and <mark>angel robinson</mark> have dealt with persistent ankle injuries. the pair combined for just nine points in sunday's loss. the lead was tossed back-and-forth in an opening six minutes of play that saw five lead changes and five ties. at the 14:35 mark, a pair of smalley free throws gave the tigers a two-point advantage. georgia's anne marie armstrong responded with a jumper to again level the score. nicolle thomas came off the bench to hit a 3-pointer, giving auburn a lead it would not give up. the tigers opened the lead to as many as 11 with just over six minutes left in the half. however, the bulldogs responded with a pair of three's and a layup from armstrong, cutting the lead to five. the tigers went on to take a, 37-32, lead into the locker room. georgia came out swinging in the second half, cutting the auburn lead, to 43-41, at the 15:44 mark. the tigers were able to rebuild their lead to nine with 7:38 remaining, compliments of a blanche alverson 3-pointer. houts, who had been pulled from the game at the 15:50 mark in the opening period, was subbed in with 5:28 remaining in the contest in search of an offensive spark. carrier added five points in the closing minutes as the tigers went on an 8-2 run, sealing the win for the home side. smalley's 3-pointer with just 46 seconds remaining ignited the crowd and put the came out of reach. the tigers were 42 percent from the field, 4-of-17 from outside the arc and 13-of-15 from the charity stripe. auburn won the rebounding battle 39-27 while also converting 17 bulldog turnovers into 22 points. the tigers' 20 assists marks the second-highest team assist total on the season. <mark>jasmine james</mark> led the bulldogs in scoring with 13 while anne marie armstrong pulled down a team-high five boards. georgia was 43 percent from the field, 5-of-24 from 3-point range and 6-of-12 from the line. \"we have to get into gear,\" said georgia head coach andy landers. \"we have to make plays like we were earlier in the year. we have to get healthy. we missed a lot of shots and free throws.\" you can send a story to multiple email addresses by separating the email addresses with a semicolon (;)"}, {"articleID": "2018102422_00052187_W", "names": {"Gary Brown": ["Q13468194", "Q42322389", "Q5524765", "Q5524766", "Q5524767", "Q5524768", "Q5524769", "Q5524770", "Q5524771"], "Linda Smith": ["Q16885749", "Q3241375", "Q435239", "Q57744472"]}, "date": "2018-10-24", "url": "http://bridgemi.com/detroit-journalism-cooperative/detroit-studying-whether-shut-water-underpopulated-neighborhoods", "content": "DETROIT ‒ Detroit officials are studying whether it makes sense to shut water service and relocate residents in parts of this sprawling and often vacant city, a top city official told Bridge Magazine. Seven years after a disastrous series of public meetings about then-Mayor Dave Bing's plan to downsize Detroit, city officials are amid a $57 million, five-year analysis of the water and sewer system. The study is intended to help prioritize repairs, but water officials acknowledge the findings may help determine whether the city should offer to pay to move residents out of abandoned neighborhoods and shut water lines. \"Areas that are so sparsely populated, perhaps the neighborhood should be shut down and just move people out? We think so.\" ‒ <mark>Gary Brown</mark>, director of the Detroit Water and Sewerage Department. \"Areas that are so sparsely populated, perhaps the neighborhood should be shut down and just move people out? We think so,\" <mark>Gary Brown</mark>, director of the Detroit Water and Sewerage Department, told Bridge. <mark>Brown</mark> said the study is being conducted in conjunction with several city departments, including the office of Mayor Mike Duggan, planning officials and roads. <mark>Brown</mark> stressed that any proposal about enticing residents to relocate would be at least three to five years away. Related: In Detroit, surviving without running water has become a way of life \"I'm interested. The mayor is interested: Whether it's more advantageous to offer people a (city-owned) Land Bank home that has five times the value elsewhere...When you get into some of these neighborhoods with only a few houses, you'd get a better return on your investment to just move three people and shut down the infrastructure.\" Alexis Wiley, Duggan's chief of staff, issued a statement Tuesday distancing Duggan from <mark>Brown</mark>'s remarks, telling Bridge \"the mayor completely disagrees with this idea.\" \"The mayor's consistent approach has been to provide city services equally to all neighborhoods, regardless of population density,\" Wiley said. \"We've lit every neighborhood to the same national standard. We pick up trash, maintain parks, cut vacant lots and remove dead trees to the same standard in every neighborhood and we sweep every mile of residential streets just the same. That will continue.\" Whatever the case, the study and discussion come as Detroit continues to confront decades of neglect necessitating millions or perhaps billions of dollars in infrastructure repairs--and amid heightened sensitivities about whether all neighborhoods are benefiting from new investment in the city. Detroit officials have floated various forms of downsizing for years, as the population fell from nearly 2 million in the 1950s to 670,000 today and services have become harder to deliver in the 139-square-mile city. \"It's not for <mark>Gary Brown</mark> to decide where people live. Water is a service vital to people's health. It's not to be used as a political tool to re-engineer the city.\" ‒ Russ Bellant, Detroit neighborhood activist But shrinking services for entire neighborhoods, especially to residents who have remained in the city while neighbors fled, has been political kryptonite. Told of <mark>Brown</mark>'s comments by Bridge, East Side housing leader <mark>Linda Smith</mark>'s reaction was succinct. \"Aw, hell to the no,\" said <mark>Brown</mark>, executive director of U-SNAP-BAC, a nonprofit that develops affordable housing. Old system, rising costs Detroit's issues with abandonment are legendary. A city geographically large enough to fit San Francisco, Manhattan and Boston and still have leftover land, Detroit has more than 2.5 million fewer residents than those cities. All told, Detroit has about 24 square-miles of vacant land, including 72,000 publicly owned empty parcels, according to a report last year by Detroit Future City, a nonprofit planning group. More than 20 square miles of Detroit are considered abandoned. Here's a look at vacancy and abandonment in the city. (Photo courtesy of Data Driven Detroit) Over the years, there's been debate about whether it makes sense for the city to provide services to them all. As part of its municipal bankruptcy, Detroit agreed in 2015 to lease its water system--which serves 4 million residents in southeast Michigan--to a new suburban group, the Great Lakes Water Authority. In exchange, Detroit gets $50 million per year for 40 years, about $500 million of which will pay for upgrades and line replacements in the next five years for an old, neglected system. That's enough to replace about 2 percent of the system per year. The money comes as Detroit faces a reckoning: Water usage is dropping, down 27 percent since 2008 because of conservation efforts and efficiencies in home plumbing, but the system faces more needs than ever. Much of 2,700-mile network of water pipes was built before World War II, and the average line is 95 years-old. Many pipes from the late 1800s remain, and the city has only replaced 15 percent of the system in a century. The sewer system also is showing its age, averaging 200 sinkholes and cave-ins per year in the past five years, city records show. \"This was a beautifully designed system for 100 years ago,\" said <mark>Brown</mark>, the water chief. \"But we haven't done much maintenance for two decades. We were trying to stay out of bankruptcy,\" said <mark>Brown</mark>, who discussed the city's infrastructure needs and his ideas about shutting lines during three interviews with Bridge in the past two weeks. BRIDGE INFRASTRUCTURE COVERAGE: A s cities rush to sell off utilities, Wyandotte boasts 3 city-run systems Michigan's infrastructure is in shambles. Answers aren't easy Michigan needs $4B more per year for infrastructure, but how to pay for it? Michigan's 2018 infrastructure report card: D + Lansing dozes as infrastructure crumbles In recent years, Detroit has pursued several controversial plans to increase water and sewer revenues. It has disconnected water at 112,000 homes since 2014 to increase collections, and raised sewage fees for drainage, prompting an outcry from pastors and lawsuits. The water department's 2015 master plan discusses closing or modifying some water filtration plants, which could need $1 billion in upgrades by 2035. Shutting service in select areas may make that easier, <mark>Brown</mark> said. The city could perhaps redevelop fallow land into industrial parks to create jobs, he said. \"There are pieces of a large system that can be taken out without impacting the system as a whole,\" <mark>Brown</mark> said. The city is amid a $57 million, five-year study with national engineering firm AECOM to develop metrics on which service lines in Detroit should be replaced first. The study weighs several factors, including age and health of the lines, but also the likelihood of neighborhood comebacks. Perhaps unsurprisingly, two of the city's hottest areas--downtown and Midtown--are deemed higher priorities for line replacement. \"We need the data to make these kinds of decisions, but this has been talked about lots of times,\" said <mark>Brown</mark>, who served on the City Council before taking over the water department. \"It's politically difficult to pick winners and losers, which neighborhoods are viable and which should go back to God.\" \"But this is the fact: This is a city built for 2 million people and now we have 650,000,\" <mark>Brown</mark> said. He noted the city is already pursuing a similar model in Southwest Detroit, where as many as 350 families are being offered publicly owned homes if they leave the area near the planned Gordie Howe International Bridge to Windsor. <mark>Brown</mark> said the city can look to one of the water department's municipal customers, Highland Park, as a cautionary tale of how abandonment can wreck infrastructure. The city within Detroit, whose population plummeted to 10,000 from 53,000 in the 1930s, is so empty Highland Park has to send vacuum trucks to move human waste through its pipes. Gravity is supposed to propel sewage from pipes to treatment plants, but there are too few people flushing toilets to move the waste along in Highland Park, <mark>Brown</mark> said. A non-starter for many Any talk of relocations or downsizing in Detroit--especially amid a flurry of public investment in downtown and Midtown--is bound to be controversial. Told of the water study by Bridge on Tuesday, one neighborhood activist sighed and said, \"Jesus.\" \"It's appalling,\" said the activist, Russ Bellant, president of the HelCo Block Club on the city's northeast side, a retired Water Department plant operator and city council candidate last year. \"It's not for <mark>Gary Brown</mark> to decide where people live. Water is a service vital to people's health. It's not to be used as a political tool to re-engineer the city.\" Bellant was among those who attended meetings in 2011 about the so-called Detroit Works plan to re-engineer and shrink the city. The idea by former mayor Bing was devised as Detroit slipped toward bankruptcy to streamline services and perhaps relocate residents. The plan never recovered from poorly organized initial meetings that got off to a rough start when Bing likened some neighborhoods to a \"hell hole.\" Talk of moving Detroiters still strikes raw nerves for many in this predominantly black city, including residents old enough to recall city relocation efforts in the past targeting minority residents, most notably \"urban renewal\" drives in the early 1960s that demolished the Black Bottom neighborhood for freeways. Other controversial efforts included using eminent domain to clear the Poletown neighborhood in the 1980s for a General Motors Plant and the city's clearing of land in the Rivertown neighborhood in the 1990s for casinos that eventually located elsewhere. Most of Detroit's 2,700-mile network of water pipes was built before World War II and maintenance was delayed for years as the city slunk toward bankruptcy. (Bridge photo by Anthony Lanzilote) Under Duggan, city planners have adopted many of the concepts from Bing's failed plan, including using empty land as an asset to develop green spaces, farms or green belts. Duggan, though, has been careful to say his goal is to expand the city's population and has never characterized planning efforts as downsizing. \"One of the challenges in the city is even highly vacant places aren't totally vacant,\" said Tom Goddeeris, deputy director of Detroit Future City, a planning group that has been involved in discussions about reimagining Detroit. \"There aren't a lot of places where there is just one house. It's three or four house here and three or four there.\" Overall, 6 percent of Detroit is considered \"low density\" ; that is, areas that are home to five or fewer people per acre, according to a Detroit Future City report. That's comparable to poor cities nationwide, but what makes Detroit unique is the lack of high-density neighborhoods to offset the vacant ones. Goddeeris noted that the response to the city's offer to relocate residents near the planned Gordie Howe International Bridge--in one of the most industrial, polluted corners of Michigan--could be instructive. So far, only a small fraction of 350 offered city-owned homes have wanted to leave. \"Even if there are compelling reasons to move and there are fairly reasonable options,\" Goddeeris said, \"people still aren't interested.\" Wiley, the mayor's chief of staff, stressed the goal of that program was not to downsize but to help residents of the neighborhood near the planned bridge \"relocate to another neighborhood in the city of Detroit.\" Related: In Detroit, surviving without running water has become a way of life Next article Read 3 comments Twitter Facebook Google + Mail"}, {"articleID": "2018100609_00187371_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2018-10-06", "url": "http://www.gamereactor.eu/games/80323/FIFA", "content": "FIFA 19 REVIEW. Written by <mark>Mike Holmes</mark> on the 28th of September 2018 at 10 \"It's a solid football sim, make no mistake, but EA Sports is going to have to do better next year.\" 0 REVIEW. Written by Ricardo C. Esteves on the 19th of September 2018 at 13 \"FIFA 18 was a phenomenal football game, and FIFA 19 follows suit, although not quite to the same degree.\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 5th of October 2018 at 12:06 He has been removed from the cover on EA's website. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 5th of October 2018 at 10 Seeing all 20 clubs take part. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 4th of October 2018 at 09 Coming to Paris Games Week later this month. 0 NEWS. Written by <mark>Mike Holmes</mark> on the 1st of October 2018 at 18:08 Still willing to take a chance?"}, {"articleID": "2019082916_00084944_W", "names": {"Brian Baker": ["Q4963025", "Q4963026", "Q4963027", "Q4963029", "Q53329", "Q911812"], "Alex Wong": ["Q4718004", "Q50093976"]}, "date": "2019-08-29", "url": "http://www.wibc.com/blogs/tony-katz/pence-not-enough-win-next-election-we-have-win-next-generation", "content": "Tony Katz Blog> Tony Katz> Pence: Not Enough to Win Next Election, We Have to Win The Next Generation Pence: Not Enough to Win Next Election, We Have to Win The Next Generation Pence: \"Openly advocating Socialism in the United States is something I never thought I'd live to see.\" <mark>Brian Baker</mark> Aug. 29, 2019 Share Facebook Twitter LinkedIn Copy Link (Photo Credit: WIBC) Defending the American dream and preserving our system of government for future generations is a top priority for Vice President Mike Pence heading into the 2020 election. While visiting Indianapolis this week to deliver an address at the American Legion Convention, the Vice President offered his thoughts to WIBC host Tony Katz on recent polling that revealed an increase in the number of young Americans who support Socialism. \"Ronald Reagan very famously said that freedom is never more than one generation away from extinction [and] it is the duty of every American generation to preserve freedom,\" said Pence. \"And that's why I've said many times all across the country that it's not going to be enough for us to win the next the election, we have to win the next generation.\" Pence expressed his concern with the number of Democrat representatives in Washington who are openly advocating for an economic system that has impoverished millions of people and robbed them of their liberties. \"Openly advocating Socialism in the United States is something I never thought I'd live to see,\" said Pence. \"And it gives you an idea of how incredibly far left the modern Democratic Party has gone.\" Vice President Pence added, however, that the results of the historic 2016 election demonstrate that the majority of Americans are resolute in their desire to preserve our system of government as the founders intended. \"I really believe that President Trump's message of a strong military, of a free market economy, of conservative jurist prudence on our courts, still connects with the majority of the American people,\" said Pence. \"And our challenge is to continue to carry that out, go win this election, and deliver the results that we've got happening all over this country.\" Vice President Pence also responded to an excerpt that was published in the Wall Street Journal from former Defense Secretary Jim Mattis' book, \"Call Sign Chaos,\" which criticizes the Trump administration's approach to foreign policy, and warns against the risk of alienating our allies. Pence responded that \"America First' does not mean\" America Alone,' but it does mean that America's best interests are our top priority, adding that leaders around the world respect and appreciate renewed American leadership on the world stage. \"We had eight years of a President who apologized for America,\" said Pence. \"Now we have a President who never apologizes for America.\" He continued: \"[World leaders] appreciate and respect an American President who puts the interests of our country first, but they also respect that [Trump] recognizes that they're going to put the best interests of their country first as well.\" Asked to offer assurances to American farmers who are caught in the middle of the Trump administration's contentious trade negotiations with China, the Vice President said the best thing for Hoosier farmers and manufacturers is have congress pass the USMCA - the United States Mexico Canada Agreement. \"It is going to be a huge improvement on NAFTA,\" said Pence. \"More than 70,000 U.S. manufacturing facilities have closed since Bill Clinton signed NAFTA into law in 1995, and tens of thousands of those jobs went South of the border into Mexico.\" The Vice President urged Americans to call their Democrat representatives in congress and urge them to have Nancy Pelosi bring the USMCA to the House floor for a vote. \"It will strengthen the President's hands in our negotiations with the E.U., with the U.K. after Brexit, and with China by showing that in North America, we can modernize this agreement in a way that puts American jobs and American workers first,\" said Pence. The Vice President added that once the USMCA is successfully passed, it would result in the creation of up to 175,000 new jobs in the early phases of the agreement, according to analysts. Hoosier farmers and manufacturers are poised to reap significant benefits from the USMCA being signed into law, according to Pence. \"When you look at the percentage of agricultural products and manufacturing products in Indiana that go either to Mexico or to Canada, it will be an overwhelming percentage of our exports in this state,\" said Pence. Check out Tony Katz's full, unedited interview with Vice President Mike Pence by clicking on the link below. Tony Katz Aug. 29, 2019 The Tao of Dave Chappelle (Michael Kovac/Getty Images) If you have been following the reviews of Dave Chapelle's new Netflix stand-up...Share Facebook Twitter LinkedIn Copy Close Tony Katz Aug. 28, 2019 Rep. Omar Using Campaign Funds For A Booty Call? (<mark>Alex Wong</mark> / Staff / Getty Images) An independent government watchdog claims Democratic Rep. Ilhan Omar's campaign...Share Facebook Twitter LinkedIn Copy Close Advertisement Load more Advertisement WIBC TV TRENDING ON 93.1 WIBC 1 Godfather Actor Gianni Russo Makes Outrageous Claims About Marilyn Monroe, Killing a Pedophile 5,665 Views 2 Three Snakes Found on Man's Property in Jackson County 2,747 Views 3 Brother, Sister Killed in East Side Shooting; IMPD Searching for Suspect 2,559 Views 4 Man Found Stabbed in Semi on I-70 Dies, Other Man in Semi Charged with Murder 2,411 Views 5 Man Missing for Nearly a Decade Found Behind Wall of Supermarket 1,990 Views Event Calendar Sep 22 2019 Colts Bud Light Tailgate, Colts vs. Falcons 10:00 am @ Georgia Street Upcoming Sep 29 2019 Colts Bud Light Tailgate, Colts vs. Raiders Oct 20 2019 Colts Bud Light Tailgate, Colts vs. Texans Oct 27 2019 Colts Bud Light Tailgate, Colts vs. Broncos Nov 10 2019 Colts Bud Light Tailgate, Colts vs. Dolphins View All Calendars Contests View All Win a Ticket Prize Pack to the Big Machine Vodka 400 at the Brickyard! Win a 4-pack of tickets to see Ball State vs. Indiana @ Lucas Oil Stadium [QUIZ] Enter to win Big Machine Vodka's Brickyard 400 Race Tickets"}, {"articleID": "2019120315_00260125_W", "names": {"Dan Reynolds": ["Q5214274", "Q5214275"]}, "date": "2019-12-03", "url": "http://daijiworld.com/news/newsDisplay.aspx?newsID=649837", "content": "<mark>Reynolds</mark>' tweets praise over clipping of girl students singing \"Believer' <mark>Reynolds</mark>' tweets praise over clipping of girl students singing\" Believer' Tue, Dec 3 2019 09:03:12 PM New Delhi, Dec 3 (IANS): A video clipping of a group of schoolchildren rendering Imagine Dragon's popular song Believer has created quite a buzz on social media. The well-synchronised singing by the girls' choir left people praising the effort. The band's lead singer <mark>Dan Reynolds</mark> also tweeted his praise. A Twitter user posted the clipping a week ago and wrote: \"Schools in India are singing Believer in morning assembly.\" The post got 2.2 K retweets and 9.3 K likes. <mark>Reynolds</mark> wrote on @ DanReynolds: \"So beautiful. Thank you for sharing this.\" The fan replied back: \"Thanks for replying. Big fan of your work.\" One user conjectured that it was sung in the morning assembly. But another differed: \"This is definitely St Charles School in Bengaluru. This is not assembly. Rather they are practising for their school function which was held last week.\" When one user objected to the singing of the song in the morning assembly, one Twitter user posted: \"People can find controversy in everything. Find religion in music. And I thought music has no language.\" --IANS You have 2000 characters left. Disclaimer: Please write your correct name and email address. Kindly do not post any personal, abusive, defamatory, infringing, obscene, indecent, discriminatory or unlawful or similar comments. Daijiworld.com will not be responsible for any defamatory message posted under this article. Please note that sending false messages to insult, defame, intimidate, mislead or deceive people or to intentionally cause public disorder is punishable under law. It is obligatory on Daijiworld to provide the IP address and other details of senders of such comments, to the authority concerned upon request. Hence, sending offensive comments using daijiworld will be purely at your own risk, and in no way will Daijiworld.com be held responsible. Security Validation"}, {"articleID": "2010031116_00139536_W", "names": {"David Mark": ["Q16115800", "Q17505469", "Q18159867", "Q459205"], "Peter Baker": ["Q18205345", "Q2507374", "Q37376664", "Q55455271", "Q7172646", "Q7172647", "Q7172649"], "Jim Baker": ["Q17352688", "Q18764156", "Q6193502", "Q6193507"], "Patrick Kennedy": ["Q16105663", "Q17541361", "Q247915", "Q7146936", "Q7146939"]}, "date": "2010-03-11", "url": "http://feeds.cbsnews.com/%7Er/CBSNewsTravelGuru/%7E3/c8xnJFPdd4M/main6288901.shtml", "content": "rep. eric massa, (d) new york, had some choice words recently about rahm emanuel, calling him \"the son of the devil's spawn.\" <mark>david mark</mark>, senior editor for politico, examines rahm emanuel and how he helps and hurts the obama presidency. white house chief of staff rahm emanuel (cbs) (the new republic) noam scheiber is a senior editor of the new republic. allow me to posit a case study: two high-ranking government officials are the subject of multiple newspaper and magazine profiles in the span of a few weeks. the first official resists the attention. he isn't so much as quoted in any of the pieces, whose authors glumly note his lack of enthusiasm for their projects. by contrast, the second official goes out of his way to cooperate with the profile-writers. he submits to numerous, on-the-record interviews and mounts a detailed defense of his actions. his aides even distribute one of the articles after the fact. now, which of these officials would you expect to be pilloried for hogging the spotlight and deflecting blame onto the president? right--me, too. i refer of course to rahm emanuel and tim geithner. since mid-february, emanuel has seen his performance as white house chief of staff dissected in at least four pieces that were, to varying degrees, sympathetic: two in the new york times magazine. similarly, geithner's tenure as treasury secretary is the topic of thousands of words in the current issue of vogue. emanuel is basically a ghost in his pieces-you sometimes think you detect his presence, but it vanishes when you do a double-take. geithner is the central presence in his profiles, delivering lengthy soliloquies on the political economy of financial crises. but whereas geithner's participation is seen as benign, even salutary-virtually everyone in washington (including me) thinks the administration could benefit from a better explanation of its economic successes-emanuel's studious non-participation is held up as evidence of malign intent. \"it sounded, for all the world, like the kind of orchestrated leaks that often precede a forced resignation in washington,\" the wrote of his paper's emanuel stories. \"except that the chief of staff doesn't usually force the president out.\" so, according to this thinking, emanuel has been serving as washington's de facto assignment editor in addition to his other responsibilities. it might all make perfect sense--if it weren't completely nutso. let's not kid ourselves: any time you see a spurt of stories about an operator as prodigious as rahm emanuel, there's reason to think he might be involved. emanuel is \"as relentless in working reporters as he is in working congressmen,\" the times' <mark>peter baker</mark>, who authored one of the profiles, recently told the new yorker. \"he cajoles, lobbies, berates, and trades information because he understands it's better to work with the media than to shut us out.\" suffice it to say, it's hard to believe such a person wouldn't take an interest in his own press clippings. moreover, it would be naïve to assume emanuel wasn't involved in a piece just because he didn't advertise it. as the wall street journal's naftali bendavid notes in the thumpin', his book about emanuel's turn at the house democratic campaign committee (dccc), the chief of staff's longstanding mantra when dealing with reporters is \"no fingerprints.\" bendavid illustrates the approach in the context of several dccc-initiated stories about republicans in the aftermath of hurricane katrina. having said all that, the far more important thing to understand about emanuel is that he has an acutely-honed sense of his own self-interest. which is why he surely knew that drawing attention to himself, and to the ways the president erred by rejecting his advice, would have been a recklessly self-defeating act. all the more so back in february, when the obama administration faced its most turbulent moment yet. this is, after all, one of the most fanatically discreet white house's in recent memory. the average \"west wing\" fan could have told you that airing dirty laundry amid all the scrutiny would completely tick off this president. between this and my own writing about emanuel-a piece i can assure you he didn't initiate, and that i actually started back in december, long before he became washington's chief preoccupation-i'm confident the recent profiles had little to do with any lobbying on the part of their subject. what the pieces mostly had to do with is the fact that emanuel is a compelling figure in his own right. since i published my take last week, a variety of people have privately expressed amazement that emanuel and the white house would allow such a piece to be written. the observation often takes the form of a comparison to a previous chief of staff-something like, \"i can't imagine john podesta or andy card ever going along with a piece like this.\" but, as much as i respect podesta and admire his work for bill clinton, the situation isn't close to analogous. emanuel was a widely known-and much-profiled-figure long before he joined the obama white house; in his own prior life, podesta was a career staffer known only to politicos. there was always going to be a much bigger appetite for rahm emanuel profiles than john podesta profiles. and some fraction of those were going to see the light of day, regardless of how emanuel felt about them. as for the orientation of the recent rahm pieces, that has much more to do with broader media tidal-movements than any intervention by emanuel himself. back in january and early february, a handful of reporters and pundits alleged that emanuel's mistakes as chief of staff were threatening obama's presidency (see here). at that point, a second group of journalists noticed that the anti-rahm narrative, whatever truth it contained, had overshot its <mark>mark</mark>. being opportunistic players in a competitive industry, they (er, we) gambled that some additional reporting and analysis might produce a corrective to the conventional wisdom. better yet, the corrective would have the virtue of being both novel and true! unfortunately, as any economist will tell you, people in a competitive market tend to bid away profits pretty quickly. and so it was that we ended up with not one corrective piece but four. it's not surprising that people like broder--and bloomberg harrumphed about the recent rahm coverage--would read multiple pieces on someone like emanuel and assume they must be orchestrated. these writers came of age in an era when practicing political journalism meant channeling the thoughts of powerful insiders. the main reporting challenge back then was breaking into the establishment-becoming the guy bob strauss or <mark>jim baker</mark> called with a juicy scoop. but the cardinal virtue for this generation's political journalist isn't access; it's counter-intuition. everyone wants to say something surprising, and to generate it by dint of their cleverness and resourcefulness, not at the urging of some wise man they're cultivating. you spend weeks working sources at varying distances from your subject, praying that the scraps of news you collect don't first wind up in the hands of widely-read web reporters like marc ambinder. so you can imagine how it feels when, just as you're pulling it all together, you learn that two or three other journalists have been up to exactly the same thing. actually, you don't have to imagine. i'll tell you: it's kind of annoying. but that's the way the world works. (and, for the record, i wouldn't trade jobs with anybody ...) it's all a little ironic, i guess: as much as we rahm-ologists like to believe we're independent arbiters, our pieces suggest we're only slightly more free-thinking than the establishment journalists of yore. maybe the only difference is that we're chained to a predictable meta-narrative rather than to a particular source. granted, i hope that's not the case. but, if it is, you can hardly blame rahm emanuel. the posting of advertisements, profanity, or personal attacks is prohibited. by using this web site you agree to accept our report offensive content: if you believe this comment is offensive or violates the cbsnews.com terms of use, you can report it below (this will not automatically remove the comment). once reported, our staff will be notified and the comment will be reviewed. offensive: sexually explicit or offensive language advertisements, commercial links, or repetitive posts disruptive posting: flaming or offending other users illegal activities: promote cracked software, or other illegal content e-mail this comment to a friend. e-mail this to: send me a copy of this message note: your e-mail address is used only to let the recipient know who sent the e-mail and in case of transmission error. neither your address nor the recipients's address will be used for any other purpose. <mark>patrick kennedy</mark>: media doing \"despicable\" job covering afghanistan 7.2-magnitude quake rocks central chile as president sebastian pinera is sworn into office; no immediate reports of injuries angelina jolie films in paris; plus, tom hanks, adrien brody, catherine zeta jones and mo \"nique a glimpse at the day's news as seen through a camera lens this\" er \"actress now plays a\" good wife \""}, {"articleID": "2011052101_00080303_W", "names": {"Jesse James": ["Q18719497", "Q20985425", "Q21062632", "Q530550", "Q954359"], "Ucla 'S Tiffany Lua Had A Hole-In-One And Topped The Individual Leaderboard With Four Holes Left And The Bruins Had A Six-Stroke Lead Friday When Third-Round Play In The Ncaa Division I Women 'S Golf Championship Was Suspended Because Of Darkness . Lua , Who Entered The Round Tied For Third , Aced The Par-3 11Th Hole . She Was 3 Under For The Day And 5 Under Overall On The Tradition Club Course . Georgia 'S Marta Silva Zamora Was Tied For Second At 2 Under With Lsu 'S Austin Ernst . Silva Zamora Had A 72 , And Ernst Was 4 Over For The Round With Four Holes Left . \" I Got Off To A Rough Start , But After That I Tried To Make Some Good Solid Swings And Keep A Good Tempo , \" Lua Said . \" I Wanted To Make Some Solid Strokes In Putting . I Was Excited To Make The Ace And Follow That With A Birdie . I 'M Definitely Looking Forward To Tomorrow . \" Ucla Had Four Holes Left . Defending Champion Purdue Was Second , Also With Four Holes Left . \" We 'Re Going To Take It Easy , \" Ucla Coach Carrie Forsyth Said . \" We Have To Take It Easy . We Are Going To Think Positive And Try To Make Good Decisions Because We Made Some Bad Ones Today . We Need To Have Confidence , And I Think We Will Play Just Fine . \" The Round Was Delayed 1 Hour , 50 Minutes Because Of Lightning . Ucla Was On The Seventh Hole When Play Was Delayed . Forsyth Said She Was Surprised How Much The Delay Affected Her Team , Which Shot A 5 Under Through The First Seven And Was 6 Over On The Next Three . \" Sometimes The Break Helps You , And Sometimes They Help You , \" Forsyth Said . \" We Had Some Girls Who Had Momentum Going , And You Feel Like You 'Re Doing Well , And Then You Come In And Sit . \" Coastal Carolina 'S Courtney Boe Also Had A Hole-In-One On The 11Th Hole , And Virginia 'S Brittany Altomare Aced The 16Th . Georgetown Police Try To Piece Together Restaurant Owner 'S Injuries Swat Officer Fired , Six Others Disciplined In Aftermath Of Party <Mark>Jesse James</Mark> ": []}, "date": "2011-05-21", "url": "http://statesman.com/news/texas/ucla-bruins-lua-lead-ncaa-womens-golf-1488449.html?cxtype=rss_texas", "content": "Names:"}, {"articleID": "2017101607_00181338_W", "names": {"Mason Rudolph": ["Q19666923", "Q3543162"], "Mark Humphrey": ["Q6768145", "Q6768146"], "Ray Guy": ["Q1857411", "Q7297563"], "Pat Brady": ["Q2056430", "Q3368521", "Q7143235", "Q7143237"], "Malcolm Perry": ["Q37372024", "Q47124330", "Q6742550", "Q6742553"], "Andre Williams": ["Q16235162", "Q2846286"], "Jonathan Taylor": ["Q16214649", "Q26864704", "Q41788679", "Q41806856", "Q57440551", "Q58464066", "Q6274569", "Q6274573", "Q6274575"]}, "date": "2017-10-16", "url": "http://idahopress.com/sports/national/stat-watch-marshall-punter-s--yarder-longest-since/article_c933b9b2-1f12-553e-8488-cbb71a0a1f32.html?block_id=1359641", "content": "STAT WATCH: Marshall punter's 92-yarder longest since 1972 By ERIC OLSON AP College Football Writer 16 min ago (...) UCLA quarterback Josh Rosen (3) throws down field for a first down against Arizona in the first half during an NCAA college football game, Saturday, Oct. 14, 2017, in Tucson, Ariz. (AP Photo/Rick Scuteri) Rick Scuteri Oklahoma State quarterback <mark>Mason Rudolph</mark> (2) passes in the fourth quarter of an NCAA college football game against Baylor in Stillwater, Okla., Saturday, Oct. 14, 2017. Oklahoma State won 59-16. (AP Photo/Sue Ogrocki) Sue Ogrocki Boston College running back AJ Dillon (2) crosses the goal line to score during the second half of an NCAA college football game against Louisville, Saturday, Oct. 14, 2017, in Louisville, Ky.. Boston College won 45-42. (AP Photo/Timothy D. Easley) Timothy D. Easley Navy quarterback Zach Abey, left, runs the ball behind the blocking of fullback Chris High (33) in the first half of an NCAA college football game against Memphis Saturday, Oct. 14, 2017, in Memphis, Tenn. (AP Photo/Mark <mark>Humphrey</mark>) <mark>Mark Humphrey</mark> Navy quarterback Zach Abey (9) scores a touchdown on an 8-yard run against Memphis in the second half of an NCAA college football game Saturday, Oct. 14, 2017, in Memphis, Tenn.. Memphis upset Navy 30-27. (AP Photo/Mark <mark>Humphrey</mark>) <mark>Mark Humphrey</mark> Marshall's Kaare Vedvik knew he hit a good punt out of his own end zone. Once the ball landed, it kept going and going, farther than any other punt in a Football Bowl Subdivision game in 45 years. His 92-yard punt against Old Dominion on Saturday was, according to Marshall research, the longest since Southern Mississippi's <mark>Ray Guy</mark> boomed a 93-yarder against Mississippi in 1972. \"It's an unbelievable feeling to send it from one end zone to the other,\" the redshirt senior from Norway said. \"It's a punter's dream. Every time, you just try to hit your best ball. This one went over his head and had a nice tail wind. The ball rolled down to the other goal line, so you can't ask for anything better than that.\" × Vedvik's big punt came after the Thundering Herd went three plays and out on their first possession of the game. With the ball at the 8-yard line, Vedvik was deep in his own end zone and with a light wind at his back when he put his foot to the ball. It bounced at the Old Domion 30, over the return man, and skipped hard toward the end zone and rolled in before the coverage team could down it. Vedvik also had punts of 52, 36, 48 and 36 yards as well as a pooch punt of 27 in the Herd's 35-3 win. His season average of 44.8 yards leads Conference USA. The longest punt in FBS history: 99 yards by Nevada's <mark>Pat Brady</mark> against Loyola Marymount in 1950. Some other notable feats from the weekend:------LEG WORKOUT Kansas' Cole Moos established a national season high with 13 punts against Iowa State. No other punter in the FBS has attempted more than 11 in a game this season. Moos' 40 punts are most in the Big 12 by far. NAVY GOES BY LAND Navy leads the nation with 397.5 yards rushing per game, and the Midshipmen are on pace to pile up the most yards on the ground since Nebraska's 1995 national championship team averaged 399.8. Quarterback Zach Abey is running for 169.3 yards per game, 29 behind national leader Bryce Love of Stanford. Abey's 189 carries are tied for most in the country. The Midshipmen also get nearly 70 yards a game from both <mark>Malcolm Perry</mark> and Chris High. THE 200 CLUB Boston College freshman AJ Dillion had the top rushing performance of the weekend, running for 272 yards and four touchdowns on 39 carries in a 45-42 win over Louisville. It was the third-best outing by a BC back behind <mark>Andre Williams</mark>' 339 yards against North Carolina State and 295 yards against New Mexico State, both in 2013. Arizona quarterback Khalil Tate, after going for 327 yards against Colorado a week earlier, ran 15 times for 230 yards against UCLA. Wisconsin freshman <mark>Jonathan Taylor</mark> had his second straight 200-yard game, going for 219 on 30 carries against Purdue. Diocemy Saint Juste of Hawaii ran 39 times for 202 yards against San Jose State, his third 200-yard game of the season. FANTASTIC FALCON Air Force quarterback Arion Worthman became the fifth player this season to score five touchdowns in a game. Worthman finished with 166 yards and scored four of his touchdowns in the second half as the Falcons came back from a 27-point deficit to beat UNLV 34-30. Worthman's fifth TD, a 1-yard run with 2:14 left, gave the Falcons their first lead. PASSING LEADER Oklahoma State's <mark>Mason Rudolph</mark> and UCLA's Josh Rosen are in a close competition for most passing yards per game. <mark>Rudolph</mark> overtook Rosen this week after throwing for 459 yards against Baylor to raise his average to 394.7. Rosen had a season-low 219 yards against Arizona, dropping his average from 427 to 392.3 .------More AP college football: http: //collegefootball.ap.org and https: //www.twitter.com/AP--Top25 Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags"}]