[{"articleID": "2017062817_00488568_W", "names": {"Michael Mccarthy": ["Q1933317", "Q20010903", "Q20642389", "Q3308368", "Q6832627", "Q6832630", "Q6832633"], "Jonathan Shapiro": ["Q28421759", "Q2966148"]}, "date": "2017-06-28", "url": "http://journalstar.com/news/national/mom-s-ex-boyfriend-gets-life-in-killing-of-baby/article_2a36aa1f-b5ec-5c51-b1ff-e47d828d6919.html", "content": "BOSTON (AP)--A Massachusetts man was sentenced Wednesday to life in prison in the killing of a 2-year-old girl who became known as Baby Doe after her remains washed up on the shore of a Boston Harbor island. <mark>Michael McCarthy</mark>, 37, will be eligible for parole after serving 20 years under the sentence imposed by Judge Janet Sanders. <mark>McCarthy</mark> was convicted Monday of second-degree murder in the 2015 killing of Bella Bond, the daughter of his girlfriend at the time. A computer-generated image of Bella was shared by millions on social media as authorities scrambled to identify her. Assistant District Attorney David Deakin asked the judge to set <mark>McCarthy</mark>'s parole eligibility at 25 years--10 years more than the minimum. <mark>McCarthy</mark>'s lawyer called that recommendation \"vindictive\" and asked Sanders to make him eligible for parole after 15 years. The judge came out in the middle of the two recommendations at 20 years. The girl's mother, Rachelle Bond, who also was charged in the case, was the prosecution's star witness. She told the jury she saw <mark>McCarthy</mark> kill her daughter one night after the girl didn't want to go to bed. <mark>McCarthy</mark>'s lawyer, <mark>Jonathan Shapiro</mark>, insisted that Bond was the real killer and cast a \"web of lies\" to blame <mark>McCarthy</mark>. \"There was no justice for Mr. <mark>McCarthy</mark> here,\" <mark>Shapiro</mark> said. Bond pleaded guilty to being an accessory after the fact for helping <mark>McCarthy</mark> dispose of her daughter's body. Under a plea deal with prosecutors, she is expected to serve less than two years in jail. The agreement calls for her to be released after her sentencing July 12. Sign up for our daily news email The top headlines from JournalStar.com. Delivered at 11 a.m. Monday-Friday. Sign Up! Daily Headlines Top headlines from journalstar.com. Delivered at 11 a.m. Monday-Friday. Obituaries I understand and agree that registration on or use of this site consitutes agreement to its user agreement and privacy policy. Bella Bond's father, Joseph Amoroso, gave a victim impact statement before <mark>McCarthy</mark> was sentenced, describing Bella as \"a happy and innocent child full of life.\" \"I was robbed of my chance to be a father to Bella,\" he said. Testimony during the trial showed the girl's short life was marked by turmoil. Both <mark>McCarthy</mark> and Bond were heroin addicts. A friend testified that he saw <mark>McCarthy</mark> discipline the girl by putting her in a locked closet."}, {"articleID": "2012101709_00095179_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2012-10-17", "url": "http://siasat.com/english/news/rahul-gandhi-meets-pm", "content": "congress general secretary rahul gandhi met prime minister <mark>manmohan singh</mark> wednesday for a \"routine meeting\" , party sources said. \"yes, he (gandhi) met the prime minister,\" a congress source told ians. he refused to divulge what was discussed, saying only that it was a routine meeting. the meeting with the prime minister at his 7, race course road residence comes amid speculation of gandhi joining the cabinet. on tuesday, <mark>manmohan singh</mark> and congress party chief sonia gandhi met president pranab mukherjee, sparking talk of a cabinet reshuffle that has been on the cards for some time. speculation about a cabinet reshuffle has been doing the rounds since the mamata banerjee-led trinamool congress quit the united progressive alliance (upa) last month leaving six posts vacant. c.p. joshi, minister of state for road transport and highways, was given additional charge of the railways portfolio after trinamool's mukul roy quit. slots vacated by the dmk earlier also have to be filled up. besides, ministers holding dual charge are to be relieved. congress sources had hinted last month that the much awaited reshuffle could happen after oct 15, after the end of the two-week-long shradh period considered inauspicious by hindus. this question is for testing whether you are a human visitor and to prevent automated spam submissions. muslim names? the siasat daily, 2012. all rights reserved. jawaharlal nehru road, abids, hyderabad - 500001, ap, india"}, {"articleID": "2014072917_00051741_W", "names": {"Lou Reed": ["Q189080", "Q6685709"], "Neil Young": ["Q1361496", "Q16104585", "Q1974908", "Q48841251", "Q6265210", "Q633", "Q6989513", "Q6989515"]}, "date": "2014-07-29", "url": "http://www.surfingmagazine.com/sounds/courtney-barnett/", "content": "Have you ever seen a mousey Australian hipster girl cover Kanye West's \"Black Skinhead\" ? Melbourne's Courtney Barnett pulled it off in a radio station once and it was just too adorable to be offensive. As she said, \"I'm sorry, but I had to change some words that were...rude.\" Covers are pretty out of character for Courtney, as her songwriting is famously vivid and brainy - a talent she picked up in her younger Dahl days. Shortly before her global tour, she tells us about a few influences that have made her into the artist she's become. She made no mention of Kanye. - Beau Flemister ￼ ￼ SURFING: All of your songs have such great stories. Were you a big reader as a kid? Courtney Barnett: Yeah, I definitely read a lot as a kid. I grew up with heaps of Roald Dahl books. I always loved how he wrote such imaginative, crazy stuff. I think my songs draw from that, although I've been a bit lazy with my reading recently. [laughs] I have been reading lots of band biographies, though. What's your favorite Roald Dahl book? Probably George's Marvellous Medicine. I actually just read it again. But the thing about Dahl's children's books is that they're so dark. They're twisted and weird, and maybe I kind of do that a bit in my songs. They're sarcastic and dark, but in a funny, lighthearted way. Who are your musical influences? Nirvana was a big one when I was a kid, so was <mark>Lou Reed</mark> and Television. And now I'm really into The Rough Sea and I just started listening to Kurt Vile. My tastes are pretty broad. Oh, also <mark>Neil Young</mark>; he's a huge influence. For an Australian, some of your songs seem to have that American-Western twang to them. Yes, that's true. That'd be the <mark>Neil Young</mark>, I suppose. We really like some of that Western style over here, so I guess it shows in our music, like the guitars in \"Avant Gardener.\" Do you play anything else beside guitar? Yeah, I can play drums, bass, keyboard...that's about it. And all very averagely. [laughs] I can make them sound like they're supposed to, nothing more. Have you ever gone surfing before?"}, {"articleID": "2018110114_00265866_W", "names": {"Abdul Aziz": ["Q22958462", "Q23542680", "Q23542681", "Q27830812", "Q30121874", "Q30600990", "Q4665272", "Q59601323"], "David Wang": ["Q16199852", "Q28871824", "Q9315976"]}, "date": "2018-11-01", "url": "https://www.zawya.com/mena/en/press-releases/story/EROS_GROUP_expands_its_Brand_Stores_concept_in_Partnership_with_Huawei-ZAWYA20181101140909", "content": "EROS GROUP expands its Brand Stores concept in Partnership with Huawei The Intelligent Life store concept redefines consumer experience Press Release Dubai, United Arab Emirates: Huawei in partnership with Eros Group opened doors to its all new store in Mirdiff City Center, Dubai. Only the second of its kind in the UAE, the new flagship store is themed on Huawei's Intelligent Life agenda that allows customers to get a hands-on experience and explore the latest technology from the brand in a comfortable futuristic space that is designed with nature in mind. The store was officially opened on 25 th October to coincide with the Mate 20 Series Pre-Order by Honorary Store manager <mark>Abdul Aziz</mark> Al Marzouqi @ Fex, Emirati entrepreneur and public figure, who welcomed hundreds of customers to place their pre-orders. Deepak J Babani, Executive Vice Chairman, Eros Group commented \"In recent years, experience stores of leading brands across categories have been attracting customers, especially in the high-end segment. The Huawei experience store will bring Huawei, as a brand, closer to the consumer. Eros Group is proud to be associated with it and is committed to open many such experience stores at most prominent destinations in UAE\" . Commenting on the opening, <mark>David Wang</mark>, UAE Country Manager, Huawei CBG said, \"The United Arab Emirates holds a key strategic position for Huawei's goals of global leadership in the industry. We are very glad partnering with our long standing local partner, EROS GROUP, to being the new Huawei experience store and expand our presence in the market. We welcome both new and existing Huawei and Eros customers to come and experience our Intelligent Life store concept, along with our latest developments in consumer technology.\" Advertisement Niranjan Gidwani, CEO, Eros Group also added, \"Acceptability of Huawei mobile phone is on the rise. The recent success of Nova 3E, Nova 3i & P20 has contributed substantially to Huawei's market share. Huawei Experience stores will act as a catalyst in introducing the customer centric technology & user friendly design to the prospective buyers.\" Huawei Consumer Business Group (CBG), is offering customers attractive deals while pre-ordering the company's latest flagship, the Huawei Mate 20 series. Packed with some of the most powerful hardware today and features that rival no other in the market, the Huawei Mate 20 series is Huawei CBG's most powerful phone to-date. These offers will not only make it easier to purchase, but also include a variety of add-ons to even further improve the Mate 20 experience. Orders come with two separate offers for the Huawei Mate 20 Pro and the Huawei Mate 20. The Huawei Mate 20 Pro pre-order customers will receive the brand-new Huawei Watch GT, launched together with Mate 20 series at the regional event, and the Huawei Wireless Quick Charger. Customers who opt for the Huawei Mate 20 will receive a Huawei Bluetooth Speaker and the Huawei Supercharger Car Charger. Pre-order customers for the Huawei Mate 20 series will receive their device on 8 th November, the day when long awaited smartphone king hits the shelves. - Ends -"}, {"articleID": "2014022314_00025703_W", "names": {"Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"], "Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"], "Michelle Rodriguez": ["Q184219", "Q3311458"]}, "date": "2014-02-23", "url": "http://www.newkerala.com/news/2014/fullnews-16476.html", "content": "Congress has been making false promises to people for the past 60 years: Modi in Assam Silchar, (Assam), Feb. 22: Bharatiya Janata Party (BJP) prime ministerial candidate Narendra Modi on Saturday criticized the Chief Minister Tarun Gogoi-led Congress Government in Assam for making false promises to the people, and added that he <mark>will</mark> help the people in fulfilling their dreams. \"This Congress Government in Assam cannot do any good to you all. I heard that when your Chief Minister heard that Modi is coming to his state, he started losing his sleep. I heard that he visited you two days ago. The projects that were not even started yet, he has again announced those projects,\" Modi said while addressing a rally here today. \"He (Gogoi) thought that someone <mark>will</mark> come and ask for an explanation. These Congress people have been making false promises for the past 60 years,\" he added. He urged people to vote for the BJP in the Lok Sabha elections, and said, \"I <mark>will</mark> standby you all and <mark>will</mark> help in fulfilling your dreams. You can trust me.\" Describing the whole Northeast region as \"lakshmi', Modi said,\" You find wealth in those places where there is \"lakshmi'. We want\" saraswati' as well as \"lakshmi'. Lakshmi needs a place to sit, and that's why it rests on a lotus. If there is no lotus, then\" lakshmi' <mark>will</mark> come and go after taking a round. \"He also took a jibe at Prime Minister <mark>Manmohan Singh</mark> saying,\" The country's PM is your MP. He hasn't travelled Assam like me, who is not even an MLA in your state. There is no district in Assam, where I haven't spent a night. \"Criticizing Gogoi for poor management during the floods that rocked Assam in 2012, Modi said,\" Your CM does not even know that Modi used to stay in Assam. Where was your CM when there were floods in 2012? Many people died in during those days. He was in USA and after that went to Japan, \"Drop guns and join mainstream, Home Ministry tells NE insurgents Congress has been making false promises to people for the past 60 years: Modi in Assam Disruptions created by Congress MPs in last session of Parliament disappointing: Sushma Swaraj PHE staff stages protest against Omar government, demands regularization of jobs Jennifer Aniston celebrates 45th b\" day sans fiance Justin Theroux <mark>Will Smith</mark> in talks for film adaptation of best-seller novel \"Brilliance' Kendall Jenner advised to quit\" KUWTK' show to focus on modeling career Cara Delevingne admits to \"being in love' with girlfriend <mark>Michelle Rodriguez</mark> Vehicles on NH 31A as traffic is disrupted due to agitation by Gorkha Janmukti Morcha A model walks the ramp during the India International Jewellery Week in Mumbai"}, {"articleID": "2018011105_00106874_W", "names": {"David Horowitz": ["Q44641480", "Q5235149", "Q722462"], "Abdul Razak": ["Q247730", "Q41251943", "Q4665681"], "Monirul Islam": ["Q47467193", "Q6900421", "Q6900425"]}, "date": "2018-01-11", "url": "https://www.frontpagemag.com/fpm/268929/islamic-terrorists-or-tragic-heroes-raymond-ibrahim#disqus_thread", "content": "The Western media's ongoing attempts to portray aggressors--even suicide-bombers--as victims. January 11, 2018 Raymond Ibrahim Raymond Ibrahim is a Shillman Fellow at the <mark>David Horowitz</mark> Freedom Center. PJ Media The so-called mainstream media's approach to and apologias for Islamic terrorism have become as predictable as they are farcical. In a recent piece titled, \"A Mysterious Act of Mercy by the Subway Bombing Suspect,\" the New York Times' Jeffrey Gettleman portrays would-be suicide bomber Akayed Ullah--whose foiled attempt at Times Square subway last month could have massacred countless Americans--as just another Muslim youth angered at and responding to the mistreatment of Muslims, that is, a Muslim with legitimate \"grievances.\" This is clear from the opening sentences: Before Akayed Ullah returned home to New York from his native Bangladesh...he had one last thing to do--an all-night bus ride by himself to help Rohingya refugees [Muslims]. After visiting relatives here in the capital city, Dhaka, he traveled across the country, slept in a mosque and under a tree, and passed out a few hundred dollars of medicine in the crowded refugee camps. \"When he left [America], he seemed happy,\" said his mother-in-law, Mahfuza Akhter. \"But when he returned, he was so upset. He said those people were living in hell, each and every minute.\" \"That lonely trip across Bangladesh in September remains a mystery,\" Gettleman goes on to opine, wondering whether Ullah was \"following his own heart, reflecting some sort of inner struggle as he headed toward his first known act of violence and self-destruction.\" Gettleman claims to base this \"tragic hero\" image of the would-be Muslim suicide bomber on \"extensive interviews with more than a dozen friends, relatives and acquaintances,\" all of whom (opportunistically?) say that Ullah was \"outraged by injustices inflicted on Muslims. He was also described by several people who know him well as loving and giving.\" According to Gettleman, such claims \"still leave a hole as to why Mr. Ullah did this.\" And so it goes. To anyone paying attention, the NYT's portrayal of Ullah is virtually boilerplate; the duplicate structure of the portrayals of all Islamic terrorists who strike at the United States. Recall, for instance, when <mark>Abdul Razak</mark> Ali Artan--an 18-year-old Muslim refugee from Somalia, who was receiving aid from Catholic charities--rammed his car into a building at Ohio State University, then got out and stabbed people with a butcher knife, hospitalizing some 13 people. CNN, NBC, the Washington Post and many others sought to rationalize away Artan's violence by citing one of his Facebook posts where he wrote, \"Seeing my fellow Muslims being tortured, raped and killed in Burma led to a boiling point. I can't take it anymore.\" The problem with both Ullah's and Artan's supposed \"grievances\" is twofold. First, the obvious: how, exactly, does terrorizing and slaughtering Americans make up for the plight of Rohingya Muslims in Burma/Myanmar? If Ullah and Artan were primarily motivated by the suffering of the Rohingya, shouldn't they have sought to terrorize and kill Burmese--not Americans? Secondly, while media and other \"experts\" routinely portray such Muslim terrorists as being motivated by the \"love\" they feel for fellow Muslims--as when former CIA Michael Scheuer described Osama bin Laden as a man of love, comparing him to Robin Hood--this \"love\" is itself another reflection of Islamic supremacism and the flipside to the Islamic doctrine of Loyalty and Enmity: just as Muslims are obligated to hate and fight non-Muslims, so are they \"obligated to befriend a believer--even if he is oppressive and violent toward you--while he [the Muslim] must be hostile to the infidel--even if he is liberal and kind to you\" (The Al Qaeda Reader, p. 64). Or as the Koran (48:29) more succinctly puts it, Muslims \"are forceful against the disbelievers, merciful among themselves.\" Simply put, Ullah's terror attempt is a byproduct of Islamic teachings that make the non-Muslim enemy number one, regardless of any real or imagined \"grievances.\" The reason Ullah struck the U.S. as opposed to Myanmar is probably because the latter has more \"draconian\" security measures that made America an easier target. Ironically, Bangladeshi authorities, who said Ullah \"was closely following several jihadist websites,\" come closer to the mark: \"He seemed to have this hatred for America,\" said <mark>Monirul Islam</mark>, the chief of Bangladesh's counterterrorism police operations. \"We're not exactly sure where it came from.\" While the answer is self-evident--the hatred came from jihadi websites that preach hate for all infidels 24/7--at least Bangladeshi authorities do not offer silly and sappy motivations such as \"grievances,\" which is more than can be said for so-called mainstream Western media and their nonstop efforts to portray Islamic aggressors as \"tragic heroes.\" Share"}, {"articleID": "2018011717_00788476_W", "names": {"Sung Min": ["Q12971420", "Q7640091"]}, "date": "2018-01-17", "url": "https://globalnews.ca/news/3970362/kid-rock-nhl-all-star-game/", "content": "Kid Rock will headline entertainment at the upcoming 2018 NHL All-Star Game in Tampa, Fl. on Sunday, Jan. 28. He will perform during the second intermission and his set will be televised as part of the game broadcast, the league announced on Jan. 16. The 2018 @ Honda #NHLAllStar Game will feature @ KidRock as the headlining entertainment! pic.twitter.com/rhwYqjr4Em--NHL (@ NHL) January 17, 2018 READ MORE: Kid Rock delivers political speech during Detroit concert amid protest Additional performers will be announced in the coming days, but the choice of headlining entertainment left many NHL fans confused. Opens up Twitter * The headline reads that Kid Rock is performing at the 2018 NHL All Star game.... pic.twitter.com/tw9jUH1dlA--Alex R. (@ AlexTheGreatzz) January 17, 2018 Hey @ NHL, did you actually discuss inviting Kid Rock to perform at the ASG or was it an intern error?--Jason Kay (@ JKTHN) January 17, 2018 Nobody chooses #KidRock for their event; they settle for Kid Rock when they can't get anyone else for the money they're offering. #NHLAllStar--Ed the Sock (@ EdtheSock) January 17, 2018 Kid rock to play the #NHLAllStar game.... every #Hockey fan right now...pic.twitter.com/d07L2y5ZHE--All Beard No Teeth (@ ABNTHockey) January 17, 2018 NHL: Why don't any women, minorities, or people under 40 watch our sport? Also NHL: Let's book Kid Rock to be the main entertainment for our biggest event of the year!!--Mike (@ DeetoDC) January 17, 2018 NHL selected Kid Rock to do their ASG? pic.twitter.com/mUXEdUpqqQ--Jayson Buford (@ jaysonbuford) January 17, 2018 I've never seen @ NHL fans more united than they are right now in hating the announcement that Kid Rock is playing the #NHLAllStar game .--Alisha Grauso (@ AlishaGrauso) January 17, 2018 Did the NHL get turned down by 10,000 more prominent musicians of was Kid Rock a first choice? Either way, amazing .--Travis Yost (@ travisyost) January 16, 2018 And just when you thought the NHL couldn't get any whiter. . https: //t.co/t8ynPfpFjm--Asher M. Roth (@ TheAsherRoth) January 17, 2018 The NHL picking musical acts at their events. pic.twitter.com/5nTW9k0yS7--Joey Jo-Jo Junior Shabadoo (@ Brendan414) January 17, 2018 If SNL parodied the NHL All Star Game, the skit would have Kid Rock as the headlining act. https: //t.co/0lHaREaz1d--Keegan Matheson (@ KeeganMatheson) January 17, 2018 The NHL looked at how much attention that college football got for having trendy, young, peak-popularity artist in Kendrick Lamar play the halftime show. So they decided to get...* squints eyes * Kid Rock. huh--<mark>Sung Min</mark> Kim (@ sung_minkim) January 17, 2018 Kid Rock is playing the #NHLAllStar game? pic.twitter.com/gWi79ORc6J Story continues below--Erik (@ erikwray) January 17, 2018 READ MORE: Kid Rock hints at run for U.S. Senate Kid Rock's appearance at the NHL All-Star Game will support his \"American Rock n Roll Tour 2018\" and new album Sweet Southern Sugar. His tour kicks off on Jan. 19 at Bridgestone Arena in Nashville, Tenn., and will continue with 21 shows. \"Kid Rock remains at the centre of media attention in regards to his musical and personal ambitions, leaving his mark in a multitude of genres,\" the NHL said in a press release. Flo Rida will take the stage at the All-Star Skills competition prior to the game. The all-star festivities will begin on Saturday, Jan. 27, with the skills competition, followed by the divisional battles the following day. Follow @ KatieScottNews"}, {"articleID": "2019030300_00746251_W", "names": {"Jose Garcia": ["Q18808599", "Q3810443", "Q58413561", "Q6292313", "Q6292317", "Q778451"]}, "date": "2019-03-03", "url": "http://news8000.com/news/national-news/dea-ny-fentanyl-bust-finds-enough-to-kill-nearly-2-million-people/1047351570", "content": "DEA: NY Fentanyl bust finds enough to kill nearly 2 million people Five people arrested during the raid Posted: Mar 02, 2019 05:48 PM CST Updated: Mar 02, 2019 06:36 PM CST Fentanyl test strips prove controversial A home in a quiet Westchester County, New York, neighborhood was hiding enough fentanyl to kill 2 million people, the US Drug Enforcement Administration said. Federal agents found five kilograms (just over 11 pounds) of fentanyl and six kilograms (13.2 pounds) of heroin Friday when they raided a fentanyl mill operating out of a home in Ardsley, the DEA said. Five people who were arrested during the raid are facing several drug charges. Braulio Mata, 31; <mark>Jose Garcia</mark>, 44; and 20-year-old Yarly Mendoza-Delorbe were charged with conspiracy and drug possession. Another suspect, Ramon Aracena Alfe, 47, is facing a possession charge. The fifth person, 32-year-old Dionell Duarte Hernandez, has been charged with possession and resisting arrest, officials said. The group began renting the home a few months ago and neighbors had noticed several vehicles coming and going, CNN affiliate News 12 Westchester reported. \"The fentanyl alone has the potency to kill nearly over two million people,\" said DEA Special Agent in Charge Ray Donovan. \"I commend the men and women in the Task Force and Tactical Diversion Squad for their quick and efficient investigation into this organization and their diligence to the safety of the residents living nearby.\" Ardsley is a wealthy community about 20 miles north of New York City. Copyright 2019 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2014020302_00004457_W", "names": {"Mark Waters": ["Q42786460", "Q471552", "Q6770245"], "Emma Roberts": ["Q228598", "Q41070739", "Q56187743", "Q56187744"], "Andy Jordan": ["Q16239016", "Q22278438", "Q4760868"], "Elizabeth Banks": ["Q219373", "Q47295776"], "John Green": ["Q10451726", "Q16196962", "Q19560608", "Q20646280", "Q20707695", "Q50282022", "Q56597706", "Q6236145", "Q6236157", "Q6236167", "Q630446"], "Michael Grant": ["Q1719607", "Q1752975", "Q18686452", "Q56026228", "Q57428184", "Q6830728", "Q6830729", "Q6830732"]}, "date": "2014-02-02", "url": "http://www.sugarscape.com/main-topics/book-club/1015678/author-richelle-mead-talks-turning-vampire-academy-book-movie-watch", "content": "What you think of this Article...The suck at school Nobody is a bigger fan of the Vampire Academy series than author Richelle Mead, mainly because she wrote it. But if you're a big fan of the books and are a bit worried about any changes they might have made to the storyline while making the movie then it sounds like you don't need to worry as Richelle reckons it's even bigger and better than its inspiration. With Zoey Deutch taking on the role of ass-kicking dhampir guardian Rose, we never had to worry about it not being hilarious, but apparently Richelle reckons that fans are still in for a few surprises, even if they think they know the story inside out. \"It just blows me away to see what <mark>Mark Waters</mark> and the rest of the team working on the movie can do,\" she explained. \"When I read [the script] I just felt like everything I had done was in there. The humour is there - he wrote lines that are funnier than mine. I was kind of jealous!\" Check out what else Richelle has to say about the movie below...WE CAN'T WAIT. Can you? Comments please...Sarah Hyland talks getting beaten up for Vampire Academy: \"If I didn't come out bruised and bleeding, I wasn't doing my job' Sarah Hyland talks being BFFs with Taylor Swift:\" People have a preconceived idea about her' Theo James, Kate Winslet and Shailene Woodley talk factions behind the scenes on the Divergent set - WATCH Zoey Deutch and Lucy Fry introduce the brand new trailer for Vampire Academy - WATCH Zoey Deutch and Lucy Fry kick butt in two brand new clips from Vampire Academy - WATCH Vampire Academy debuts brand new movie clip full of girl fights and fang flashing - WATCH Dawn O'Porter: \"Any girl who goes out with Harry Styles is going to get loads of grief. Taylor Swift is awesome' Delirium trilogy author Lauren Oliver on making TV shows with <mark>Emma Roberts</mark> and new book Requiem Just how posh are the Made in Chelsea cast? <mark>Andy Jordan</mark>, Fran Newman-Young and Cheska Hull are put to the test - WATCH <mark>Elizabeth Banks</mark> reads aloud her favourite Effie Trinket scenes from Catching Fire - WATCH <mark>Andy Jordan</mark> tests Cheska and Fran's Made In Chelsea knowledge:\" If we were p *** ing off Lucy Watson, what would we be doing? \"Lucy Fry sucks Zoey Deutch's blood in brand new Vampire Academy: Blood Sisters trailer - WATCH Author <mark>John Green</mark> goes behind the scenes on The Fault In Our Stars movie with Shailene Woodley and Ansel Elgort - WATCH Jennifer Lawrence reveals Hunger Games: Catching Fire book to film story changes Divergent author Veronica Roth: Allegiant will be told from two points of view <mark>Michael Grant</mark> live interview stream - submit your questions here! Fall Out Boy take The Stupid Interview and indulge Patrick Stump's armpit fetish The Raven Boys author Maggie Stiefvater on psychics, the supernatural and new book The Dream Thieves Between Shades of Gray author Ruta Sepetys on hanging out with mobsters, brothel Madams and new book Out of the Easy"}, {"articleID": "2017071613_00208447_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-07-16", "url": "http://www.houstonchronicle.com/news/article/Trump-defends-his-son-drawing-a-contrast-with-11291945.php", "content": "<mark>Trump</mark> defends his son - drawing a contrast with Clinton - and says media are \"distorting democracy' Philip Rucker, The Washington Post July 16, 2017 PISCATAWAY, N.J. - President <mark>Trump</mark> defended his son <mark>Donald Trump</mark> Jr., contrasting his Russia meeting with Hillary Clinton's deleted emails and accused the news media of\" DISTORTING DEMOCRACY \"in a series of angry statements issued early Sunday. Tweeting from his private golf club in Bedminster, N.J., where he is spending the weekend, <mark>Trump</mark> lashed out at the media for coverage of the disclosure that his oldest son and namesake held a meeting last year with a Kremlin-connected Russian lawyer who offered damaging information about Clinton, his campaign opponent. <mark>Trump</mark> tweeted,\" HillaryClinton can illegally get the questions to the Debate & delete 33,000 emails but my son Don is being scorned by the Fake News Media? \"<mark>Trump</mark> was referring to emails Clinton deleted from her private server as secretary of state, as well as to her campaign being provided an early look at a question in a primary debate against Sen. Bernie Sanders of Vermont. The debate controversy surfaced only because of an illegal hack of Democratic emails, which U.S. intelligence agencies have concluded was orchestrated by Russia, and their subsequent release on Wikileaks. In another tweet Sunday morning, <mark>Trump</mark> accused the news media of\" phony unnamed sources & highly slanted & even fraudulent reporting. \"He said the\" #Fake News, \"the president's term for news outlets whose aggressive reporting he does not like, is\" DISTORTING DEMOCRACY in our country! \"Translator To read this article in one of Houston's most-spoken languages, click on the button below. US News With all of its phony unnamed sources & highly slanted & even fraudulent reporting, #Fake News is DISTORTING DEMOCRACY in our country! - <mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) July 16, 2017--<mark>Trump</mark> also thanked a former campaign adviser, Michael Caputo, for his testimony Friday before the House Intelligence Committee, which is investigating Russian meddling in the U.S. election and possible collusion with the <mark>Trump</mark> campaign. Caputo told reporters that he testified in a closed session for nearly four hours and told House investigators,\" I had no contact with Russians and I never heard of anyone in the <mark>Trump</mark> campaign talking with Russians. \"<mark>Trump</mark> tweeted,\" Thank you to former campaign adviser Michael Caputo for saying so powerfully that there was no Russian collusion in our winning campaign. \"Caputo worked on the <mark>Trump</mark> campaign as a communications adviser throughout the Republican primary season but left the team in summer 2016 as the general election got underway. He has long ties to Russia, having lived in the country in the 1990s and working in 2000 as a contractor with the Russian conglomerate Gazprom Media to improve Putin's image in the United States. <mark>Trump</mark> has been staying in Bedminster at his <mark>Trump</mark> National Golf Club since returning from Paris on Friday evening. The president has been watching the U.S. Women's Open, tweeting five times over the weekend about his attendance at the golf tournament. He spent much of Saturday in an enclosed viewing area, watching the golfers on television and entertaining spectators by flashing a thumbs up or posing for photos. On Sunday morning, <mark>Trump</mark> boasted that his supporters\" far out-numbered the protesters \"at the golf club: Thank you to all of the supporters, who far out-numbered the protesters, yesterday at the Women's U.S. Open. Very cool! - <mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) July 16, 2017"}]