[{"articleID": "2016120600_00464507_W", "names": {"Rich Hill": ["Q3430418", "Q7323297"], "Steve Pearce": ["Q902082", "Q947168"], "Miguel Cabrera": ["Q51612870", "Q735354"], "Jose Reyes": ["Q220096", "Q282400", "Q6293856"], "David Ortiz": ["Q19402485", "Q28815032", "Q38332228", "Q448005", "Q54541573"], "John Farrell": ["Q1017017", "Q17916883", "Q46168067", "Q56723519", "Q6232765", "Q6232766"]}, "date": "2016-12-05", "url": "http://helenair.com/sports/baseball/professional/winter-meetings-heat-up-melancon-to-giants-hill-to-dodgers/article_48e83c7d-a506-5d8d-82a6-b4cbc6c93010.html", "content": "OXON <mark>HILL</mark>, Md. (AP)--Albeit too late to save them this year, the San Francisco Giants got their closer. All-Star righty Mark Melancon and the Giants reached agreement on a $62 million, four-year contract Monday. As baseball's winter meetings heated up, lefty <mark>Rich Hill</mark> re-signed with the Los Angeles Dodgers for $48 million over three years. A couple smaller deals also developed as teams met inside a hotel on the banks of the Potomac River outside Washington. The Toronto Blue Jays signed versatile <mark>Steve Pearce</mark> and Philadelphia added reliever Joaquin Benoit. Nothing yet on the top trade targets--White Sox ace Chris Sale, Pirates outfielder Andrew McCutchen and possibly two Detroit fixtures, slugger <mark>Miguel Cabrera</mark> and pitcher Justin Verlander. But the New York Yankees confirmed they're trying to boost their bullpen with major free-agent talent. \"We have been pursuing Aroldis Chapman. We also have been talking to Kenley Jansen. We also had talked with Melancon,\" Yankees general manager Brian Cashman said. <mark>Jose Reyes</mark>, meanwhile, might be changing positions, rather than teams. Mets general manager Sandy Alderson said the star infielder would get his first look at the outfield in spring training. And the Red Sox said they might fill their designated hitter spot--left vacant by the retiring <mark>David Ortiz</mark>--with a DH-by-committee. That would still leave room, of course, for them to sign slugger Edwin Encarnacion. Boston did make a move with manager <mark>John Farrell</mark>, picking up his contract option through the 2018 season. Melancon tweeted that he was excited to be joining the Giants. They certainly were thrilled to get him, pending a physical, giving the 31-year-old the richest deal ever for a reliever. Because he was traded during the season, from Pittsburgh to Washington, the Giants don't lose their first-round draft pick next June as compensation. The Giants' bullpen was a troublespot all year, blowing 32 saves. Their woes peaked in their final loss, to the Cubs in Game 4 of the NL playoffs, when Chicago scored four runs in the ninth inning against five relievers. Melancon posted a combined 47 saves and a 1.64 ERA last season, a year after leading the majors with 51 saves for the Pirates. Get the latest sports news and scores sent to your email inbox Sign Up! HelenaIR.com Sports Obituaries I understand and agree that registration on or use of this site consitutes agreement to its user agreement and privacy policy. The 36-year-old <mark>Hill</mark> found stability, and a lot more in Los Angeles. He was on the scrap heap in 2015, pitching in independent ball for the Long Island Ducks, before resurrecting his career. \"I think it's something that has been an incredible journey to get to this point, but never did I ever think that I would pack it in,\" he said. <mark>Hill</mark> went a combined 12-5 with a 2.12 ERA in 20 starts for the Dodgers and Oakland last season. Not everyone was in the holiday shopping spirit. Instead of hoping for hitters, pitchers or fielders, manager Ned Yost was thinking about his field back home in Georgia. \"I got to refill the feeders at the farm. Planted some grass, finally got some rain, so my wish is that it comes up,\" he said."}, {"articleID": "2019041216_00797862_W", "names": {"Alex Hepburn": ["Q10366783", "Q21061799"], "Joe Clarke": ["Q17198080", "Q20090463", "Q6209116", "Q6209117"]}, "date": "2019-04-12", "url": "http://www.somersetcountygazette.co.uk/news/national/17571032.jail-term-inevitable-for-cricketer-found-guilty-of-raping-sleeping-woman/", "content": "\"Jail term inevitable' for cricketer found guilty of raping sleeping woman By Press Association 2019 <mark>Alex Hepburn</mark> A cricketer has been found guilty of raping a sleeping woman during the first night of a sexual conquest competition he helped set up on a WhatsApp group. <mark>Alex Hepburn</mark>, 23, was warned a jail sentence is inevitable for the attack on the the dozing victim--committed just days after he set the rules of the contest to have sex with as many new partners as possible. A jury found the former Worcestershire CCC all-rounder guilty of oral rape but cleared him of a further count of rape relating to the same victim. <mark>Alex Hepburn</mark> was told a custodial sentence was\" inevitable' (West Mercia Police/PA) A four-day trial at Worcester Crown Court heard the woman wrongly thought she was having sex with <mark>Hepburn</mark>'s then county team-mate <mark>Joe Clarke</mark> at the players' flat in Portland Street, Worcester. She told jurors she had earlier had consensual sex with England Lions batsman Mr <mark>Clarke</mark> following a night-out in April 2017. Jurors were told Mr <mark>Clarke</mark> left his bedroom to be sick in a bathroom, where he passed out, leaving the woman asleep on a mattress in his room. <mark>Hepburn</mark> told jurors he had drunk up to 20 bottles of beer before the woman rolled over in bed, kissed him, and instigated what he reasonably believed was consensual sex. The complainant, who cannot be identified, said she had her eyes closed and engaged in 20 minutes of sexual activity with Australian-born <mark>Hepburn</mark> in a dimly-lit bedroom--before \"clocking\" who he was when he spoke. After the unanimous guilty verdict was returned following around 11 hours of dleiberations, <mark>Hepburn</mark> sighed and then slumped into his seat, covered his face with his hands and sobbed. Jurors returned to court a few minutes later and cleared <mark>Hepburn</mark> of a second count of rape. During his evidence on Wednesday this week, <mark>Hepburn</mark> admitted he sent \"disgusting, horrible and embarrassing\" WhatsApp messages while setting the rules of the sexual conquest competition. Bailing <mark>Hepburn</mark> following the verdicts, Judge Jim Tindal told the cricketer, who was aged 21 at the time of the rape: \"You have been convicted and now fall to be sentenced .\" I am adjourning your case for the preparation of a pre-sentence report. But it would not be a kindness to you to leave you under any false impression as to the purpose of that report. \"There is only one sentence that can properly be handed down in this case, and a custodial sentence is inevitable .\" You need to prepare yourself and get matters in order and attend Hereford Crown Court on the 30th of April. \"<mark>Hepburn</mark> leaves Worcester Crown Court (PA) The judge also said that his provisional view was that verdicts indicated that <mark>Hepburn</mark>'s belief in the woman's consent had been unreasonable. In a statement, Worcestershire County Cricket Club's chairman, Fanos Hira, said:\" WCCC is appalled by the details that have been reported in this case. \"The WCCC board and CEO were first made aware of the arrest and subsequent charge of Mr <mark>Hepburn</mark> on 10th November 2017; WCCC then took immediate and decisive action .\" Our One Club values outline clear expectations of attitudes and behaviours for all staff at WCCC and everyone involved in Worcestershire cricket. \"WCCC continues to work alongside both the ECB and PCA focusing on education, welfare and development programmes for all staff within the game .\" <mark>Alex Hepburn</mark>, a former Worcestershire County Cricketer, has been convicted of one count of rape at Worcester Crown Court today (Friday 12 April) after a 5 day trial at Worcester Crown Court. Sentencing due 30 April. More: https: //t.co/lnGSE6BRLA pic.twitter.com/tNUPqGbR37--West Mercia Police (@ WMerciaPolice) April 12, 2019 Following the trial, Detective Chief Inspector Ian Wall, of West Mercia Police, said: \"We welcome the conviction and I hope it will offer some comfort to the victim, who has shown great courage and strength in coming forward in reporting this to us, throughout the investigation and in giving evidence in court .\" At the time of the offence <mark>Hepburn</mark> was in a position of trust and power as a professional sportsman for local team Worcestershire County Cricket Club. \"I hope this conviction will provide reassurance to other victims of sexual offences, giving them the confidence that they will be believed and listened to by specially trained officers and that we will do everything to bring offenders to justice .\" "}, {"articleID": "2018070917_00079776_W", "names": {"Julia Roberts": ["Q40523", "Q6306690", "Q6306692"], "Michael Pearce": ["Q16196208", "Q635480"], "Jane Evans": ["Q16019377", "Q29642641"]}, "date": "2018-07-09", "url": "https://www.hollywoodreporter.com/news/julia-roberts-lucas-hedges-film-ben-is-back-nabbed-by-roadside-1125640", "content": "<mark>Julia</mark> Roberts-Lucas Hedges Drug Addiction Drama \"Ben Is Back' Nabbed by Roadside 10:00 AM PDT 7/9/2018 by Tatiana Siegel FACEBOOK TWITTER EMAIL ME COMMENTS Vera Anderson/WireImage (2) <mark>Julia Roberts</mark>, Lucas Hedges The film, which marks a teaming of Roadside, Lionsgate and LD Entertainment, will get a December release. LD Entertainment, Lionsgate and Roadside Attractions are teaming up to acquire U.S. distribution of the <mark>Julia Roberts</mark> drama Ben Is Back. Written and directed by Peter Hedges (What's Eating Gilbert Grape, Pieces of April), the film also stars his son, recent Oscar nominee Lucas Hedges (Manchester by the Sea). The move puts Lionsgate back in business with <mark>Roberts</mark>, who headed up the breakout hit Wonder, a film that earned $303 million worldwide. Ben Is Back centers on titular 19-year-old Ben Burns (Lucas Hedges), a young man with substance abuse issues who unexpectedly returns to his family's suburban home on Christmas Eve morning. Ben's mother Holly (<mark>Roberts</mark>) is relieved and welcoming but wary of her son staying clean. Over a turbulent 24 hours, new truths are revealed and a mother's undying love for her son is tested as she does everything in her power to keep him safe. Courtney B. Vance (The People V. O.J. Simpson: American Crime Story) and Kathryn Newton (Lady Bird) round out the cast. The acquisition was jointly announced by Mickey Liddell of LD Entertainment, Lionsgate president of acquisitions and co-productions Jason Constantine and Roadside Attractions co-founders Howard Cohen and Eric d’Arbeloff. Roadside Attractions will release the film, which wrapped production in New York in February, on Dec. 7, a plum spot for awards-season hopefuls. Black Bear Pictures and Color Force produced Ben Is Back, with 30WEST and Black Bear fully financing the film. Nina Jacobson, Brad Simpson, Teddy Schwarzman and Peter Hedges produced Ben Is Back, while. Daniel Steinman, Micah Green, Dan Friedkin, Ben Stillman, <mark>Michael</mark> Heimler, <mark>Jane Evans</mark>, Liddell, and Pete Shilaimon executive produced. CAA negotiated U.S. sales, while Sierra/Affinity is handling foreign sales .\" Drawing from Peter Hedges' incredibly moving script and direction, <mark>Julia Roberts</mark> and Lucas Hedges deliver career-high performances, \"Cohen and d’Arbeloff said in a statement .\" In a role that is current and important, <mark>Julia Roberts</mark> is transformative as a mom fighting to save her son. And we are thrilled to reunite with Lucas Hedges after his Oscar-nominated turn in Manchester by the Sea. He is unforgettable here as a young man trying to reconnect with his family for Christmas. \"Added Liddell:\" Peter Hedges, <mark>Julia Roberts</mark>, and Lucas Hedges have put on a master class in storytelling. This timely story will resonate with everyone across the country. \"LD and Roadside have partnered on a successful run of films that include critical and commercial successes. With Ben is Back, the companies have collaborated on releasing and producing nine films such as I Can Only Imagine, which is the top earning indie film of the past year, as well as Albert Nobbs and Biutiful, which together garnered Roadside and LD five Oscar nominations. They recently acquired U.S. distribution rights to the Judy Garland movie Judy, directed by Tony nominee and two-time Olivier winner Rupert Goold and starring Renee Zellweger. 30WEST and Roadside Attractions recently partnered on <mark>Michael Pearce</mark>'s serial killer drama Beast. FACEBOOK TWITTER EMAIL ME COMMENTS Tatiana Siegel tatiana.siegel @ thr.com @ tatianasiegel27 Comments comments powered by Disqus"}, {"articleID": "2011072807_00072079_W", "names": {"Henry Ford": ["Q19865736", "Q52439758", "Q5721389"], "Larry Moss": ["Q6490837", "Q6490838"]}, "date": "2011-07-28", "url": "http://freep.com/article/20110728/COL07/107280450/1002/business", "content": "skip this ad? advertisement detroit mayor dave bing puts city services to the test under new plan detroit mayor dave bing laid out an ambitious citywide plan wednesday that aims to ultimately...as hundreds of students arrive on the university of michigan campus this week, ann arbor police are...delaware-based chemical giant dupont acknowledged wednesday what many lawn care professionals...welcome back, lions! and for once, i say that without a hint of sarcasm. the tigers had their chances but went 1-for-9 with runners in scoring position. new college hockey conference sure to be hot topic at media days hockey will be part of the athletic directors' agenda when they meet today and friday at the big...chevrolet doesn't just build cars and trucks. it creates archetypes. chevrolet's 100th birthday strategy reflects general motors' recent marketing philosophies: play...research can help you save when buying a car without an employee discount if you don't qualify for an a plan or a friends and family deal or a supplier discount, don't be...5 questions with ben gibbard singer, songwriter and guitarist, death cab for cutie lighter in tone than much of death cab for cutie's previous work, \"codes and keys\" ...maker faire at the <mark>henry ford</mark> celebrates artists, inventors and do-it-yourselfers for royal oak's lish dorset and her handmade detroit collective, it doesn't get much bigger than...detroit jazz legend wendell harrison releases first new cd in 7 years \"here's my thing,\" says wendell harrison, describing his personal manifesto. hotdogging the frank who doesn't love a good hot dog? it wouldn't be summer without them. question: what's the best way to grill corn? do you have to soak it first?--tony dehn, galesburg. carolyn hax: be happy, not concerned over child's love for nanny dear carolyn: we have been lucky to have the same wonderful, caring nanny since our 2-year-old was...michigan's driver responsibility fee--which will turn eight years old in october--is a perfect...guest commentary: creating a regional transit authority is key to competing for federal funds much has been written in the media lately regarding mass transit - on the woodward avenue m-1...the tragic shooting in norway reflects the danger in adopting a security policy of profiling people. how should you track your money?? know how much money you owe--and where you can trim costs on things that don't matter much, if at all .? read your statements--whether you get them online or in the snail mail. you might spot mistakes or other issues .? take advantage of e-mail alerts to avoid fees. many consumers get alerts via e-mail or text message when their balances drop below certain levels to avoid triggering fees or they use those alerts to remind them when bills are due to avoid late fees .? home values and stock values fluctuate. so unless you're selling today, you should realize that the price can be different in the next few weeks and next few years. most investors know to avoid making rash decisions during frenzied cable coverage of triple-digit drops for the dow, a junky jobs report or bickering about the odds for the first-ever default on u.s. debt obligations. but what about the instant internet access to your very own personal net worth? should you be following the value of what you own like the weather? or worse yet, just like someone who jumps on the scale each day to see their weight? www.zillow.com daily to see how much your house is worth today? go to your online 401 (k) account to see the latest balance? watch the bottom line on your ira every other day? while some of us do the ostrich thing and do not open our 401 (k) statements or bother to pay attention to how much we have in savings and checking, others overcompensate by adding up what they're worth down to the last nickel every minute. if so, you could be effectively day-trading on your own financial health. it used to be that people waited for the end of a quarter to study a financial statement or the end of the month. but now we've got constant access to our financial picture online. we can almost watch the storm clouds as they roll onto the scene, given the volatility of stock prices and home prices lately. \"people can look at their net worth on a daily basis,\" said <mark>larry moss</mark>, senior vice president for raymond james in birmingham. and some can be tempted to make crazy moves if they're worth $500 or $1,000 less than they were \"worth\" a day before. emotional swings can interfere with long-term investment plan every day, we're learning about yet another financial app or other way to manage our money on the go. most financial experts will tell you that it's a good idea to go online to view your bank account, see your credit report, or track credit card spending as a way to watch out for potential fraudsters. \"for the most part, technology has given a lot of clients a better reference point of where they're at,\" said jason fannon, financial consultant in the charles schwab office in southfield. schwab, like others in the financial services industry, offers more tech conveniences to consumers, such as a way to deposit checks by taking a picture of the check with an iphone. ok, but is it possible that just like teens with a new video game we can play around with all these financial tech toys a bit too much? even financial professionals admit they check out the value of their homes more than they should. \"unless you're going to buy and sell your house every day, it really doesn't matter,\" said marisa lenhard, senior portfolio manager for sigma investments in southfield. that said, she admits that she's been known to look more than a few times each week at the value of her home as estimated by zillow. it doesn't exactly cheer her up to realize that her home's value has gone down about 20% or so in the last six months. it's not just the house. some consumers obsess on their credit scores, too. \"there are people who check it daily,\" said j.d. roth, editor and founder of a blog at www.getrichslowly.org. roth has heard from some consumers who regularly track that credit score by paying for various monitoring services. these consumers do not make certain moves--such as paying off their mortgage, credit cards or car loans--because they worry about how it might hurt their credit score. sure, your credit score could drop slightly in some cases if you pay off a mortgage and it is your only installment debt. an installment loan, such as a mortgage or car loan, can bump up your credit score if you pay on time. it improves your mix of credit. even so, it's far more important to the health of one's score to pay bills on time, keep credit balances low and take on new credit only when it's really needed, said craig watts, public affairs director for fico. we're not talking about a possible huge hit to a score, if you pay off that mortgage or car loan. \"to me, the credit score is not the primary goal. the goal is to live a happy life with good financial stability,\" said roth, who took more than three years to get out of debt. roth says you should pay more attention to how much you owe--and check that score a few times a year if you want. even if you're not burdened by debt, should you be so focused on your net worth that you watch the changing balance each day? william c. roney iii, senior vice president, division director for the great lakes for raymond james, said people always had some idea about the overall picture of their finances. now, roney said, online services allow people to be hyper-aware of what someone thinks their house is worth or what their portfolio is worth at a given time. www.mint.com to manage their money, too. but again, if you use a service like mint.com or others, you can easily get regular updates on how much you are worth. if you're glued to the values you can find online, you just might panic and fear making any moves. or you might take bigger risks to catch up to what you think you should be worth. or if you're looking at your investments daily, you might buy and sell stocks or mutual funds more often than you should--pushing up trading costs. \"the daily emotional swings get in the way of a long-term investment plan,\" said <mark>larry moss</mark>, senior vice president for raymond james in birmingham. lenhard has noticed that some clients can have a \"fixed number in their head\" and their mood can change dramatically depending on whether their net worth is above or below that number. a few folks can even be upset if the change is as little as $10. too often, people remember the old benchmarks--how much their net worth supposedly was back in 2006 or 2007 before the housing collapse and financial meltdown hit. but why should you waste all that energy trying to recapture that past high--which frankly was nothing more than illusion given all the monkey business on wall street? i'd argue that some baby boomers ended up in a financial mess because they stopped saving as they watched the rock 'n' roll values for stocks in the late 1990s and outrageous values for homes during much of the past decade. it was far easier to convince yourself that you were rich--and did not need to save much--when you thought your home was worth $300,000. now, it could be too easy to convince yourself that you'll never be able to afford to retire--or buy a new car or take a vacation--when that same home could be valued at $150,000. wouldn't it be more productive to just keep plugging away--no matter what your 401 (k) or house are worth at 2 a.m. today? susan tompor: fluctuating worth can tempt people to make hasty moves"}, {"articleID": "2016092223_00272282_W", "names": {"Edward Jones": ["Q16853914", "Q18671061", "Q19282395", "Q24042103", "Q5343818", "Q5343819", "Q5343824", "Q56597246"]}, "date": "2016-09-22", "url": "http://cjonline.com/news/business/2016-09-22/westar-settlement-opens-opportunity-bidding-war#comments", "content": "Westar settlement opens opportunity for bidding war Posted: September 22, 2016 - 6:09 pm By Morgan Chilson morgan.chilson @ cjonline.com Eight bidders not selected to purchase Westar Energy will be able to submit new bids based on a settlement agreement reached this week in a class action lawsuit filed in July in Shawnee County. Westar and Great Plains Energy settled with plaintiffs in all three lawsuits filed against the companies regarding the proposed acquisition of Westar by GPE, according to a Securities and Exchange Commission filing this week. Although most of the settlements related to additional disclosure information added to the companies' proxy statement, one key point reopened the bidding process for Westar, said attorney Derrick Farrell, a lawyer for the plaintiffs with the Delaware office of Faruqi & Faruqi. The settlement agreement required Westar and GPE waive standstill provisions, he said, which are put in place in most bidding processes to maintain confidentiality during a sale. The company, in this case Westar, will often reveal confidential information during the sale. \"You don't want some potential purchaser to get inside information and then trade on it,\" Farrell said. \"One of the things they do to protect against that is they have a standstill provision, (which says)\" hey, we're going to give you confidential information and you can't go buy stock in the company without our permission. \"But a\" little more unique \"provision during the bidding process for Westar also waived the potential purchasers' rights to come in and make a higher offer\" even if one of these people was willing to pay double the deal price, \"he said, adding that they were prohibited from even asking if they could make a higher offer. Those in the class action lawsuit wanted that provision waived so if one of the eight bidders wanted to come in and sweeten the pot, they could do so .\" Those provisions have been dropped so there are no contractual prohibitions now on these eight potential purchasers, \"Farrell said. Andy Pusateri, a utilities analyst for <mark>Edward Jones</mark>, said he thinks it is unlikely waiving those prohibitions from making new offers will start a bidding war for Westar .\" I don't see very likely possibility that we'll get a ton of interest from many other companies, \"he said .\" I don't think all other seven parties are going to come back in because Great Plains did offer a pretty significant premium. \"In general, he said, there aren't many bidding wars in utility mergers and acquisitions; in recent years, he could only think of one .\" We don't see a lot of bidding wars for utility businesses, especially given that Westar put themselves on the block and all of these other parties had a chance to bid, \"Pusateri said .\" I can't point to many other bidding wars just because valuations have been so high that it's tough to really get involved in a bidding war when you're already paying a significant premium for somebody's assets. \"Westar spokeswoman Gina Penzig confirmed that companies can ask to submit a counter-offer, but also said Westar Energy doesn't expect that to occur .\" First of all, we feel like we selected for our shareholders, our customers in the community, the best deal that was proposed, \"she said .\" Also, we think the parties put forth their best offer in the beginning. \"Should an offer come in, Penzig said Westar's board would have a duty to consider it. Morgan Chilson can be reached at (785) 295-5659 or morgan.chilson @ cjonline.com. Follow Morgan on Twitter @ @ crazeywriter. Go to the previous story Pentagon spent $7,687 surveying Fort Leavenwo...ADVISORY: Users are solely responsible for opinions they post here and for following agreed-upon rules of civility. Posts and comments do not reflect the views of this site. Posts and comments are checked for inappropriate language, but readers might find some comments offensive or inaccurate. If you believe a comment violates our rules, email webmaster @ cjonline.com -"}, {"articleID": "2010090705_00234893_W", "names": {"Andy Murray": ["Q10125", "Q526811"], "Svetlana Kuznetsova": ["Q192064", "Q21063641", "Q3978501", "Q4245117"], "Boris Becker": ["Q76334", "Q893625"], "Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"]}, "date": "2010-09-07", "url": "http://uk.reuters.com/article/idUKN0619546620100907?feedType=RSS&feedName=tennisNews", "content": "julian linden new york, sept 6 new york, sept 6 (reuters) - the easy part is over for roger federer. the u.s. open is about to get a lot harder for the swiss master. the 16-times grand slam champion is through to the quarter-finals and in majestic form, but most of his main rivals are too. only <mark>andy murray</mark> has made an early exit. federer booked his place in the last eight with a 6-3 7-6 6-3 win over jurgen melzer at the arthur ashe stadium on monday without ever having to play at his best. it will take a mighty performance from his rivals to stop him capturing a sixth title at flushing meadows but there are some willing challengers ahead. his next opponent is robin soderling, the big-hitting swede who ended federer's french open defence earlier in the season. if he gets through that, federer could then face serbia's novak djokovic, who beat him in the semi-finals at the australian open in 2008. there is also rafa nadal, as always, lurking on the other side of the draw if they both reach the final. federer may be the greatest player of all time but nothing is ever assured. soderling and djokovic also moved through to the quarter-finals by winning on monday. soderling overcame albert montanes, one of six spaniards who made the last 16 of the men's draw, 4-6 6-3 6-2 6-3. it was a workmanlike performance but djokovic was all class and looks the more threatening. the world number three demolished the improving american mardy fish 6-3 6-4 6-1 and is steadily building momentum and confidence. caroline wozniacki cleared one of the major hurdles in her bid to win the women's title when she eased past an error-prone maria sharapova, who is still battling to regain her best form after struggling with injuries for the past two seasons. sharapova was soundly beaten 6-3 6-4 but contributed to her own downfall with 36 unforced errors and nine double faults, including three in successive points. her shrieks echoed around the centre court. she was one of two former u.s. open champions from russia that were beaten in straight sets. <mark>svetlana kuznetsova</mark> also departed, losing 7-5 7-6 to diminutive slovakian dominika cibulkova, leaving vera zvonareva to fly the flag. federer is yet to drop a set in the tournament and hardly got out of second gear against melzer. he did have some problems with his serve and was broken once each in the first and third sets but was able to raise his game when it mattered. <mark>boris becker</mark>, watching from the stands, nodded in approval. after the match, federer shook hands with <mark>alex rodriguez</mark> and was invited to watch his new york yankees play. \"i've never been to a baseball game so that's something on the\" to do' list for me, \"federer said .\" my schedule is busy so we'll see if i can make it or not. \"djokovic, getting better with each match after a shaky start to the tournament, provided a reminder of the form that saw him reach the final in 2007 then capture his maiden grand slam in melbourne the following year with his best performance of the championship. next in line for djokovic is gael monfils who overpowered his countryman richard gasquet 6-4 7-5 7-5 to become the first frenchman in a decade to reach the u.s. open quarter-finals .\" it's very encouraging at this stage of the tournament that i'm raising my game and feeling more comfortable on the court, \"djokovic said .\" i played a great match today. \"soderling has developed a reputation of a giantkiller after beating nadal at the french open last year the federer this season. the odds are stacked against toppling federer on the super-fast courts in new york but he holds no fears .\" i've played roger many times. i know his game and he knows mine, \"soderling said. a surprise finalist 12 months ago but the top seed this year after the withdrawal of injured world number one serena williams, wozniacki reminded everyone of just how far she has come .\" i definitely think i've improved a lot, not only physically, but also i believe in myself more. i believe i can do it, \"wozniacki said. wozniacki's next opponent is cibulkova, the only unseeded player left in the women's draw and also the smallest at just 1.61 metres (5-foot-3).\" okay, i'm short, but, you know, i'm really quick, \"the 45th-ranked cibulkova said .\" i can be fast on the court and i have no problem with the low balls. \"estonia's kaia kanepi recovered from a horrendous start to wear down belgium's yanina wickmayer 0-6 7-6 6-1 and reach the last eight against zvonareva after the wimbledon finalist outgunned germany's andrea petkovic 6-1 6-2 in 67 minutes. thomson reuters is the world's largest international multimedia news agency, providing investing news, world news, business news, technology news, headline news, small business news, news alerts, personal finance, stock market, and mutual funds information available on reuters.com, video, mobile, and interactive television platforms. thomson reuters journalists are subject to an editorial handbook which requires fair presentation and disclosure of relevant interests."}, {"articleID": "2019110618_00169932_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}, "date": "2019-11-06", "url": "http://www.eppingforestguardian.co.uk/news/national/18019313.singer-chris-brown-holds-high-end-garage-sale-home/", "content": "Singer <mark>Chris Brown</mark> holds high-end garage sale at his home By Press Association 2019 <mark>Chris Brown</mark> 0 comment <mark>Chris Brown</mark> says he is having a high-end garage sale at his Los Angeles home, and a crowd has been gathering for hours. The singer posted a flyer on his Instagram and Twitter accounts that included his home address in the Tarzana neighbourhood, and says the event started at 10am Wednesday and will go on until 7pm. The flyer says the sale will feature \"significantly marked-down high-end designer items\". DA CRIB.... ❤ ️ 2 day event pic.twitter.com/WnsN2Zp2U0--<mark>Chris Brown</mark> (@ chrisbrown) November 6, 2019 He captioned the posts: \"DA CRIB...2 day event .\" People began gathering at the house on Tuesday night, and a long line stretched down the pavement of the residential neighbourhood before the event Wednesday. The house was the site of one of <mark>Brown</mark>'s many run-ins with the law, a 2016 police standoff that ended with his arrest. 0 comment"}, {"articleID": "2020022409_00007105_W", "names": {"Mike Burgess": ["Q6846186", "Q6846189"]}, "date": "2020-02-24", "url": "http://www.afr.com/politics/federal/later-foreign-espionage-worse-than-the-cold-war-spy-chief-20200224-p543o4", "content": "Foreign espionage \"worse than the Cold War': spy chief Feb 24, 2020--7.00 pm Share ASIO has disrupted a locally based\" sleeper agent \"who helped orchestrate a campaign of harassment against dissidents and aided foreign spies who travelled to Australia, amid an unprecedented level of espionage and interference. In a rare public address, Director-General of Security <mark>Mike Burgess</mark> revealed foreign spies had travelled to Australia to set up computer-hacking outfits targeting classified information, and visiting scientists and academics also have collected intelligence. ASIO chief <mark>Mike Burgess</mark> says Australia faces twin threats from foreign interference and terrorism. Alex Ellinghausen Mr <mark>Burgess</mark> rejected criticism that no prosecutions had stemmed from the introduction of foreign interference laws despite much fanfare, saying the spy agency had recommended visa cancellations and had intercepted foreign agents when they arrived in Australia. The nation's spy chief also sounded the alarm about the growing threat from right-wing extremism, saying groups had become better organised and were training in combat. Mr <mark>Burgess</mark>, who took over from Duncan Lewis last September, outlined the challenge of keeping Australians safe in the first annual threat assessment delivered by an ASIO chief. Advertisement He said he welcomed greater transparency around the Australian Security Intelligence Organisation's operations. Although China is frequently named as being responsible for foreign meddling, Mr <mark>Burgess</mark> eschewed identifying any country as being responsible for what he said was an unprecedented scale, breadth and ambition of foreign interference and espionage .\" The intent is to engineer fundamental shifts in Australia's position in the world, not just to collect intelligence or use us as a potential \"back door' into our allies and partners,\" Mr <mark>Burgess</mark> was expected to say according to speech notes. \"There are more foreign intelligence officers and their proxies operating in Australia now than at the height of the Cold War and many of them have the requisite level of capability, the intent and the persistence to cause significant harm to our national security .\" Hostile intelligence services have directly threatened and intimidated Australians in this country .--<mark>Mike Burgess</mark>, ASIO boss In one case broken up by ASIO, Mr <mark>Burgess</mark> said a foreign intelligence service had deployed a sleeper agent to Australia who \"lay dormant for many years, quietly building community and business links, all the while secretly maintaining contact with his offshore handlers\". \"The agent started feeding his spymasters information about Australia-based expatriate dissidents, which directly led to harassment of the dissidents in Australia and their relatives overseas,\" Mr <mark>Burgess</mark> said. \"In exchange for significant cash payments, the agent also provided on-the-ground logistical support for spies who travelled to Australia to conduct intelligence activities. Advertisement\" Perhaps most disturbingly, hostile intelligence services have directly threatened and intimidated Australians in this country. In one particular case, the agents threatened the physical safety of an Australia-based individual as part of a foreign interference plot. \"Mr <mark>Burgess</mark> said hostile intelligence services were targeting Australia because of its strategic position and alliances, leadership in science and technology, unique expertise across the economy and the build-up of the defence force and defence industrial base. He said the internet and social networking applications had become a rich seam of information for spies in their recruitment efforts .\" Now, they can use the internet to work from the safety of their overseas headquarters to launch cyber operations against Australian networks and to send thousands of friend and networking requests to unsuspecting targets with the click of a mouse, \"he said. In suburbs around Australia, small cells regularly meet to salute Nazi flags, inspect weapons, train in combat and share their hateful ideology .--<mark>Mike Burgess</mark>, ASIO boss Despite the fall of Islamic State, Mr <mark>Burgess</mark> said the threat of a terrorist attack in Australia remained probable and unacceptably high .\" The number of terrorism leads we are investigating right now has doubled since this time last year. \"While Islamic-inspired extremism remained the principal concern, right-wing terrorism had come into sharp focus after the Christchurch mosque massacre last year. Mr <mark>Burgess</mark> said ASIO this year stopped an Australian from leaving to fight with a right-wing group on a foreign battlefield .\" In suburbs around Australia, small cells regularly meet to salute Nazi flags, inspect weapons, train in combat and share their hateful ideology, \"he said .\" These groups are more organised and security conscious than they were in previous years. \"Share"}, {"articleID": "2015060819_00010266_W", "names": {"Abu Sayyaf": ["Q19926418", "Q22948979"]}, "date": "2015-06-06", "url": "http://www.worldbulletin.net/haberler/160318/pakistan-forms-committee-for-rohingya-muslims", "content": "20:14 Russian, Azerbaijani presidents phone Turkish leaders 17:32 Liberia to help Sierra Leone become Ebola-free 16:30 Iceland ends capital control to boost economy 16:14 Indian Tata steel to lower UK pension age 16:07 Pistorius to be released on parole in August 15:24 Turkish PM to meet president over election 14:04 Turkey does not risk financial crisis 13:22 Turkey ratifies military cooperation with Qatar 12:58 Suspect detained over HDP rally bomb 15:30 Qatar sues French right official for \"terror\" comments 16:33 Electronic tags for Muslim pilgrims 12:03 French, Spanish and Italian stock markets fall 19:45 Italian Enel to invest in renewable energy for Africa 14:19 S. Gas Corridor to supply Azeri energy for 100 years 14:50 Oil prices rise above $60 per barrel mark 12:14 Italy's football striker donates 60K Euro for muslims 11:37 Quran prints from Proph. Muhammad era on display 16:56 Red Juma mosque opens after 90 years 11:43 Muslim scientists discover solar eclipse 11:07 Belgian Muslim community speaks out against radicalization 14:02 Popular Syrian poet adds her voice against Assad 16:34 The legend of Nasruddin Hodja is alive and well 11:52 Spring brings poetry season to Afghanistan 16:56 135 stolen artifacts returned to Egypt from US 11:46 Registan: historic Uzbek grand square spans cities 15:31 Baltic states shocked over Russian sewerage dump 10:58 AstraZeneca, Lilly test new cancer drug combination 16:04 Smart technology key for lower carbon emission 11:12 Deal to phase out rich-world coal export subsidies elusive 08:51 Increased air conditioner use will add to global warming 16:38 EU approves first new genetically modified crops 16:26 Scientists created \"Dino-chickens' in lab 11:15 Apple Watch pre-orders sell out in minutes 13:19 Advanced material made cheaper by Turkish Nanografi 17:29 Mobile technology tiptoes towards 5G 09:17 Cooler Pacific has slowed global warming, briefly 12:41 Astronomers find giant black hole in early universe 16:08 China: Philippines violating South China Sea code 11:11 Ethiopians in Israel protest police brutality 11:56 Germany's ugly legacy: Is Hitler's racist hatred back? 16:39 The era of\" Cold Peace' in Crimea 12:27 The \"massacre\" in Central Africa 14:41 Observations of racial discrimination in Germany 15:07 Framework Agreement on the Bangsamoro 13:22 From gardens to garbage for Afghan capital 10:49 Ahmici massacre remembered after 22 years 15:07 Memoirs with Hasan el-Benna: The guide and steadfast preacher 08:52 Sharif Huseyin declared himself Khalifa 12:20 Seljuks on the Baltic: Polish-Lithuanian Muslims in the Ottoman Empire 14:25 Remembering Palestinian cartoonist killed by Israel 12:15 Four years after uprising, Egypt is back to square one 15:49 Khojaly: massacre which scarred a nation 09:46 Pipeline politics: new gas route revives Russian rivalry with West 09:33 Hate crime charges in NC murders must clear tall legal hurdle 11:33 US media bias shown in coverage of Chapel Hill murders Pakistan has formed a committee consisting of high-level ministers for Rohingya Muslims. Amid countrywide protests, Pakistan has set up a ministerial committee to suggest relief efforts and craft a role that the South Asian Muslim country can play for Rohingya Muslims. The committee comprises the country's outspoken Interior Minister, Chaudhry Nisar Ali Khan, National Security Advisor and head of foreign affairs, Sartaj Aziz, and Prime Minister's special assistant on foreign affairs, Tariq Fatemi, a statement issued by the Interior Ministry said on Saturday. The committee will meet on Sunday to deliberate on the issue of Rohingya Muslims and evaluate Pakistan's role in alleviating their misery, the statement added. Chaudhry Nisar, who earlier this month drew Egyptian government's ire after he declared the death sentence to Egypt's first democratically-elected President Mohammed Morsi \"murder of democracy\" , criticized the international community for its inaction and \"criminal silence\" over the massacre of Rohingya Muslims. \"The silence of such bodies raises serious questions about the utility and effectiveness of international forums that proclaim themselves as upholders, defenders and promoters of human rights and democratic values,\" Nisar said in the statement. He added that the ignorance and silence of international community, especially the United Nations and the Organization for Islamic Cooperation (OIC), would nullify the efforts aimed at weaning away the Muslim youths from falling into the hands of militant groups. Pakistan's mainstream religious and political parties have held several protests across the country in last two weeks against massacre of Rohingya Muslims. Photos and posts highlighting the miseries of Rohingya Muslims have gone viral on social media as common citizens, especially youths, share such posts while criticizing rich Muslim countries for not playing their role, and appreciating Turkey for its contributions. The Pakistani government had earlier expressed its solidarity with Rohingya, but this is the first practical step, an indication that protests might have been influential. Thousands of Rohingya and Bangladeshi migrants have been stranded at sea since Thailand launched an anti-trafficking crackdown May 1 after discovering the bodies of dozens of migrants near its border with Malaysia. After initially turning back boatloads of migrants, Indonesia and Malaysia agreed to take Rohingya in for one year, ascertaining which are asylum seekers and which are economic migrants, on the condition that the international community then resettle them. Russia to expedite military build-up on Kuril Islands Russia has ordered the quick build-up of the construction of military and civilian infrastructure on Kuril Islands. Philippine town suffers water outage Town in Muslim south enters 4th day without water after suspected <mark>Abu Sayyaf</mark> damage pipes, behead militiaman on patrol. Modi cops an earful for misogynist comment Narendra Modi the Indian Prime Minister sparked outrage after making a sexist comment to the Bangladeshi Prime Minister Sheikha Hasina. Korean Air sees no drop in U.S. bookings The Seoul-based airline has received calls from U.S. customers asking about the safety of travel to the region Living in the shadow of MERS South Korean citizens move cautiously amid country's first outbreak of the often-fatal Middle East Respiratory Syndrome Philippines aims to adopt OIC halal standards The Philippines will be adopting OIC halal standards as it will an opportunity to enter global Muslim market 2 <mark>Abu Sayyaf</mark> members arrested in Philippines Suspects fail attempt to capture businesswoman whose brother and son were previously kidnapped Malaysian teams hope to recover victims by evening 13 confirmed dead, 6 missing after tremor sends rocks crashing down on one of Southeast Asia's highest peaks S. Korea to track cellphones to prevent MERS spread S. Korean officals reported 14 more cases of MERS, bringing the total in the country's outbreak to 64, and said a fifth person infected with the virus had died. Sri Lanka opposition demands government change Sri Lanka opposition demand president's appointed prime minister be replaced by party with parliamentary majority Pakistan forms committee for Rohingya Muslims Pakistan has formed a committee consisting of high-level ministers for Rohingya Muslims. Taliban seize key district on Afghan-Pakistan border Afghan troops forced top pull back in early morning attack on Yamgan Bangladesh, India sign territory swap agreement Bangladesh and India have signed deals that \"unveiled some of the pathways to this future' Indian villagers look to Raj in face of power cuts Union Jack-waving residents complain British treated them better than Indian authorities 60% of China's underground water\" not fit for humans' More than two thirds of China's underground water is not fit for human contact. Pakistan govt not ceasing int' l NGO operations"}, {"articleID": "2019111715_00119823_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Sarah Chen": ["Q48894641", "Q710713"]}, "date": "2019-11-17", "url": "http://www.gamereactor.eu/hearthstone-heroes-of-warcraft/?sid=b9ba8e3b22681a58db44470d653415a5", "content": "HEARTHSTONE: HEROES OF WARCRAFT REVIEW. Written by Ricardo C. Esteves on the 9th of August 2019 at 14 \"In addition to offering many alternatives to players, it's a really fun expansion in terms of cards, effects, and variety .\" REVIEW. Written by Ricardo C. Esteves on the 15th of April 2019 at 15 \"Hearthstone changes for the better as new content comes in and old cards are swept from the table .\" NEWS. Written by <mark>Sam Bishop</mark> on the 4th of November 2019 at 14:17 This is coming with the Descent of Dragons set, and we talked with Game Designer Peter Whalen and Engineer <mark>Sarah Chen</mark> about it. NEWS. Written by Jonas Mäki on the 1st of November 2019 at 08:33 We have reported several times about Blizzard's treatment of the professional Hearthstone player Chung Ng Wai. He expressed his support for Hong Kong (which is his ..."}]