[{"articleID": "2017080210_00219211_W", "names": {"Chris Scott": ["Q1077730", "Q18217980", "Q18631749", "Q5108004", "Q5108005", "Q5108006", "Q5108007", "Q57894195"]}, "date": "2017-08-02", "url": "http://www.fleetwoodtoday.co.uk/news/business/fresh-fish-provided-to-the-open-1-8681832", "content": "Fresh fish provided to the Open Published: 10:18 Wednesday 02 August 2017 A fishmongers from Fleetwood was given the opportunity to showcase its produce during The Open at Royal Birkdale, thanks to being selected by Sodexo Sports & Leisure which ran the hospitality and dining suites at the international golf event. Neve Fleetwood, a leading supplier of fresh fish, showcased its high quality produce to visitors who were dining in one of the many hospitality suites, while watching the greatest golfers and rising stars compete at the 146th edition of The Open. Neve Fleetwood's experienced team created a unique dish for the tournament this year, The Open Fish and Chips. The succulent fish, which utilised one of the UK's most popular fish choices, haddock, was responsibly sourced and ensured that The Open guests enjoyed the best quality, fresh fish available. Neve Fleetwood has been offering an amazing supply of fresh fish and seafood to the North West for over 30 years. <mark>Chris Scott</mark>, Sodexo Account Manager at Neve Fleetwood, said: \"The Open proved a very busy but enjoyable time for us and it was a pleasure to supply such a prestigious event.\" Trending"}, {"articleID": "2017063004_00104239_W", "names": {"David Sullivan": ["Q1046824", "Q16196719", "Q5240170", "Q57436725"], "David Gold": ["Q48816571", "Q5234186", "Q56752800", "Q860329"]}, "date": "2017-06-30", "url": "http://www.dailystar.co.uk/sport/football/626090/Premier-League-owners-most-money-richest-investments-club-Abramovich-sportgalleries", "content": "The 10 Premier League club owners who have invested the most in their teams WHICH Premier League club owners have put the most money into their clubs? 1 / 10 GETTY 10. <mark>David Sullivan</mark> and <mark>David Gold</mark> - £ 105m in West Ham \"Two different owners for Arsenal and Manchester City both appear in the top 10\" England's top flight's biggest clubs are all bankrolled by rich investors these days, from the USA, Russia, China and elsewhere. Research by SBO has shown which owners have invested the most cash, with two different sets of owners appearing for both Arsenal and Manchester City. So which club's sugar daddy has splashed out the most? CLICK THROUGH THE GALLERY ABOVE TO FIND OUT. Related articles Every Premier League club since 1992 ranked by their highest home attendance Every Premier League done deal so far this transfer window: What has been confirmed? Borini joins Faubert and Bendtner among the weirdest transfers football has ever seen"}, {"articleID": "2018091021_00167360_W", "names": {"Prem Singh": ["Q28058336", "Q28419672", "Q7240178"]}, "date": "2018-09-10", "url": "http://telegraphindia.com/india/court-blow-to-sonia-rahul-258431?ref=hm-new-stry", "content": "Court blow to Sonia, Rahul Sep 11, 2018 00:00 IST The Congress president places a stone at the memorial to Mahatma Gandhi in New Delhi. Picture by <mark>Prem Singh</mark> New Delhi: Delhi High Court on Monday dismissed petitions from Congress politicians Sonia Gandhi, Rahul Gandhi and Oscar Fernandes that had challenged the reopening of their tax assessments for 2011-12. The bench of Justices S. Ravindra Bhat and A.K. Chawla said: \"The writ petitions have failed.\" On August 16, the high court had reserved its order after the income-tax department contended that Rahul's tax assessment for 2011-12 had been reopened on the ground of the concealment of material facts. The bench had orally asked the income-tax department not to take any coercive step against Sonia, Rahul or Fernandes till it had pronounced its verdict. Senior advocate P. Chidambaram, appearing for Sonia, had said he had faith in the oral statement made by additional solicitor-general Tushar Mehta. Mehta had argued that the Congress politicians had alleged mala fide on the part of the income-tax department but had not made any averments on this. Rahul Gandhi offers water from Kailash Mansarovar at Rajghat on Monday. Picture by <mark>Prem Singh</mark> The income-tax cases against the Congress politicians had arisen from a probe into a private criminal complaint lodged by BJP leader Subramanian Swamy with a trial court in connection with the National Herald newspaper case. Swamy has accused Sonia, Rahul and others of conspiring to misappropriate funds by floating a company called Young Indian that paid only Rs 50 lakh for the right to recover assets worth Rs 90.25 crore that Associated Journals Ltd, the publisher, owed the Congress. The income-tax department has said the shares Rahul has in Young Indian would lead him to have an income of Rs 154 crore and not around Rs 68 lakh, as was assessed earlier. It has already issued a demand notice for Rs 249.15 crore to Young Indian for the assessment year 2011-12. The department's move followed its probe into a complaint alleging the Gandhis had misappropriated Associated Journals' assets while transferring their shares to the newly formed Young Indian. PTI"}, {"articleID": "2015110415_00058182_W", "names": {"Colin Farrell": ["Q11691305", "Q172035", "Q2982593", "Q5145080"]}, "date": "2015-11-04", "url": "http://feeds.huffingtonpost.com/c/35496/f/677045/s/4b3b49ca/sc/28/l/0L0Shuffingtonpost0N0C20A150C110C0A40Cfirst0Elook0Efantastic0Ebeasts0Eand0Ewhere0Eto0Efind0Ethem0In0I84719120Bhtml/story01.htm", "content": "Here's Your First Look At The \"Harry Potter' Prequel\" Fantastic Beasts And Where To Find Them' Accio prequel! Cole DelbyckEntertainment Writer, The Huffington PostPosted: 11/04/2015 09:38 AM EST | Edited: 16 minutes ago Eat your heart out, Harry Potter. The film version of J.K. Rowling's \"Harry Potter\" prequel, \"Fantastic Beasts and Where to Find Them,\" has been shrouded in secrecy ever since the project was announced in 2013. That is, until now. Entertainment Weekly's newest cover star is Newt Scamander, the movie's protagonist and world renowned magizoologist (a person who studies magical creatures) played by Oscar-winner Eddie Redmayne, who sets out on an adventure in 1926 New York. Entertainment Weekly Things to note: Redmayne is sporting Scamander's signature briefcase and standing in the hallowed halls of the Magical Congress of the United States of America (or MACUSA), the magical governing body for the American witches and wizards. <mark>Colin Farrell</mark>, Samantha Morton, Ezra Miller and Katherine Waterston are also set to join Redmayne on the magical adventure. The official title design for \"Fantastic Beasts and Where to Find Them\" was released on Tuesday on the film's Instagram account with a mysterious caption that reads, \"Prepare yourself for the beasts are coming.\" "}, {"articleID": "2018081415_00193686_W", "names": {"Tom Hardy": ["Q208026", "Q21572165", "Q7816088", "Q7816089"], "Peter Parker": ["Q19596717", "Q21165177", "Q51587673", "Q56513979", "Q7176298"]}, "date": "2018-08-14", "url": "http://wegotthiscovered.com/movies/new-venom-fan-art-gives-sinister-symbiote-classic-look/", "content": "x Unfortunately, whether or not Spider-Man will indeed be swinging by Ruben Fleischer's Venom is as up in the air as ever. That said, even if the eponymous web-head does unexpectedly drop in, it likely won't be the \"friendly neighborhood\" version we're all used to. After all, Holland's twenty-something web-slinger just doesn't fit the bill. Nevertheless, that hasn't stopped the fandom from envisioning what <mark>Tom Hardy</mark>'s Eddie Brock locked in battle with the current portrayer of <mark>Peter Parker</mark> could look like. At the beginning of the month, a delectable piece of fan art--or so it would appear to Venom--depicting the cantankerous Klyntar administering a chokehold onto the Iron Spider exploded online. Far-fetched, if nothing else, the image spurred on a new fan theory in which a Redditor theorized that Andrew Garfield could feasibly reprise his role as <mark>Peter Parker</mark>, seeing as the thirty-four-year-old actor would fit in much \"better with the new Venom film.\" Regardless, apparently feasibility isn't something the Holland fanbase is concerned with, as you'll see below. Instagram user Spdrmnkyxxiii posted an updated version of his piece of fan art in which the iconic white encrusted spider symbol is applied to the back of <mark>Hardy</mark>'s symbiote, and Holland's Spider-Man has taken the proverbial place of the \"turd in the wind.\" New Venom Fan Art Gives The Sinister Symbiote A Classic Look 1 of 2 Click to skip MORE FROM THE WEB Click to zoom The latest intel on the situation, at least according to director Ruben Fleischer, is that the titular web-head will not be apart of Venom. Although, seeing as <mark>Tom Hardy</mark> did give Holland quite a tongue lashing at SDCC last month, I suppose anything's possible. Hell, even Fleischer himself has teased that it might just become a reality one day. Until then, though, we'll just have to make due with creative fan art. Which, by the way, is totally fine with us. Source: Heroic Hollywood"}, {"articleID": "2017060112_00953840_W", "names": {"Emily Warren": ["Q22314878", "Q24060566"]}, "date": "2017-06-01", "url": "http://theintell.com/life-style/local-entertainment/music/the-chainsmokers-to-light-up-liacouras-center-in-philadelphia-on/article_4d13ab18-66ea-5831-aab0-e2c058171df5.html", "content": "Close Chris Pizzello/Associated Press \"It's been crazy,\" Alex Pall (right) says of the success he and Drew Taggart have enjoyed as the Chainsmokers. The Chainsmokers to light up Liacouras Center in Philadelphia on Saturday By Ed Condran, correspondent 0 Chris Pizzello/Associated Press \"It's been crazy,\" Alex Pall (right) says of the success he and Drew Taggart have enjoyed as the Chainsmokers. According to the National Health Interview Survey, cigarette smoking among adults and teens has dropped dramatically over recent years. However, according to the Billboard charts, the Chainsmokers are all the rage. There was no secondhand smoke when the Chainsmokers--Alex Pall and Drew Taggart--played South By Southwest in March. The fans who jammed into the Sony party to catch the charismatic EDM-pop duo during the annual music festival/conference couldn't get enough of the act. But that's no surprise considering how well the Chainsmokers have been doing on the charts. The catchy single \"Roses\" reached the Top 10 on the Billboard Hot 100. \"Don't Let Me Down\" became their first top-five single and won the Grammy Award for best dance recording. \"Closer\" became their first No. 1 single on the chart. \"It's been crazy,\" Pall says. \"But it's a good crazy. We are running around so much that we don't get a chance to absorb all of this.\" It's been a whirlwind since the tandem hooked up in 2012. In just five years, the celebrated act is headlining arenas. \"Things have happened quickly for us but we've worked hard for this,\" Pall says. \"We're constantly working.\" The Chainsmokers, who will perform Saturday at the Liacouras Center, are touring behind their first full-length album, \"Memories: Do Not Open,\" which dropped in April. \"Memories\" is cut from the same cloth as the act's EP, 2016's \"Collage.\" The new tunes are witty, playful and hook-laden. \"It Wont' Kill You\" and \"Wake Up Alone\" sound like future hits. Fans danced enthusiastically to the party rock anthems in Austin. \"You never know what's going to happen,\" Pall says. \"We're just happy to have the opportunity to make music.\" It wasn't that long ago that Pall was working as an art gallery receptionist in New York, which is where he grew up. Taggart was an intern at Interscope Records when they met. \"We had this huge connection over music,\" Pall says. \"Calvin Harris, Deadmau5 and David Guetta are some of the artists we talked about when we met. We got together all of the time to make music. It was slow at the start but we started to get it going. The cool thing was that we got some good feedback.\" Less than two years after meeting, the Chainsmokers scored with \"#Selfie,\" which became a viral sensation. \"That was a joke but it blew up,\" Pall says. \"We were just having fun, messing around and it took off. We were in an odd spot since we really didn't have anything else...to showcase. We were just getting started and we didn't expect anyone to get that excited over it (' #Selfie').\" But when the Chainsmokers were pressed to come up with material, the pair came through. \"We love making music,\" Pall says. \"The fame can get in the way. But we try to ignore that stuff and just focus on what matters. It's all about the songs.\" There should be plenty of future for the Chainsmokers since Pall is 31 and Taggart is just 27. \"We're excited about everything,\" Pall says. \"The response has been amazing. We love our fans but we know we have so much ahead of us. We have a lot of work to do.\" Enjoying our content? Become a Intelligencer subscriber to support stories like these. Get full access to our signature journalism for just 44 cents a day. The Chainsmokers appear Saturday at the Liacouras Center, 1776 N. Broad St., Philadelphia. Klara, Whethan and <mark>Emily Warren</mark> will open. Show time: 8 p.m. Tickets: $81 and $110. Information: 215-204-2400; www.liacourascenter.com Tags"}, {"articleID": "2017062106_00490541_W", "names": {"Paris Jackson": ["Q16027591", "Q7137312"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Jermaine Jackson": ["Q317784", "Q3807984", "Q6182329"]}, "date": "2017-06-21", "url": "http://home.nzcity.co.nz/news/article.aspx?id=250253&fm=psp,tst", "content": "Home> News> Entertainment <mark>Paris Jackson</mark> wants to be a good role model for children The 19-year-old star - who is the daughter of pop legend <mark>Michael Jackson</mark> - has revealed her ambition is to make a positive impression on the fashion world, and <mark>Paris</mark> also wants to become a healthy influence in the lives of young women. 21 June 2017 She shared: \"I really want to leave a positive imprint in the fashion world, mostly regarding the media and the stereotypical beauty standard that is blasted all over every magazine you see, every article that pops up on your phone screen, every billboard you see while you're driving down the street.\" I already have many young girls looking up to me and I want to be something their parents are OK with them looking up to. \"<mark>Paris</mark> is balancing her burgeoning career as a model with her ambition of becoming a screen star. The teenager recently secured a role in US TV series\" Star', while she has also just finished shooting her first movie. Explaining her passion for acting, <mark>Paris</mark> told the Australian version of Vogue magazine: \"I've always just loved the aspect of storytelling and getting my head into a new space, experiencing the shoes of another person/character, and suspending reality for a moment.\" <mark>Paris</mark>' movie debut sees her star alongside Charlize Theron and Amanda Seyfried in the Nash Edgerton-directed action-comedy \"Gringo'. And <mark>Paris</mark> admitted the Australian movie-maker played a crucial role in ensuring she felt at ease on set. She said:\" It was just like playing my eighth-grade self. Nash is a total angel and made me feel at home the instant I got to set. \"Meanwhile, <mark>Jermaine Jackson</mark> recently admitted he worries fame could\" break \"his niece <mark>Paris</mark>. <mark>Jermaine</mark> said:\" We're very proud of <mark>Paris</mark>. I just think we have to make sure she is OK because this business not kind to anybody. It can break you. \"You have to know when to hold them, when to fold them, when to make your move and when to hold back.\" "}, {"articleID": "2018030318_00017379_W", "names": {"Amit Shah": ["Q19946588", "Q4746875", "Q4746876"]}, "date": "2018-03-03", "url": "http://indiatoday.intoday.in/pti-feed/story/bjd-ridicules-shah-for-statement-on-winning-odisha-1181353-2018-03-03", "content": "READ LATER BJD ridicules <mark>Shah</mark> for statement on winning Odisha March 3, 2018 UPDATED 21:25 IST March 3, 2018 UPDATED 21:25 IST READ LATER Bhubaneswar, Mar 3 (PTI) BJD leaders today ridiculed BJP president <mark>Amit</mark> Shahs statement and claimed that the saffron partys \"dream\" of forming the government Odisha will never be fulfilled even though it has won in Tripura and other north eastern states. Patro was reacting to Shahs stateme Bhubaneswar, Mar 3 (PTI) BJD leaders today ridiculed BJP president <mark>Amit</mark> Shahs statement and claimed that the saffron partys \"dream\" of forming the government Odisha will never be fulfilled even though it has won in Tripura and other north eastern states. Patro was reacting to Shahs statement in Delhi that BJPs golden period will start when it forms government in Odisha, West Bengal and Kerala. Shahs statement has not gone down well with the BJD leaders and ministers who are celebrating defeat of BJP in the recently concluded by-poll in Bijepur assembly seat .? <mark>Amit Shah</mark> had confidently told that his party will win the Bijepur by-elections, but it did not happen. Therefore, there is no chance of BJP coming to power in 2019 assembly elections in Odisha, \"BJD Vice-president and minister S N Patro said. <mark>Shah</mark> had in September last year set an ambitious Mission 120 of winning at least 120 of the 147 assembly seats in Odisha after BJP registered unexpected success in the rural polls.\" Only Naveen Patnaik is popular in Odisha. Nobody knows <mark>Shah</mark> in Odisha. The BJP is passing through a silver period but it will not reach its golden era. His (<mark>Shah</mark>) desire of BJP forming government in Odisha will never be fulfilled, \"Odishas Panchayati Raj Minister Pradeep Maharathy told reporters. Maharathy, a veteran BJD leader in coastal Puri district, had announced before the results of the Bijepur by-polls were announced that he would resign from the ministry if BJP won the seat. BJD candidate Rita Sahu won the Bijepur seat over a margin of 41,932 votes. PTI AAM KK KK This is unedited, unformatted feed from the Press Trust of India wire. Do You Like This Story? 0 Awesome! Now share the story 0 Too bad. Tell us what you didn't like in the comments Posted by site admin Suggested Stories Recommended READ THIS After Sridevi's death, Congress says UPA gave her Padma Shri. Twitter fumes. INC deletes post Let Chef Kunal Kapur show you how to do Holi right Who's that? Jayalalithaa statue at AIADMK headquarters looks nothing like Amma What exactly happened on the night Sridevi died? Watch Right Now Exclusive: BJP's frontrunner for Tripura CM Biplab Kumar Deb on election results Nagaland election results: NPF supporters raining down money in Dimapur Exclusive: Kiren Rijiju confident of remaining in power in Nagaland Tripura result is a historic verdict, says Ram Madhav on BJP's victory Battleground Northeast: Cliffhanger in Tripura, CPM-BJP neck and neck Top Takes Exclusive: BJP's frontrunner for Tripura CM Biplab Kumar Deb on election results Tripura result is a historic verdict, says Ram Madhav on BJP's victory Islamabad Club snubs Indian envoy Ajay Bisaria, puts on hold his membership application"}, {"articleID": "2014061205_00011080_W", "names": {"Sean Doolittle": ["Q7440950", "Q959451"], "Bob Welch": ["Q2907864", "Q4934336", "Q494745"], "Reggie Jackson": ["Q2640578", "Q7308252", "Q959112"]}, "date": "2014-06-11", "url": "http://www.latimes.com/sports/baseball/mlb/angels/la-sp-cespedes-throw-angels-20140612-story.html?track=rss", "content": "Oakland outfielder Yoenis Cespedes makes an incredible throw to the plate against the Angels on Tuesday. Oakland's Yoenis Cespedes armed and dangerous to Angels' runners / / Oakland's Yoenis Cespedes proves again he's got one of the best arms in the majors / / \"You don't see that kind of arm strength and accuracy from the foul pole. He just winged it' - Gary DiSarcina Collin Cowgill hits a walk-off home run in the 14th inning to lift Angels past Athletics. Angels Manager Mike Scioscia sounded as if he half-expected Yoenis Cespedes, the A's Paul Bunyan-like outfielder, to make a superhuman leap and pull it in.\" The way he was playing tonight, \"Scioscia said,\" it would not have shocked me if he caught it. \"During the second inning of a May 31 game at Oakland, Cespedes threw out two Angels at the plate. And on Tuesday he was at it again, unleashing a throw in the eighth inning that is being compared to some of baseball's best ever. With Howie Kendrick at first, Mike Trout's one-hop double toward the left-field line caromed off Cespedes' glove and into the corner. Angels third base coach Gary DiSarcina said he thought there might be a play at the plate but that Kendrick, who runs well, would score easily. Cespedes retrieved the ball near the foul pole and air-mailed a high-arcing throw of about 300 feet to catcher Derek Norris that nailed Kendrick at the plate and preserved a 1-1 tie.\" You don't see that kind of arm strength and accuracy from the foul pole, \"DiSarcina said.\" He just winged it. \"Said Scioscia:\" When the ball rolled into the corner, I thought Howie would score standing up. Cespedes picked the ball up and threw a guided missile that was right on the money. It was just an incredible throw from that distance, from that angle, everything. \"\"If you hadn't seen it,\" A's reliever <mark>Sean Doolittle</mark> said, \"you probably wouldn't have believed it.\" Which is why the Angels were holding their collective breath as Cespedes quickly retreated to the wall in tracking Cowgill's blast. Angels have confidence going into series against AL West-leading A's Darryl Sutter's decision to coach Kings changed franchise forever Cespedes' throw, Cowgill's homer highlight Angels' 14-inning win over A's Shelly Sterling to ask judge to expedite hearing on family trust <mark>Bob Welch</mark> dies at 57; faced <mark>Reggie Jackson</mark> in classic World Series duel Such a great Lakers team; it stings that <mark>Jackson</mark> and Fisher are Knicks Council members seek tighter state regulation of ride-sharing firms <mark>Bob Welch</mark> dies at 57; faced <mark>Reggie Jackson</mark> in classic World Series duel Pope Francis prays for peace with Israeli, Palestinian leaders GM fires 15 at top levels; report on ignition switches \"brutally tough' GM fires 15 at top levels; report on ignition switches\" brutally tough '"}, {"articleID": "2010031519_00188955_W", "names": {"Sam Williams": ["Q15993660", "Q16019605", "Q18159201", "Q23461766", "Q3946368", "Q3946369", "Q3946372", "Q7408336", "Q7408339", "Q7408340"]}, "date": "2010-03-15", "url": "http://current-movie-reviews.com/sports/2010/03/15/22-year-old-katie-spotz-sets-world-record/", "content": "22-year-old katie spotz sets world record advertisement: 22-year-old katie spotz completed her solo journey across the atlantic ocean today, thereby becoming the youngest person to ever row across the atlantic ocean alone. she started her journey on january 3 in dakar, senegal, and when she touched a pier in georgetown, guyana. \"the hardest part was just the solo part,\" spotz said, who also said that she had trouble sleeping in the tiny craft, and that boredom was her enemy during the 2-month journey. katie spotz is from mentor, ohio, and she made the journey without any support, other than a coast guard boat that escorted her to guyana's coast. her journey was to raise money and awareness for the blue planet run foundation, which aims to bring clean drinking water to roughly one billion people who live without it. \"the records are just a bonus for katie. rowing the atlantic and raising funds for clean water are the things she really cares about,\" said her coach <mark>sam williams</mark>. mike: wow..... you're still using the word retarded. are you like in 4th grade? mike: the cbo has to use \"current law\" which means the sgr or doc fix is not fixed - that alone is...femme: gabby looks like the female version of notorious big - her arms are so huge they are folds of fat! she...denise: sorry laura but many women have the intelligence to see through the phoney kate gosselin. she is not a role ..."}]