[{"articleID": "2015062819_00011649_W", "names": {"Phil Jackson": ["Q16197662", "Q21464447", "Q2342953", "Q316246", "Q7182034"]}, "date": "2015-06-26", "url": "http://www.thescore.com/news/786308", "content": "Less than 24 hours after the 2015 NBA Draft, rumblings of discord have arisen from New York. New York Knicks president of basketball operations <mark>Phil Jackson</mark> turned heads Thursday when he selected 7-foot-1, 230-pound Latvian center Kristaps Porzingis with the No. 4 pick. Knicks fans who attended the draft, held at Barclays Center in Brooklyn, were Carmelo Anthony to the list of dissatisfied individuals, according to Frank Isola of the New York Daily News. Carmelo, according to source, called Tim Hardaway Jr. late Thursday to express his displeasure with <mark>Phil Jackson</mark>'s draft night moves. Oh boy June 26, 2015 Since Porzingis is a relatively unknown commodity stateside, it's understandable that Melo and Knicks fans are confused. However, some experts questioned why Porzingis' skillset didn't garner him No. 1 consideration Jahlil Okafor off the board, the Knicks had the opportunity to draft a promising point guard in Willie Cauley-Stein. Perhaps any of those players would have appeased Anthony. Drama may be brewing in the Big Apple in the wake of the Porzingis pick, but <mark>Jackson</mark> is resolute in his decision. Speaking with ESPN's Chris Broussard, <mark>Jackson</mark> justified tabbing Porzingis as their new prized rookie. \"He's got the best upside that we had available to us. Has a great attitude, good family, working at the game,\" <mark>Jackson</mark> said. \"We understand that it might take a year, but he's willing to work and he's got the equipment to do it .\" The tension surrounding this move might come from the time it could take Porzingis to evolve into an impact player. <mark>Jackson</mark> intends to surround his rookies (the Knicks also traded for the draft rights to Notre Dame's Jerian Grant) with veterans in order to relieve them of overwhelming pressure in their first year. June 26, 2015 It seems Melo may not have the requisite patience, however."}, {"articleID": "2011061922_00073706_W", "names": {"Li Na": ["Q180446", "Q264230", "Q2722542", "Q436411", "Q45600304", "Q45640690", "Q460060", "Q707760"]}, "date": "2011-06-19", "url": "http://bleacherreport.com/articles/740408-rory-mcilroy-nba-draft-serena-williams-and-todays-late-sports-news/entry/97532-serena-williams-what-can-we-expect-from-serena-at-wimbledon", "content": "serena williams: what can we expect from serena at wimbledon? bryn lennon/getty images serena williams faces long odds at wimbledon after missing almost full year serena williams was at the peak of women's tennis almost exactly one calender year ago. she had just won wimbledon and the title secured her ranking as the top player in the world. a year later she has dealt with a slew of injuries that have kept her out of every tournament before playing in eastbourne earlier this month. she was victorious in one match before losing to vera zvonareva in the second round. as williams told reporters, she simply forgot to bring her serve on the trip: \"i didn't travel with my serve to eastbourne, so i hope it came with me,\" she said. \"i hope he was in my luggage coming to wimbledon, because i missed him .\" williams, who resumed practicing in april, said she was only able to train at full strength for just \"21 days\" before leaving for eastbourne. though she has twice returned from extended breaks of over six months to resume winning grand slam titles, she has never had a break of this length since becoming a full-time professional. must read: power ranking the best american tennis players at wimbledon it's going to be a very difficult task for serena, but you can never count her out at wimbledom and now she is finally healthy. but the rust factor is a huge issue and it's hard to imagine her not wearing down physically after playing in multiple matches in the span of a few days. she is seeded seventh and opens her tournament tomorrow when she plays frenchwoman aravane rezai. after that she has the possibility of a quarter-final against <mark>li na</mark>, who won this month's french open title to become china's first grand slam singles champion. expect williams to win the opener, but <mark>na</mark> is riding a boatload of confidence and is currently in peak physical condition. she will be the one to take down serena in her comeback. ricky rubio: are the timberwolves ready to contend for playoff spot with rubio? miami heat: why lebron and wade's efficiency on offense suffered in year one what is the duplicate article? why is this article offensive? where is this article plagiarized from? we're looking for talented sports writers to feature on bleacher report we are the us's 4th largest sports media site with 20 million monthly readers. we deliver entertaining content about all the teams and topics in sports. we have the most popular newsletters for every major team in the us. @ bleacherreport: watch awarding the most controversial dads in sports - copyright? 2011 bleacher report, inc. all rights reserved."}, {"articleID": "2018110707_00097664_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2018-11-07", "url": "https://economictimes.indiatimes.com/news/international/world-news/trump-frames-midterms-as-tremendous-success-despite-losses/articleshow/66533574.cms", "content": "Trump frames midterms as \"tremendous success' despite losses AP | Nov 07, 2018, 11.44 AM IST 0 Comments WASHINGTON (AP)--Resigned to losing his party's grip on the House, President Donald Trump congratulated the House Democratic leader on Tuesday night and chose to celebrate\" tremendous success \"for Republicans in maintaining the Senate. Trump called Rep. Nancy Pelosi and noted her pitch for bipartisanship in her remarks, her office tweeted. The president, in an earlier tweet, weighed in on the midterm results, overlooking the Democratic pickups in the House and writing:\" Tremendous success tonight. Thank you to all! \"With results still coming in, Democrats were on track to gain control of the House, while Republicans kept their Senate majority. Widely viewed as a referendum on Trump's presidency, the results offered a split decision that revealed deep divides in the American electorate. Control of the House would give Democrats the ability to launch investigations into the president and stymie his agenda. But White House spokeswoman Sarah Huckabee Sanders minimized the magnitude of likely Democratic gains .\" Maybe you get a ripple, but I certainly don't think that there's a blue wave, \"she told reporters, pointing to several early Republican wins. As for Republicans retaining control of the Senate, she called it\" a huge moment and victory for the president. \"White House aides called on Democrats to work with Republicans in the next Congress. Said White House counselor Kellyanne Conway:\" I don't know that there will be much of an appetite for Democrat lawmakers to spend all of their time, or most of their time or even a fraction of their time investigating, instigating, trying to impeach and subpoena people. \"In addition to the call to Pelosi, Trump called Republican Senate Majority Leader Mitch McConnell, Republican House Speaker <mark>Paul Ryan</mark> and Senate Democratic leader Chuck Schumer, as well as a number of candidates he backed during the race, the White House said. Sanders said he would continue making calls Wednesday. Trump had aggressively campaigned in the closing days of the race, his focus on boosting Republicans in states that he carried in 2016. Of the three races he targeted in the final day, the Republicans won all of them: Mike Braun defeated Democratic Sen. Joe Donnelly in Indiana, Josh Hawley defeated Democratic Sen. Claire McCaskill in Missouri and Attorney General Mike DeWine defeated Democrat Richard Cordray in the race for Ohio governor. The White House has been stressing the historical headwinds it faced: In the last three decades, 2002 was the only midterm election when the party holding the White House gained Senate seats. And only twice in the past eight decades has the president's party picked up House seats in the midterms. Trump spent election night watching returns with family and friends at the White House, his shadow looming large over the results. Nearly 40 percent of voters cast their ballots to express opposition to the president, according to AP VoteCast, a national survey of the electorate, while about 25 percent said they voted to express support for Trump. Opposition to Trump proved to be more a motivating factor for Democrats than support for the president a factor for Republicans. Still, Republican voters tended to be overwhelmingly supportive of the president. Faced with the possibility of keeping the Senate but losing the House, aides in recent days had laid out the political reality to Trump, who could face an onslaught of Democratic-run investigations. In turn, Trump began trying out defensive arguments ahead of Election Day, noting that midterm losses are typical for the party in the White House, pointing out a high number of GOP retirements and stressing that he had kept his focus on the Senate. Aides set up televisions in the White House residence for Trump, first lady Melania Trump and their guests to watch election results come in, with the sets tuned to different cable news channels. Among those expected were Trump's adult children, White House aides, Republican officials and presidential friends. The election served as a referendum of sorts on Trump's racially charged appeals and the strength of the coalition that powered him to the White House--a group he will need again in just two years. Overall, more voters disapproved of Trump's job performance than approved--a finding that is largely consistent with recent polling. Voters scored Trump positively on the economy and for standing up\" for what he believes in. \"But the president received negative marks from voters on temperament and trustworthiness. Still, about one-third of voters said Trump was not a factor in their votes. Trump's scorched-earth campaigning came to define the 2018 campaign. In the final days, he sought to motivate supporters with the battle over the confirmation of Supreme Court Justice Brett Kavanaugh. Ahead of the election, both parties claimed that the emotionally charged debate over Kavanaugh's confirmation would motivate their supporters to turn out. Returning to his immigration-heavy 2016 playbook, Trump went on to unleash his full fury on a caravan of migrants slowly making their way to the southern border. His take-no-prisoners approach troubled many Republicans seeking to appeal to moderate voters in suburban House districts, but Trump prioritized base voters in the deep-red states that could determine the fate of the Senate. At times he even appeared at odds with his own campaign, which in the election's final days released a gauzy ad aimed at suburban women. Trump did not care for the soft-focus ad, which notably did not mention him, according to a person familiar with the president's thinking who was not authorized to speak publicly. Instead he promoted an expletive-loaded video featuring a Latino man convicted of murdering two police officers, which was widely decried as being racist. ___ Associated Press writer Deb Riechmann contributed to this report. ___ Follow Lucey on Twitter at http: //twitter.com/ @ catherine_lucey and Lemire at http: //twitter.com/ @ JonLemire ___ For AP's complete coverage of the U.S. midterm elections: http: //apne.ws/APPolitics (This story has not been edited by economictimes.com and is auto--generated from a syndicated feed we subscribe to .) 0 Comments"}, {"articleID": "2018033117_00229782_W", "names": {"Gordon Ramsay": ["Q15280", "Q22279905", "Q27557641"]}, "date": "2018-03-31", "url": "http://www.thedrive.com/news/19805/one-of-gms-cruise-self-driving-cars-just-got-a-ticket-in-california", "content": "One of GM's Cruise Self Driving Cars Just Got a Ticket in California Cruise says that its car did nothing wrong. By Rob Stumpf March 31, 2018 News autonomy Bolt Chevy Cruise GM police self-driving technology General Motors SHARE Autonomous car development is having a rough month. From a self-driving Uber striking and killing a pedestrian in Arizona to Tesla's Autopilot being engaged in a fatal crash in California, the news just keeps piling up. Now, an autonomous Chevy Bolt by GM's autonomous division, Cruise, has been ticketed according to local news. The company disagrees and says it has the data to prove that no wrongdoing occurred. The car was pulled over by an officer on the streets of San Francisco for not yielding to a pedestrian in a crosswalk, according to reports. Cruise feels that this is an incorrect assertation of events. The Bolt was in an autonomous driving mode, meaning that its sensors were collecting data as it drove down the street and the car logged the information as it used it to make decisions on just how to operate. The data it collected suggests that the pedestrian was 10.8 feet away from the car while it passed through the intersection, insinuating that the car did nothing wrong. \"Safety is our priority in testing our self-driving vehicles,\" Cruise said in a statement. \"California law requires the vehicle to yield the right of way to pedestrians, allowing them to proceed undisturbed and unhurried without fear of interference of their safe passage through an intersection. Our data indicates that's what happened here .\" One concern that many have is the ability for autonomous cars to be \"bullied\" by pedestrians who walk into traffic or are otherwise aggressive with oncoming cars. As long as the technology is working right, we should be seeing autonomy being more adaptive to pedestrians who are in its path. Cruise stated that its systems were functioning as intended and followed all laws pertaining to pedestrians. The driver behind the wheel of the Bolt has been issued a ticket, according to the Bay Area news station. This brings into question just who should be held responsible for scenarios such as the one which Cruise found themselves in. If a ticket is issued, whether valid or not, while a car is in an autonomous driving mode, who is ultimately responsible for the illegal maneuver? Should drivers be expected to override the vehicle? These are all questions which further elaborate on the need for legislation surrounding self-driving cars. Since January 1, Oklahoma Has Ticketed 60 Left Lane Squatters By James Gilboy Posted in News Watch This Michigan Driver Roll His Car Trying to Avoid a Simple Speeding Ticket By Kyle Cheromcha Posted in News Hawaii Driver Gets Ticket for Honking at Police Car That Allegedly Cut Her Off By Kyle Cheromcha Posted in News Please Don't Try <mark>Gordon Ramsay</mark>'s Very Illegal Trick to Avoiding Speeding Tickets By Kyle Cheromcha Posted in News The Fast and the Furious Movies Are to Blame for Speeding Tickets By Basir Khan Posted in Sheet/Metal MORE TO READ RELATED Since January 1, Oklahoma Has Ticketed 60 Left Lane Squatters Our hats are off to the Oklahoma Highway Patrol. READ NOW RELATED Watch This Michigan Driver Roll His Car Trying to Avoid a Simple Speeding Ticket \"The conversation would have been easier,\" Michigan State Police tweeted. READ NOW RELATED Hawaii Driver Gets Ticket for Honking at Police Car That Allegedly Cut Her Off No one should be above the beep. READ NOW RELATED Please Don't Try <mark>Gordon Ramsay</mark>'s Very Illegal Trick to Avoiding Speeding Tickets Plastic wrap on the license plate? Rubbish, just rubbish. READ NOW RELATED The Fast and the Furious Movies Are to Blame for Speeding Tickets There is a correlation between the movies being released and motorists getting pulled over. READ NOW"}, {"articleID": "2013030114_00055894_W", "names": {"Randy Jackson": ["Q337521", "Q349461", "Q7292252", "Q7292253", "Q7292255", "Q7292256"]}, "date": "2013-03-01", "url": "http://examiner.com/article/cortez-shaw-soars-with-titanium-on-american-idol", "content": "cortez shaw gave a strong performance on \"american idol\" thursday. performing a rendition of \"titanium\" by david guetta and sia, shaw impressed the judges with his unique take on the song. \"that was a really bold and brave move. there was a lot of inconsistency but in the end, there was total redemption,\" said keith urban. touched by his performance, nicki minaj said cortez shaw picked the right song. \"oh is it hot in here or is it just me? i like you cortez. i liked you a lot tonight. good song choice,\" said minaj. focusing on positive portions of his performance, <mark>randy jackson</mark> said shaw was current. \"i like you. i think you're very current. i think you could be an interesting artist on today's scene,\" said <mark>jackson</mark>. after a brief deliberation, the judges voted to keep cortez shaw in the competition. lazaro arbos channels keith urban with \"tonight' on\" american idol' \"american idol' names top 10 girls including angela miller, zoanette johnson rihanna gets an order of protection from a creepy fan. 13 photos mariah's top gave fans quite a performance when it slipped down. examiner.com is the inside source for everything local. we are powered by examiners, the largest pool of passionate contributors in the world."}, {"articleID": "2012091214_00098079_W", "names": {"Todd Miller": ["Q16214997", "Q27988162", "Q28421749", "Q7812539"]}, "date": "2012-09-12", "url": "http://thisweeknews.com/content/stories/olentangy/news/2012/09/11/family-promise-house-project-offers-solace-to-homeless-families.html", "content": "project offers solace to homeless families the only organization in delaware county to provide temporary housing for the homeless will begin renovations this month on its first official home. an \"eyesore\" house at 39 n. washington st. was purchased in march by delaware county habitat for humanity and delaware county family promise and will be transformed into housing for up to five homeless families, with services to assist them in getting back on their feet. jennifer sami, executive director of family promise, said the organization provides essential services to about 40 families a year. its current model involves moving the families from church to church on a weekly basis. all the families served have children under the age of 18. \"these families are already in chaos and crisis mode, and it adds additional chaos to uproot their children each week,\" sami said. \"it distracts them from the focus of getting jobs and housing .\" the program is employment-focused, and the family promise house will provide a full-time social worker to help the families look for housing and jobs daily. \"having one place to serve our families is a more-effective and compassionate way to serve them,\" sami said. \"i think it will add to the success of the families .\" <mark>todd miller</mark>, executive director of delaware county habitat for humanity, said he thinks the house is needed in delaware county. \"the need is there,\" he said. \"i honestly think there are a lot of families that are a few paychecks away from finding themselves in a homeless situation .\" i, for one, will sleep better knowing there is a place for homeless families in delaware county. \"habitat for humanity is the contractor for the project and will work to provide volunteers and financial assistance, contributing half the funds needed to fix up the home. <mark>miller</mark> said habitat officials are excited about making an impact on homelessness in delaware county .\" normally, we only provide families with long-term solutions, and this is a way to provide services to families on a short-term basis, \"he said. sami said families will be able to stay for 30 days with the possibility of an extension to 90 days, depending on their progress .\" the expectation is that these families are looking for employment and a home, \"she said .\" we have a 75-percent success rate. \"the organizations hope area businesses, churches and community members will be willing to donate their money, time, skills or materials to the project .\" i hope the community will take a step forward to help accomplish this project by donating money or sharing their time and talents, \"<mark>miller</mark> said .\" delaware county needs this. \"the project is scheduled to be complete by spring. groundbreaking took place friday, sept. 7, and interior demolition will begin at the end of the month. sami said there are enough funds to complete the demolition and to meet building codes, but more financial support will be needed to finish the interior. healthy communities learn more about health issues and what you can do to lead a better life. awarding $20,000 in scholarships this year! nominate your student in grades 9-12 today."}, {"articleID": "2015120905_00385418_W", "names": {"Adam Warren": ["Q2824023", "Q4679945", "Q4679946", "Q901842"], "David Price": ["Q1176177", "Q16063598", "Q20804677", "Q20973688", "Q332804", "Q37830471", "Q5238707", "Q5238709", "Q5238711", "Q5238712", "Q5238713", "Q5238714", "Q5238716", "Q56072488", "Q56952850", "Q634326", "Q984010"], "Kyle Hendricks": ["Q17182882", "Q17198188"]}, "date": "2015-12-08", "url": "http://chicago.suntimes.com/baseball/7/71/1165768/cubs-build-pitching-depth-radar-moves", "content": "Cubs build pitching depth with under-the-radar moves Cubs build pitching depth with under-the-radar moves Written By Gordon Wittenmyer Posted: 12/08/2015, 11:31 pm Sign-up for Chicago Sun-Times newsletters. Breaking News Alerts The Cubs acquired <mark>Adam Warren</mark> from the Yankees for Starlin Castro Tuesday night. NASHVILLE, Tenn.--It didn't take the Cubs long splashing around in the deep end of the off-season pitching pool to decide on some different strokes for accomplishing their pitching goals this winter. Whether it leads to the division-championship season they have in mind for 2016, they've at least preserved immediate payroll flexibility and potential flexibility for the next two or three years during a period of relatively limited resources. \"As we looked into the starting pitching markets aggressively, both the free agent market and the trade market, we really came to feel like the <mark>price</mark> of poker was very high to acquire starting pitching,\" team president Theo Epstein said. That's why the Cubs struck as swiftly as they did to sign veteran John Lackey to the two-year, $32 million deal that was struck Friday and became official Tuesday--a deal that might have been impossible to get done if it hadn't been finalized before Zack Greinke's record-setting $34.4 million-a-year deal was reached with the Diamondbacks. That's also why right-hander <mark>Adam Warren</mark> looked especially attractive in Tuesday's salary-driven trade of Starlin Castro to the Yankees. <mark>Warren</mark>, 28, is a first-year arbitration-eligible player who has a 3.39 career ERA, mostly as a reliever, and a fastball that touches 95 mph out of the bullpen (92-93 when he starts). He went 7-7 with a 3.29 ERA in a 2015 season that included 17 starts. And he quickly became a modestly priced, controllable player for a Cubs staff that is starting to look thick with effective, versatile pitchers--if not the marquee Greinke and <mark>David Price</mark> types. \"Years and dollars were really significant for starters of note in free agency and came with a significant amount of risk, frankly, that we weren't completely comfortable with,\" Epstein said. \"And in the trade market we felt like in a lot of cases we would have liked to pay like two dollars on the dollar almost in return .\" That was especially true of talks with the Braves over starter Shelby Miller. Sources say the <mark>price</mark> for Miller seemed to get steeper the longer the Cubs talked with the Braves--who eventually got an eye-popping haul for Miller on Tuesday from the Diamondbacks, including shortstop prospect Dansby Swanson, this year's No. 1 overall draft pick. The Cubs have a top four in the rotation of Jake Arrieta, Jon Lester, Lackey and Jason Hammel. They have potential fifth starters in <mark>Kyle Hendricks</mark> and <mark>Warren</mark>, or possibly Clayton Richard or Trevor Cahill. And they're on the way to a power-pitching bullpen with a left-right balance and versatile long and/or situational pitchers. \"You can have impact pitching without necessarily having all household names, sort of bona fide, top-of-the-rotation guys,\" Epstein said. \"We still have to go out and accomplish it, but if you have a staff where there's no negative contributors, no replacement-level pitchers, but all solid, contributing pitchers who throw strikes and can follow a game plan and miss bats and be effective, that in and of itself can make you one of the best pitching staffs .\" I like to think if everyone pitches up to their potential next year we're getting close to that ideal. \"National & World News"}, {"articleID": "2011092603_00006804_W", "names": {"David Proctor": ["Q3018641", "Q55362788"], "Dennis Raphael": ["Q43664290", "Q5258880"]}, "date": "2011-09-26", "url": "http://thestar.com/news/article/1059610--word-on-the-street-is-people-love-libraries", "content": "to view this content, javascript must be enabled, and you need the latest version of the macromedia flash player. click here to get the free macromedia flash player now! the free stuff, magazine back issues, unusual recipe books: just some of the things that word on the street attendees named as their favourites. <mark>david proctor</mark>, the author of a series of books set in a post-apocalyptic toronto where \"condos block out the sky in every direction,\" couldn't have picked a better time to make his debut at the city's largest literary festival. this year's word on the street festival was one of the best-attended in the festival's history, with thousands showing up, but also one of the most political. <mark>proctor</mark>'s latest in his \"condopocalypse\" series concludes with the destruction of kensington market and the construction of a \"mega-condo\" in its place. \"i've been told this is non-fiction,\" he said. queen's park was closed off sunday morning - a warm and sunny autumn day - lined with book booths and food trucks and visited by a steadily growing crowd of people celebrating all things books. june dickenson, head of public relations at the festival said the mood of the festival was different this year because of the talk of budget cuts at city hall. \"people are saying i want to see the authors because it (the festival) may be taken away from us .\" last year, she said, there wasn't such urgency. \"nobody rallied around things the same,\" she said. the toronto public library workers union, which represents 2,400 full and part-time employees, made its inaugural appearance. maureen o'reilly, a librarian and the union's president, said she got over 1,000 signatures on her petition to keep libraries open and sold all 350 of her grey canvas tote bags emblazoned with her union's logo. in a way, the union's bags and pins became the chic accessories of the festival - a defiant kind of political statement. \"nobody in their right mind assumes they'll run into (mayor) rob ford here,\" said <mark>dennis raphael</mark>, professor of health policy at york university, carrying a union bag and wearing a red tommy douglas shirt. the other festival must-have was the little book of rob ford, a pocket book of the mayor's quotes published in 2011 by house of anansi press. the anansi booth was giving the book out free with another purchase, while the unionized library workers were giving it away outright. an varied assortment of word-loving groups attended the festival, including the poets league, the horror writers association (complete with a grave stone rip-patterned tablecloth), and chizine publications, a publisher of surreal and disturbing fiction. \"if we can frighten dogs and children we're doing our job,\" said co-publisher sandra kasturi. republican approach would \"cripple' u.s., says obama as he seeks support on west coast the three-day trip, ending tuesday in denver...careers @ the star advertise with us"}, {"articleID": "2018121822_00270713_W", "names": {"Erik Hansen": ["Q11967715", "Q12310324", "Q12310326", "Q12310328", "Q3305138", "Q37991672", "Q40523468", "Q5388613"]}, "date": "2018-12-18", "url": "https://finance-commerce.com/2018/12/lawsuit-pits-witchs-hat-against-condo-tower/", "content": "A Prospect Park neighborhood group has turned to the courts to try to force a developer to shrink the height of a residential project proposed near the historic Witch's Hat water tower in Tower Hill Park. Chicago-based Vermilion Development has already received city approval for the Arts & Architecture Project, named for the historic building at 3338 University Ave. SE in Minneapolis. The $75 million apartment and condominium project is about a block and a half west of the Westgate Station on the Green Line light rail route. Vermillion plans to renovate the 1919 structure for commercial uses and build a seven-story, 137-unit apartment building wrapping around it. It also wants to build a 13-story, 72-unit condo tower next door. It's that condo tower that alarms the Friends of Tower Hill Park, a nonprofit group organized to \"protect the views of, and from, the Prospect Park Water Tower,\" according to a court filing in Hennepin County District Court. The group is suing Vermilion and the current landowners under the Minnesota Environmental Rights Act, arguing the view from the building is legally protected. The tower and surrounding park occupy the highest land elevation in the Twin Cities and are on the National Register of Historic Places, according to the lawsuit. The lawsuit, which seeks an injunction blocking the project from moving forward, is \"ludicrous,\" Vermilion said in a statement Tuesday. \"We hold tremendous and sincere respect for the community of Prospect Park and for Tower Hill and the Witch's hat, and we're honored to be contributing to the area's growth along the green line,\" Development Manager Ari Parritz said in an email statement. \"The baselessness of this lawsuit is a painful smear on the positive nature of all of our relations to date .\" The complaint was filed Dec. 11. A supporting affidavit by Gayla Lindt, a University of Minnesota lecturer in architecture and vice chair of the group, argues that blocking the view from the 107-foot tower would cause \"irreversible\" harm to the neighborhood. \"The view from the Witch's Hat Tower is breathtaking; in my opinion, it is the most spectacular view in the Twin Cities in that it allows uninterrupted views to the distant horizon,\" she said. The condo tower would be considerably taller than the Witch's Hat tower and located 450 feet away. The finished building would block the tower's view of downtown St. Paul and the Capitol, the group claims in the lawsuit. The group does not oppose the development entirely, said its attorney, <mark>Erik Hansen</mark> of Minneapolis-based Burns & <mark>Hansen</mark>. An early proposal for the apartment building--without the condo tower--was acceptable to the Friends of Tower Park Hill because it did not top the tree line around the Witch's Hat, he said Tuesday. \"If someone erected a skyscraper next to the State Capitol, people would object, and rightly so, because it changes the whole effect of the building,\" <mark>Hansen</mark> said in an interview. \"...I don't think the community is trying to stop the project, per se. The concern is the height .\" Vermilion believes the view from the Witch's Hat, which is open to the public only one day per year, should not block development nearby. The developer also denies many of the specific claims made in the lawsuit. The Capitol and St. Paul Cathedral are barely visible from the Witch's Hat, Parritz said in an interview. More important, he said, the tower won't even block that sight line. Plans filed with the city show the condos on the north end of the proposed development, east and slightly north of the Witch's Hat. Downtown St. Paul is to the east and southeast. \"Our building's location does not block that direction,\" Parritz said. \"What they are claiming is untrue .\" As to the broader objection that Vermilion's project will break up the uninterrupted view from the tower, Parritz said that creates an unrealistic burden for development. \"If you contemplate the consequences, or the precedent that this would set, and play it out, it's going to make your head hurt,\" he said. \"Because it means in 360 degrees around a fairly central location in Minneapolis, you cannot build any buildings that would block any sliver of any other building, anywhere in the metro .\" In response to community feedback, the height of the project was reduced earlier from 17 stories in the original proposal to 15 stories, then again to 13, Parritz said. Sight lines have played a role in other historic preservation debates. A market-rate apartment proposal by Plymouth-based Dominium in Uptown Minneapolis was delayed for several years due in part to concerns it would block the view of the adjacent Buzza Lofts, another historic building. The Minnesota Environmental Rights Act has been used before to protect the view from important landmarks, <mark>Hansen</mark> said. He cited a 2011 case in which a court blocked AT & T from building a 450-foot cellphone tower near the Boundary Waters Canoe Area Wilderness in northern Minnesota. Victory in that case was short-lived, however. An appeals court overturned the ruling and allowed construction to proceed. Vermilion has not yet filed its formal response to the lawsuit, and no hearings are scheduled. Barring an injunction, Vermilion plans to break ground on the project in the first quarter of 2019, Parritz said. The neighborhood group hopes to resolve the issue without further litigation, but believes the character of the landmark is at stake, <mark>Hansen</mark> said. \"Hopefully this isn't one where people will [on the] backend regret allowing the construction to go forward,\" he said. Related: Vermilion plans Prospect Park condo tower, apartments Friends of Tower Hill Park complaint [PDF] Friends of Tower Hill Park affidavit [PDF] Vermilion Development statement [PDF] Like this article? Gain access to all of our great content with a month-to-month subscription. Start your subscription here."}, {"articleID": "2011102109_00081832_W", "names": {"Thomas Jefferson": ["Q6115426", "Q743755", "Q7791239"]}, "date": "2011-10-15", "url": "http://businessinsider.com/paul-krugman-inequality-financial-crises-2010-6", "content": "follow us on facebook and get updates from money game posted directly to your news feed email sent! you have successfully emailed the post. image: paul krugman paul krugman is in europe, where among the other things he's presenting at the luxembourg income study on the connection between inequality and financial crises. summary paul krugman is a economist and a op-ed columnist for the new york times. he is also professor of economics and international affairs at princeton university. in 2008, he won a nobel prize in economics. he has written multiple...joe weisenthal contact: e-mail: krugman using objective data to back up his theories is a good thing. presenting his economic analysis to peer reviewed forums backed by old-fashioned data analysis and appropriate case control should be welcomed. this is a welcome departure from some of the overreaching that drives his nyt columns. yea but the inequality gap is a function of all administrations (the \"clinton miracle\" for example) whereby good natured ideas to bridge the gap starting with innocuous concepts like sub prime mortgages. nicely done wouldn't you agree...now look at greece, they were fronted mountains of cash so that they could bridge the inequality gap to western europe. they took the money. they squandered and looted the money and got nowhere. nowhere except in deep debt. both of these and cast of a thousand more were instrumental in creating bubbles and financial crisis. you think cdos were the playthings of bank geeks? in part true, but they were products to help the poor raise their standard of living through access to credit. of course it was a disaster every step of the way. but again, a major component introduced to bridge the gap .: perhaps a better question is how did the wealth-income inequality gap become so wide that the bottom 47% have even less to pay in taxes. whatever happened to trickle down economics? where have real wages gone in the last 40 years? how can you expect wages to fall and incomes and therefore taxable incomes to increase? complete nonsense. of course the population will pay less in taxes if they have less of the wealth from earning less in income, since their jobs of course were off-shored. not to mention lax standards in regards to illegal immigration. you wanted to destroy the middle class, and now your complaining about negative effects on the tax base? if you don't have the taxpayers you don't have a tax base. so why should unearned income not be taxed, relative to earned income? what gives speculators more of a right to gamble on land and equities than investing back into industry? why should real investment and income from work be discouraged? this is a bunch of baloney republican talking points. in a 35 year career as a partner in a cpa firm, dealing with thousands of businessmen, i never met one who was going to close up shop because he was only going to get to keep 58 cents out of every dollar of profit instead of 60 cents. the reason why business isn't expanding is because it's laying off. if you have overcapacity, particularly if it's debt-financed, it doesn't make much sense to add more people and build more capacity when you can't keep your current facilities or people busy. yes. but this time the elites have learned their lesson and they will not let slip their gold-plated boots from the bloodied faces of the middle and working classes. rushbo economics part one: what is not class warfare: cutting pay, eliminating benefits, increasing job demands, buying productive companies to saddle them with debt in order to raise $$$to play the markets, outsourcing jobs, exporting industries, employing illegal immigrants, transfering losses onto the govt. you nailed it. some day, i hope the average american can see beyond the propaganda machine meant to \"keep them in their place\" and supporting an economic regime that does nothing but screw them over. a lot of piss but no vinegar...so what to do? let china eat our lunch eight days a week so that we can make sure that american workers make $45 an hour to produce something in 12 other countries (including china) can produce for $3? you sound like you're running for office. you make good points in a vacuum. i'm not suggesting i have the answers to your question but i can certainly tell you that the era of all those things you pine for is certainly gone. you aren't going to put toothpaste back into the tube. thanks alphadirected. you really taught me how to construct an argument \"you aren't going to put toothpaste back into the tube .\" wow, that sure is mighty big thinking skills you got there. hard to argue with such airtight logic. economics and toothpaste. why didn't i see the similarity? it all begins to make sense when you think of economic problems as being similar if not identical to toothpaste problems. \"being a california resident my entire life, i will tell you with full authority that the latinos built this fucking state .\" wow, another great argument. i'm to suppose to take it on your authority that this bit of nonsense is true? and the gratitutious profanity is intended to make your argument even more irrefutable? brillant! while i understand latinos--or as they refer to themselves, the race--are a super race to which all other ethnic groups must bow and whimper, i will not do so. latinos are no better or worse than any other ethnic group. \"if you took every latino laborer and immigrant (illegal or otherwise) and shipped them back to where they came from, the state would entirely collapse in two weeks. forget their energy input, just look at what would happen to the tax base when you take them out of buying products at 9.75% sales tax or buying gasoline both of which you can't get around due to citizenship. economic collapse post haste. faster than already happening if that's possible...\"oh so true, and the fact that they duck income taxes doesn't change a thing. and it would be hateful to point out that while they routinely duck out of paying income taxes, they still make full use of the state roads, highways, schools, hospitals, etc. and so, in conclusion, you don't have any solutions but the john mccain solution: wring your hands and whimper,\" the jobs are gone and ain't coming back., the jobs are gone and aint coming back. . \"nice. the indians, mexicans and chinese must giggle at such american economic defeatism. what did you just say? as far as i can tell you derided my opinion because of all of it's\" big thinking skills \". then you went on and on about who knows what and then completely distorted the latino issue. in fact your understanding of the immigration issue looks to be taken directly from a tea party genius that heard about it on fox. btw. the latinos (or any immigrant) cannot duck out of sales tax nor can they duck out of paying taxes at the pump etc. if you've got some empirical evidence saying they take more in taxes than they give, then lets fucking see it. and don't show us any of that sexed up crap from those heritage foundation goof balls. look, i don't have an answer to an infinitely complex situation. nor do you--so quit with the populist\" well if americans were just smarter \"mentality bullshit. i'm not wringing my hands in defeat at all. that's your ridiculous assumption to be piled atop your other ridiculous assumptions. well genius, if the latinos built california the stats show they did a pretty poor job. with all those high priced players in la, frisco, and silicon valley paying big tax bills the state is still going broke. is broke. wonder how all those busted hospitals would fare if your beloved illegals would pay their hospital bills instead of skipping out. no mention by you of the large latino gangs home grown in california that now have their tentacles in most of the us and south of the border. i live in a small city of 8000 2000 miles from the border. we have had a latino presence here for over 50 years. officially we are over 20% latino. reality says closer to 30. one city 20 miles south of here is officially 40%. from experience i can say your claim that latinos are super workers is just plain crap. i've worked shoulder to shoulder with these people and they aren't even average. when the boss isn't looking you can't find them. when the boss comes around they brown nose the hell out of him so he doesn't see their lack of activity. quality isn't in their vocabulary. employers want illegals because they are too scared to do anything but work hard and endure your arrogance and incompetence. sounds like you employ gobs of illegals and are pissed cause you can't get enough of them. hey einstein, 1) only dolts and hells angel types call san francisco\" frisco \"...2) california is going broke because the ca government is retarded. it isn't about not paying enough taxes, it's about the\" smash and grab \"techniques used by both democrats and republicans alike with no regard or care about the state at large. i've got a $13mm bike path being put in in my community and we just voted on a $1bn yes that's one billion dollar! public transit train going to a community with 240 people in it! looks great supporting\" public transit \"so the mental midgets in sacto jumped on. the most expensive public transit train on the planet. no shit. hello, this is our problem--not some latino guy working for $9 an hour sending money back to mexico to his family. 3) i'm sorry you are working\" shoulder to shoulder with illegal aliens \"maybe your outlook would look a little rosier if you had a better job. just a thought. anyhow, your personal ancedotal evidence is meaningless in public policy. give us a an actual number of how many latinos run out on their hospital bill. now give us a number in how much latinos pay in sales and fuel taxes that can never be avoided. 4) american workers overpaid compared to chinese workers ignorant? are you a union shop steward touting union rhetoric? hey einstein, chinese workers are paid less than american workers thereby american workers are paid too much for the same work. do you want your iphone to cost $1,200 or do you want to pay $199? i'm not making up any rules here or saying anything that isn't obvious. don't hate the player--hate the game. and btw, your final statement reveals that you are a union mouthpiece spouting the same ol tired shit as the ship goes down. 5) look at solar energy in this state. an important industry across many fronts. president obama is using solar as a pillar of his\" green revolution \"the electrical union has stepped in and lobbied to have all the workers on a solar installation be union workers. they say\" we need strong union labor to be involved in green energy and to promote american hard work and the families they support \"fine. then the solar industry realized it would raise the cost on each job anywhere from 50-100% per job and it would kill the solar industry. nobody could afford solar with the increase. so the union says when asked about the crippling cost increases\" we need strong union labor to be involved in green energy and to promote american hard work and the families they support \"...they want to kill an entire industry and have no jobs for their members rather than be rational. as they've done over and over and over. how many industries have they destroyed now? the us does not benefit from such trade whatsoever, only a few executives and wall street benefit from the current dynamic. as the industrial output of the nation declines so does the ability for the nation to maintain its current living standards and tax base. so the ability to even service debt decreases. this forces an increase in credit growth whereby foreign goods are purchased with debt. you wanted your free market and free trade? now you have to live with the consequences. the enormous racked due to companies not willing to house operations in the us. why? labor costs. period. you are not looking at the big picture, you're simply looking at your flawed and failed neoliberal model. so china's macro policy decisions are of no consequence? free trade is a one way street to deindustrialization. the us was built on protectionism. from 1776 up until the end of ww2 and even more so up until the end of 1971 the us was once of the most protectionist nations on earth. all major industrial developed nations were developed through protectionism. governments when properly managed (i.e not under neo-liberalism, but under checks and balances, regulation, etc) are non-profit entities. unless you want to get into pinochet's endeavors. businesses are free to move to haiti. tax rates and regulation were at all time highs for them during the 50s and 60s, where did they go? they stayed right in the us. do you know why? it's the same exact reason why enterprises do not move from china (even though labor costs have been increasing over the past few years) to countries in southern asia, south america or africa. there is no infrastructure in those third world nations to handle the capacity the enterprise needs to move. government investment into infrastructure actually lowers their costs of production. why doesn't the free market invest in infrastructure? investments in infrastructure are considered to be quite terrible as a general rule of thumb by private investors. they almost always turn sour during recessions and usually go bankrupt in the free market. the only investors that actually stand to make a profit are the scavengers that buy them up on mere fractions of their original investment values. if labor was not needed then businesses wouldn't hire that labor period. if labor is needed for certain tasks then businesses simply must pay the difference instead of taking as much income from labor as possible and paying it out in dividends. businesses make profits after-tax. if they want to share in the growth of a region they will pay the necessary taxes. businesses will go wherever they find the most opportunity, if they want to exploit (i.e speculate instead of making capital investments) it then they don't have to share their benefits. no an increase in wages does not result in an increase in the price of the end product. this has been proved wrong time and time again. if a business is to be competitive in the market place and meet demand it cannot rise prices instead that will eat the cost of the wages. capitalism is about capitalists maximizing profits at the expense of all else. what the unions would like is keeping the real wage promised to them 40 years ago when the free-trade and deregulation business started. what they are seeing now is that the neoliberal models have been shown to be totally broken. the pension underfunding has more to do with faith in the stock market and the management of corporations, that is the risk taken with defined benefit contribution plans. no doubt managers looking out short term profits don't mind borrowing from workers pensions. it's a similar situation to what we have with ss and medicare. for the last 40 + years ever since lbj started spending taxes alloted to the ss and medicare trusted funds into the general fund for mostly military-industrial complex spending. he doesn't explain it at all, but someone a lot better does here:\" if the american people ever allow private banks to control the issuance of their currency, first by inflation and then by deflation, the banks and corporations that will grow up around them will deprive the people of all their property until their children will wake up homeless on the continent their fathers conquered. \"- copy to clipboard\" paper is poverty,...it is only the ghost of money, and not money itself. \"--<mark>thomas jefferson</mark> to edward carrington, 1788. me 7:36 like i told wrote acted total all truth even total all process in the past like 9.8 mh global devils' assumption over the average when i will satay in fiji originally naturally automatically i will back to my concentration. (greatest incredible nothing values will be broken) till that 9.8 mh globla separation will be finished in 9.8 mh globla total all the rich often get richer by driving the poor and the middle class into debt to them through predatory lending and by any other means they can think of. a lot of the assets the rich hold are nothing more than ious from various borrowers, including taxpayers and ordinary people. but the problem with becoming rich by making others poor and indebted to you is that sooner or later the poor become so poor that they no longer are able to keep borrowing and spending just like before. which puts a stop to their borrowing and spending. and this leads to job losses and widespread defaults of the debtors who have lost their incomes and can no longer service their debts. in a win-lose situation like this, the winners are only temporary winners. the rich become temporarily more rich by driving the people into debt to them. but then at some point the debts of the poor become so large that the poor default due to their inability to pay. and the rich lose some of their riches as a result of that. which makes everyone more equal in terms of wealth than before .: the government has to borrow in order to give the money to the banks. that's what all those trillion dollar deficits are all about. but whatever the government borrows from the rich, the taxpayers will eventually have to repay with interest. which means that government bailouts of the banks is just another way of increasing the inequality between the rich and the poor. the rich become more rich, and the rest go deeper into debt to the rich because of increased government borrowing. right, but what krugsie-ubsie suggests, and will always suggest, is that a. governments must continually bail out the little guy at the expense of the big guy. b. make those rich bastards pay, and pay and pay.... what he fails to understand, and i think most liberal/progressives fail to grasp is that it's not supposed to be fair. of course it's unequal. that's why we call them rich people. duh. the economic forces are similar to phyical forces. they create their own checks and balances. when government tries to control those forces, they may do so for a limited time, but i think, ultimately nature wins. for the past 60 plus years, our economy has been inflating. doesn't it make sense that it must de-flate sometimes? what government should do, i believe, is help people adjust to new norm and not keep trying to put back the old one. yes, extend benefits to unemployed, but help them find work at the same time. if we really want to go socialist, then we should create a public works program aimed at helping people get trained for new jobs. who blames rich folks for poor folks (sic) problems? the big guys get bailed out or subsidized at least as often as the small guys. the slides point to nothing more than a correlation. there is no cause and effect shown. smoke and mirrors economics as i see it. to call it unmistakable is simply misleading. for an economist that is so hell bent on imposing socialist tyranny on the masses it is no wonder he blames income disparity. the true cause of this problem is a lack of individual responsibility. krugman is just looking for a way to justify the redistribution of wealth (except for his own i am sure). you are nothing more than a socialist. you support socialism for the deadbeat pentagon bureaucrats costing the taxpayer a million dollars a year, each. what do they have to show for it? nothing but failure after failure after failure in nearly all of their post-ww2 enterprises. if you weren't such a socialist you would be calling for the firing of 95% of these pentagon welfare queen and hillbillies stationed in remote sandboxes instead of encouraging more military spending bankrupting the nation. mr krugman, could you unmistakably explain why no bubbles in vastly more unequal countries such as mexico and brazil? how maker's mark bourbon travels from a kentucky distillery to your glass the greenest office building in the world is inadequate without this tool how this fashion startup manages its complicated supply chain operations lumber exports from north america to china are about to hit a record $2.6 billion this year october 2011 business outlook survey - indicators suggest continuing weakness - philadelphia fed"}]