[{"articleID": "2019081704_00015697_W", "names": {"Ian Ward": ["Q19670167", "Q45316198", "Q5983200", "Q5983207"]}, "date": "2019-08-17", "url": "http://www.thetelegraphandargus.co.uk/news/17840424.bradford-39-s-west-end-suffers-another-blow-flares-announces-closure/", "content": "News Bradford's West End suffers another blow as Flares announces closure By Felicity Macnamara @ FelicityM_TandA Reporter See photos images Skip to next photo 1 / 1 Show caption 1 / 1 0 comment THE last remaining club in Bradford's once-thriving West End is to close its doors tonight. Flares, at the top of Morley Street, has managed to weather the storm of high-profile closures in recent years, but will shut up shop after a final party this weekend. Many in Bradford will remember the glory days of the West End, when the area was packed with clubs and nighttime spots, from Che Bar, Revolution and Love Apple, to Walkabout, Livingstone's, Tokyo, Brewhaus, Bierkeller and The Sir Titus Salt Wetherspoons pub. But it's a scene which has vastly changed, leaving forlorn-looking, empty buildings as a sad reminder of what once was. Jason Courcoux, who has been general manager of the venue since 2012, has seen the West End change in the seven years he has been at the helm and says Flares is the last club standing. He said: \"It was still very vibrant, the area was busy and there was a hell of a lot of trade on Thursday, Friday, Saturday and Sunday.\" The demographics of everywhere has changed slightly. It has changed around again because there's quite a lot of new openings on the Ivegate area, with Sunbridgewells. \"It just seems it has moved areas, but this was initially all built and purposely earmarked for the late night economy, which is a shame it has all gone, because we've got the Odeon [Bradford Live] in the next two years, so it's just not going to have that kind of late night support that it should have. We've seen every venue, one by one, close.\" Jason said there were hopes of it coming back when some new venues like Brewhaus, Bierkeller and Tiki-O opened, but they too shut up shop. In an interview with the Telegraph & Argus earlier this year, Aaron Mellor, who ran the three venues as part of his Tokyo Industries chain, described trading in Bradford as \"impossible\" due to rating levels. At the time he said: \"The city is clinging onto hopes that a miracle investment of incredible proportion in the Odeon will save the city - it won't.\" Jason says a lot of work has gone into trying to make the area work, but it hasn't seemed to have taken off. \"I have been involved with some meetings with Alex Ross-Shaw, Richard Dunbar, Susan Hinchcliffe, who are all supportive of the late night trade--it's not anything they've done or the Council, it's just how the area has gone,\" he said. \"We've still remained pretty consistent, we've still got a nice Friday and Saturday crowd, so it's still ticking over. It's a shame to see it go--I hope whoever takes it on next runs it as a late-night venue.\" I'm hoping the Odeon will turn things around slightly, but whether or not anything will come back to the West End, I'm not sure. \"Since Che Bar went to Life Church and there's now talk of what was Walkabout being a church as well, it seems the use of the area is going to be completely different.\" Everyone earmarks it and says \"oh it's Bradford'--it's the country, it's nationwide.\" There's certain towns and cities that do thrive still, and there's some that have either not kept up the pace or the momentum, or the demographic has changed. \"He added:\" Let's hope the Council teams, the NEC teams, have all got enough in place to reinvigorate the area and give it that drive. We're hoping the Odeon will give it that injection it needs. \"The club will be open tonight for one last nostalgic knees-up before the music stops and the disco ball stops spinning for good. <mark>Ian Ward</mark>, chairman of Bradford BID, said:\" It's always sad to see a venue close and we hope a beneficial new use for this building can be found soon. One of the BID's key objectives is to help improve the night-time economy and we want to see more entertainment, leisure and hospitality venues opening to help bring the city to life for both residents and the visitors who help boost the local economy. \"City centres are going through a period of unprecedented change, with a whole raft of new commercial challenges, and we have to learn to adapt to fluctuating trends and be fleet of foot in responding to them.\" While some venues may have closed, the BID has been pleased to see others open in areas such as Ivegate, Sunbridgewells and North Parade, for instance, and we should embrace these periods of change as exciting opportunities to remodel the city's offer and deliver what people want to see now. \"Councillor Alex Ross-Shaw, Bradford Council's Executive Member for Regeneration, Planning and Transport, said:\" Obviously it's sad to hear that Flares has closed down and it's clear the West End area of the city centre is undergoing a number of changes at the moment. Although the old clubs are gone there are new organisations coming in such as the trampoline and soft play park, Airobounce. \"Cllr Ross Shaw said with Bradford Live there is a\" huge opportunity \"for the area to regenerate.\" We're doing a lot of work analysing what those opportunities might look like so we can work with potential end users to get the West End filled and buzzing again. \"Trevor Higgins, CEO of Bradford Breakthrough, added:\" The West End of Bradford has had many ups and downs through the years. I remember way back in the seventies it had a thriving night life scene and it has had several periods of rise and fall since then. \"Now would be a great time for the area to take off once again. The city centre night scene is on the up with North Parade and Sunbridge Wells, due to their unique offerings, attracting visitors from across the region. The revitalisation of the West End would be yet another piece in the city centre redevelopment jigsaw.\" 0 comment"}, {"articleID": "2010100820_00209540_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Rory Reid": ["Q22807045", "Q7366945"], "Jim Gibbons": ["Q17411221", "Q59228431", "Q6195205", "Q639207"]}, "date": "2010-10-08", "url": "http://rgj.com/article/20101007/NEWS19/101007060", "content": "your browser's security settings are preventing some features from appearing. sandoval and <mark>reid</mark> exchange jabs in second nevada governor debate nevada's gubernatorial candidates took jabs at each other in the second of four debates thursday, with democrat <mark>rory reid</mark> criticizing republican opponent brian sandoval for his lack of experience running a complex government and lack of a plan to fix nevada's estimated $3 billion budget deficit. sandoval, a former federal judge, countered in the las vegas-based debate that <mark>reid</mark>'s budget plan is so full of fantasy money that it would be \"laughed out of the legislature\" because it doesn't add up. he also warned the statewide audience that <mark>reid</mark>, chairman of the clark county commission, will raise nevadans taxes while he will not. both candidates have taken strong no-new-taxes stances throughout the campaign, although <mark>reid</mark> said thursday he would consider supporting a state lottery if the profits went to education. \"tonight, my opponent said no to all of these tax increases, but when he was presented with the question that said,\" if you were presented with a budget that includes a tax increase, would you sign it,' he said he would, \"sandoval said of <mark>reid</mark>.\" so the answers given tonight don't compare to what he said previously. \"<mark>reid</mark> continually criticized sandoval for a lack of a budget plan, one he had promised long ago in the campaign but has never delivered for the current budget shortfall.\" the problem with this debate is that it is so one-sided because brian does not have a plan, \"<mark>reid</mark> said.\" i can't criticize it because he simply does not have one. the only thing he has made clear is that he will cut $500 million from education. \"at times the candidates joked with each other. <mark>reid</mark> probably got the best jab against republicans, saying that sandoval was just another republican gov. <mark>jim gibbons</mark>, but in a more expensive suit. yet it was clear to one independent observer that there was no clear winner. those on a reno gazette-journal panel with party affiliations sided with the candidate of their party. both candidates showed strong points, said fred lokken, a political science professor at truckee meadows community college.\" brian sandoval seemed to be more effective in framing the extent of the budget challenges facing nevada and did indicate that cuts would be a major part of his budget strategy--indicating he was being honest with voters, \"said lokken, a former republican who is now registered as a nonpartisan voter.\" <mark>reid</mark> came across as more directed and more specific about most every response, \"lokken said.\" he came across as better-informed and better-prepared on the issues. in fact, he was very confident in his understanding of a number of issues and demonstrated a depth of understanding that was not as apparent with sandoval. \"chip evens, chairman of the washoe county democrats, differed with lokken on sandoval's honesty.\" sandoval saying \"let's be honest' is not the same as actually being honest,\" evans said. heidi smith, the former chairman of the washoe county republicans and current gop national delegate, said <mark>reid</mark>'s mannerisms were as annoying as fingernails scratching a chalkboard. \"<mark>reid</mark> appeared very nervous and seemed to lose his train of thought now and then,\" smith said. \"he constantly punctuated every thought by pumping his left hand up and down while moving his body back and forth like a cuckoo clock. his body language drove me nuts. sandoval appeared more relaxed; his voice and delivery were very smooth. sandoval clearly appeared very gubernatorial.\" a hispanic democrat was disappointed with sandoval for his stance he took on arizona immigration law. sandoval is trying to become the first hispanic governor in nevada. sandoval said he supported arizona's immigration law \"because it was a valid response to a public safety issue.\" sandoval said he has spoken with sheriffs across nevada and \"it is their opinion that we don't need an arizona - style law in the state of nevada.\" he said he would consider an arizona-style law for nevada if necessary. \"i do believe that it is very, very important to keep an eye on what is going on in the state of nevada and if it is necessary to adopt similar laws, then that is something that should be considered.\" that was not what democrat theresa navarro wanted to hear. \"the arizona law that brian sandoval agrees with is a disgrace to our constitution,\" said navarro, also the vice-chair of the latino coalition. \"<mark>rory reid</mark> saying that he is supporting comprehensive immigration reform to fix our immigration problem instead of the arizona law was very important and enlightening. at least he was proposing a solution.\" sandoval's immigration response might prove costly, evans said. \"sandoval probably ended any chance of getting the hispanic vote with his support of the arizona law,\" evans said. republicans countered that sandoval had a better grasp of the economy. sandoval stressed that the current down economy is the worst time to raise taxes. \"he (sandoval) recognized the urgency to get the economy back on track and the necessity to remove the present uncertainly created by the present political climate, but was not depending on wildly optimistic income projections that were promised based on unrealistic revenue claims,\" said su kemper of reno. \"it was obvious that <mark>reid</mark> was taking cues from his father <mark>harry</mark>, while sandoval represented a more conservative point of view.\" <mark>reid</mark> scored points talking about his experience in running and balancing the budget of clark county, by far nevada's biggest county, lokken said. you must fill out the comment body in order to submit a comment. incline village woman arrested on 1984 new jersey parental abduction waives extradition southern california: amber alert for two brothers in alleged parental abduction (see photos of boys) former first lady dema guinn endorses <mark>harry reid</mark>, suggests kenny guinn would have, too gammick disputes former daughter-in-law's child support allegations (watch video)"}, {"articleID": "2016080123_00441090_W", "names": {"Eric Fisher": ["Q30075239", "Q5386483"], "Andy Reid": ["Q2622812", "Q27830815", "Q470738", "Q4761219"]}, "date": "2016-07-31", "url": "http://kckingdom.com/2016/07/31/kansas-city-chiefs-eric-fisher-gets-his-deal/", "content": "Kansas City Chiefs: <mark>Eric Fisher</mark> Gets His Deal Comment Kansas City Chiefs offensive tackle <mark>Eric Fisher</mark>--Mandatory Credit: Troy Taormina-USA TODAY Sports The Kansas City Chiefs signed offensive tackle <mark>Eric Fisher</mark> to a four year contract extension worth $48 million, with $40 million guaranteed. The Kansas City Chiefs made an investment in their offensive line by locking up offensive tackle <mark>Eric Fisher</mark> to a four year contract extension worth up to $48 million. The deal includes $40 million in guaranteed money. It comes on top of <mark>Fisher</mark>'s current deal and his 5th year option in 2017. <mark>Fisher</mark> is the second player the team has re-signed from the 2013 NFL Draft. This deal, along with the signing of Mitchell Schwartz earlier this offseason, gives the Kansas City Chiefs their bookend offensive tackles for the next five years. This is an important investment for the team as it sets the basis for how the offensive line will look. In a lot of ways, that sets the tone for the team as a whole. With the announcement of <mark>Fisher</mark>'s new deal, General Manager John Dorsey told reporters: \"In three seasons he's grown significantly as a football player in our system. He's a tough, physical presence and a leader on our offensive line. We look forward to keeping him as a part of our organization and community.\" When <mark>Andy Reid</mark> and John Dorsey first came to Kansas City, they expressed to the fan base that they intended to build the team through the offensive line. Since then they have drafted six linemen over the past four drafts and have signed or traded for numerous veterans. Unfortunately, many of those moves have no panned out...which is what makes <mark>Fisher</mark>'s new contract truly important. \"In three seasons (<mark>Eric Fisher</mark>) has grown significantly as a football player in our system.\" ~ Chiefs GM John Dorsey <mark>Eric Fisher</mark> is the second Chiefs offensive lineman to get a second contract from the team (Jah Reid was given a second deal earlier this offseason). As the team's 2013 1st round pick, number one overall in the draft, it is important that the team felt comfortable in their investment in him. <mark>Fisher</mark> has been a favorite target for fan ire ever since his rookie season. His early struggles in the NFL have been well-documented. However, <mark>Fisher</mark> took a clear step forward in 2015 that was highlighted with the much-loved (in Chiefs Kingdom anyways) shot of him delivering a clean up shot to JJ Watt in the AFC Wild Card game. While that play was just one in a long season, it was indicative of the improvements <mark>Fisher</mark> made. The mean streak that was talked about when he was a draft prospect finally showed up last year. He also showed the ability to stick with opposing pass rushers, and set himself up as a force in the running game. His ability to perform those two aspects of the game are why he's got a new contract. Next: Kansas City Chiefs Training Camp Recap Day Three Want your voice heard? Join the KC Kingdom team! The Chiefs are investing in their future, and that's big news. It shows a level of faith by the front office, not just in one player, but in the direction of the franchise in general. They aren't cutting bait with their talented players, which means they are continuing to build on their current success. That's what the best franchises in the league do. Top Stories"}, {"articleID": "2011103117_00071146_W", "names": {"John Maynard": ["Q51587882", "Q6247334", "Q6247336"], "Simon Johnson": ["Q10401988", "Q1461050"], "Norman Solomon": ["Q1772406", "Q1999688", "Q59156347"]}, "date": "2011-10-31", "url": "http://prairieweather.typepad.com/big_blue_stem/2011/10/money-is-different-in-the-hands-of-republicans.html", "content": "money is different in the hands of republicans republicans - who normally insist that the government can't create jobs, and who have argued that lower, not higher, federal spending is the key to recovery - have rushed to oppose any cuts in military spending. why? because, they say, such cuts would destroy jobs. thus representative buck mckeon, republican of california, once attacked the obama stimulus plan because \"more spending is not what california or this country needs.\" but two weeks ago, writing in the wall street journal, mr. mckeon - now the chairman of the house armed services committee - warned that the defense cuts that are scheduled to take place if the supercommittee fails to agree would eliminate jobs and raise the unemployment rate. oh, the hypocrisy! but what makes this particular form of hypocrisy so enduring?...paul krugman you know as well as i do! building weapons is more productive than building infrastructure? of course not. because politicians are nuts, that's why, and if you don't believe me, take a look at keynes' understanding of the their hypocrisy. but why would anyone prefer spending on destruction to spending on construction, prefer building weapons to building bridges? <mark>john maynard</mark> keynes himself offered a partial answer 75 years ago, when he noted a curious \"preference for wholly\" wasteful' forms of loan expenditure rather than for partly wasteful forms, which, because they are not wholly wasteful, tend to be judged on strict \"business' principles.\" spend money on some useful goal, like the promotion of new energy sources, and people start screaming, \"solyndra! waste!\" spend money on a weapons system we don't need, and those voices are silent, because nobody expects f-22s to be a good business proposition. and now they're pushed even farther into hypocrisy with the possibility that the debt reduction super-committee may fizzle and force us into huge defense cuts. .. to admit that public spending on useful projects can create jobs is to admit that such spending can in fact do good, that sometimes government is the solution, not the problem. fear that voters might reach the same conclusion is, i'd argue, the main reason the right has always seen keynesian economics as a leftist doctrine, when it's actually nothing of the sort. true. if you actually read keynes, you'll know he was no lefty. need a shortcut? insta-keynes? try this. we don't need is further proof that republicans will do anything, spread any rumor, indulge in any sustained form of ignorance, fool with any ballot box, or spread any slur to increase power. see, they'd like us to believe that their government (if they should take control of it) is not useless. after all, george w. bush expanded government massively. their government spending is good spending. like the f-22s, like the preemptive, unjustified and unwinnable wars and further, unneeded, tax cuts for the wealthiest and even for corporations who send jobs overseas. their spending, after all, results in a huge tip going right into their own pockets via the pockets of the top 1%. and bank failures and deep recessions...your comment could not be posted. error type: the letters and numbers you entered did not match the image. please try again. which would you rather have? afghanistan war or social security? nation-killer: america has an inequality problem that's bringing our society down obama's principles, his skepticism, his pragmatism, and his game plan our \"hidden brains\" --political decisions, the republican disconnect, and how politicians connive with voters the danger next time: the pressures to keep financial instruments unregulated \"uh-oh. wall street has got its swagger back!\" interview with economist <mark>simon johnson</mark> t. r. reid: how to win over the right and get \"better, cheaper, and fairer health care\" \"war made easy: how presidents and pundits keep spinning us to death.\" discussion with <mark>norman solomon</mark> \"gotcha capitalism\" : about those capitalist predators we love to hate \"free lunch\" : david cay johnston on hidden government subsidies for the very, very rich how a third candidate affects how we decide who to vote for: \"the decoy effect\" jeff sharlet on how fundamentalists are \"reimagining\" american history \"one step too far:\" serious shifts in the federal balance of power, and some excerpts from justice o'connor's georgetown speech"}, {"articleID": "2014050311_00023129_W", "names": {"Adam Wainwright": ["Q1185516", "Q57305474"]}, "date": "2014-05-03", "url": "http://www.miamiherald.com/2014/05/02/4095255/sloppy-wainwright-and-cardinals.html", "content": "CHICAGO--All it took was an outing Cardinals ace <mark>Adam Wainwright</mark> hasn't had in months to help the Cubs keep him from doing something no one has in 100 years of history at their ivy-draped ballpark. After allowing an early lead to the Cubs that snapped his 25-inning scoreless streak, <mark>Wainwright</mark> mishandled a tie game and allowed a homer later that built a 6-5 win for the Cubs on Friday at Wrigley Field. Through his first 45 innings and six starts this season, <mark>Wainwright</mark> had allowed a total of six runs. The Cubs got that many in one afternoon. The Cardinals' righty could have become the first pitcher ever to go 7-0 in his career at Wrigley, which is celebrating its centennial all summer. <mark>Wainwright</mark> instead gave the ballpark a belated birthday gift?? 1/2 a first. He had one word to describe the blemish on his North Side record. \"I was just very sloppy,\" <mark>Wainwright</mark> said. \"You're not going to be perfect every time. This was just a bad day. I didn't give my team much of a chance.\" No, but they gave him one. Against Cubs lefty Travis Wood (2-3), the Cardinals rallied to tie the score 2-2 in the third inning. Jhonny Peralta's eighth-inning, two-run homer tightened the game late. The Cardinals failed to advance the tying run from first base in the eighth and never threatened against closer Hector Rondon in the ninth. The bigger misfire, however, was <mark>Wainwright</mark>'s after Peralta's two-out double knotted the score in the top of the third inning. In the bottom of the inning, <mark>Wainwright</mark> did what he rarely does?? 1/2 he walked two batters to fuel a three-run rally that regained the lead for the Cubs for good. Welington Castillo's second of three doubles in the game drove home two of the runs. The Cubs have scored 10 of the 12 runs <mark>Wainwright</mark> (5-2) has allowed this season. \"To go out and give up three runs is very unlike me,\" <mark>Wainwright</mark> said. \"To hand the game back over is something I normally don't do a whole lot of ....Those (walks) are the difference in the game?? 1/2 those two runners. They both end up scoring. We lost by one. As you know, walks are something that I try never to do. If you continue to load the bases bad things are going to happen.\" <mark>Wainwright</mark> arrived at Wrigley two starts removed from a shutout and one removed from a hyperextended knee that kept him from a shutout. He had not allowed a run in his previous three starts and had just become the fourth Cardinals pitcher in history to win five games in the first month of the season. What he was doing, he'd done before, but he'd never done it better. \"He's got so many weapons right now,\" Matheny explained. \"Not just a fastball and curveball, but he's got the cutter and the sinker now, too. The ability to throw them at different speeds with different breaks and at different locations. He fits the essence of pitching in my mind.\" <mark>Wainwright</mark> started the game one inning shy of tying his career for consecutive scoreless innings. He wouldn't get there. Five of the first seven Cubs reached base, and before <mark>Wainwright</mark> got an out in the game Anthony Rizzo had a two-run single for the first of his three RBIs. The feel for multiple pitches and ability to throw them, as Matheny described, to multiple locations and varying speeds just wasn't there. His trusty curve rebelled at times, and <mark>Wainwright</mark> described how he \"just didn't have command over\" several pitches. \"Pitches that were just on the edge or close, from our perspective at least, were not where he wanted or not getting called, one of the two,\" Matheny said. After the Cardinals rallied to tie the score at 2-2, <mark>Wainwright</mark> issued a one-out walk to Rizzo. Starlin Castro followed with a single up the middle. Nate Schierholtz benefited from <mark>Wainwright</mark>'s lack of command and loaded the bases with a walk. <mark>Wainwright</mark> had pitched out of trouble?? 1/2 two runners in scoring position, no outs?? 1/2 in the second, but he couldn't pull off the same trick twice. Rizzo scored on a groundout for the go-ahead run, and Castillo's double pushed the lead to three runs. The Cubs finished with 10 hits in five innings against <mark>Wainwright</mark>, and five of them went for extra bases, including Rizzo's leadoff homer in the fifth. \"When I missed I was over the middle of the plate or falling behind in counts,\" <mark>Wainwright</mark> said. \"That's a team over there that thrives off of middle balls and being in hitter's counts. I gave them both things they wanted.\" The Cubs also benefited from a call and a play in the field. In the second inning, Randal Grichuk raced deep into the right-center gap to get his glove on a potential double. The ball came out of his glove but he clutched it with his arms?? 1/2 until crashing into Wrigley's brick wall and dropping the catch. In the first inning. Luis Valbuena skipped a ball down the first-base line that kicked up chalk ahead of the base before slicing into right field's foul territory. First-base ump Larry Vanover called the ball fair over the bag. Matheny argued, knowing it's one of the few plays he cannot challenge through baseball's expanded replay. Fair or foul calls in front of the umpire will not be reviewed. \"They feel that they don't have the technology to accurately determine if that ball crosses over the bag,\" Matheny said. \"Hard to tell. I'm just thinking pure physics. The video that we did have didn't seem as obvious as what we saw in real time ....I had a feeling that was going to hurt. That's a big swing.\" The Cardinals overcame the two runs it created. They couldn't the do the same for the walks and homer. After Peralta's seventh homer of the season landed in the basket above the wall in center field, Matt Holliday reached first as the tying run with no outs. He did not advance an inch. <mark>Wainwright</mark> started the day one of four pitchers in history with a 6-0 record in his career at Wrigley. None of the three got to 7-0, and because Friday was what his season hasn't been?? 1/2 sloppy, less than perfect?? 1/2 neither did <mark>Wainwright</mark>. The Confines are usually friendlier. \"It's one of my favorite places to pitch, one of my favorite places to go - a lot of atmosphere. I love being here,\" <mark>Wainwright</mark> said. \"I love pitching here. I just don't like pitching games like I just did here.\" "}, {"articleID": "2019052301_00063908_W", "names": {"Sue Bird": ["Q240672", "Q56682147"], "Christian Petersen": ["Q1081372", "Q3675690", "Q5110030"]}, "date": "2019-05-23", "url": "http://greenwichtime.com/uconn/article/UConn-women-s-notebook-Multiple-UConn-stars-13877208.php", "content": "https: //www.ctpost.com/uconn/article/UConn-women-s-notebook-Multiple-UConn-stars-13877208.php Auriemma: \"Not a great summer' for UConn icons in WNBA By Doug Bonjour Updated 9:12 pm EDT, Wednesday, May 22, 2019 Former UConn teammates <mark>Sue Bird</mark> (6) and Diana Taurasi (12) take a break in the action against Canada during the 2012 Olympics. Former UConn teammates <mark>Sue Bird</mark> (6) and Diana Taurasi (12) take a break in the action against Canada during the 2012 Olympics. Photo: <mark>Christian Petersen</mark> / Getty Images Photo: <mark>Christian Petersen</mark> / Getty Images Image 1 of / 4 Caption Close Image 1 of 4 Former UConn teammates <mark>Sue Bird</mark> (6) and Diana Taurasi (12) take a break in the action against Canada during the 2012 Olympics. Former UConn teammates <mark>Sue Bird</mark> (6) and Diana Taurasi (12) take a break in the action against Canada during the 2012 Olympics. Photo: <mark>Christian Petersen</mark> / Getty Images Auriemma:\" Not a great summer' for UConn icons in WNBA 1 / 4 Back to Gallery BRANFORD--The WNBA season will tip off Friday, albeit without some of its most recognizable stars out of UConn. Breanna Stewart tore her Achilles' tendon, Diana Taurasi had back surgery, and Maya Moore stepped away to spend more time with her family and focus on her faith. And then came news Tuesday that <mark>Sue Bird</mark>, Stewart's teammate on the defending champion Seattle Storm, needs arthroscopic surgery on her knee and will be out indefinitely. \"It's not a great summer, huh, for the UConn icons,\" Geno Auriemma remarked, as the UConn Coaches Roadshow stopped at Stony Creek Brewery on Wednesday. <mark>Bird</mark>, Moore, Stewart and Taurasi are all program icons. And the reality is, they're all expected to miss most, if not all, of the upcoming season. \"It's a really weird coincidence that it all kind of converged at the same time,\" Auriemma said. Sports Videos Seattle didn't specify a timetable for <mark>Bird</mark>'s return, but Auriemma is obviously hoping her absence is short-term. <mark>Bird</mark>, an 11-time All-Star, was one of 17 former Huskies in the WNBA at the start of last season. \"<mark>Sue</mark>'s going to do what she's always done her entire career,\" Auriemma said. \"She's going to make sure she's 100 percent ready to go when she is ready to go. She's not one of these people that does things half way.\" Rivalry continues If Auriemma had it his way--and his way only--he'd schedule more games against marquee opponents after the New Year. UConn had three such contests last year, losing to eventual national champion Baylor and Louisville on the road in January, and beating South Carolina in Hartford in February. The school recently renewed their series with the Gamecocks through 2021-22. The two teams will play this season in Columbia, completing a four-year agreement. \"South Carolina's one of the schools that isn't worried about playing in January and February,\" Auriemma said. \"There's a lot of schools, they all want to play in November and December. Well, you can only play so many games in November and December ....Our kids look forward to those January and February Monday night big games on national TV. They're really cool. The more we can do of those, the better.\" Looking ahead During a question-and-answer session with fans, Auriemma was asked whether he's given thought to how much longer he'd like to continue coaching. His response? \"I don't think there's anybody in life that after you've done something, in my case, 44 years I've been coaching...that doesn't wake up some mornings and say,\" Do I really want to keep doing this?' I think that's just human nature, \"Auriemma, 65, said.\" If you say, \"No, every day's a new day for me,' you're not being honest I bet. We all go through that.\" The difference is, you ask yourself, \"Why would I feel like that?' he continued.\" Is it because it's gotten really hard or it's gotten too easy? Is it because I don't want to deal with the bureaucratic part of it or I'm tired of the travel? If it's, \"I don't like my job because I don't like my practice, I don't like being around the players, I don't like trying to put my team together, I don't enjoy that anymore,' that's not happened.\" dbonjour @ ctpost.com; @ DougBonjour Most Popular 1 The mobs are ruining storm chasing 2 Cabot the great white shark bids farewell to Greenwich 3 Police: Video shows woman abandoning child found asleep in stroller, covered in trash 4 \"Carl's life was nothing but pain': Boy who was badly beaten as a baby dies at 14 5 Greenwich lawyer faces prison time in college admissions scandal 6 Son of Roger Clemens charged with drunken driving 7 Great white shark tracked off Greenwich coast View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2017081605_00731605_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-08-14", "url": "http://news.yahoo.com/news/body-language-experts-analyse-whether-212500618.html", "content": "<mark>Donald Trump</mark>'s comments condemning white supremacists may have been belated--and heavily scripted--but body language experts say they were largely sincere. On Monday, under mounting media pressure, Mr <mark>Trump</mark> took to the podium to call out white supremacists, neo-Nazis, and the KKK. Three days earlier, a hundred of them had descended on Charlottesville, Virginia, in protests that lead to three deaths and dozens of injuries. Mr <mark>Trump</mark> had initially attributed the casualties to \"violence on many sides\" . On Monday, however, he called out the hate groups specifically. \"Racism is evil,\" Mr <mark>Trump</mark> said, in hastily arranged remarks at the White House. \"And those who cause violence in its name are criminals and thugs, including the KKK, neo-Nazis, white supremacists, and other hate groups that are repugnant to everything we hold dear as Americans.\" Body language experts Susan Constantine and Lillian Glass both told The Independent that the remarks appeared scripted, and devoid of the President's usual ad-libbing--an indication of the seriousness of the topic. But both women agreed that Mr <mark>Trump</mark> couldn't help letting slip some telling body-language cues. \"He's got to either concentrate on his words and reading off the script, or on showing the right affect,\" Ms Constantine said. \"I've found that what he does is he reads the script, but at the moment he feels he wants to add emphasis, he uses hand gestures.\" \"Racism is evil': <mark>Trump</mark> condemns white supremacist groups after deadly protest in Charlottesville pic.twitter.com/4g3PL4SsdP--Business Insider (@ businessinsider) August 14, 2017 Ms Constantine pointed to his signature bouncing, up-and-down hand gesture, which she says connotes his anger. The gesture, she said, is similar to someone shaking their finger. It means:\" I am telling you with a level of certainty, I will absolutely not put up with it. \"Ms Glass also saw signs of authentic anger from the President, especially when he talked about one of the weekend's victims. When discussing the death of 32-year-old Heather Heyer, she said, the President\" breathes in through his nose, which shows he is angry \". She compared the breathing to that of a bull before it enters the ring. His upturned palm, she added, shows he was speaking honestly on the subject. But Ms Glass also noticed something odd about his remarks--a new gesture she had never witnessed the President making. The movement--a sort of pinching of the thumb and forefinger--is a gesture she says was pioneered by John F Kennedy, and parroted by every president after him.\" I guess he's trying to be contained, because he's got this new gesture, \"she said.\" ...In essence, he's starting to get more in-script and more in the politics of the matter. \"Despite this, Ms Glass is convinced that Mr <mark>Trump</mark> meant the bulk of what he said from behind the podium--whether or not he wrote the words himself.\" He's very controlled because he knows this is such a divisive issue, \"she said,\" ...But he does leak out his anger and passion when he breathes through his nose, and his honesty comes out through his hand being open. \"Ms Constantine concurred.\" When he's talking about how he wants everyone to love each other...he's using his hand gestures, \"she said.\" And as a body language expert, that \"s what you look for: Do the words match the gesture? If he didn't feel that, his hands would be on the podium.\" "}, {"articleID": "2019111123_00090160_W", "names": {"Tom Davis": ["Q14371530", "Q19957326", "Q22814855", "Q2366977", "Q7815530", "Q7815532", "Q7815534", "Q7815535", "Q7815536"]}, "date": "2019-11-11", "url": "https://www.wtxl.com/news/local-news/gadsden-county-man-was-apart-of-first-class-of-all-black-marines-in-u-s", "content": "Gadsden County man was apart of first class of all black Marines in U.S. Posted: 6:38 PM, Nov 11, 2019 Updated: 2019-11-11 18:38:50 -05 GADSDEN COUNTY, Fla.--A Gadsden County man was in the first class of all black Marines in the United States. Chester <mark>Davis</mark> Sr. was in the Montford Point Marines. His unit, formed in 1942, was segregated from the white Marine units, and even had a separate base, in Montford Point, North Carolina. <mark>Davis</mark>' sons say his unit fought the Japanese alongside the U.S. Marines in the South Pacific, all the way to the surrender to the Japanese in 1945. While he has passed on, Veterans Day is a special day for their family. \"This is a challenge, this is something I wanted to do, that was to help defend my nation, and so he fought with vigor, courage, valor, and patriotism, and for that, I am extremely proud of my dad,\" said <mark>Tom Davis</mark>, <mark>Davis</mark> Sr.'s second oldest son. <mark>Davis</mark>' sons said their father's unit didn't get the recognition it deserved until recently. 70 plus years later, in 2011, Congress unanimously voted in favor, and President Obama signed into law, a proclamation recognizing the Montford Point Marines. They also now proudly display his Congressional Gold Medal. Copyright 2019 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}, {"articleID": "2008111501_00016730_W", "names": {"Michael Steele": ["Q331838", "Q443813", "Q51709680"], "Matt Lewis": ["Q26689670", "Q55014098", "Q6788967"]}, "date": "2008-11-15", "url": "http://hotair.com/archives/2008/11/14/michael-steele-mccain-should-have-hit-obama-on-wright/", "content": "<mark>michael steele</mark>: mccain should have hit obama on wright posted at 8:30 pm on november 14, 2008 by allahpundit <mark>matt lewis</mark>, per <mark>steele</mark>'s conference call this afternoon with bloggers. and that's not the money part: <mark>steele</mark> also warned that we shouldn't \"soft-pedal\" our attacks on barack obama, \"just because the president of the united states happens to be a black man.\" this, of course, presents the argument that <mark>steele</mark> - an african-american - could be a more effective critic of obama than could his white republican colleagues. he added that \"the obama campaign played the race card beautifully.\" david harsanyi says he was more explicit than that: the most interesting aspect of the call focused on the perceived ability of <mark>steele</mark> to take on barack obama more ferociously and avoid the tedious race-card ploy used by some democrats. when asked if he would be able to criticize obama more freely, <mark>steele</mark> said \"i think because i'm an american i will be to do it\" and that \"bad policies don't have color, they're just bad policies.\" good answers. having him up top could reduce the absolute moral authority deficit superficially, but will it really \"avoid the tedious race-card ploy\" ? remember, this is a guy whom the nutroots have been known to photoshop as sambo for the crime of being black while conservative. if anything, i suspect, electing him will feed racial politics by leading the left to frame the one as \"authentically black\" vis-a-vis the republican \"house slave\" or whatever progressive witticism they've coined for him this month. which isn't a reason to vote against <mark>steele</mark>, needless to say: on the contrary, maybe that's the point - to bait them and let them show off how \"enlightened\" they really are. they won't be able to resist. don't get your hopes up: but one influential republican believes that rnc members are going to insist that the next chair come from the rnc. \"as to the new chair, don't pay any attention to people who aren't on the rnc,\" he told me. \"this is not a good thing, but the current rnc believes only one of their own should be chair. maybe a dozen have a clue politically - and that's being very kind. none (as chairman) could be an ideas leader or command the substantive respect of republican senators or representatives.\" if that's true, if <mark>steele</mark>'s doomed to lose to some rnc crony, it's doubly unfortunate insofar as not only will the base be disappointed, but it'll hand the democrats an easy talking point about the prospects for black politicians within the gop as compared to their own party. not just for that reason but partly for that reason, i hope he pulls it out. note from hot air management: this section is for comments from hot air's community of registered readers. please don't assume that hot air management agrees with or otherwise endorses any particular comment just because we let it stand. a reminder: anyone who fails to comply with our stay safe, mike. you thought chuck schumer was interested in your credit rating before...pasalubong on november 14, 2008 at rnc has a real death wish, doesn't it? jindal/steele 2012! (i know i have a different name every day, but that shows the depth of our bench) mccain should have hit obama on any number of issues, but he would rather lose the election honorable than stoop to such actions. so it turns out the american people are the losers for the next four years. how would one wake up the rnc? would it take losing the house, senate when asked if he would be able to criticize obama more freely, <mark>steele</mark> said \"i think because i'm an american i will be to do it\" and that \"bad policies don't have color, they're just bad policies.\" good answers. nicely stated. and he's right about wright. i'm pessimistic on the outcome of the selection, of course. i'm all for <mark>michael steele</mark>. he is outspoken and speaks my kind of language. he is a shining star for the party. they cast powell and rice as uncle toms, who gives a flying ruck what they think. principles first. ummmmmmm, maybe the rnc didn't read hot air for 6 months, or got the hint, or recieved hot/airs"}, {"articleID": "2014111012_00026726_W", "names": {"Steve Scott": ["Q1394213", "Q16239327", "Q3499100", "Q55996252", "Q56485491", "Q7613875", "Q7613876", "Q7613877"], "Robert Plant": ["Q28036733", "Q428223", "Q58449717"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "Christopher Nolan": ["Q224912", "Q25191"]}, "date": "2014-11-10", "url": "http://www.standard.co.uk/business/business-news/quindell-digs-deeper-hole-on-confusing-directors-dealings-9851100.html", "content": "CCTV shows gang of youths bombard police car with fireworks in spectacular Bow attack Gallery: Dramatic CCTV shows the moment a mob of youths launched a volley of fireworks at a passing police car. The video which emerged online today shows a gang of around 15 youths brandishing rockets in the street before lighting them and levelling them at the police vehicle on patrol. A & E waiting times at west London hospitals hit a record after closures Patients in west London have the longest wait for A & E treatment in the country following the closure of two casualty units. First look at the new glass walkway installed 42 metres above Tower Bridge Quindell digs deeper hole on \"confusing' directors' dealings Embattled insurance outsourcer Quindell's attempt to explain opaque share-dealing by three directors backfired today as the shares plunged by as much as 25%. Chief executive Rob Terry, finance director Laurence Moorse and non-executive <mark>Steve Scott</mark> have taken loans secured on their own shares to fund the purchase of £ 2.2 million more in Quindell shares, which they believe are\" materially below \"their true worth. But today's detailed clarification to a complex deal first unveiled last week sent the stock into another tailspin amid City worries over\" jiggery-pokery \", as it emerged loan company Equities First Holdings was only prepared to lend on the shares at a price well below their closing value on Friday. Terry transferred 8.85 million shares over to EFH and received £ 7.47 million in return - an average price of just 84.5 p. EFH is under no obligation to hang onto the shares although it will not vote them, and it has pledged not to use them for short-selling purposes. Market Report: Quindell leaps on black-box deal with Canadian insurer Market report: Quindell mystified by driving force behind price plunge But the big haircut taken by EFH on the shares - far below Friday's closing price of 118.5 p - spooked the City, sending Quindell as low as 88.75 p at one stage, before recovering. Mike van Dulken at Accendo Markets said the update\" served only to generate more investor discontent with such jiggery-pokery \".\" Quindell is not doing anything to make life easier for itself, releasing what can only be surmised as a highly confusing update, \"he added. If the price falls more than 20% below the value at which they were transferred to EFH - around 68p - the directors will have to put up more stock or cash as collateral. Quindell successfully sued research firm Gotham City, which called the firm\" a country club built on sand \", but shares have fallen 8% since April. <mark>Robert Plant</mark> turns down £ 500million offer from Richard Branson to reform Led Zeppelin The\" wow project': first look at the new glass floor installed at Tower Bridge UCL students paying as much as £ 225 a week hit out at \"appalling' condition of their halls Hackney pair guilty of string of sexual offences against vulnerable teenage girls after grooming them online The moment gang shoots volley of fireworks at passing police car in east London Million Mask March protesters attack woman in London\" for having wrong accent' <mark>George Osborne</mark> accused over claim Britain has \"halved' £ 1.7 bn EU bill Met Commissioner Bernard Hogan-Howe in warning over internet safe-haven for terrorists and paedophiles Riot police on alert for bonfire night\" Million Mask March' by activists Anonymous Boy, 18, stabbed to death in one of four murders in London in just over 24 hours Russell Brand's revolution rants mocked online by #Parklife campaign Help catch thugs wearing pink tutus who beat my son to a pulp for being gay Sign-up for our weekly Reader Offers email CCTV shows gang of youths bombard police car with fireworks Nicki Minaj brings the wow factor to the 2014 MTV EMAs Why it's time the UK had its own NFL franchise First look at the new glass floor installed in Tower Bridge Blast off with Matthew McConaughey and <mark>Christopher Nolan</mark> Grace Dent on living with a Labrador in London"}]