[{"articleID": "2018101314_00258290_W", "names": {"Dino Rossi": ["Q3707956", "Q5278544"]}, "date": "2018-10-13", "url": "https://www.seattletimes.com/seattle-news/politics/i-1634-campaign-with-millions-from-soda-industry-aims-to-block-local-sweet-beverage-taxes/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all", "content": "The most lopsided campaign on Washington's November ballot is a microcosm of the battle the soda industry is waging across the country. Initiative 1634--taxation of food and beverages This initiative would prohibit new local taxes on food or beverages. It would not overturn Seattle's sugary-drink tax, but would block any rate increase. Supporters: Coca-Cola Company, PepsiCo, Keurig Dr Pepper, Red Bull North America Opponents: Foundation for Healthy Generations, the American Cancer Society, El Centro De La Raza Initiative 1634, backed to the tune of $13 million by a soda-pop industry that sees a threat to its profits in a growing wave of regulation, would ban local taxes on any food or beverage or ingredient intended for human consumption. The campaign echoes a similarly well-funded effort that took out a smaller statewide soda tax eight years ago. The I-1634 campaign is blanketing the airwaves with advertisements that raise the specter of looming local grocery taxes, while making little or no mention of the sweetened beverages produced by the companies funding the campaign. The public-health advocates opposing I-1634--on a shoestring budget--say the rhetoric about grocery taxes is an attempt to disguise the real purpose of the initiative and its funders. Seattle's sweetened-beverage tax, which raised $10.5 million in its first six months, is designed to discourage consumption and fund health and education programs. It has rankled Seattle retailers who say it is costing them business as consumers go outside the city limits to buy their beverages. Most Read Local Stories Federal jury awarded $5 million to man fired from Mercedes-Benz of Seattle after cancer surgery Tales from the road: How I survived decades of Skagit-to-Seattle commuting \"The Property': A family's getaway cabin defined its dreams, until a tragic Sunday morning VIEW Kim Schrier ad ties opponent to fugitive developer;\" sleazy garbage,' answers <mark>Dino Rossi</mark> campaign Truck driver arrested in crash at Tiger Mountain summit that killed 2 Unlimited Digital Access. $1 for 4 weeks. While I-1634 would not repeal the Seattle tax, which took effect Jan. 1, it would ensure that no other Washington cities can follow suit, and would stop any increases in Seattle beyond the current rate of 1.75 cents per ounce. When Seattle's sugary-drink tax is mentioned in I-1634 campaign ads, it's often abbreviated and paired with images that overstate the scope of the tax. In one spot, a mom in the grocery store looks at a container of milk while a narrator talks about Seattle's \"huge new beverage tax.\" In fact, milk-based beverages are explicitly exempted. Proponents originally sought a ballot title that included the word \"groceries,\" but a judge changed it to \"certain items intended for human consumption.\" The focus on local taxes, say opponents of I-1634, hews closely to a strategy employed by the tobacco and gun industries to limit the powers of local government, over which they have less political influence, to regulate them. \"This is an existential battle for the soda-pop industry,\" said state Sen. Reuven Carlyle, D-Seattle, who opposes the initiative. \"They know that they are now in the same light as tobacco, fossil fuels and other products that have negative externalities and affect public health.\" Earlier this year, lawmakers in Michigan and Arizona enacted bans on local food and beverage taxes. In California, where a handful of cities have enacted sweetened-beverage taxes, the soda industry threatened to bring a statewide initiative to the ballot that would have required a two-thirds majority to raise local taxes of any kind unless the Legislature put a moratorium on local food and beverage taxes, which it did. Oregon voters will decide in November on an initiative backed by a soda industry trade group and grocery chains with similar goals. The campaign backing I-1634 says it will close a \"loophole\" in Washington law that allows local jurisdictions to tax groceries--though not through sales taxes. Sales taxes on groceries were eliminated by a 1977 initiative, but local jurisdictions can still tax food items through other means. Seattle's sweetened-beverage tax, for instance, is structured as an excise tax on businesses distributing the drinks. The campaign's ads suggest that other Washington cities are considering sugary-drink taxes and that taxes on beef, dairy or other groceries could be next. There are few if any examples, however. \"We aren't aware of anybody else who has a tax that would be impacted by this initiative or who had been contemplating one,\" said Sheila Gall, general counsel of the Association of Washington Cities, which does not take a position on political campaigns. But the grocery industry is an easy target for new taxes, said Paul Kapioski, owner of the West Seattle Thriftway and chairman of the Washington Food Industry Association, which gave $20,000 to the I-1634 campaign, the only contributor besides the soda industry. Grocery taxes would exacerbate an already regressive tax code in Washington, hitting low-income people hardest, he said, and soda taxes could be just the beginning as policymakers try to change consumer behavior. \"It only takes one city or one group of people to say here's another area that we can target,\" he said. Kapioski argues that taxes like this, if they happen at all, should be implemented on a state level, both for efficiency in administering the tax collection and so that grocers in one jurisdiction don't lose business to competitors in nearby non-taxed jurisdictions. That's already happening with soda-pop sales for Seattle businesses, particularly those near the edge of the city. \"We've definitely seen a drop in sales in that category,\" said Kapioski, whose store is about a mile and a half from White Center, which has no tax. \"There is some crossover there where people will drive outside of the city limits and buy it substantially cheaper.\" If I-1634 passes, Seattle businesses would continue to have a price disadvantage compared to competitors in adjacent cities. That was news to some of the 1,300 people and businesses listed as endorsers on the yes campaign's website, including Aychu Aweke, at a 7-Eleven at the city limits in northeast Seattle. \"Across from [my] store, McDonald's, no tax. Taco Bell, no tax. Mine, soda tax. I have to increase my price and people don't come to my store,\" Aweke said. \"That hurts my business.\" Aweke said he thought I-1634 would repeal the Seattle tax. When told it wouldn't, he said, \"You called the wrong person.\" He wasn't clear on how his name had been added to the list of I-1634 endorsers--which includes small businesses and restaurants, farm groups and the Teamsters Union, which has many members in the soda industry--but other people on the list said representatives from their soda distributor asked them to sign-on, and that they knew the initiative would leave Seattle's tax in place. Henry Kim at Rotary Grocery in Pike Place Market said he didn't want to see other businesses hurt by the soda tax. \"No other victims for Washington state,\" he said. While some individual businesses report lost sales due to Seattle's tax, it's unclear yet whether the tax is discouraging sweetened beverage consumption or just shifting purchases to other cities. The soda companies funding the I-1634 campaign--The Coca-Cola Company, PepsiCo, Keurig Dr. Pepper and Red Bull North America--either did not respond to questions about how the Seattle tax has impacted overall Washington sales, or declined to comment. The companies have for years been concerned about taxes on their products or ingredients, calling that out among their \"risk factors\" in securities filings. Coca-Cola's latest annual report states, \"Obesity and other health-related concerns may reduce demand for some of our products.\" It goes on to note that taxes on sweetened beverages aiming \"to reduce consumption or to raise revenue...could adversely affect our profitability.\" Voters will have more than anecdotal data about the impact of Seattle's soda taxes before they vote Nov. 6. Researchers at the University of Washington and Public Health Seattle & King County are studying several impacts of Seattle's soda tax, including the extent to which the cost is passed on to consumers. Results on that question for the first half of the year are due Oct. 22, said Jesse Jones-Smith, a UW obesity epidemiologist, co-leader of the research team tasked by the city to evaluate the tax. Additional research will focus on whether the tax has changed attitudes about and reduced consumption of sugary beverages, whether small food stores in Seattle have lost sales and whether people change buying patterns at supermarkets based on the tax, Jones-Smith said. Their research will join a small but growing body of analyses that have followed a wave of new soda taxes around the country and abroad. These new taxes differ from state-level soda taxes that have been around for decades in that they are mostly imposed by cities and are explicitly designed to raise the price for consumers in order to reduce consumption. In one study, researchers found that sweetened-beverage sales had fallen 9.6 percent a year after Berkeley implemented the first large soda tax in the U.S.--1 cent per ounce--in November 2014. The study found overall beverage sales did not decrease, leading researchers to conclude that sweetened beverage taxes \"may be effective in shifting consumers to purchase healthier beverages without causing undue economic hardship and while raising revenue for social objectives.\" In Philadelphia, which began taxing sweetened beverages at a rate of 1.5 cents per ounce in 2017, residents reported lower consumption compared to nearby cities, according to phone surveys conducted for Drexel University researchers. \"Taxation is probably our most powerful policy lever that we could pull in terms of really trying to shift use patterns with these risky products,\" said Vic Coleman of the Washington Healthy Kids Coalition, which opposes I-1634. The opposition campaign has raised $7,650, mainly from the Foundation for Healthy Generations, a Seattle nonprofit, and the American Cancer Society. Coleman hopes people will weigh the potential public health benefits before voting to restrict cities' taxing authority. The link between sweetened beverages and obesity, diabetes and other major health concerns was only just coming into focus the last time a beverage tax came before Washington voters. In 2010, the Legislature passed a carbonated-beverage tax amounting to 2 cents per 12-ounce container--a fraction of the Seattle rate--part of a three-year package of temporary tax increases that were also levied on candy and bottled water to help fill a state budget deficit. That year, the soda industry poured a then-record $16 million into a successful initiative campaign to repeal the tax."}, {"articleID": "2020021216_00335981_W", "names": {"John Marriott": ["Q18342977", "Q6246820"], "William Francis": ["Q42319715", "Q8009298"]}, "date": "2020-02-12", "url": "https://www.libdemvoice.org/tag/welsh-culture", "content": "<mark>John Marriott</mark> 12th Feb - 4:11 pm I have to hand it to all those \"recent' Lib Dem members for their enthusiasm. It's always fascinating when people keep trying to reinvent the...<mark>William Francis</mark> 12th Feb - 3:33 pm @ Toby Keynes @ William:\" I would add that you aren't actually proposing that consumers own 50% of the utility: if you can't sell your shares, you...Michael 1 12th Feb - 3:29 pm In general electoral pacts with one party standing down for another in particular seats do not work in British FPTP politics if that's what is...<mark>William Francis</mark> 12th Feb - 3:10 pm @ Innocent Bystander \"But this is for customers not employees and in this scenario the customers who have invested nothing (in a 51% case) get to...<mark>William Francis</mark> 12th Feb - 3:09 pm @ Innocent Bystander\" If the company expands and has more customers, does the govt have to buy more of the traded shares to supply the ..."}, {"articleID": "2014021805_00002387_W", "names": {"Alexis Martin": ["Q17395837", "Q27819359", "Q2834584", "Q55069621"], "Ian Martin": ["Q15069750", "Q18640488", "Q41805425", "Q532124"]}, "date": "2014-02-17", "url": "http://kvoa.com/news/genius-3-year-old-arizona-girl-youngest-member-of-mensa/", "content": "The Pac-12 acknowledged Sunday night that \"the officials missed the call\" and should have handed...4,5 & 6-Year Olds Dazzle Crowd At Fiesta De Los Vaqueros Tucson Rodeo: Paul Cicala Reports 4,5 & 6-Year Olds Dazzle Crowd At Fiesta De Los Vaqueros Tucson Rodeo: Paul Cicala...Some of the best golf players are checking in at the Dove Mountain Ritz Carlton...Google Plus 7 minutes 33 seconds ago Genius 3-year-old Arizona girl youngest member of Mensa QUEEN CREEK, AZ - Three-year-old <mark>Alexis Martin</mark> is currently the youngest person in Arizona's chapter of Mensa. Mensa is the international club with one criterion - an IQ in the top two percent of the world. The average person has an IQ of 100. <mark>Alexis</mark>' is above 160. The doctors who tested <mark>Alexis</mark> said she tested so high, they couldn't even calculate her IQ score. <mark>Alexis</mark> started reading when she was two-years-old. Her father, <mark>Ian Martin</mark>, said she showed signs of her capabilities when she was just a year old, ABC15 reported. \"From 12-18 months old, we'd be driving around in the car and she would recite her bedtime story from the night before,\" he said. \"She didn't just recite them, she recited them exactly.\" It's not just her 5th grade reading level that's shocking, <mark>Alexis</mark> also taught herself Spanish via her parents' iPad. <mark>Alexis</mark>' parents know their daughter's gift is amazing but they are also discovering new challenges. \"Does she go into kindergarten early? We are kind of hesitant because we do want her to get that social aspect,\" said <mark>Ian Martin</mark>. <mark>Alexis</mark> will never be able to go to a normal school, according to the doctor who helped test her. One of the reasons, often times, kids this brilliant have high anxiety and it's easier for them to be around similar children."}, {"articleID": "2019051322_00090325_W", "names": {"James Jordan": ["Q10305089", "Q6136966", "Q6136968", "Q6136972"], "Brian King": ["Q16730866", "Q23017073", "Q57952101"]}, "date": "2019-05-13", "url": "http://www.fox13memphis.com/news/tennessee/judge-orders-psych-evaluation-for-appalachian-trail-suspect-1/948954442?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Judge orders psych evaluation for Appalachian Trail suspect Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Judge orders psych evaluation for Appalachian Trail suspect By: DENISE LAVOIE, Associated Press Updated: May 13, 2019 - 5:02 PM Judge orders psych evaluation for Appalachian Trail suspect For the past couple of weeks, hikers along the Appalachian Trial had been warning each other about a hiker who was threatening other hikers with a large knife. The man, who used the trail nickname of \"Sovereign,\" was arrested in Tennessee last month after some hikers reported him to authorities. But he was released after pleading guilty to possession of marijuana and other minor charges. Over the weekend, matters turned deadly in southwestern Virginia, where he is accused of stabbing one hiker to death and seriously injuring another. <mark>James Jordan</mark>, 30, of West Yarmouth, Massachusetts, is charged with murder and assault with intent to commit murder. During his initial appearance Monday in U.S. District Court in Abingdon, Virginia, a judge ordered him to be held in custody and to undergo a psychiatric evaluation. <mark>Jordan</mark>'s public defender declined to comment following the hearing. <mark>Jordan</mark> had repeatedly threatened four hikers late Friday and early Saturday before attacking them, according to federal authorities. An FBI agent said in an affidavit filed in court that when <mark>Jordan</mark> initially approached the hikers he was acting in a \"disturbed and unstable\" manner while playing a guitar and singing. Later that night, <mark>Jordan</mark> began randomly approaching the hikers' tents, making noises and threatening them. \"<mark>Jordan</mark> spoke to the hikers through their tents, and threatened to pour gasoline on their tents and burn them to death,\" FBI Special Agent Micah Childers wrote in the affidavit. Fearing <mark>Jordan</mark>, all four hikers decided to pack up and leave their campsite. Two of them were chased by <mark>Jordan</mark> as they tried to leave, but managed to escape by turning off the lights they had strapped to their heads and veering off the trail into the woods, said Sheriff Thomas Roseberry of Bland County, Virginia, whose deputies interviewed the couple after they walked off the trail to report the incident. \"They described this guy as talking crazy and following them down the trail,\" he said. The other two hikers also ran to get away from <mark>Jordan</mark>, but he caught the man first and stabbed him until he collapsed onto the ground, Childers wrote. <mark>Jordan</mark> then stabbed the woman repeatedly. She fell to the ground and played dead, and <mark>Jordan</mark> then left to find his dog, Childers wrote. The woman got help from two hikers who helped her hike another 6 miles (9.7 kilometers) into Smyth County, Virginia, where they called 911. The victim remained hospitalized Monday. Her condition could not immediately be determined. Authorities did not release the names of the victims. The attacks took place where a 1-mile (1.6-kilometer) length of the trail passes through Wythe County. <mark>Jordan</mark> was arrested and taken into custody by officers with the Wythe County Sheriff's Office. The male victim was found dead, with a knife near to his body, Micah wrote in the affidavit. At this time of the year the section of the trail in southwestern Virginia is usually packed with hikers making their way along the entire 2,100-mile length of the trail, from Georgia to Maine, said <mark>Brian King</mark>, a spokesman for the Appalachian Trail Conservancy. \"We give a lot of safety advice, which people tend to follow, but with someone with an intent to do evil, how do you guard against that?\" <mark>King</mark> said. Sheriff Mike Hensley of Unicoi County, Tennessee, said he did everything he could to keep <mark>Jordan</mark> locked up after he threatened hikers there and in other communities along the trail last month. Hensley said hikers called his office in late April and said a man was threatening them and said: \"It's going to be a bad day for hikers on the trail.\" He said he sent officers to the location described by the hikers, but the man was no longer there. The next day, some other hikers complained about a man threatening them. Hensley said his officers found <mark>Jordan</mark>, who was intoxicated, and gave them a fake name and a fake identification. He was arrested and charged with possession of marijuana and drug paraphernalia, and criminal impersonation. <mark>Jordan</mark> pleaded guilty to the charges and was later released. Hensley said the judge ordered <mark>Jordan</mark> not to return to the Appalachian Trail, but he was not charged with making threats because none of the hikers were willing to testify in court. \"The fact is nobody wanted to step up to the plate and press charges,\" Hensley said. \"They were on the trail walking and they didn't want to come back - they told my investigators that.\" \"It's just heartbreaking that this happened, and our prayers go out to the victims' families and to this young girl that was stabbed,\" he said. \"I did everything that I could do. I did get this man off the trail. That's all I could do.\" Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:"}, {"articleID": "2009112011_00070638_W", "names": {"Angela Smith": ["Q168606", "Q27667173", "Q390949", "Q4762558", "Q57966178"]}, "date": "2009-11-20", "url": "http://financemarkets.co.uk/2009/11/20/social-enterprises-thrive-in-recession/", "content": "social enterprises continue to thrive despite the economic downturn, according to statistics released this week. research by the social enterprise coaltion found that social enterprises are bucking the downward economic trend, with over half increasing their annual turnover since the recession began. fewer than 20% of social enterprises have seen their turnover drop. two thirds of social enterprises are making a profit, and a further 16% are breaking even. the study also revealed that social enterprises contribute an annual £ 8.4 billion to the british economy and employ around 800,000 people. reasons respondants gave for starting a social enterprise included wanting to put something back into the community, and making a lasting difference. jonathan bland, chief executive of the social enterprise coalition, said: \"this research confirms what we have always believed but until now have not been able to support with evidence - that social enterprise is an ambitious and growing business sector, one that is of real importance to the economy and to society.\" this does not mean that there aren't challenges - particularly around business support and access to finance - but the results show optimism about the future and ambition for further growth. \"<mark>angela smith</mark>, government minister for the third sector, added:\" i am delighted that social enterprises are thriving even in these tough economic times. \"social enterprises have a key role in society, they contribute to the economy like any other business while at the same time bringing together and empowering communities.\" "}, {"articleID": "2009101401_00141271_W", "names": {"Don Nelson": ["Q15429462", "Q375600"], "Stephen Jackson": ["Q17612442", "Q39390566", "Q461825", "Q7609583", "Q7609584"], "Chris Mullin": ["Q289398", "Q5107532"], "Al Davis": ["Q1389376", "Q16151684"]}, "date": "2009-10-14", "url": "http://us.rd.yahoo.com/sports/rss/nba/SIG=12grf21ko/*http%3A//sports.yahoo.com/nba/news?slug=ap-warriors-disarray&prov=ap&type=lgns", "content": "(notes) wants out, tired of losing and seeing other star players leave town. (notes) doesn't think he and rookie (notes) can coexist in the same backcourt-at least that was his initial, gut reaction. that's a lot of popping off by the top two players on the golden state warriors, all said before they had even hit the practice floor for the first time late last month. these days, the nfl's raiders aren't the only oakland team in disarray. coach <mark>don nelson</mark> and the warriors brass believe ellis and curry will be just fine. <mark>nelson</mark>, who prefers to go small in his up-tempo offense, hasn't ruled out ellis and curry playing together. \"i can't envision that,\" ellis said. \"us together, no. i can't. i just can't. i just can't. they say we can, but we can't. i just want to win, and we're not going to win that way.\" ellis' comments-which he later backed off of following a conversation with nellie and now insists there's no issue-and the trade demands from <mark>jackson</mark> show the warriors already have their share of distractions heading into the season with another young roster. for what it's worth, <mark>nelson</mark> has decades of nba experience and has dealt with his share of hotheads and egomaniacs over the years. he swears he can handle a disgruntled <mark>jackson</mark> and has no concerns that the emotional swingman and captain won't give it his best every minute he's on the floor. <mark>nelson</mark> and general manager larry riley have said they will explore a trade for <mark>jackson</mark> if it's the right situation for the warriors. even one high-profile acquisition this offseason would have made <mark>jackson</mark> feel better about his team's chances this season in the powerful western conference. the warriors were interested in a draft-night trade with the suns that would have brought amare stoudemire to golden state. it never happened. what caught <mark>jackson</mark>'s bosses off guard is the way he went about making his trade demand: publicly in new york with buddy and former teammate (notes) at a function for their shoe company. the nba fined <mark>jackson</mark> $25,000 for the remarks. all this after <mark>jackson</mark> received a three-year contract extension worth $28 million in november-a deal that could make him tough to trade. ap - oct 8, 4:49 pm edt \"who's going to turn down that money? i'm not stupid. i didn't go to college but i've got a lot of common sense,\" <mark>jackson</mark> said. <mark>jackson</mark> averaged 20.7 points, 5.1 rebounds and 6.5 assists in 59 games last season. he insists he will continue to play hard as long as he's around, but has no idea what to expect. <mark>jackson</mark> was a key figure in the warriors ending a 13-year playoff drought in 2007, just a few months after he arrived in the bay area in a trade with the pacers. \"as you know,\" <mark>jackson</mark> said, \"this organization's unpredictable. very unpredictable.\" case in point: the strangely timed departure of <mark>chris mullin</mark> this spring. <mark>mullin</mark>, the beloved former player turned top executive, apparently had lost his authority months before the team parted ways with him in may. ap - oct 8, 4:48 pm edt the seemingly constant drama surrounding this club might cause other players to question whether they want to play for owner chris cohan. yet it certainly is an intriguing, entertaining team on the court with plenty of scorers. curry apparently is taking everything in stride as the former davidson star adjusts to the demands of the next level. he called himself and ellis a potentially \"very explosive duo.\" \"i think we have a lot of talent,\" curry said. \"you just want to get everyone on the same page.\" the warriors are almost a different team this preseason with ellis healthy. riley traveled to memphis during the offseason to meet with ellis and reiterate that the warriors consider him someone they think can help turn things around for good. ap - oct 8, 4:47 pm edt there may still be some hard feelings on ellis' end. he was suspended 30 games and fined $3 million after seriously injuring his ankle in a mo-ped accident last summer and requiring surgery. he didn't return to action until january and appeared in only 25 games. the high-scoring guard signed a six-year, $66-million contract in july 2008, about a month before the crash. <mark>nelson</mark>, riley and team president robert rowell are eager to get the season started and, they hope, put some of these issues behind them. for now, at least. the warriors have shown positive signs. the 2008 squad barely missed the postseason despite winning 48 games, most by a non-playoff nba team in a quarter-century. rowell said he's committed to fielding a competitive team. <mark>nelson</mark> and riley believe their young players will be all the better with a year's more experience. report abuse the problem aint the players its cohan an <mark>nelson</mark>. member c. webb???????? <mark>nelson</mark> is a joke, what has <mark>nelson</mark> ever won....... the warriors will never go anywhere as long as <mark>nelson</mark> an cohan exist report abuse <mark>stephen jackson</mark>'s time has come and gone...... big-shot jack? ha-ha.........no, he's not...time for him and his tired act to get the @ #$% \"outta town.......... report abuse everyone make's it sound like these problems are a new phenomenon for the warriors.if it wasn't for <mark>al davis</mark>'s silver and black circus called the raiders, the warriors would be the most dysfunctional team in the bay area.as a bay area native, i've watched the trials and tribulations of the warriors for decades, and the only thing that's changed, is the names.as long as chris cohan owns the team, the warriors are destined for mediocrity.he should sell the team to someone who at least has a passing interest in basketball. ufa5000\" class = \"usericon\" height = \"24\" width = \"24\" /> report abuse f *** <mark>jackson</mark> and monte scooter ridin ass. just shut and play. i love the warriors buit these to clowns need to go. damn i miss baron davis!!! report abuse <mark>chris mullin</mark> must feel good hes outta their. i feel good im no longer a warriors fan. report abuse if they don't make significant trades soon, it will be another 2-4 years of mediocrity...as much as i like the warriors, it really sucks to be a warrior fan these days...thanks a lot <mark>nelson</mark>.. report abuse they need to make a trade. relieve the excess of guards or do something that makes basketball sense. our new core should be with curry, randolph, morrow, and biedrins we have three really bad contracts in ellis, maggette, <mark>jackson</mark>, and im not a huge fan of any. bad mouths, injury prone and such diva like antics. we need to change the culture and get in a new target goal of gathering talent and being a 36-40 win team as soon as possible. we're going to suck this year a lot worse with players that don't care and don't belong here. alramlu \"class =\" usericon \"height =\" 24 \"width =\" 24 \"/> report abuse these guys make the most money in sports, ellis got 6 -66 million and n.fl players are just fightting to get there contracts guranteed money dang, they need a cap in basketball the salary is crazy even in baseball. report abuse we need to just chill for a little wile, its all because of curry but i like curry i think hes going to become a real good player!! report abuse can i on behalf of all warriors fans file a class action suit against <mark>jackson</mark>? i don't really know the law but taking money under false pretences seems like a good start. thegaffer\" class = \"usericon\" height = \"24\" width = \"24\" /> report abuse not caring, case in point, the oakland raiders. report abuse these prima donnas need to stop whining and play basketball to earn their keep. ronny turiaf - still gettin' hyphy:: 2009-2010 golden state warriors player recap and previews"}, {"articleID": "2009091515_00001492_W", "names": {"George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"]}, "date": "2009-09-15", "url": "http://uk.news.yahoo.com/22/20090915/tpl-uk-nuclear-iaea-iran-81f3b62.html", "content": "the iaea did not comment immediately on the deal which coincides with a diplomatic thaw between iran and world powers, signalled by a plan for talks on october 1, and which was prompted by rising concern about iran's drive for nuclear capability. salehi declined to say what the new cooperation entailed but it would not cover the iaea's probe into intelligence reports suggesting iran covertly researched nuclear weapon designs. iran has said the reports are fabricated and the issue is closed. \"we managed to come to an agreement to set a new framework for better and deeper cooperation in the future,\" salehi told reporters, summarizing talks with iaea chief mohamed elbaradei during an annual meeting of the agency's 150 member states. \"details will be revealed at the proper time. we hope we will be witnessing in the future improved cooperation (with the iaea). and we think the international environment is also very conducive to this issue...\"last month, iran agreed to longstanding iaea demands for tighter surveillance of its rapidly expanding natanz uranium enrichment plant and restored some access to a heavy-water reactor of proliferation concern. but the iaea has called for more far-reaching transparency from iran to defuse mistrust around its nuclear ambitions. it wants iran to permit snap inspections ranging beyond declared nuclear sites to verify that no secret work devoted to\" weaponising \"nuclear know-how is going on, and address what it calls credible intelligence pointing to past military dimensions to enrichment rather than just deny it without offering proof.\" the alleged studies (intelligence) is from our point of view a dead issue. this is just like a movie which is very consistent and comprehensive but at the end it is a fiction, \"salehi said, speaking in english.\" we are not here to prove the fictional movie is real...\"iran has said it is enriching uranium only for electricity, not to perfect means to fuel atom bombs as the west fears. bae systems announces job cuts bae systems has announced the company will axe 1,100 jobs and close its site in cheshire after a company efficiency review.\" you lie!' - washington turns into westminster? american pundits have been thrown into a debate over decorum in washington, with some suggesting the us should not follow...<mark>osborne</mark> plans emergency budget <mark>george osborne</mark> will call an emergency budget within weeks of winning the next election, he confirmed today. heroin \"shooting galleries' praised a controversial scheme assessing the merits of legal heroin\" shooting galleries' is expected to receive warm praise...<mark>brown</mark> seeks to reassure unions before election prime minister <mark>gordon brown</mark> sought on tuesday to reassure his party's traditional union allies over threatened public...councils lose £ 200m a year to fraudsters people fraudulently claiming single person's discount on their council tax are costing councils millions, the audit...cable maps out lib dem cuts vince cable has outlined liberal democrat plans to cut public spending, in what is arguably the most detailed package of...poll: anyone is better than <mark>brown</mark> almost half of voters think that anyone from the labour ranks could do a better job of leading the party than <mark>gordon brown</mark>. tories reject file-sharing plans the conservatives have come out against peter mandelson's plans to disconnect households found guilty of illegal file-sharing. subscribe to rssmost popular in: politics copyright © 2009 yahoo! all rights reserved."}, {"articleID": "2019112115_00038307_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-11-21", "url": "http://origin.thehollywoodgossip.com/2019/11/eddie-judge-doubles-down-ryan-vieth-isnt-sick-hes-just-a-loser/", "content": "Earlier this month, The Real Housewives of Orange County viewers saw Tamra Judge fear that her son might die by suicide. Her husband, Eddie, came across as harsh and unsympathetic while speaking to the camera. After suggesting that Ryan Veith might need a metaphorical kick in the butt, Eddie Judge seemed to dismiss Ryan's mental health struggles. \"When you're struggling with childhood issues as a man, you're not a man,\" Eddie told the camera. Ryan is a famously troubled person, from his abhorrent and bigoted statements to his alarming criminal history. Ryan's self-esteem is low, and he had confessed to his mother and to a therapist that he felt worthless. \"Time to move on...just because you see it on TV doesn't mean it's real!\" Eddie writes without context on Instagram this week. \"I'm happy most of you understand this,\" he continues. \"And those that do not, you need to learn how it works.\" \"Reality TV is not Reality,\" Eddie argues. He correctly points out: \"These shows are designed to get maximum reaction from the viewers.\" \"Has anyone reached out to a villain on a TV show,\" Eddie begins to ask. He continues: \"And messaged him/her what a piece of shit he/she is because of what they saw that person do or say to someone else on that show?\" \"Oh yeah, no,\" Eddie answers. \"Because someone wrote that script.\" \"Well, someone writes the script on reality TV .,\" he claims. \"Just not exactly the same way a scripted show is produced.\" \"I stand behind what I said and never did I say that people with a mental illness need to man up,\" Eddie insits. \"I understand mental illness,\" he writes. Eddie explains: \"I also understand when someone uses mental illness as an scapegoat.\" \"Ryan is not mentally ill and he is not using it as an scapegoat,\" Eddie claims. \"He is struggling with life,\" Eddie opines. \"And, you don't have to be mentally ill to feel depressed.\" Depression is literally mental illness, my dude. \"However, the TV show will figure out how to get max reaction by editing a touching moment in such a way to get you to watch for more,\" he writes. \"If they do not, then we have no show,\" Eddie concludes. \"Get it? The end!\" As we mentioned, depression is absolutely a mental illness. It's a brain disorder. That seems to indicate that Eddie is either deeply ignorant about mental health or willfully playing word games. While Ryan is struggling with life, part of that struggle stems from mental illness. However, depression and self-loathing may be factors in Ryan's behavior, but they do not excuse his actions or his statements. As you can tell by the Betsy Ross cosplay that Ryan decided to wear on camera, he is struggling with a number of issues. But neither his domestic violence arrest nor his outspoken support for <mark>Donald Trump</mark> are excused by his mental health. If Eddie had argued that Ryan was refusing to take accountability for his actions and was therefore scapegoating plenty of decent people with mental illness, we would agree. Instead, Eddie decided to make unsubstantiated claims about Ryan's mental state and doubled down upon his unsympathetic words. Not cool. It is entirely possible to hold Ryan accountable and to understand how his mental health and childhood impact his adult life at the same time. Tamra Judge: I'm Scared My Son Is Gonna Kill Himself! Start Gallery Edit Delete Share on Facebook Email"}, {"articleID": "2017092810_00326419_W", "names": {"Peter Evans": ["Q17523824", "Q2074761", "Q2534758", "Q39089656", "Q52888475", "Q57986136", "Q7173890"]}, "date": "2017-09-28", "url": "http://www.examiner.com.au/story/4955039/carrying-on-lewis-legacy/?src=rss", "content": "The Anzac spirit was alive and well at Campbell Town District High School on Thursday. Ajay Woods (fourth from left) receives the Lewis McGee Memorial Medallion at Campbell Town District High School on Thursday. View More Local Business List Your Business Here The Anzac spirit was alive and well at Campbell Town District High School on Thursday, with the inaugural awarding of the Lewis McGee Memorial Medallion. Ajay Woods, 11, from Avoca Primary School and Jonty Nicolson, 11, from Campbell Town District High School were named as the first ever recipients of the award in front of more than 100 community members. The ceremony was also used to mark the 100 th anniversary of the action which earned Sergeant McGee the Victoria Cross medal. The award was created to recognise students who show exceptional consideration and mateship throughout year. Thursday's event marked the culmination of a three-year journey for Campbell Town Anzac Group chairman <mark>Peter Evans</mark>, who was the driving force behind the award. He said the medallion was not just about commemorating Sergeant McGee. \"It's way for us to remember all the soldiers who have served bravely for Australia,\" he said. \"I was immensely proud to see the medallion awarded in front of an audience that included surviving members of the 12 th and 40 th battalions.\" It's great to be involved with the schools and to be able to give back after all they have done for us. \"Born in Ross, Lewis McGee spent much of his young life in Avoca before enlisting in the Australian Imperial Force during 1916 at the age of 27. He was posted to the 40th Battalion, and completed training in Tasmania and the United Kingdom, where he was promoted to lance corporal. After being transferred to the Western Front in November 1916, he was quickly promoted to corporal and then sergeant. It was during an attack on Broodseinde Ridge as part of the Passchendale Offensive where Sgt McGee's platoon suffered heavily casualties from machine gun fire 50 metres in front of their position. Armed with just a revolver Sgt McGee made his way forward alone and was able to seize control of the pillbox upon which the machine gun was set. His actions on October 4, 1917 reignited the 40 th Battalion's advance and earned him the Victoria Cross. Sgt McGee died in battle on October 12, 1917."}, {"articleID": "2019061009_00231235_W", "names": {"Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"], "David Warner": ["Q3018962", "Q363271", "Q57408725"]}, "date": "2019-06-10", "url": "http://euronews.com/2019/06/10/zampa-uses-hand-warmers-says-finch-amid-ball-tampering-claims", "content": "Zampa uses hand warmers, says Finch amid ball-tampering claims Zampa uses hand warmers, says Finch amid ball-tampering claims By Reuters • last updated: 10/06/2019 - 11:33 Cricket - ICC Cricket World Cup - India v Australia - The Oval, London, Britain - June 9, 2019 Australia's Aaron Finch speaks to Adam Zampa Action Images via Reuters/Andrew Boyers - Copyright Text size Aa Aa (Reuters)--Australia spinner Adam Zampa may have been using hand warmers during his bowling spell in Sunday's 36-run Cricket World Cup defeat by India, captain Aaron Finch has said in response to a flood of ball-tampering accusations on social media. Video footage showed Zampa putting his hand into his pocket before rubbing the ball prior to bowling the 24th over. Zampa's team mates <mark>Steve Smith</mark> and <mark>David Warner</mark> have just returned to the national setup after serving 12-month bans for their roles in a ball-tampering scandal in South Africa early last year. \"I haven't seen the photos, but I know that he has hand warmers in his pocket,\" Finch told reporters. \"He has them every single game he plays.\" I honestly haven't seen them (the images), so I can't comment too much on it. But I know for a fact that he has hand warmers every game. \"Australia next play Pakistan in Taunton on Wednesday. (Reporting by Rohith Nair in Bengaluru; Editing by Peter Rutherford) euronews provides breaking news articles from reuters as a service to its readers, but does not edit the articles it publishes. Articles appear on euronews.com for a limited time. Share this article"}]