[{"articleID": "2012110811_00043480_W", "names": {"Thomas Day": ["Q21166189", "Q3525032", "Q42325085"]}, "date": "2012-11-08", "url": "http://thetimesnews.com/lifestyles/lifestyles-home/luncheon-lecture-with-thomas-day-scholar-planned-for-nov-15-1.45752", "content": "\"<mark>thomas day</mark>: man in the middle,\" a luncheon and lecture with laurel sneed, a <mark>thomas day</mark> scholar, will be at 11:30 a.m. nov. 15 at alamance country club, 2402 pineway drive, burlington. sneed is executive director of the apprend foundation and serves as director of the <mark>thomas day</mark> education project, which she co-founded in 1994. in 1995, sneed conducted the research that discovered <mark>thomas day</mark>'s origins and her work continues today. admission is $40 per person and reservations must be confirmed with payments by monday. mail checks to the alamance county historical museum, 4777 n.c. 62 south, burlington. this is a fundraiser for the alamance county historical museum. for more information, call (336) 226-8254."}, {"articleID": "2013050917_00081986_W", "names": {"John Gibbons": ["Q19953474", "Q21557552", "Q27074107", "Q30122089", "Q3181578", "Q53552549", "Q55403007", "Q6235234"], "Carlos Villanueva": ["Q2939496", "Q716965"], "Gary Green": ["Q1348874", "Q42422013", "Q5525162", "Q5525163", "Q5525164", "Q5525165", "Q5525167", "Q58756268"], "Robert Vito": ["Q15993612", "Q3938452"], "David Price": ["Q1176177", "Q16063598", "Q20804677", "Q20973688", "Q332804", "Q37830471", "Q5238707", "Q5238709", "Q5238711", "Q5238712", "Q5238713", "Q5238714", "Q5238716", "Q56072488", "Q56952850", "Q634326", "Q984010"], "Ray Chapman": ["Q19871984", "Q28421918"], "Michael Weiner": ["Q3308574", "Q39710513", "Q56850515", "Q6835258", "Q6835259", "Q878144"], "Ryan Thompson": ["Q21651804", "Q3453865", "Q3943098", "Q4416955"]}, "date": "2013-05-09", "url": "http://hawaiitribune-herald.com/sections/sports/procollege/hit-liner-happ-says-?i-feel-really-fortunate?.html", "content": "Associated Press ST. PETERSBURG, Fla. - J.A. Happ isn't sure how he'll react when gets on a mound again. One thing he does know is that he's going to try to forget what happened Tuesday night. Toronto's 30-year-old left-hander returned to Tropicana Field on Wednesday, less than 24 hours after he was struck on the head by a line drive that sent him to a hospital for an overnight stay. Happ expects to make a full recovery from a skull fracture behind the left ear that doctors believe will heal on its own, adding he doesn't anticipate having any fear of returning to work. \"I think you've just got to get back out there and try to forget about it,\" he said. \"I won't know until I'm out there, but I don't anticipate it being a problem.\" He's not sure when he'll get the opportunity. The pitcher sprained his right knee when he dropped to the ground Tuesday night, and that could affect how soon he'll be ready to pitch again. Happ realizes his injuries could have been worse. \"I feel really fortunate,\" he said after limping into the auxiliary clubhouse for a news conference and climbing a couple steps to sit behind a microphone. \"It looks like I moved just a little bit. I don't remember doing that, but it looks like it was just enough to where it must have caught me in a better spot, because I think it could have got me head on,\" he said. \"I've got some stitches and there's a fracture in the skull, I suppose, behind my ear, but it's not serious or threatening. We'll let those heal.\" Happ, who was put on the 15-day disabled list, had a brief conversation with Tampa Bay's Desmond Jennings, who hit the line drive that caught him squarely on the left side of the head. Happ shook hands with several teammates outside the Blue Jays clubhouse while assuring each one: \"I'm fine.\" \"He just wished me the best and hoped for a quick recovery,\" Happ said. \"Obviously, something like that is never intentional. I let him know that I knew that and I appreciated him coming over. It's a scary thing, I'm sure on his end, too.\" When Jennings arrived at the ball park he was relieved to learn from one of the Rays' trainers that Happ appeared to be OK. \"That enabled me to breathe a little bit,\" Jennings said. \"But you still don't know until you talk to him, until you see him face to face.\" Happ remembers releasing the ball, as well as teammates talking to him while he received medical attention on the field. \"I don't remember seeing it,\" he said. \"Just immediate loud ringing in my ear. Just pressure on my ear, and I was on the ground. That was kind of it. It took me a few seconds to kind of figure out what was going on, but I do remember them being there...the coaches and Gibby (manager <mark>John Gibbons</mark>) and obviously the trainers. I was coherent and talking pretty quickly.\" He also called his mother while an ambulance was transporting him to nearby Bayfront Medical Center. \"They were holding the phone up to my ear for me ....She was definitely relieved, glad to hear my voice,\" Happ said. The hit, still being replayed on TV a day later, left some of his fellow players unsettled. \"I felt horrible yesterday. I played with Happ last year for a little bit,\" Chicago Cubs pitcher <mark>Carlos Villanueva</mark> said. \"There's a lot of talk out there about the gear and protective stuff. Hopefully, they'll come out with something that won't affect us pitching out there, but it's still such a fast game. What happens if the ball comes directly at your face? There's nothing you can do. You can't pitch with a mask on. It just comes down to the draw of the luck I guess.\" Major League Baseball, meantime, is trying to determine the best way to protect pitchers from similar injuries. The league's senior vice president, Dan Halem, said a half-dozen companies were designing headgear for pitchers but no product so far was sufficiently protective and comfortable. \"If it doesn't absorb enough impact, then it may be ineffective,\" he said. Dr. <mark>Gary Green</mark>, MLB's medical director, said the Head Injury Criterion (HIC) scale is being used to evaluate products and that a cap liner likely would have to be 8 ounces or lighter. \"We've found some things that are very lightweight, but they're not very protective, and then other things that might be protective but they are too heavy and don't meet the other specifications,\" he said. <mark>Robert Vito</mark>, president of Pennsylvania-based Unequal Technologies Co., said a patent had been submitted for a product he hopes to make available in June. <mark>Vito</mark> said his employees met with pitchers, coaches and trainers from 26 big league teams during spring training. \"My biggest concern coming from the MLB Players Association is the mirror test. When they put it on, it must be concealed protection that cannot be detected by the fan,\" he said. In testing the product, he had someone smash a Louisville Slugger bat into his chest. \"Energy is like water. It's got to go somewhere,\" <mark>Vito</mark> said. \"So the energy is either going to go into my body and devastate tissues, tendons and break ribs and crush my heart to where I'm bleeding out internally, or it's going to get absorbed into the pad and then return some of that energy to the bat, all the while protecting me.\" While Unequal has used Kevlar-based products in the past, Georgia-based Evoshield employs \"gel-to-shell\" technology. \"There is no fast and easy solution,\" Evoshield CEO Bob Pinckney said in a statement. <mark>Green</mark> said an average of two pitchers had been struck on the head by line drives during the past seven or eight seasons. \"While these things are catastrophic, they're still rare events,\" he said. Baseball stepped up its efforts after two pitchers were struck last year. Oakland's Brandon McCarthy was hit on the head by a liner last September, causing a skull fracture, an epidural hemorrhage and a brain contusion that required surgery. He was released from a hospital six days later. Detroit's Doug Fister was struck in the head by a batted ball during the World Series; he was unhurt and stayed in the game. \"I've heard a lot of pitchers say they wouldn't mind trying it. And a lot of pitchers just don't want it,\" said Tampa Bay's <mark>David Price</mark>, the reigning AL Cy Young Award winner. \"So I think the decision would still be left up to that player. If it worked and it didn't affect anything in the mound, I would definitely look into it.\" When a product is available that MLB thinks will provide protection without getting in the way, it will ask the players' association for its input. \"I guess you'd have to see some prototypes,\" Happ said. \"It would be tough.\" In the macho culture of baseball, the adoption of protective gear has been slow. While Cleveland's <mark>Ray Chapman</mark> died when he was hit by a pitch in 1920, MLB didn't make the use of helmets or protective cap inserts mandatory until the National League required them for the 1956 season. Helmets weren't required until the 1971 season and, even then, they weren't mandatory for players already in the big leagues. An earflap on the side of the head facing the pitcher was required for new players starting in 1983. Stronger and slightly heavier carbon-fiber helmets, the Rawlings S100 Pro Comp, were required starting this year. \"You can't ask a pitcher to use material that he's not comfortable with. But I'm hopeful that, much like with batting helmets, we'll figure something out that both allows the players to play without any obstruction but adds to player safety,\" union head <mark>Michael Weiner</mark> said. \"When they get close to something that they think might work, then at that point we're both going to look at it together.\" Bryce Florie doesn't see well in his right eye to this day, the result of being struck by a line drive hit by the Yankees' <mark>Ryan Thompson</mark> while pitching for Boston in September 2000. Florie returned the following year but ended his career after just seven more big league appearances. \"With the way everything is being condensed, I think it's inevitable that it's going to happen, that they're going to have something in the hat,\" Florie said. \"You'll have a hard time to get major leaguers and minor leaguers to say,\" OK, Let me try this out .' Most of them are not going to want to be the first guy. But if you talk to guys like myself and other guys that have been hit, up in the face, in the head, we'll be, \"Like yeah, I'll do it .' But then, it's kind of late.\" Rules for posting comments Comments posted below are from readers. In no way do they represent the view of Stephens Media LLC or this newspaper. This is a public forum. Comments may be monitored for inappropriate content but the newspaper is under no obligation to do so. Comment posters are solely responsible under the Communications Decency Act for comments posted on this Web site. Stephens Media LLC is not liable for messages from third parties. IP and email addresses of persons who post are not treated as confidential records and will be disclosed in response to valid legal process. Do not post: Potentially libelous statements or damaging innuendo. Obscene, explicit, or racist language. Copyrighted materials of any sort without the express permission of the copyright holder. Personal attacks, insults or threats. The use of another person's real name to disguise your identity. Online Extra: Warriors unfazed in taking Division II title Man pleads no contest in peeping Tom cases"}, {"articleID": "2014101519_00079065_W", "names": {"Helen Scott": ["Q16227550", "Q26906899", "Q43392691", "Q43395889", "Q5703119"]}, "date": "2014-10-15", "url": "http://scotsman.com/news/scotland/top-stories/world-s-end-trial-friend-saw-accused-with-teens-1-3574140", "content": "click here If you have not signed up previously It's free and only takes a minute! Arrange your newspaper/digital subscriptions online Annie Lennox slams mood of post-indyref Scotland Viking treasure hoard found in Scotland SNP, Greens slam TV debate plans amid court threat Keane let Celtic team-mates trash Man Utd club car Ukip to target \"rust belt' seats in Scotland SNP, Greens slam TV debate plans amid court threat Scottish independence: Thousands at Glasgow rally Rumour Mill: Virgil van Dijk | Scotland | Lennon Rumour Mill: Anya injury | Scotland | Neil Lennon Rumour Mill: Scotland | Celtic | Hibs | Hearts World's End trial: Friend\" saw accused with teens' A FRIEND of two teenagers killed in 1977 has told a court she saw the man accused of their murders with them in the pub where they were last seen alive. Jackie Thomson identified Angus Sinclair as one of the two men she saw with Christine Eadie and <mark>Helen Scott</mark> at the World's End pub in Edinburgh. Keep up to date with all aspects of Scottish life with The Scotsman iPhone app, completely free to download and use. Sinclair, 69, has pleaded not guilty to assaulting, raping and murdering the 17-year-olds between October 15 and 16 1977 between the pub and locations in East Lothian. Ms Thomson, who was with the girls on the night they went missing and were killed, was giving evidence on the third day of Sinclair's trial at the High Court in Livingston. She told the court that she and another friend, Tony, had left Christine and <mark>Helen</mark> in the World's End in the company of two men at around 10.45 pm on Saturday October 15, 37 years ago. Prosecuting, Lord Advocate Frank Mulholland said Ms Thomson had been shown a series of 12 photographs of men by the police in 2004. Mr Mulholland said she was shown the images to see if she could identify anyone who was one of the males she saw with the girls in the pub in 1977. Pointing to Sinclair, he told the court Ms Thomson had identified the accused. He asked: \"How sure were you that this person on photo K, Angus Sinclair, was one of the two male persons?\" Ms Thomson replied: \"In 1977 he looked quite a lot different - younger than that. It is hard to say because I had seen photos in the newspapers.\" Mr Mulholland asked her to answer the question directly, stating: \"How sure were you?\" * Please type the postcode as the example above Try The Scotsman app for 30 days free! View the latest news and sport or download full editions of the newspaper to read offline. Search for Scotsman.com in your Android or iOS app store today. Newspaper subscribers get free unlimited access to the app. Contact us If you wish, you can contact us using any of the methods below. clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. The Scotsman provides news, events and sport features from the Edinburgh area. For the best up to date information relating to Edinburgh and the surrounding areas visit us at The Scotsman regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Webtrends / Google Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend."}, {"articleID": "2013062020_00009717_W", "names": {"Ian Davidson": ["Q10411614", "Q16195495", "Q296755", "Q56421067", "Q5981374", "Q5981377", "Q5981380"]}, "date": "2013-06-20", "url": "http://www.defence.pk/forums/europe-russia/259390-uk-warns-scottish-defence-industries-loss-privileged-access-us-m.html", "content": "Join Date Oct 2012 Location Usa UK warns Scottish defence industries of loss of \"privileged' access to US m UK warns Scottish defence industries of loss of\" privileged' access to US market By Guy Anderson 6/17/2013 The UK government has reiterated warnings of the consequences for Scotland's defences sector should Edinburgh choose independence in 2014, arguing that military suppliers north of the English border would lose assured access to the UK defence market and \"a privileged level of access to the US market\" . The comments came in an official statement released on 14 June in a formal response to the House of Commons Scottish Affairs Committee report - published earlier this year - on the implications of Scottish independence on jobs in the defence sector. Scotland will hold a referendum in 2014 on the issue of independence from the United Kingdom. The views of the government were consistent with those of the select committee. Committee chairman <mark>Ian Davidson</mark> MP said: \"In the evidence it took [relating to the report] the committee was unable to identify any defence supplier or product which would benefit from separation, but did find a large number that would suffer.\" Scotland hosts the facilities of a series of leading defence contractors, including Finmeccanica, Thales, Babcock, and BAE Systems. UK warns Scottish defence industries of loss of \"privileged' access to US market You may not post new threads You may not post replies You may not post attachments You may not edit your posts"}, {"articleID": "2011021706_00042604_W", "names": {"Michael Lohan": ["Q4267518", "Q54566123"]}, "date": "2011-02-17", "url": "http://etonline.com/tv/107825_David_Letterman_on_Lindsay_Lohan_Incident_We_Got_Duped/index.html", "content": "david letterman is speaking out after his cbs show, \"the late show with david letterman,\" announced that lindsay lohan would be a guest, and then she later denied it. on tuesday, \"the late show with david letterman\" sent out a press release announcing that <mark>lohan</mark>, who was recently charged with felony grand theft, would be announcing the \"top ten list\" via satellite that coming thursday. <mark>lohan</mark> then tweeted on tuesday night, \"i am not going to be doing david letterman, i'm not sure how this happened, but i am sorry for the confusion...\"on wednesday night's\" late show, \"letterman gives his take on how the events went down. he says that after he included a joke about lindsay stealing a grammy on one of last week's shows, he got a call from a\" guy \"who told him,\" lindsay thought the joke was hilarious. \"he says the\" guy \"proceeded to tell him that lindsay wanted to be on\" the late show. \"he says he instructed his publicity department to share the news, but adds,\" then lindsay lohan says, \"oh, i don't know, none of that's happening, i don't know what's going on. it's not true .'\" \"so it turns out we were duped,\" letterman shares. \"and i have no one to blame but myself, and boy, is my face red!\" \"and by the way, now i have to apologize to the lindsay lohan family. i hope i didn't embarrass you lindsay, and your family,\" letterman adds with a sincere and apologetic expression on his face. lindsay's father <mark>michael lohan</mark> told tmz that he had brokered the deal."}, {"articleID": "2020020311_00098192_W", "names": {"Dianne Gove": ["Q5269971", "Q57025996"], "Phil Murphy": ["Q260042", "Q3378818", "Q7182210", "Q7182211"]}, "date": "2020-02-03", "url": "https://wobm.com/ocean-county-lawmakers-have-megans-law-expansion-bill-move-ahead/", "content": "Vin Ebenau Prison cell at the Monmouth County Correctional Institute. (Vin Ebenau, Townsquare Media New Jersey) Share on Facebook Share on Twitter A Megan's law legislative initiative (S-205) introduced by 9th District Ocean County Senator Chris Connors, Assemblyman Brian Rumpf and Assemblywoman <mark>Dianne Gove</mark> has advanced thru the Senate Law and Public Safety committee. The legislation would require the state attorney general to establish a means for providing e-mail notifications when a sex offender listed on the internet registry registers a new address in a different county or zip code from the offender's previous address. The 9th District Lawmakers issued a statement on their legislation moving ahead: \"Community notification is the core purpose of Megan's Law in the overall effort to safeguard our communities against sexual predators. To be more effective, we're proposing to upgrade Megan's Law by instituting the use of e-mail notifications which would help in addressing complications encountered by law enforcement due to the transient nature of sexual offenders. Residents could stay better informed if they received e-mail notifications in instances when a registered sex offender moves to a new address. Currently, notifications are mostly provided to persons living in high-risk zones who are likely to come in contact with a sex offender. Under our legislation, residents would be able to request notifications for up to two additional counties or zip codes, which they may not receive under current law.\" NJ child predator who says \"pedophiles are a persecuted minority' wins appeal Assemblyman Rumpf and Assemblywoman <mark>Gove</mark> said that they will be introducing the companion bill to S-205 in the coming weeks. The 9th District delegation is also sponsoring legislation that would amend Megan's Law which would require that the county prosecutors to determine an offender's risk of re-offense, or tier, prior to the inmate's release from incarceration.\" At present, many sex offenders are not tiered until they have been released into the community because the offender's residence is a factor that may be considered in determining the risk of re-offense, \"The 9th District Lawmakers said. There have been similar pieces of legislation introduced and passed in New Jersey to aim to tighten the policies of Megan's Law even further. In response to Governor <mark>Phil Murphy</mark> vowing to make New Jersey a sanctuary state and Attorney General Gurbir Grewal's Immigrant Trust Directive, Jersey Shore Assemblyman Ron Dancer introduced legislation in July of 2019 requiring anyone convicted of fleeing sex crime charges in foreign countries to register under Megan's law. Marlboro bus driver arrested for watching obscene material in front of students More Jersey Shore News: Enter your number to get our free mobile app Filed Under: 9th District, Brian Rumpf, child predators, Chris Connors, <mark>Dianne Gove</mark>, Megan's Law, Ocean County, Sex Offender Categories: Jersey Shore News, New Jersey News, News, News Briefs, Ocean County News, Your Town Comments Leave A Comment Back To Top"}, {"articleID": "2019052806_00034035_W", "names": {"John Baker": ["Q12633672", "Q15109473", "Q18379494", "Q26220645", "Q26220647", "Q28946020", "Q3180978", "Q42871706", "Q51585141", "Q55990560", "Q59155019", "Q59201610", "Q6007104", "Q6111119", "Q6220376", "Q6220386", "Q6220388", "Q6220400", "Q6220402"], "John Michael": ["Q16209656", "Q21556337", "Q6248613", "Q6248615"], "Michael Doyle": ["Q165639", "Q19957594", "Q6829941", "Q6829942", "Q6829945", "Q6829946", "Q6829947", "Q6829948"]}, "date": "2019-05-28", "url": "http://www.thisiswiltshire.co.uk/news/17667787.pensioner-writes-novels-as-a-hobby/", "content": "News Pensioner writes novels as a hobby By <mark>John Baker</mark> Reporter See photos images Skip to next photo 1 / 1 Show caption 1 / 1 0 comment A MELKSHAM pensioner who started writing historical fiction after he retired has just published his fifth novel and started work on the sixth. <mark>John Michael</mark> <mark>Doyle</mark>'s latest book, Requiem for a Reiver is published by Olympia Publishers and is about the lawless border region between England and Scotland in 1588. He says: \"My wife Shireen comes from the north of England. We did some family history research on her ancestry and found that she is descended from a notorious Reiver family, the Elliotts, who raided the borders of Scotland.\" This intrigued me so I decided to write about it. It has taken me about three years to produce but I don't write for a living, I write for a hobby. \"Mr <mark>Doyle</mark>, who is just about to celebrate his 81st birthday, was born in Ireland in 1938 and moved to England at the age of 17.\" My mother Lillian was English and my father William was from County Kerry. We moved back to England and I worked in a sawmill in Bath. \"Mr <mark>Doyle</mark> later spent three years in the Royal Artillery and, after leaving the army, joined an engineering company in Bath. He later moved into the aerospace industry to work for Dowty in Atworth for 22 years and then worked as deputy secretary for the Institution of Engineering Designers. After several years of study, he gained a BA (Hons) degree from the Open University, and later became an associate lecturer for the OU. On retirement, he took up writing historical fiction after delving into his own family history and unearthing a story about his Irish grandfather <mark>Michael Doyle</mark>.\" He was a bit of mystery. Nobody knew much about him and I found out that he had been the last coachman on a large country estate in Ireland. \"He lost his job when the house closed during the First World War and he moved to Scotland to help build the Great Munitions Factory at Dornock.\" He died of a heart attack on the train from Dornock to Carlisle and was buried in a pauper's grave because no-one knew where he came from or where his family was. \"The story written for his granddaughter in 2006 was then turned into his first novel, The Last Coachman, and was published by Olympia in 2010. Mr <mark>Doyle</mark>'s career as a novelist has taken off from there. He says:\" I always wanted to write historical fiction and since then I have written four more novels. \"They are This Bitter Land, Shake Hands With A Connaught Ranger, An Tanaiste (The Heir) and the latest, Requiem for a Reiver. All have been meticulously researched by Mr <mark>Doyle</mark>, who lives with Shireen in The Close, Melksham. The couple have one daughter, Catherine, and two granddaughters. He is now working on his sixth novel, which is set against the Monmouth Rebellion in 17th century England and the Battle of Sedgemoor.\" My son-in-law is descended from people who were involved in the Monmouth Rebellion. One was hung at the Bloody Assizes which started in Winchester in 1685 following Monmouth's defeat and another was transported. \"Mr <mark>Doyle</mark> is also much in demand to speak at local libraries and societies, although he does a lot less public speaking these days. He says:\" It's a catch 22--you have to be famous to sell lots of books but you have to sell lots of books to become famous! \"Published by Olympia Publishers, part of Ashwell Publishing Ltd, Requiem for a Reiver is priced £ 12.99. It is available on Amazon and from all good book stores. 0 comment"}, {"articleID": "2012072710_00066499_W", "names": {"Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"], "Troy Evans": ["Q556064", "Q7846827"]}, "date": "2012-07-27", "url": "http://hawaiitribune-herald.com/sections/sports/procollege/vilma-court-hearing-ends-no-decision-tro.html", "content": "new orleans - after jonathan vilma and seven witnesses testified thursday that nfl commissioner roger goodell got his facts wrong in the bounty scandal, a federal judge decided against making an immediate ruling on whether the suspended saints' linebacker could temporarily return to work. regardless of the outcome, the hearing gave vilma and several current and former teammates, as well as saints assistant head coach joe vitt, a chance to explain why they believe nfl investigators \"misconstrued\" evidence gathered in their bounty investigation and incorrectly concluded that the saints had a program in place that offered cash bonuses for tackles that injured opponents. \"everything i've worked for has been basically thrown down the toilette,\" vilma said when asked about the harm his bounty suspension has done to both his pro career and charitable work that includes building schools in haiti. \"it hurts. it's tough to swallow because it's not who i am.\" vilma has asked u.s. district judge ginger berrigan to impose a temporary restraining order against the nfl while his lawsuit against goodell proceeds. vilma's suit accuses the commissioner of defamation and also asks berrigan to permanently overturn goodell's decision to suspend vilma for the entire 2012 season. nfl attorneys did not attempt to challenge testimony denying the existence of a bounty program. rather, they argued the real question in vilma's case was whether the federal courts had jurisdiction to overturn a process that was collectively bargained. they noted that multiple system arbitrators have already agreed that goodell has followed the very policies for imposing discipline to which players agreed in the league's labor agreement. \"mr. vilma may not like that bargain but it's not for him? or this court to decide,\" nfl attorney gregg levy argued. berrigan did not say when she would rule on the temporary restraining order that vilma's attorney requested in thursday's seven-hour hearing. however, she is attempting to fast-track vilma's lawsuit, along with a separate but parallel lawsuit brought by nfl players association on behalf of three other current or former saints slapped with partial-season suspensions in the bounty matter: <mark>will smith</mark>, scott fujita and anthony hargrove. berrigan did say she was troubled by some of the nfl's arguments. she said goodell's contention that players were being punished for actions that occurred not on the field, but in meeting rooms and locker rooms, \"borders on ridiculous,\" and cited it as one of several examples of \"slicing the salami very thin.\" goodell has stated that he has jurisdiction because he is dealing with conduct detrimental to the game, not for on-field infractions that require the use of an arbitrator other than the commissioner. vilma attorney peter ginsberg said that goodell violated the cba by failing to serve as a neutral arbitrator. he said goodell's bias in the matter was evident in his public comments even before he handed down players' suspensions. goodell \"is allowed to be commissioner and arbitrator. he is not allowed to pre-judge,\" ginsberg said. current new orleans defensive players roman harper, sedrick ellis, jonathan casillas and scott shanle testified on vilma's behalf, along with retired former teammates <mark>troy evans</mark> and randall gay. they denied ever seeing vilma offer $10,000 cash knocking quarterbacks brett favre or kurt warner out of the 2009-10 nfc playoffs, as the nfl has said he did. the witnesses also corroborated vilma's description of some of the terms that the nfl has highlighted in its report about the bounty program. they explained that the term \"kill the head\" means to legally stop a ball carrier's forward progress, to literally turn his body so that his head is facing sideways or backward, and not in the direction the offense was trying to go. they testified the term \"whack\" described legal hit below the waist in which a ball carrier in the open field has his legs cut out from under him. a \"cart-off,\" they said, also was a legal hit, albeit one that forced a player to take at least a few plays off to re-gather himself. they described a \"knockout\" as a high-impact, dramatic and legal hit that did not necessarily result in injury. they also testified that the pool they were involved in was a pay-for-performance pool that largely rewarded big plays such as forced fumbles, sacks or interceptions, but added that the program also fined players for mental errors or penalties including unnecessary roughness. vitt, sometimes pausing with emotion, praised vilma as one of the finest players he has ever known, and someone as important to new orleans' defense as record-setting quarterback drew brees is to the saints' offense. vitt described vilma as an intelligent, hardworking and unselfish player whose teammates overwhelmingly elected him as defensive captain. \"when these grown men who make a lot of money vote for this man to lead them into critical situations, and make critical calls? and be there for them in times of need, personally, i think it speaks volumes,\" vitt said. vilma wants a swift ruling because he is rehabilitating his surgically repaired left knee and said doing so at the saints' facility is far more productive than doing it on his own. vitt added that when players rehabilitate injuries at team headquarters, they do so with trainers who have a \"personal vested interest\" in the player's health. despite not getting an immediate temporary restraining order allowing him to rejoin the saints, vilma appeared to be in good spirits as he left court. \"in a perfect world, that would have happened, but there's a lot for the judge to go over right now and i'm definitely not going to try to rush her,\" vilma said. \"i hope she gets it right and i hope it's in my favor.\" rules for posting comments comments posted below are from readers. in no way do they represent the view of stephens media llc or this newspaper. this is a public forum. comments may be monitored for inappropriate content but the newspaper is under no obligation to do so. comment posters are solely responsible under the communications decency act for comments posted on this web site. stephens media llc is not liable for messages from third parties. ip and email addresses of persons who post are not treated as confidential records and <mark>will</mark> be disclosed in response to valid legal process. do not post: potentially libelous statements or damaging innuendo. obscene, explicit, or racist language. copyrighted materials of any sort without the express permission of the copyright holder. personal attacks, insults or threats. the use of another person's real name to disguise your identity. slaying may have been in self defense life getting harder for kids on isle food stamp use doubles on big island two manslaughter indictments returned"}, {"articleID": "2008102920_00014477_W", "names": {"Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"], "Julia Roberts": ["Q40523", "Q6306690", "Q6306692"], "Ryan Reynolds": ["Q192682", "Q7384463"]}, "date": "2008-10-29", "url": "http://philly.com/r?19=961&43=168041&44=33508434&32=3796&7=195357&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fentertainment%2F20081029_ap_cruisesmithappearinvideotogetoutthevote.html", "content": "posted on wed, oct. 29, 2008 cruise, <mark>smith</mark> appear in video to get out the vote new york - leonardo dicaprio is bringing out the big guns to get out the vote. tom cruise, <mark>julia roberts</mark>, harrison ford, <mark>will smith</mark>, steven spielberg and justin timberlake are among the celebrities starring in a new public service announcement produced by the actor, who also appears in the spot. the video shows the stars struggling to grasp the concept of using reverse psychology to get young people into voting booths. required by director spielberg to say \"don't vote,\" <mark>roberts</mark> remarks, \"that doesn't make sense.\" cruise and <mark>smith</mark> complain to each other, while timberlake jokes, \"i can do anything. i was in a boy band, ok?\" finally, ford says, \"you know what? i can't do it. it's not true, i don't believe it, 537 people decided the 2000 election, and you want me to tell people that one vote doesn't count?\" \"there are more baldwin brothers than that,\" quips <mark>ryan reynolds</mark>, whose wife scarlett johansson also appears in the video. philly.com comments are intended to be civil, friendly conversations. please treat other participants with respect and in a way that you would want to be treated. you are responsible for what you say. and please, stay on topic. if you see an objectionable post, please report it to us using the \"report abuse\" button. about your comments: these comments are monitored by philly.com staff. we reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable. personal attacks, especially on other participants, are not permitted. we reserve the right to permanently block any user who violates these terms and conditions. project h.o.m.e.'s 2008 young friends event - opening doors to the future this networking event features hors d'oeuvres, beverages, silent auction, short program emceed by pat croce & more. wednesday, october 29 â \u0095 5:30 till 8 pm • venue search: - by name - by cuisine - by venue type, e.g. \"movie theater\" - philadelphia, pa - 19101 - center city - by name - by cuisine - by venue type, e.g. \"movie theater\" - philadelphia, pa - 19101 - center city select which day you would like to search events, or select"}, {"articleID": "2019012705_00077175_W", "names": {"J. Miller": ["Q18730558", "Q56239397"]}, "date": "2019-01-27", "url": "http://www.readingeagle.com/drivetime/article/readings-annual-automobile-exhibition-was-perfect-for-industry-eager-to-make-cars", "content": "Share Adjust font size: A A A Ron Devlin | Reporter/columnist 610-371-5030 Ron Devlin covers Kutztown and Brandywine Heights School Districts for the Reading Eagle. Follow Ron Friday January 25, 2019 04:30 PM Reading's Annual Automobile Exhibition was perfect for industry eager to make cars Reading auto dealers had their motors revving full speed when the eight-day-long Third Annual Automobile Exhibition opened in the Bechtel Building at Fourth and Penn streets on Feb. 22, 1919, 100 years ago next month. Written by Ron Devlin Reading auto dealers had their motors revving full speed when the eight-day-long Third Annual Automobile Exhibition opened in the Bechtel Building at Fourth and Penn streets on Feb. 22, 1919, 100 years ago next month. World War I had ended three months earlier, and manufacturers and dealers were gearing up for returning soldiers. \"From four years of world-shattering war, with its consequent financial and economic disasters, the motor car emerges bigger, stronger, more useful and more appreciated than ever before,\" said a show advertisement in the Reading Times on Feb. 24, 1919. \"It comes now to the world in all its glory, with all the people bowing in acknowledgement to its achievements.\" The automobile industry contributed more than $600 million in munitions to the war effort, and was eager to get back to making cars. A shortage of 700,000 units was forecast, primarily because of shortages of steel and manpower during the war. The war had a positive effect on the development of the truck, the industry reported. French generals credited the versatility of trucks in delivering supplies and munitions to the battlefield with playing a critical role in winning the war. Schwartz Motor Truck Co., which built trucks at Pearl and Chestnut streets in Reading, promised better service and a complete line of parts in a Times ad. Industry development The Reading show committee reflected the broad development of the industry in Berks County. H.O. Keller of Reading Automobile Co. was president. Others included H. B. Schwartz of Schwartz Motor Co., A. N. Kline of Studebaker Co., H. G. Lutz of Fisk Tires and W. <mark>J.</mark> Memmert of Taylor Motor Garage Co.. America was undergoing major social and cultural change in post-World War I. Women, who would gain the right to vote with the ratification of the 19th Amendment to the U.S. Constitution in August 1920, were behind the steering wheel in increasing numbers in 1919. \"Men must drive cars built for women,\" a Times story said. \"Men's pretense that the motor car is an intricate piece of machinery that a mere woman's untechnical mind can't understand is gone forever.\" Cars exhibited at the Reading show reflected the broader social change. They were more stylish, powerful and affordable. The Chandler, available at <mark>J. Miller</mark> Kalbach Co. in Reading, offered six body styles ranging in price from $1,795 to $3,095. \"Gracefully designed, splendidly furnished and upholstered, roomy and comfortable, it is a car of exceptional refinement,\" its ad bragged. Converted into headquarters Overland Harper Co had taken over the former Rajah Temple in the 500 block of Franklin Street and converted it into headquarters for sale of the Overland and Willys-Knight motor cars. The Daniels 8, built in Reading and sold by Reading Automobile Co., was featured at the show. Characterized as a distinguished luxury car with \"a little more power than you'll ever need,\" it was the brainchild of George E. Daniels. He would become the first president of General Motors and general manager of Oakland and Locomobile cars. The Standard 8 Hupmobile, available at C.C. Snyder in Reading, bragged that its two-speed sliding gear transmission would deliver \"no shifting of gears in traffic or on hills.\" Built with Standard Steel, is sold at a \"remarkable\" price of $2,750. Barbey Automobile Co. at Third and Spruce, \"the service station with a conscience,\" sold Exide batteries that were standard equipment in Cadillac, Pierce-Arrow, Hudson and Buick autos. Heydt Motor Car Co. would exhibited Hudson and Essex cars, seen in Reading for the first time. The 35 car and 11 truck models, which had economy to luxury price tags, were illuminated by large red, white and blue electric globes. The name of each car was displayed on the globe. The Specht Orchestra and Dusenberry's Jazz Band provided entertainment to the thousands who visited the show. The Reading Automobile Dealers Association, show sponsors, said it reflected all that had been learned in car building to date. \"The Reading show reflects what has been accomplished,\" an association ad in the Times said, \"notwithstanding the fact that the resources of the automobile industry have been diverted in the last few years to help winning the war.\" Contact Ron Devlin: 610-371-5030 or rdevlin @ readingeagle.com. Ron Devlin | Reporter/columnist 610-371-5030 Ron Devlin covers Kutztown and Brandywine Heights School Districts for the Reading Eagle. Follow Ron Share this article Trending Stories Full bellies and warm hearts on Penn Street Couple meets, later marries at mall Berks County real estate transactions for January 27, 2019 Writing for kids isn't simple Maroon 5's PJ Morton on Super Bowl and Grammy noms What's got you wondering \"what's that about?\" in the Berks County area? Ask us your burning questions and we'll investigate. Please note that questions may be edited for clarity or brevity. More Drive Stories"}]