[{"articleID": "2018042210_00190108_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-04-22", "url": "http://abc7.com/presidents-trump-macron-solidify-political-bromance-with-state-visit/3377883/", "content": "share tweet share email Presidents Trump, Macron solidify political bromance with state visit SHARE: share tweet share email SHARE share tweet share email ABCNews JORDYN PHELPS Sunday, April 22, 2018 03:43 AM Their relationship began with a show of machismo--an extended, white-knuckle handshake on their first meeting last year in Belgium. Emmanuel Macron had reportedly studied <mark>Donald Trump</mark>'s style of domineering power-grabbing handshakes, apparently prepared to avoid being outdone by his counterpart. Instead, it was President Trump who at one point in the 5-second-long handshake attempted to withdraw his hand from Macron's firm grasp. The maneuver marked the start of what has become a close partnership between the two leaders, who recently joined forces along with the United Kingdom to strike Syria earlier this month. \"It's no secret that President Trump and President Macron enjoy a good working relationship. I may say a close personal relationship,\" a senior administration official said in a briefing with reporters. President Macron has already feted Trump in grand style, inviting him to be his guest of honor at France's elaborate Bastille Day celebrations last summer. The president and first lady dined with Macron and his wife at the Eiffel Tower and sat side-by-side as French military tanks, planes and troops rolled down the Champs-Elysee in the elaborate military parade. The event so inspired Trump that he has since called on the Pentagon to look into organizing a military parade in the United States. That parade is now set to take place on Veterans Day. By extending an invitation to host Macron for a state visit in the United States, Trump is in many ways returning the favor and celebrating the deeply-rooted historical ties between the two countries and marking the 100th anniversary of the end of World War I. This will be the president and first lady's first time hosting a foreign leader to the full ceremonial honors of a state visit and sends a symbolic message about the value Trump places on his close ties with the French president. \"This will be a visit of symbolism of the strength and history of the U.S.-French relationship,\" says Heather A. Conley, senior vice president for the Center for Strategic and International Studies. \"It will be more symbolism than substance .\" The events When Macron arrives in Washington on Monday for a three-day visit, he and his wife will stay at Blair House, the presidential guest house, and will dine privately with the president and first lady at George Washington's Mount Vernon home and pay a visit to the first president's tomb. \"President Trump is eager to host the Macrons for this special event, as he remembers fondly the dinner the couples shared together in the Eiffel tower on the eve of Bastille day last July,\" a senior administration official said. President Trump will officially welcome Macron to the White House on Tuesday with an elaborate welcome ceremony on its South Lawn, complete with honor guards and marching bands. They are scheduled to engage in bilateral meetings and partake in a joint news conference. Macron will also dine with Vice President Mike Pence at the State Department for a luncheon that is traditionally hosted by the Secretary of State, and visit the tomb of the unknown soldier. The day will conclude with a formal white-tie state dinner that has been in the works for several months at the personal direction of First Lady Melania Trump. Anita McBride, who served as chief of staff to First Lady Laura Bush, said the dinner will be a chance for the first lady to showcase her skills as a hostess. McBride predicted that Melania Trump has put a keen interest in creating an elegant evening. \"Mrs. Trump wants her guests to have a wonderful, sensory experience. The flowers and lighting in the room. She pays great attention to detail. It's really a chance for her to show how they entertain,\" McBride said. The White House is closely guarding the invite list, with plans to only release the names of the invitees after the final guest has arrived for the evening, which is sure to include both French and American dignitaries. But the guest list is one of the most important and trickiest matters to navigate--to strike the right balance and set the desired tone. Several offices and departments are involved in the process, with recommendations flowing in from the State Department, the Office of Public Liaison--which largely manages the White House's relationship with outside groups--and the offices of Cabinet Affairs and legislative affairs, McBride said. But the most important suggestions of all, she added, are those that come from the first couple. \"The most important list of all is who the first family wants to have there,\" said McBride. As for what's on the menu, the White House has yet to reveal what will be served but says the first lady has personally selected and taste-tested the dishes. While some modern state dinners have been hosted in a large event tent on the South Lawn of the White House, Tuesday's dinner will be in its State Dining Room. Stephanie Grisham, a spokeswoman for Melania Trump, says the setting is a \"nod to tradition and the historic relationship between the two countries .\" She added that there has been an effort on the part of the first lady's office \"to keep things elegant and more traditional than perhaps some of the last few state dinners .\" The live musical accompaniment for the evening will be \"classical and traditional,\" says Grisham. She suggested the entertainment will be a departure from the modern artists who made a splash at some of former President Obama's state dinners, which included live performances from A-list artists like Gwen Stefani and Beyonce Knowles. On Wednesday, Macron will deliver an address to a joint session of Congress, which Elysée Palace says will be a \"very important moment\" of Macron's visit. \"The French president will introduce himself to the American people, will send a message of friendship, of respect and affection toward the American nation,\" the Elysée Palace says. \"Our common history is incredible, a history of friendship that started 250 years ago. The central message that we will see at the Congress will be: Do you want to continue to write history together?\" Macron will also make a public address at George Washington University, and hold his own news conference at the conclusion of his U.S. visit. The Issues Amid all the pomp and circumstance of the ceremonial visit, there will also be the work of high-level diplomacy between the two leaders and their delegations. Macron has described his relationship with Trump as \"extremely direct and frank,\" telling the BBC in January: \"Sometimes I manage to convince him, and sometimes I fail .\" Macron appeared to test the limits of that frankness when he seemed to take credit recently for convincing President Trump not to pull U.S. troops out of Syria in the immediate future; Trump had said days before that the U.S. mission in Syria was nearly complete and that troops would be coming home \"very soon .\" \"We convinced him that it was necessary to stay there long-term,\" Macron said during an extended televised interview on Sunday. The White House then came out to refute Macron's assertion. \"The U.S. mission has not changed--the President has been clear that he wants U.S. forces to come home as quickly as possible,\" White House Press Secretary Sarah Huckabee Sanders said. And Macron himself also sought to walk back the comments, later attempting to clarify: \"I did not say that either the U.S. or France will remain militarily engaged in the long term in Syria .\" After the joint strike earlier this month and the public fissure around Macron's comments on the duration of a U.S. military commitment, one issue to watch will be whether the two countries come to any sort of shared understanding around next steps for war-torn Syria. A senior administration official said the leaders would \"discuss probably in some detail the way forward on Syria\" but said it's \"difficult to say right now\" how far those discussions will go. \"The question around Syria would be,\" Now what?' \"says Conley .\" President Macron very much wants to see a diplomatic process come through. He wants more U.S. engagement...[and] wants to talk to President Trump about what the U.S. policy towards Syria will be at the same moment where President Trump has publicly announced that his desire is to remove U.S. forces from Syria. \"Conley added that it will be interesting to see how the\" leaders comment publicly on their two positions on Syria and a diplomatic process moving forward. \"While the Elysée Palace has made clear they don't have high expectations for producing substantive agreements, the French delegation will try their hand at the art of persuasion in presenting the French position on issues of disagreement, namely the Iran nuclear deal, trade, and the Paris Climate Accord .\" We hope that this State visit will be useful and allow us to present our arguments, to convince and move forward. But on these three topics, we do not expect to obtain results, make deals [or] agreements during the visit. For example, on the Iran deal, we know that President Trump has not made a decision yet. We do not think there will be a diplomatic breakthrough during the State visit, \"the Elysée Palace said. A senior administration official said the Iran nuclear deal is sure to be a\" a major topic of discussion \"during the meetings but said that any decisions as it relates to the United States' continuing participation in the agreement would come in mid-May, when the president faces a deadline on whether to continue to keep the U.S. a party to the deal. Even as both U.S. and French officials say there's no expectation that a final decision will be reached on the Iran deal during the visit, Conley says Macron is uniquely suited among European leaders to make potential headway with Trump as he seeks to convince him not to withdraw the United States from the pact .\" This visit will be dubbed the \"Save the Iran Nuclear Agreement' trip,\" Conley said. \"The French have historically been the toughest EU of the three--that's U.K., France, and Germany--on being tough on Iran, getting the toughest compliance possible. So in some ways, President Macron is the best to provide the president with...the toughness that he wants about and towards Iran, but trying to do so in a way that preserves the Iran nuclear agreement .\" But as it relates to the Paris Climate Accord--the historic pact on climate change to which President Obama had previously committed the United States and has since been adopted by every other country in the world--the Elysée Palace says President Macron will refrain from trying to convince President Trump to get back on board with the agreement. \"We are not trying to get the United States back into the Paris Accord,\" the Elysée Palace said. \"What we are doing is describing the consequences of climate change. We continue scientific and economic cooperation with the U.S.. This goes beyond the U.S. Federal state; working with American cities, NGOs, companies. By working collectively, the United States will reach their objective of decreasing gas emissions. On the political aspect, it can show the Trump administration the positive consequences of actions to fight climate change in terms of job creations and innovation .\" Asked if Paris Climate Accord is set to be discussed, a senior administration official said, \"I don't have any insight on that for you\" and said the topic is not on the agenda \"unless it's brought up by President Macron .\" Related Topics: abc news national SHARE: share tweet share email (Copyright © 2018 ABC News Internet Ventures .) Top Stories 2 brothers found inside car in Burbank died of gunshot wounds, coroner says Verne Troyer, actor in \"Austin Powers' franchise, dies at 49 Compton shooting: Mother killed, young daughter wounded Mini pony led police on short chase in Texas White Sox player in critical condition following brain hemorrhage Local woman is a mother figure for thousands of orphaned kids Powerhouse influencer creates\" sisterhood \"digital conference for Latinas Brush fire burns at least 21 acres in Montebello Show More April 21 is last day to use Toys R Us gift cards Compton, Willowbrook residents dealing with\" contaminated' water Teacher asked 8th-graders to list positives of slavery Family, friends remember 2 killed in Studio City fire LAPD sets up checkpoints to keep people safe on 420 More News"}, {"articleID": "2018101512_00316813_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}, "date": "2018-10-15", "url": "http://www.thisislocallondon.co.uk/news/national/16983838.sturgeon-warns-mps-cobbled-together-brexit-deal-would-be-dereliction-of-duty/", "content": "Nicola Sturgeon 0 comments MPs who help <mark>Theresa May</mark> get a \"cobbled-together\" Brexit deal through Parliament would be guilty of a \"dereliction of duty\" , Nicola Sturgeon has warned. The Scottish First Minister used a speech in London on Monday to urge Westminster politicians to vote down any compromise deal the Prime Minister can strike with Brussels. She accused the UK Government of \"threatening us with fire, to make us choose the frying pan\" , and argued that any deal that is presented to the Commons was likely to be deliberately vague about the future relationship and damaging to the UK's interests. Ms Sturgeon told an audience at the Royal Society of Arts that voting down the Prime Minister's proposal would allow a deal keeping the UK in the customs union and single market--which the SNP wants--to be presented instead. Voting against \"a bad or blindfold Brexit\" was not a vote for no-deal, she argued, but \"the only chance the House of Commons will have to reset these negotiations and think again before it is too late\". She said: \"As the crucial vote looms closer, it is also time for individual members of the House of Commons to consider what compromises they see as justified--and which are not--if they are to serve their constituents, and the wider public interest .\" If they do that, I believe that a commonsense outcome could yet be found. \"Ms Sturgeon has said the SNP's strong preference is to remain in the EU (Jane Barlow/PA) She added:\" For MPs to support a bad or blindfold Brexit--a cobbled-together withdrawal agreement and a vague statement about our future relationship--would, in my view, be a dereliction of duty. \"In the June 2016 referendum, Scotland voted by 62% to 38% in favour of remaining in the EU. As part of her speech, the First Minister presented a new paper from the Scottish Government--Scotland's Place in Europe: Our Way Forward. It noted that the\" core \"of the proposal was the same as it set out in December 2016. Writing in her foreword to the paper, Ms Sturgeon said:\" The Scottish Government, in line with the overwhelming vote for Remain in Scotland, supports continued EU Membership. Remaining in the EU continues to be our strong preference. \"Nevertheless in December 2016 we set out a compromise plan to keep Scotland and the UK in the European Single Market and Customs Union to limit the damage of Brexit as much as possible .\" It is therefore simply incorrect for the Prime Minister to say that there is no alternative to Chequers. \"In fact, the UK Government's position is increasingly absurd--insisting on pursuing proposals they have been told will not work while rejecting a plan that will .\" She adds: \"With crucial decisions coming up over the next few weeks and months at EU level--and in the House of Commons, where the UK Government must seek the approval of the UK Parliament--it is vital to break the deadlock .\" For the Prime Minister and the UK Government it is time to face reality. For MPs at Westminster it is time to come together in a commonsense coalition to minimise the Brexit damage. \"A spokesman for the Department for Exiting the European Union (Dexeu) said:\" We will have an ambitious course outside of the EU that enhances our prosperity and security and that genuinely works for everyone across the UK. \"We have put forward a precise and credible plan for our future relationship with the EU and look forward to continuing to engage with the EU Commission on our proposals .\" 0 comments"}, {"articleID": "2016052005_00860440_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"], "Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"], "J. Cole": ["Q204018", "Q56604513", "Q6105158"], "Rick Ross": ["Q297831", "Q431969", "Q606032"], "Anthony Anderson": ["Q16148910", "Q19938265", "Q313918", "Q4771995", "Q4771998"], "Kevin Hart": ["Q1740168", "Q3195712", "Q57439639", "Q618352", "Q6396452"], "Erica Campbell": ["Q22338517", "Q242883"], "Michelle Williams": ["Q156796", "Q229153", "Q23893381"], "Chris Robinson": ["Q1077712", "Q1077723", "Q3675561", "Q5107898", "Q5107900", "Q5107901", "Q5107905"], "Chris Paul": ["Q1077636", "Q46040", "Q56754195"], "Stephen Curry": ["Q352159", "Q43981708", "Q5573861"]}, "date": "2015-06-29", "url": "http://www.justjared.com/2015/06/28/bet-awards-2015-complete-winners-list/", "content": "The 2015 BET Awards just wrapped up and it was a night filled with amazing music and performances. Big winners of the night include Nicki Minaj, <mark>Chris Brown</mark>, and more! Janet Jackson and Smokey Robinson were both honored during the show, and tons of celebs took the stage to perform throughout the evening. In case you missed it, check out JustJared.com \"s full coverage of the BET Awards right here! Click inside to see the full list of winner' s from the 2015 BET Awards...Best New Artist Dej Loaf Fetty Wap Rae Sremmurd <mark>Sam Smith</mark>--WINNER Tinashe Best Female Hip-Hop Artist Azealia Banks Nicki Minaj--WINNER Tink Iggy Azalea Trina Dej Loaf Best Male Hip-Hop Artist <mark>J. Cole</mark> Drake Common Kendrick Lamar--WINNER Big Sean Wale Best Female R & B/Pop Artist Beyoncé--WINNER Janelle Monáe Jhené Aiko Ciara Rihanna K. Michelle Best Male R & B/Pop Artist The Weeknd John Legend Trey Songz Usher August Alsina <mark>Chris Brown</mark>--WINNER Best Group A $AP Mob Migos Rae Sremmurd--WINNER Rich Gang Young Money Jodeci Best Collaboration <mark>Chris Brown</mark>--\"Loyal (feat. Lil Wayne & Tyga)\" Big Sean--\"I Don't F ** k with You (feat. E-40)\" August Alsina--\"No Love (Remix) [feat. Nicki Minaj]\" Common & John Legend--\"Glory\" --WINNER <mark>Chris Brown</mark>--\"New Flame (feat. Usher & <mark>Rick Ross</mark>)\" Mark Ronson--\"Uptown Funk (feat. Bruno Mars)\" Best Actress Gabrielle Union Kerry Washington Taraji P. Henson--WINNER Tracee Ellis Ross Viola Davis Best Actor <mark>Anthony Anderson</mark> Idris Elba Jussie Smollett <mark>Kevin Hart</mark> Terrence Howard--WINNER Youngstars Award Jacob Latimore Jaden Smith Mo’Ne Davis--WINNER Quevenzhané Wallis Zendaya Best Movie Annie Beyond the Lights Selma--WINNER Think Like a Man Too Top Five Best Gospel Artist Deitrick Haddon <mark>Erica Campbell</mark> Fred Hammond Lecrae--WINNER Mali Music <mark>Michelle Williams</mark> Video of the Year Beyoncé--\"7/11 ″--WINNER <mark>Chris Brown</mark>--\"New Flame (feat. Usher & <mark>Rick Ross</mark>)\" <mark>Chris Brown</mark>--\"Loyal (feat. Lil Wayne & Tyga)\" Big Sean--\"I Don't F ** k with You (feat. E-40)\" Nicki Minaj--\"Anaconda\" Common & John Legend--\"Glory\" Video Director of the Year Benny Boom Beyoncé, Ed Burke & Todd Tourso--WINNER <mark>Chris Robinson</mark> Fatima Robinson Hype Williams Sportswoman of the Year Brittney Griner Candace Parker Serena Williams Skylar Diggins Venus Williams Sportsman of the Year <mark>Chris Paul</mark> Floyd Mayweather, Jr.. Lebron James Marshawn Lynch <mark>Stephen Curry</mark>--WINNER Coca-Cola Viewers' Choice Award Beyoncé--\"7/11 ″ Dej Loaf--\"Try Me\" Kendrick Lamar--\"i\" Nicki Minaj--\"Only feat. Drake, Lil Wayne & <mark>Chris Brown</mark>)\" --WINNER Rae Sremmurd--\"Throw Sum Mo (feat. Nicki Minaj & Young Thug)\" The Weeknd--\"Earned It\" Centric Award Avery Sunshine--\"Call My Name\" Jazmine Sullivan--\"Dumb (feat. Meek Mill)\" Mark Ronson--\"Uptown Funk (feat. Bruno Mars)\" <mark>Sam Smith</mark>--\"Stay with Me (feat. Mary J. Blige)\" The Weeknd--\"Earned It\" - WINNER"}, {"articleID": "2015081806_00079543_W", "names": {"Ram Chandra Yadav": ["Q14643701", "Q44820740"], "Nitish Kumar": ["Q122304", "Q7041330"]}, "date": "2015-08-18", "url": "http://economictimes.indiatimes.com/articleshow/48524567.cms", "content": "Bihar polls: SP to fight polls with or without mahagathbandhan By Vithika Salomi, TNN | 18 Aug, 2015, 11.55 AM IST Post a Comment READ MORE ON & raquo; Samajwadi Party (SP) | samajwadi party | RJD president | <mark>Ram Chandra Yadav</mark> | <mark>Nitish Kumar</mark> | Nationalist Congress Party (NCP) | Kiranmoy Nanda <mark>Nitish</mark>, Lalu and Congress general secretary C P Joshi on August 12 announced the JD (U) and RJD would contest from 100 constituencies each. ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! PATNA: The rift in the JD (U) and RJD-led grand alliance did not seem to end with the Samajwadi Party (SP), which has not been allotted any seat by the alliance, declaring on Monday it would \"definitely' contest the coming Bihar election with or without the alliance. Much to the disappointment of CM <mark>Nitish Kumar</mark> and RJD president Lalu Prasad who have been trying to bring non-NDA parties on one platform, the Nationalist Congress Party (NCP) has also threatened to quit the grand alliance if the party is not given at least 12 seats. <mark>Nitish</mark>, Lalu and Congress general secretary C P Joshi on August 12 announced the JD (U) and RJD would contest from 100 constituencies each while Congress would fight for 40 seats. Three seats were left for NCP. At least 51 SP functionaries sat on indefinite hunger strike on August 14, demanding at least 17 of the 243 assembly seats from the alliance leadership. They called off their fast on Monday evening after SP national vice-president and Rajya Sabha MP Kiranmoy Nanda assured them that the party would contest the polls and that he was in talks with Lalu and <mark>Nitish</mark> over the issue .\" The party's aim is to defeat BJP in Bihar. I have already talked to Lalu-ji and he has agreed to discuss the issue. I will also talk to Nitish-ji, \"Nanda told TOI and added the SP would definitely contest the Bihar assembly polls. State SP president <mark>Ram Chandra Yadav</mark> said the party's parliamentary board would take the final decision on the matter .\" If the alliance leadership does not give us respectable number of seats, we will contest without the alliance, \"he said, claiming the party has 2 to 7% vote share in Bihar. However, CM <mark>Nitish Kumar</mark> on Monday ruled out any scope for redistribution of seats. He said the onus was on the NCP to decide whether they wanted to be a part of the alliance or not .\" The seats have already been distributed among the allies and there is no need to revise it, \"said <mark>Nitish</mark>, who is the CM candidate of the alliance. Stay on top of business news with The Economic Times App. Download it Now!"}, {"articleID": "2019120505_00110907_W", "names": {"Elizabeth Wilson": ["Q28835124", "Q43392923", "Q43393617", "Q43393858", "Q43393983", "Q43394943", "Q43394992", "Q43395968", "Q944952"]}, "date": "2019-12-05", "url": "https://www.sunshinecoastdaily.com.au/news/former-scouts-leader-guilty-over-brutal-child-porn/3895430/", "content": "Scout leader Daniel Leslie Cooper pleaded guilty to eight offences involving the possession, transmission and solicitation of more than 25,000 horrific child abuse images and videos. Crime Twisted Scout: \"Baby pics are so hot. Love brutal' by Vanessa Marsh 5th Dec 2019 2:52 PM premium_icon Subscriber only 0 A FORMER Queensland Scouts leader has faced court over his sickening and\" highly depraved \"obsession with child abuse material that a prosecutor described as some of the worst examples ever seen. Deception Bay man Daniel Leslie Cooper today pleaded guilty to eight offences involving the possession, transmission and solicitation of more than 25,000 horrific child abuse images and videos using covert online messaging services. Crown Prosecutor Krista Breckweg told the Brisbane Supreme Court that Cooper, a former Scouts leader, had sent and received thousands of appalling images and videos showing the sexual abuse and torture of children including newborn babies and toddlers. Scout leader Daniel Leslie Cooper pleaded guilty to eight offences involving the possession, transmission and solicitation of more than 25,000 horrific child abuse images and videos .\" Underpinning it all is this sense of absolute contempt, degradation, of dehumanising them, \"she said .\" It is unusual because it is highly depraved...it is some of the worst examples of offending of this type in terms of child pornography. \"Ms Breckweg said in the sickening exchanges between Cooper and other offenders online in 2016 and 2017, he discussed his love of\" babies and brutal \"and showed interest in incest, bestiality, rape and torture of children as young as newborn babies .\" I love everything sick, \"Cooper told one user during and exchange in which he spoke of his interest in sexual images of little children saying\" I just love them tiny \",\" baby pics are so hot \",\" love babies \",\" love brutal \". Ms Breckweg said the images found in Cooper's possession were\" highly depraved \"including pictures of dead and mutilated babies, newborns being sexually penetrated by adults and the torture of babies .\" This material demonstrates an extraordinary level of debasement and cruelty, \"Ms Breckweg said. Justice <mark>Elizabeth Wilson</mark> will sentence Cooper next week. 0 child exploiation material Read More Login to follow child sex abuse Read More Login to follow court Read More Login to follow crime Read More Login to follow daniel leslie cooper Read More Login to follow editors picks Read More Login to follow scouts queensland Read More Login to follow child exploiation material child sex abuse court crime daniel leslie cooper editors picks scouts queensland"}, {"articleID": "2017061009_00728691_W", "names": {"Joshua Smith": ["Q15454606", "Q15909291", "Q16223459", "Q19996391", "Q30122145", "Q42565664", "Q6290209"], "Scottie Thompson": ["Q21064560", "Q437912"]}, "date": "2017-06-10", "url": "http://journal.com.ph/sports/kings-play-texters", "content": "FOR finishing off their quarterfinal rival right away, Barangay Ginebra and coach Tim Cone also got time to prepare and some luxury to scout their potential semifinal opponent. Obviously Cone did watch the three episodes of the TNT-Meralco quarterfinal series and got something to focus on in the semifinals of the PBA Commissioner's Cup. \"The TnT/Meralco series was an epic battle, but it presents a very interesting matchup for us,\" said Cone, whose Gin Kings will play the Tropang Texters in the best-of-5 semifinal series starting today at the Mall of Asia Arena. Cone is visibly impressed with the way the Texters executed what he called their \"in and out game' and import <mark>Joshua Smith</mark>'s flexibility on both ends of the court. <mark>Smith</mark> actually averaged 22.2 points and 24 rebounds as he stood at the forefront of the Tropang Texters who beat Meralco in three games in the quarterfinals. Needless to say, the Gin Kings need to put more premium on defending what Cone describes as a\" massive' TNT import. \"We're going to have to find ways to battle their in and out game with their massive import,\" said Cone, who is looking to bring the Gin Kings to their third straight finals appearance under his watch. \"It will be tough for us to defend. We have problems dealing with huge import, and we have to figure that out,\" added Cone. On the other hand, the Texters will have to find ways to keep pace with the Gin Kings' quickness and Cone himself is saying that. \"They, of course, will have to find ways to stop our quickness and like I said, (the series is) very interesting indeed,\" said Cone, who is counting on import Justin Brownlee, Japeth Aguilar and Joe Devance, <mark>Scottie Thompson</mark> who all run faster. One interesting matchup that's expected to highlight the 6:30 p.m. opener of their brief series is between L.A. Tenorio of Ginebra and TNT's Jayson Castro. The Gin Kings asserted their might as the playoff top seed and crushed Globalport, 96-85, to advance to the semis Tuesday in a game marred by the ejection of Batang Pier's top gunner Terrence Romeo. The other half of the Final Four is between San Miguel Beer and Star Hotshots who started their separate series last night. Tweet Read 0"}, {"articleID": "2020030212_00011804_W", "names": {"Oleksandr Zinchenko": ["Q1803666", "Q19636859"], "Claudio Bravo": ["Q313161", "Q491787", "Q56239393", "Q58372288"]}, "date": "2020-03-02", "url": "http://andoveradvertiser.co.uk/sport/national/18274254.zinchenko-already-looking-ahead-manchester-citys-latest-cup-success/", "content": "Sport National Sport <mark>Zinchenko</mark> already looking ahead after Manchester City's latest cup success By Press Association 2020 <mark>Oleksandr Zinchenko</mark> helped Manchester City to another trophy success 0 comment <mark>Oleksandr Zinchenko</mark> says Manchester City are already thinking about their next challenge after getting their hands on the Carabao Cup yet again. City won the competition for a third year in succession, and a fifth time in seven years, as they beat Aston Villa 2-1 in a hard-fought final at Wembley on Sunday. It was also the 11th major trophy of the modern City era, the first of which was the FA Cup triumph of 2011, and they have their sights set on more. Our 6 ️ ⃣ th consecutive English trophy!?? ⚽ ️ @ QNetOfficial?? #ManCity #CarabaoCup pic.twitter.com/5SjNPP4dTp--Manchester City (@ ManCity) March 1, 2020 A third successive Premier League title looks beyond them but the FA Cup and Champions League are still very much on the radar. Left-back <mark>Zinchenko</mark> said: \"It is so important for us to win every title. We are so happy. We have an unbelievable squad and we fight for all titles .\" So everyone is happy, but we should think about the next game because we have one or two other challenges. We want to fight. \"We have to show our class in our performance every single game and then at the end of the season we are going to speak about if it was a good season for us or if it was successful or not. The Captain. The Man of the Match. #EFL #CarabaoCup #CarabaoCupFinal #ManCity #MCFC pic.twitter.com/eYtRxTJY3t--PepTeam (@ PepTeam) March 1, 2020\" We have Champions League and FA Cup as well. We are going to fight for these titles and see what happens. Everyone is focused on the next game and that is it. \"City are back in action on Wednesday as they travel to Sheffield Wednesday in the FA Cup fifth round. They then have Premier League games against Manchester United and Burnley before their Champions League quest resumes with the second leg of their last-16 tie against Real Madrid at the Etihad Stadium on March 17. City hold a 2-1 aggregate lead from the first leg at the Bernabeu last week. City had to earn their latest success as relegation-threatened Villa fought back after conceding to Sergio Aguero and Rodri in the first half an hour. Mbwana Samatta pulled one back and it took a brilliant late save from <mark>Claudio Bravo</mark>, tipping a Bjorn Engels header onto a post, to prevent the match going to extra time .???? Otro título más?????? otro día mágico en mi memoria. Gracias a todos por sus mensajes???????? ✌?? @ ManCity #Wembley #CarabaoCupFinal???? pic.twitter.com/tUpdWks8Td--<mark>Claudio Bravo</mark> Muñoz (@ C1audioBravo) March 1, 2020 It was not the first time <mark>Bravo</mark> had excelled in the competition. Twice in the 2017-18 run he was the hero in penalty shootouts, against Wolves and Leicester, and after missing most of last season through injury, he has played throughout this year's challenge. <mark>Zinchenko</mark> said:\" One year ago someone said we have to change the name of the cup, so not Carabao Cup, we should say it is the <mark>Claudio Bravo</mark> Cup. \"He did it again for us. Thanks a lot to him. Everyone was talking about him in the dressing room .\" It was a battle. Big respect to Aston Villa. They were well organised defensively and it was not too easy. \"0 comment"}, {"articleID": "2010012017_00172347_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2010-01-20", "url": "http://familyguy.wikia.com/index.php?title=The_Kiss_Seen_Around_the_World/References&diff=55295&oldid=prev", "content": "the kiss seen around the world/references * neil asks a hologram named al, \"why haven't i leaped?,\" a reference to the science fiction show \"[[quantum leap]]\" , in which a character travels through time and cannot leave a certain period until he sets events \"right .\" * neil asks a hologram named al, \"why haven't i leaped?,\" a reference to the science fiction show \"[[quantum leap]]\" , in which a character travels through time and cannot leave a certain period until he sets events \"right .\" * when lois finds stewie's bully tied up, he says, \"we're playing house .\" lois asks why the boy is tied up, and stewie says \"[roman polanski]'s house .\" this could be a reference to the director being accused of child rape, his trademark dark, psychological style or the fact that the horrific [[charles manson | manson murders]], in which polanski's wife, actress [sharon tate], was killed, occurred in polanski's <mark>beverly hills</mark> residence. * when lois finds stewie's bully tied up, he says, \"we're playing house .\" lois asks why the boy is tied up, and stewie says \"[roman polanski]'s house .\" this could be a reference to the director being accused of child rape, his trademark dark, psychological style or the fact that the horrific [[charles manson | manson murders]], in which polanski's wife, actress [sharon tate], was killed, occurred in polanski's <mark>beverly hills</mark> residence. * while brian catches meg kissing the television, tom tucker can faintly be heard saying \"more news from the white house today on why of the united states | president]] [[george w. bush | bush]] stuck his finger in an electric socket. the president responded,' [[dick cheney]] told me that's where leprechauns hide their gold .'\" * while brian catches meg kissing the television, tom tucker can faintly be heard saying \"more news from the white house today on why president [[george w. bush | bush]] stuck his finger in an electric socket. the president responded,' [[dick cheney]] told me that's where leprechauns hide their gold .'\" * when stewie asks the bully how old he is and the bully replies, \"seven\" , stewie says, \"my, you're practically a lady .\" this is a reference to [[the sound of music (film) | the sound of music]], when maria is introduced to the children. * when stewie asks the bully how old he is and the bully replies, \"seven\" , stewie says, \"my, you're practically a lady .\" this is a reference to [[the sound of music (film) | the sound of music]], when maria is introduced to the children. * the plot of the episode may be a reference to the 1982 teen sex comedy [\"the joy of sex\" ]. this film has a sub-plot about a virginal female high-school student with a crush on an anchorman. she invites the anchorman to a motel room to seduce him, but at the last moment, realizes the anchorman is not a nice person and decides not to have sex with him. * the plot of the episode may be a reference to the 1982 teen sex comedy [\"the joy of sex\" ]. this film has a sub-plot about a virginal female high-school student with a crush on an anchorman. she invites the anchorman to a motel room to seduce him, but at the last moment, realizes the anchorman is not a nice person and decides not to have sex with him. the title refers to the phrase \"shot heard\" round the world, \"used to refer to a number of significant historical events. the man who calls peter a\" phony \"and later levels the charge at neil is referred to in the credits as\" the toy store where the griffins shop is called \"toys r overpriced,\" a parody of toys \"r' us. brian lifts up a copy of the game stratego to find actor steve guttenberg is hiding behind the chinese checkers. both actors have had few high-profile roles in their later careers. while pretending to play the keyboard, peter says\" i'm [1] yanni sans the attitude, \"referring to the new age star who is often criticized as pretentious. stewie is startled by a hasbro perfection game. star trek episode\" arena. \"several of his statements are incorrect. it is episode #19 of the series rather than #18. also, actor william shatner did not use a stunt double in the episode. neil and his teacher briefly argue about who is the\" superior officer \": captain star trek: the next generation. neil passes meg a note reading\" i want you \"and points at her while dressed as uncle sam. this is a reference to world war i and world war ii military recruitment posters. mr. lazenby is arrested for teaching that evolution was put into motion when buck rogers in the 25th century,\" used a time machine, went back and ejaculated into the primordial ooze. \"it is a possible reference to john t. scopes. tom tucker tells the high school students\" i pity the fool who does drugs, \"a reference to the mr. t. the scene in which meg fantasizes about tom tucker emerging from a swimming pool and removing his shirt with the cars song\" moving in stereo \"playing in the background mirrors the famous nude scene of fast times at ridgemont high. when meg screams,\" oh my god, i'm missing the news! \"peter replies\" we all miss the news, but huey lewis needs time to create and we all have to learn to be patient, \"referring to the rock band huey lewis and the news. while this episode was in production, the band had not released an album in six years. however, they released plan b four months before it aired. diane simmons says,\" in entertainment, mary tyler moore is 64 years old today, \"implying this scene in the episode took place december 29, 2000. dustin hoffman consists of sliced-together clips from his films peter jennings. the mass media murderer holds television journalist cbs's dan rather. peter videotapes a bag blowing in the wind and makes a speech about beauty and the serenity of life, like a character in the 1999 film american beauty (\"sometimes there's so much beauty in the world it makes my heart burst\" ), to which god says, \"it's just some trash blowing in the wind! do you have any idea how complicated your circulatory system is?\" neil asks a hologram named al, \"why haven't i leaped?,\" a reference to the science fiction show, in which a character travels through time and cannot leave a certain period until he sets events \"right .\" when lois finds stewie's bully tied up, he says, \"we're playing house .\" lois asks why the boy is tied up, and stewie says \"roman polanski's house .\" this could be a reference to the director being accused of child rape, his trademark dark, psychological style or the fact that the horrific sharon tate, was killed, occurred in polanski's <mark>beverly hills</mark> residence. while brian catches meg kissing the television, tom tucker can faintly be heard saying \"more news from the white house today on why president dick cheney told me that's where leprechauns hide their gold .'\" when stewie asks the bully how old he is and the bully replies, \"seven\" , stewie says, \"my, you're practically a lady .\" this is a reference to the plot of the episode may be a reference to the 1982 teen sex comedy"}, {"articleID": "2019050812_00172679_W", "names": {"Jill Scott": ["Q10896", "Q232592", "Q23661775"], "Ellen White": ["Q10911", "Q28233580"]}, "date": "2019-05-08", "url": "http://www.eveningtimes.co.uk/sport/national/17626050.izzy-christiansen-left-out-of-england-squad-for-womens-world-cup/", "content": "Izzy Christiansen left out of England squad for Women's World Cup By Press Association 2019 Izzy Christiansen, centre, will not be with England in France this summer 0 comment Izzy Christiansen has not been included in Phil Neville's England squad for this summer's Women's World Cup in France. The Lyon midfielder suffered a fractured fibula and ankle ligament damage in the 3-0 win over Japan at the SheBelieves Cup in early March and subsequently underwent surgery. The 27-year-old was aiming to be fit to feature at the World Cup, which starts on June 7, but her name was missing from the 23-player squad announced by the Football Association on Wednesday. We've been here before. But this time it's different. #BeReady / / #Lionesses pic.twitter.com/a0W9alJEwT--Lionesses (@ Lionesses) May 8, 2019 Forward Fran Kirby returns after missing the friendlies against Canada on April 5 and Spain four days later due to a knee problem. Captain Steph Houghton and goalkeeper Carly Telford, who withdrew ahead of the second of those games because of a groin issue and concussion respectively, are also back. Chelsea pair Kirby and Telford and Manchester City's Houghton have all played for their clubs since then. WHEN YOU GET THAT CALL.... WORLD CUP HERE I COME???????????????????????????? LETS GO #Lionesses ❤ ️ pic.twitter.com/7IicjQfnRX--Carly Telford (@ carlytelford1) May 8, 2019 Others not to have made the squad are Orlando Pride forward Chioma Ubogagu and Manchester City defender Gemma Bonner and goalkeeper Ellie Roebuck. Boss Neville said: \"This is a significant moment in our World Cup campaign and I want to congratulate all of the players in our squad .\" I must also thank those who just missed out for all of their efforts. We would not be in this position without them, they have played a big part in our World Cup journey and I know they will be our biggest supporters this summer. We dreamed it, and now we've done it?? Can't wait for this summer in France with the @ Lionesses?????????????? I'm so grateful to be a part of this team?????? #BeReady pic.twitter.com/q7lxL5MDwh--Leah Williamson (@ leahcwilliamson) May 8, 2019 \"Picking a squad is never easy but I believe in this group and I know they will be ready to help us perform at our very best at the finals .\" We know what we are capable of achieving and are determined to do all we can to be successful. We keep saying it but the hard work starts now and we are going to give it everything we have to make the nation proud. \"The members of the squad were announced one by one on the Lionesses Twitter feed on Wednesday via a series of videos featuring famous faces, starting with Houghton's inclusion being confirmed by FA president Prince William. Not a bad way of finding out your off to another @ FIFAWWC...WOW!???????????????? https: //t.co/zyzLtv8I4U--Steph Houghton MBE (@ stephhoughton2) May 8, 2019 The announcement for her club-mate Nikita Parris, the FWA Women's Footballer of the Year, was made by former England skipper David Beckham, and for PFA Women's Young Player of the Year Georgia Stanway, another City player, it was Raheem Sterling who did the honours. Actress Emma Watson, presenter James Corden plus singers Ellie Goulding and Olly Murs also made announcements. Parris and Stanway are among 11 players involved who will be taking part in their maiden World Cup. View this post on Instagram A big day today Congratulations @ nikitaparris17 @ lionesses and @ philipneville18 The whole country is behind you. #BeReady A post shared by David Beckham (@ davidbeckham) on May 8, 2019 at 2:00 am PDT The other 12 were part of the England squad that came third at the last World Cup, in Canada in 2015, under Neville's predecessor Mark Sampson. Two of that group, Karen Carney and <mark>Jill Scott</mark>, will be at a World Cup for a fourth time in France. England are in Group D alongside Scotland, who they face in their opener on June 9, Argentina and Japan. They have two more warm-up games prior to that, against Denmark at Walsall's Banks's Stadium on May 25 and New Zealand at Brighton's Amex Stadium a week later. After winning the invitational SheBelieves Cup for the first time in March, England subsequently lost to Canada 1-0, then beat Spain 2-1. England squad Goalkeepers: Karen Bardsley (Manchester City), Mary Earps (Wolfsburg), Carly Telford (Chelsea). Defenders: Millie Bright (Chelsea), Lucy Bronze (Lyon), Rachel Daly (Houston Dash), Alex Greenwood (Manchester United), Steph Houghton (Manchester City), Abbie McManus (Manchester City), Demi Stokes (Manchester City) Leah Williamson (Arsenal). Midfielders: Karen Carney (Chelsea), Jade Moore (Reading), <mark>Jill Scott</mark> (Manchester City), Lucy Staniforth (Birmingham), Georgia Stanway (Manchester City), Keira Walsh (Manchester City). Forwards: Toni Duggan (Barcelona), Fran Kirby (Chelsea), Beth Mead (Arsenal), Nikita Parris (Manchester City), Jodie Taylor (Seattle Reign), <mark>Ellen White</mark> (Birmingham). 0 comment"}, {"articleID": "2019061212_00150962_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-06-12", "url": "http://www.gamereactor.eu/?system=ps4&sid=d03e71169118b8cc95d0d5caba3f5137", "content": "PS4 We got our chance to take on the Wolves at E3, and along with some tactical buddies we got a taste of what Breakpoint is cooking. Preview The Sinking City is heading to Nintendo Switch later this year Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 13:01 One announcement that might have slipped you by last night is the news that the upcoming Lovecraftian horror-adventure is also heading to Nintendo's console. 0 We share our thoughts on Cyberpunk 2077's E3 demo Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 12:43 We got to see another slice of CDPR's sci-fi RPG and there are a few things to tell you about. 0 Watch Dogs Legion's NPCs: \"their lives don't turn off\" Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 12:09 We talked to game design lead Kent Hudson about characters, classes, and customisation in the next Watch Dogs. 0 Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 11:32 We talk all things Ghost Recon after getting our hands on the game at this year's E3. 0 Alien: Isolation is heading to the Switch Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 10:47 One of the surprise announcements of last night's Direct was the news that Creative Assembly's stellar sci-fi horror game is heading to Nintendo's console. 0 Written by Kerry-Lee Copsey on the 12th of June 2019 at 10:31 Meat Fortress, The Walking Dead, Budget Cuts sequel and more VR announcements inbound. 0 Written by <mark>Mike Holmes</mark> on the 12th of June 2019 at 08:33 Tactics game based on the upcoming Netflix series was revealed during tonight's Direct. 0 Spyro to star in Crash Team Racing, Reignited hitting PC & Switch Written by <mark>Mike Holmes</mark> on the 11th of June 2019 at 18:00 Reignited Trilogy is heading to PC and Nintendo Switch, and the little purple dragon is landing in CTR as post-launch DLC. 0 The Witcher 3: Wild Hunt - Complete Edition confirmed for Switch Written by <mark>Mike Holmes</mark> on the 11th of June 2019 at 17:27 We knew it was coming, but Geralt's third outing is indeed heading to Nintendo's console later this year. 0 Warframe Empyrean expansion teased at E3 2019 Written by Ben Kerry on the 11th of June 2019 at 16:38 The full reveal is coming next month, but we still got a sneak peek at the upcoming content during the PC Gaming Show yesterday. 0 Written by Ben Kerry on the 11th of June 2019 at 16:24 The new content drops landed alongside a new trailer shown at the Ubisoft press conference. 0 In Breakpoint \"the narrative really drives the action\" Written by <mark>Sam Bishop</mark> on the 11th of June 2019 at 15:20 Writer Emil Daubon joined us at E3 to talk about the world Ubisoft has created, including the story that we'll be experiencing. 0 Conan Chop Chop is a cutesy top-down tale of barbaric slaughter Written by <mark>Mike Holmes</mark> on the 11th of June 2019 at 14:26 We love the name, and the premise seems pretty neat too, as Funcom reveals the game that is definitely not an April Fool's joke. 0 Written by <mark>Mike Holmes</mark> on the 11th of June 2019 at 13:51 We've collected together the best trailers from Square Enix's presser. 0 Written by Fabrizia Malgieri on the 11th of June 2019 at 13:44 We talked to Creative Director Nicolas Guérin at E3 2019."}]