[{"articleID": "2011110412_00093813_W", "names": {"Scott Stevens": ["Q24571919", "Q281303", "Q7437315"], "Jack Campbell": ["Q3029621", "Q3123835", "Q3157139", "Q6111556"], "David O'Connor": ["Q28321062", "Q364502", "Q50976251", "Q5238131", "Q5238132", "Q5238134", "Q57902003"]}, "date": "2011-11-04", "url": "http://thehockeywriters.com/nick-ebert-americas-top-nhl-draft-prospect/", "content": "originally from livingston, new jersey, nick ebert has taken his game to a whole new level in the last few years. ebert was playing in the ushl with the waterloo black hawks at the age of 15, a remarkable feat, and now he's taken his talents north to the ohl, playing his first season with the windsor spitfires in 2010-2011. he was lighting up the new jersey high school circuit just a couple of years ago, once scoring two shorthanded goals on the same penalty-kill. now that he's playing at a higher level in the ohl, ebert is still getting better every game. during the 2010-2011 season, ebert put up 41 points in 64 games while scoring 11 times. some of ebert's current hockey idols include los angeles kings, and one of his all-time favourites is former devil, <mark>scott stevens</mark>. scouts believe that ebert can be a similar player to johnson, and maybe even a little bit better. like <mark>stevens</mark>, ebert is a great two-way defenseman who certainly isn't afraid to get involved in the physical side of the game. for now ebert looks to build on his skills, get stronger, solidify his spot as america's top nhl draft prospect, and hopefully hear his name called early in the 2012 nhl draft. if there's one specific thing that nick ebert will look to improve upon this season, it's his decision-making on the ice. there's no doubt he has the skills to play pro hockey for a long time, but some scouts worry that because he tends to turn the puck over, and doesn't always make the smartest passes, ebert might have difficulty adjusting to the next level. with the windsor spitfires trading away star players <mark>jack campbell</mark> (to the soo), and tom kuhnhackl (to niagara) this week, ebert is now being looked at to be a leader on what has become a young, and apparently, rebuilding team. even though he hasn't even been drafted into the nhl yet, nick will have to take on the responsibility that typically belongs to older, more experienced players, and he'll have to do it quickly. this can only help ebert's growth as a player, as it will force him to be more responsible on the ice, as well as staying responsible off it, and it should certainly help him make better decisions with the puck, because he'll know that younger teammates will be using him as a role model to better themselves as players. nick ebert is currently ranked ninth overall in the international scouting services' rankings of matia marcantuoni. there is no question that ebert can be picked ahead of both of those players in june, and he's still expected to move up a few spots in the rankings over the course of the season. through 18 games this season, ebert has 8 points, and even though windsor head coach bob boughner might like a little more point production from him, ebert's still holding steady on the iss's list due to his low plus-minus rating. ebert first skated at around three years of age, and was playing full-equipment hockey at the age of four, playing up a year in age every season he played travel hockey. he's still a big-time new jersey devils fan, and ebert admits that he thinks about things such as playing in the world junior championships, or playing in the olympics, everyday. but at the moment, his main goal is to walk up onto that podium in june, and have his name on the back of an nhl jersey. don't expect him to play in the nhl next season (it's very unlikely right now), so it is possible that ebert could be wearing a \"c\" on the front of his jersey for the spitfires in 2012-2013. current team captain and fellow defenseman adrian robertson will be a good role model for ebert this season, meaning ebert could be ready to take the reins from him soon. nick was once asked, \"what would be the biggest complement someone could give you in regards to hockey, where if you read it or heard, you'd say,\" wow. thanks! \"?\" his answer: \"saying i'm one of the top players in north america. it's pretty cool to hear that, people talking about you and putting you in the same category as the top players in north america.\" hey everyone, my name is <mark>david o'connor</mark>. i'm a passionate hockey fan who loves reading, watching, and writing about all aspects of the game. currently i am a student living in ontario that primarily focuses on prospects, as well as writing player profiles for the hockey writers. if you have any questions, or if you would be interested in having me write for you, then feel free to contact me at notify me of followup comments via e-mail"}, {"articleID": "2013021312_00096687_W", "names": {"Ron Erickson": ["Q16106250", "Q7363743"]}, "date": "2013-02-13", "url": "http://capitolhillblue.com/node/46422", "content": "widgetized section go to admin? appearance? widgets? and move object of la police manhunt was hiding in plain sight by tami abdollah and gillian flaccus february 13, 2013 police search at roadblock (ap photo) as police scoured mountain peaks for days, using everything from bloodhounds to high-tech helicopters, the revenge-seeking ex-cop they wanted was hiding among them, holed up in a vacation cabin across the street from their command post. it was there that christopher dorner apparently took refuge last thursday, four days after beginning a deadly rampage that would claim four lives. the search ended abruptly tuesday when a man believed to be dorner bolted from hiding, stole two cars, barricaded himself in a vacant cabin and mounted a last stand in a furious shootout in which he killed one sheriff's deputy and wounded another before the building erupted in flames. he never emerged from the ruins and hours later a charred body was found inside. \"we have reason to believe that it is him,\" san bernardino county sheriff's spokeswoman cynthia bachman said. dorner, 33, had said in a lengthy rant police believe he posted on facebook that he expected to die in one final, violent confrontation with police, and if it was him in the cabin that's just what happened. the apparent end came very close to where his trail went cold six days earlier when his burning pickup truck - with guns and camping gear inside - was abandoned on a fire road in the big bear lake. his footprints led away from the truck and vanished on frozen soil. with no sign of him and few leads, police offered a $1 million reward to bring him to justice and end a \"reign of terror\" that had more than 50 families of targeted los angeles police officers under round-the-clock protection after he threatened to bring \"warfare\" to the lapd, officers and their kin. just a few hours after police announced tuesday that they had fielded more than 1,000 tips with no sign of dorner, word came that a man matching his description had tied up two people in a big bear lake cabin, stole their car and fled. authorities didn't immediately give more details on the two people. game wardens from the california department of fish and wildlife who were part of the search detail spotted the purple nissan that had been reported stolen going in the opposite direction and gave chase, department spokesman lt. patrick foy said. the driver looked like dorner. they lost the purple car after it passed a school bus and turned onto a side road, but two other fish and wildlife patrols turned up that road a short time later, and were searching for the car when a white pickup truck sped erratically toward the wardens. \"he took a close look at the driver and realized it was the suspect,\" foy said. dorner, who allegedly stole the pickup truck at gunpoint after crashing the first car, rolled down a window and opened fire on the wardens, striking a warden's truck more than a dozen times. one of the wardens shot at the suspect as he rounded a curve in the road. it's unclear if he hit him, but the stolen pickup careened off the road and crashed in a snow bank. dorner then ran on foot to the cabin where he barricaded himself and got in a shootout with san bernardino county sheriff's deputies and other officers who arrived. swat team surrounded the cabin and used an armored vehicle to break out the cabin windows, said a law enforcement official who requested anonymity because the investigation was ongoing. the officers then pumped a gas into the cabin and blasted a message over a loudspeaker: \"surrender or come out.\" the armored vehicle then tore down each of the cabin's four walls. a single shot was heard inside before the cabin was engulfed in flames, the law enforcement official told the associated press. until tuesday, authorities weren't sure dorner was still in big bear lake, where his pickup truck was found within walking distance from the cabin where he hid. even door-to-door searches failed to turn up any trace of him in the quiet, bucolic neighborhood where children were playing in the snow tuesday night. with many searchers leaving town amid speculation he was long gone, the command center across the street was taken down monday. <mark>ron erickson</mark>, whose house is only about quarter mile away, said officers interrogated him to make sure he wasn't being held hostage. <mark>erickson</mark> himself had been keeping a nervous watch on his neighborhood, but he never saw the hulking dorner. \"i looked at all the cabins that backed the national forest and i just didn't think to look at the one across from the command post,\" he said. \"it didn't cross my mind. it just didn't.\" police say dorner began his run on feb. 6 after they connected the slayings of a former police captain's daughter and her fiance with his angry manifesto. dorner blamed lapd capt. randal quan for providing poor representation before the police disciplinary board that fired him for filing a false report. dorner, who is black, claimed in his online rant that he was the subject of racism by the department and was targeted for doing the right thing. chief charlie beck, who initially dismissed dorner's allegations, said he would reopen the investigation into his firing - not to appease the ex-officer, but to restore confidence in the black community, which had a long fractured relationship with police that has improved in recent years. dorner vowed to get even with those who had wronged him as part of his plan to reclaim his good name. \"you're going to see what a whistleblower can do when you take everything from him especially his name!!!\" the rant said. \"you have awoken a sleeping giant.\" within hours of being named as a suspect in the killings, the 6-foot, 270-pounder described as armed and \"extremely dangerous,\" tried unsuccessfully to steal a boat in san diego to flee to mexico. after leaving a trail of evidence, he headed north where he opened fire on two patrol cars in riverside county, shooting three officers and killing one. with a description of his car broadcast all over the southwest and mexico, he managed to get to the mountains 80 miles east of los angeles where his burning truck was found with a broken axle. only a short distance from the truck, he spent his final days with a front-row seat to the search mobilized right outside. fubar. you can follow any responses to this entry through the rss 2.0. you can skip to the end and leave a response. pinging is currently not allowed."}, {"articleID": "2016042422_00546985_W", "names": {"Agustin Garcia": ["Q3606942", "Q57772736", "Q9142689"]}, "date": "2016-04-24", "url": "http://ap.stripes.com/dynamic/stories/L/LT_MEXICO_MISSING_STUDENTS?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2016-04-24-18-44-31", "content": "MEXICO CITY (AP)--There is strong evidence that Mexican police tortured some of the key suspects arrested in the disappearance of 43 students, according to a report released Sunday by an outside group of experts. The Inter-American Commission on Human Rights expert group says that a study of 17 of the approximately 123 suspects arrested in the case showed signs of beatings, including, in some cases, dozens of bruises, cuts and scrapes. One suspect said he was nearly asphyxiated with a plastic bag, and medical studies showed another had been slapped on the ears so hard his eardrums broke and his ears bled. The Mexican government recently released documents suggesting investigations had been opened against police and military personnel, but authorities have not answered requests about whether anyone has been arrested or charged. The 43 students at the radical teachers' college of Ayotzinapa have not been heard from since they were taken by local police in September 2014 in the city of Iguala, Guerrero state. Family members and supporters of the missing students chanted \"They took them away alive, we want them back alive!\" at the news conference where the report was presented. No high-ranking officials attended the presentation of the report, which called the government's investigation flawed and incomplete. But President Enrique Pena Nieto wrote in his Twitter account that the federal attorney general's office \"will analyze the whole report, to aid in its investigations.\" Mexico's deputy attorney general for human rights, Eber Betanzos, said authorities were investigating complaints filed by 31 people who said they had been tortured; he said six criminal cases had been opened, and had that three involved employees of the attorney general's office. Betanzos called the case \"the most exhaustive investigation in the history of Mexican law enforcement.\" But the allegations of torture could endanger any chance of convictions in one of the highest-profile human rights cases in Mexican history, especially because the government's version of events - that corrupt police handed the students over to drug gang members who killed them and burned their bodies at a trash dump - hangs in large part on the testimony of some drug gunmen who now say they were tortured into confessing. \"It is a lie the way they said they caught us,\" Patricio Reyes Landa said in testimony made public by the experts' report. \"They went into the house, beating and kicking. They hauled me aboard a vehicle, they blindfolded me, tied my feet and hands, they began beating me again and gave me electric shocks, they put a rag over my nose and poured water on it. They gave me shocks on the inside of my mouth and my testicles. They put a bag over my face so I couldn't breathe. It went on for hours.\" Mexican judges are instructed to throw out confessions based on torture; Betanzos said the government's case was not solely based on confessions. The group of experts complained the government was slow to deliver some of the evidence it had asked for; it criticized government prosecutor's investigations as flawed and incomplete, and suggested that the government wanted to stick to its version, without investigating possible involvement by federal police and the army. For example, the report said, the roadblocks set up on local highways around the city of Iguala on the night of the disappearances were far more extensive than previously thought. The roadblocks were apparently coordinated by the Guerreros Unidos drug cartel to trap rivals; the gang may have thought the students were part of a rival cartel. The report criticized the forensics investigations of human remains and evidence of fire at the garbage dump in the town of Cocula, Guerrero, saying that prosecutors had provided little evidence there ever could have been a fire a big enough at the site. \"It is clear that there was a latent rejection of any version other than the burning of the students at the Cocula dump, and they turned back to that scenario time after time, without investigating other police forces or state actors,\" the group said in its final report. Its mandate expires at the end of this month, and it leaves Mexico with the crime still largely unresolved; only one student has been identified from charred bone fragments found in a river near the dump. The foot-dragging by prosecutors \"cannot be seen as partial or improvised obstacles,\" said the report. \"These different situations aren't casual barriers, they are structural barriers to the investigation.\" The report also found that one student sent a message to his parents from his cellphone hours after he had supposedly been killed. But the \"significant evidence of torture and abuse\" of the suspects was the report's most damning element. For example, the medical reports on one suspect whose testimony was key for the government's case, <mark>Agustin Garcia</mark> Reyes, claimed he had one injury, a bruise, after marines took him into custody. But hours later when he was turned over to civilian prosecutors, they said he had 30 bruises, scrapes and scabs. \"There seems to be no limit to the Mexican government's utter determination to sweep the Ayotzinapa tragedy under the carpet,\" wrote Amnesty International's Americas director Erika Guevara-Rosas. Daniel Wilkinson, deputy director of Human Rights Watch's Americas division, wrote that while the experts had been critical of the government investigation before, the new report \"goes much further in presenting evidence of obstruction, of manipulation of evidence and even torture.\" \"Based on all the ways the government has obstructed the work of the group it seems clear that the reason they brought them in was never to solve the case, but rather to do PR, to do damage control in the face of the public outrage at their handling of the case,\" Wilkinson wrote. \"If that was the calculation, clearly they miscalculated.\" "}, {"articleID": "2019062219_00247241_W", "names": {"Gilles Simon": ["Q1609613", "Q212833"]}, "date": "2019-06-22", "url": "https://www.sportskeeda.com/tennis/lopez-downs-youngster-auger-aliassime-to-set-up-simon-final-at-queen-s?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda", "content": "Lopez downs youngster Auger-Aliassime to set up <mark>Simon</mark> final at Queen's 6 / / 23 Jun 2019, 00:16 IST SHARE Email Feliciano Lopez Felix Auger-Aliassime's impressive run at the Queen's Club Championships came to an end as Feliciano Lopez fought back from a set down to set up a final with <mark>Gilles Simon</mark>. Eighth-seed Auger-Aliassime stunned Stefanos Tsitsipas on Friday, with the Greek subsequently lauding the 18-year-old as \"the most difficult opponent\" he has ever faced, but he came undone against Lopez, with the Spaniard coming out on top 6-7 (3-7) 6-3 6-4. The Canadian edged a tight first set on a tie-break but he fell 2-0 down in the second after dropping his first service game of the week following 44 consecutive holds. That was all Lopez needed to level the match and he further strengthened his grip by breaking to lead 3-2 in the decider. Auger-Aliassime saved four match points at 3-5 but Lopez got it done in the next game to move into his third Queen's final. What a week @ feliciano_lopez is having at #QueensTennis--ATP Tour (@ ATP_Tour) June 22, 2019 Lopez will face <mark>Simon</mark>, who beat Daniil Medvedev 6-7 (4-7) 6-4 6-3 in Saturday's other semi-final. A thrilling contest was settled when the Russian, troubled by a lower back injury, double-faulted to hand <mark>Simon</mark> a 3-5, third-set lead which he duly converted. \"It was hard to recover for this one. Daniil and I practise together and we knew it was going to be tough,\" said <mark>Simon</mark>. \"It's hard for me to hit through him, but when you play a match and you're a bit tired, sometimes you relax and play great. I was feeling the ball great, even if I wasn't feeling great in the legs.\" Advertisement"}, {"articleID": "2018042204_00116278_W", "names": {"Jesus Aguilar": ["Q16887607", "Q26963305"], "Brian Anderson": ["Q1057342", "Q19609578", "Q38626646", "Q4962970", "Q4962975", "Q4962976", "Q4962977", "Q55777627"], "Ryan Braun": ["Q1207567", "Q3453746"]}, "date": "2018-04-22", "url": "http://www.wahpetondailynews.com/national/sports/brewers-beat-marlins-on-walk-off-homer-by-jesus-aguilar/article_b8420a16-6773-54a6-8ca1-b93f9e3f01b7.html", "content": "Facebook Twitter Email TownNews.com Content Exchange Facebook Twitter Email Print Save MILWAUKEE--<mark>Jesus Aguilar</mark> quickly found himself in an 0-2 hole while leading off the bottom of the ninth inning. The Milwaukee Brewers first baseman eventually fouled off seven pitches, including three with a full count. On the 13th pitch of the at-bat, he broke through. <mark>Aguilar</mark> homered to right-center off Miami Marlins reliever Junichi Tazawa, sending Milwaukee to a 6-5 victory Saturday night at Miller Park. The Brewers, who have won five straight games, trailed 4-0 early before <mark>Aguilar</mark> capped the team's seventh come-from-behind victory of the season. \"I'm very happy,\" said <mark>Aguilar</mark>, who entered the game in the top of the ninth. \"He's become a force in the National League off the bench as a pinch hitter,\" Brewers manager Craig Counsell said. Milwaukee (13-9) tied the score in the eighth when Miami left fielder Derek Dietrich misplayed Eric Sogard's two-out popup to left, allowing Travis Shaw to score from second. Eric Thames was thrown out at the plate attempting to score the go-ahead run from first. \"We certainly caught a break there,\" Counsell said. Jeremy Jeffress (2-0) pitched a scoreless inning of relief to get the win. The Marlins, who have lost six of seven, went ahead on Dietrich's solo homer off left-hander Brent Suter in the first inning. A three-run homer by former Brewers outfielder Lewis Brinson in the second extended Miami's lead to 4-0. Shaw's leadoff home run in the bottom of the second off Jose Urena got the Brewers on the scoreboard. Shaw has reached first base 11 times (six walks, four hits, including two home runs, and hit by pitch) in the first three games against the Marlins. Milwaukee scored twice in the fourth on Thames' run-scoring single and an RBI groundout by Sogard. Miami extended the lead to 5-3 in fifth when <mark>Brian Anderson</mark>'s base hit drove in Starlin Castro, who singled and advanced to second on a wild pitch. The Brewers again pulled within a run in their half of the fifth on <mark>Ryan Braun</mark>'s sacrifice fly. Suter gave up five runs and eight hits in five innings. He walked one and struck out four. \"Probably too many pitches that caught the bad part, or good part, of the plate,\" Counsell said of Suter's outing. Urena, who made his first road start of the season, gave up four runs and four hits in five innings. He walked two batters and struck out three. The Marlins (5-15) dropped their third in a row and are now 3-12 since opening the season with a four-game split against the Cubs at home. Arcia sits out Milwaukee shortstop Orlando Arcia sat out after twisting his ankle attempting to get back to first base after singling in the eighth inning of Friday night's victory. \"He just kind of jammed his ankle and had a little swelling,\" Counsell said. \"I don't think we are completely out of the woods with it, but we will give him at least today (off).\" X-rays taken Friday were negative. \"That's definitely the best-case scenario. Very good news,\" Arcia said of the negative result. \"They told me everything was good, nothing broken, nothing bad. We just have to wait until (Saturday to see) how I feel.\" Arcia fractured the same ankle in 2012 while in the minors and missed the entire season. This article originally ran on host.madison.com. Love 0 Funny 0 Wow 0 Sad 0 Angry 0 Facebook Twitter Email Print Save Sports cover photo AARON GASH, ASSOCIATED PRESS Updated 8 min ago 0 Brewers' <mark>Jesus Aguilar</mark> reacts after hitting a walk-off home run Saturday night against the Marlins. Sports jump photo AARON GASH, ASSOCIATED PRESS Updated 8 min ago 0 Marlins left fielder Derek Dietrich commits an error as he attempts to catch a fly ball off the bat of Eric Sogard in the eighth inning. Travi...Tags Milwaukee Brewers Craig Counsell Baseball Sport Pitch Brent Suter <mark>Jesus Aguilar</mark> Orlando Arcia First Base Inning Locations Wisconsin Madison Load comments × Post a comment as Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching"}, {"articleID": "2012051207_00005901_W", "names": {"Mike Mcgee": ["Q1606675", "Q16732301", "Q6847923"]}, "date": "2012-05-12", "url": "http://vvdailypress.com/sports/bullpen-34450-falters-mavericks.html", "content": "adelanto? there has been no such thing as a safe lead when it comes to the high desert mavericks' bullpen lately. the mavericks blew a five-run lead in the eighth inning to lose to the rancho cucamonga quakes 13-11 on friday night at stater bros. stadium, the second straight night a lead was blown in the eighth. it was the sixth time in the last 10 games that high desert's bullpen has blown a lead or tie in the seventh inning or later. still, first baseman mickey wiswall said there isn't cause for concern. he backed the bullpen despite its recent struggles \"we have some great guys in the back end of that bullpen and we trust them every game no matter what the result is,\" wiswall said. \"what are we, 35 games into it? with that said, we have over 100 left. just stay positive, come to the ballpark with the same attitude every day. with this club we'll come out on top a lot more than we don't.\" mavericks (19-17) starter george mieses struggled early, allowing four runs in the second inning, before recovering nicely the rest of the way. he pitched six innings, allowed five hits and one earned run with four strikeouts and one walk before leaving the game with a 6-4 lead. the bullpen got off to a promising enough start. jonathan arias relieved mieses with no outs and a runner on in the seventh. after a flyout, he started a 1-6-3 double play to end the inning. the eighth inning was a whole different story. by that point the mavericks' offense had extended the lead to 9-4, but it was about to evaporate. arias walked brian cavazos-galvez to load the bases with no outs before he was pulled for carson smith. smith dug himself an early a hole against austin gallagher, who went 2-for-4 with three runs scored and five rbis on the day, with three straight balls. after smith threw a strike, gallagher blasted a grand slam to right field to draw the quakes (17-19) within one. michael pericht then completely erased the lead with a two-run home run to left field, giving the quakes a 10-9 lead - their first since the third inning. the quakes added three more runs in the ninth. the collapse overshadowed a solid night for the mavericks at the plate. all nine starters had at least a hit and a run. the team had seven extra-base hits, including four home runs. the mavericks took their first lead of the game when julio morban crushed a pitch to right field one pitch after sending a ball foul in the same direction to make it 6-4. <mark>mike mcgee</mark>'s blast that reached stadium way gave high desert a 7-4 lead to start the seventh inning. \"they've beaten us two games already and we are definitely going to avoid the sweep and come out banging and with some more intensity that skipper wants us to have,\" wiswall said. \"we should be able to do that.\" the quakes and mavericks wrap up the three-game series tonight a 7:05 p.m."}, {"articleID": "2011122201_00071998_W", "names": {"Rick Ross": ["Q297831", "Q431969", "Q606032"]}, "date": "2011-12-22", "url": "http://hiphopdx.com/index/news/id.18045/title.stalley-talks-life-at-maybach-music-group-upcoming-project", "content": "tech n9ne performs \"the noose\" for u.s. troops live for the first time stalley talks life at maybach music group, upcoming project the ohio rapper chops it up about life over at <mark>rick ross</mark>'s label and his next mixtape project. bet's jabari johnson recently chopped it up with stalley as a part of their \"face to face\" series. during the interview, the ohio native talked about how his life and career have changed since he inked a deal with <mark>rick</mark> rozay and company at maybach music group. he explained that although the amount of work he has to accomplish has picked up since the signing, it's been a blessing to align himself with such a great crew of artists. \"man, just [the] work has changed, work has picked up [since signing with mmg],\" he explained. \"it's been a lot more shows, a lot of interviews and sit-downs, but it's been a great, great, great, great thing just to be busy [and] just to be in front of different audiences, like i said, being overseas doing shows...things have been picking up and moving beautifully.\" stalley also revealed a few details about his upcoming project savage journey to the american dream, which he says will drop at the top of next year. he also explained the significance behind the project's title and what means for his career. \"i've been in the studio working on the new project savage journey to the american dream got an account with one of these? log in here, or just enter your info and leave a comment below. error submitting comment this is a test of the error system got an account with one of these? log in here, or just enter your info and leave a comment below. tech n9ne performs\" the noose \"for u.s. troops live for the first time r. kelly reveals he has written 32 more chapters of\" trapped in the closet \"slaughterhouse performs\" the illest, \"freestyles in new york city, new york diddy hints at launching a tequila brand, says he's transitioning from music 2 chainz says that\" codeine cowboys \"helped him buy land, claims he's the a & r for ludacris' next album"}, {"articleID": "2012052319_00040054_W", "names": {"Cristina Fernandez": ["Q40649", "Q5791451"], "18": []}, "date": "2012-05-23", "url": "http://en.mercopress.com/2012/05/23/following-the-falklands-ad-incident-britain-argentina-at-the-opening-hockey-match-in-london?utm_source=feed&utm_medium=rss&utm_content=falkland-islands&utm_campaign=rss", "content": "Names:"}, {"articleID": "2019021719_00372020_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-02-17", "url": "http://www.gamereactor.eu/games/39904/Red", "content": "RED DEAD REDEMPTION 2 REVIEW. Written by Magnus Groth-Andersen on the 25th of October 2018 at 12 \"A watershed moment, an instant classic, another high point for a studio which has constantly delivered them for decades.\" 0 NEWS. Written by <mark>Sam Bishop</mark> on the 13th of February 2019 at 09:00 Tweaks are being made to combat aggressive players spoiling the fun for everyone, alongside other changes like Bounty Hunters. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 11th of February 2019 at 11:50 Rockstar and its western sequel claim the number one position ahead of a week packed with tons of new releases. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 6th of February 2019 at 14:39 A new earnings report from Take-Two shows just how much the game and its online portion have given them a boost in Q3. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 31st of January 2019 at 14:43 Uncharted 4 and Red Dead Redemption 2 come in quite low, with Crash Bandicoot's N. Sane Trilogy being the lowest."}, {"articleID": "2011030210_00012315_W", "names": {"Gerry Mullan": ["Q24088043", "Q5552927"]}, "date": "2011-03-02", "url": "http://derryjournal.com/green_light_for_58m_roe_valley_wind_farm_1_2460489", "content": "published on wed mar 02 09:49:26 gmt 2011 news that energy group gaelectric is planning to invest? 58 million in a wind farm outside limavady and create 40 jobs has been cautiously welcomed by a local councillor. the company revealed its plans for the dunbeg site after getting the green light for the project from the local planning authorities. gaelectric said it intended to build a wind farm with the capacity to generate up to 42 mega watts (mw) of electricity. the company said the development was likely to cost? 58 million and estimated that it would provide enough electricity to power 24,000 homes when it was up and running. dunbeg is in a region designated as an area of outstanding natural beauty. the northern ireland planning service originally refused permission for the development on that ground. however, the planning appeals commission subsequently over-ruled this. sdlp colr. <mark>gerry mullan</mark> said: \"we can't ignore the fact that it is a? 58m project which i would hope would bring very much needed employment and benefits to local companies, but i think we also need to be aware it is in an area of outstanding beauty and i would hope the proper consultations have been completed and people are satisfied it will not have a significant negative impact on the flora, fauna and wildlife of the area.\" colr. <mark>mullan</mark> added: \"i think we cannot but welcome it as it is renewable energy and will have a significant imput into the grid, so we can't ignore that either, but we have to take on board the fact the visual amenity of the area could be compromised by this wind farm.\" the company said it would set up a locally administered fund to support community projects in the area. chief executive brendan mcgrath yesterday described the site as \"a world-class energy resource\" while gaelectric operations director, mike denny, said: \"dunbeg will not only provide a significant boost to northern ireland's renewable energy capacity, it will also generate jobs, support increased workforce skills and provide economic activity to the area.\" he said: \"gaelectric has completed an extensive consultation programme to update local communities on the dunbeg project and a locally administered community fund will be established to support community projects in the area.\" temperature: 6 c to 10 c wind speed: 10 mph terms and conditions all rights reserved? this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by temperature: 7 c to 10 c wind speed: 5 mph temperature: 5 c to 11 c wind speed: 8 mph temperature: 3 c to 10 c wind speed: 9 mph temperature: 2 c to 9 c wind speed: 12 mph"}]