[{"articleID": "2016050321_00265578_W", "names": {"Anthony Russo": ["Q18018415", "Q4773392", "Q4773395", "Q4773397"], "Joe Russo": ["Q1691583", "Q20675767", "Q24734137"]}, "date": "2016-05-03", "url": "http://comicbook.com/2016/05/03/captain-america-civil-war-directors-say-strong-chance-of-lgbt-ch/", "content": "(Photo: Marvel Comics) The latest salvo in Marvel Studio's arsenal is the much-anticipated Captain America: Civil War, and while the newest installment is receiving heavy praise, that doesn't mean there isn't room to improve the Marvel Film Universe as a whole. Please enable Javascript to watch this video mce_marker \"data-mce-type =\" bookmark \"> È One such aspect is the absence of a LGBT character. While they are represented in the comics, they have yet to make the jump to the big screen. When Collider sat down with The <mark>Russo</mark> Brothers, the Directors hinted that it is an issue they hope to address. <mark>Joe Russo</mark> addressed the issue first .\" I think the chances are strong. I mean, it's incumbent upon us as storytellers who are making mass-appeal movies to make mass-appeal movies, and to diversify as much as possible. It's sad in the way that Hollywood lags behind other industries so significantly, one because you think that it would be a progressive industry, and two it's such a visible industry. So I think it's important that on all fronts we keep pushing for diversification because then the storytelling becomes more interesting, more rich, and more truthful. \"With Marvel continuing to meet enormous success with its films, there is a certain amount of leeway that it earns in regards to debuting characters that don't have the name recognition of some of their mainstream heroes. <mark>Anthony Russo</mark> addressed this and laid out how that can affect the choices they make in future films .\" I think this is a philosophy of Marvel, in success, it becomes easier to take risks. There's a lot of unconventional ideas in Civil War in terms of what people's expectations of a superhero movie are, but I think we were able to do that because Winter Soldier worked and Marvel's been working in general, so there's more of a boldness in terms of what you can try and where you can go. So I think that's very hopeful for all of us moving forward that bolder and bolder choices can be made. \"Unfortunately for Marvel, some of their LGBT characters reside in the X-Universe, which rights-wise is still held by Fox. Still, they have a variety of characters that they could introduce into the film universe, like Hulkling, Wiccan, Miss America, Moondragon, Phyla-Vell, etc.. Hopefully Avengers: Infinity War or Guardians of the Galaxy Vol. 2 will result in this void finally being filled."}, {"articleID": "2012091503_00011899_W", "names": {"Joe Philbin": ["Q17386552", "Q597672"], "Anthony Armstrong": ["Q21457672", "Q4772017"], "Taiwan Jones": ["Q20858409", "Q3980207"], "Alex Parsons": ["Q3610705", "Q4717606"], "Michael Mitchell": ["Q16194206", "Q3856226", "Q42606423"], "Richard Seymour": ["Q23657219", "Q2606618", "Q28421769", "Q51588642", "Q7328973"], "Brandon Marshall": ["Q3643713", "Q898156"]}, "date": "2012-09-14", "url": "http://prod.www.dolphins.clubs.nfl.com/news/article-1/Rookie-WR-Matthews-Awaiting-His-Shot-Other-Notes/cf4b2033-0d3f-46cf-a903-29b4a752a711", "content": "a strong preseason could pay off for seventh-round pick. depth at wide receiver is a prerequisite in today's nfl and the miami dolphins could be testing theirs sunday with rookie not be available. matthews was a seventh-round pick of april's nfl draft and came on strong near the end of training camp, especially in the last three preseason games. he was not active last week in houston for the season opener against the texans but has kept himself prepared. at 6-feet and 210 pounds, matthews brings a physical presence to the position that was on display against the carolina panthers in the second preseason game. he drug two defenders into the end zone for a touchdown after catching a quick slant, which he views as one of his strengths when it comes to picking up extra yards after the catch. \"i've always been a guy that prides himself on picking up yards after the catch,\" said matthews, who caught 147 passes for 2,243 yards and 13 touchdowns during his college career at the university of nevada. \"but i still can try to perfect everything about my game, from getting my technique and fundamentals down both on special teams and at receiver. i just want to show the coaches that i am learning the offense and that i'm going to do whatever it takes to help the team .\" as his mentor and as an excellent example of how hard work can pay off in a big way. bess went undrafted in 2008 and now he's considered one of the top slot receivers in the league, which is also why head coach <mark>joe philbin</mark> looks to him as one of the key leaders in the locker room. whether it's running textbook routes or showing how to properly catch any type of pass, bess has developed into the type of player <mark>philbin</mark> wants all of his young players - not just the receivers - to pay close attention to. for bess, he sees a little of himself in matthews. (knee) and wide receiver <mark>anthony armstrong</mark> (hamstring) did not practice for the dolphins. thomas and mcdaniel are officially out for sunday's game and <mark>armstrong</mark> is listed as doubtful? linebacker (groin) both participated in a full practice and are being listed as probable? for the raiders, cornerback ron bartell (shoulder) and wide receiver jacoby ford (foot) did not practice and are out for the game .? running back <mark>taiwan jones</mark> (ribs), linebacker rolando mcclain (ankle) wide receiver juron criner (ankle), long snapper jon condo (concussion) and center <mark>alex parsons</mark> (shoulder) were limited and are questionable for sunday .? tight ends david ausberry (shoulder) and brandon myers (shoulder), safety <mark>michael mitchell</mark> (ribs), defensive tackle <mark>richard seymour</mark> (knee), wide receiver denarius moore (hamstring) and kicker sebastian janikowski (hamstring) all practiced in full and are listed as probable. coach speak \"i think he's got an excellent future in this league. he's progressing nicely. he's a good football player, moves well. we use the term\" he moves like a football player. \"the kid moves like a running back. he's got good balance and a little bit of base, keeps his feet in pretty close contact with the ground and he's got some speed and can catch the ball he's got some ability .\" \"you know the oakland raiders probably since the days i remember (with cliff branch), that's a big part of their game and they've got those guys on the outside, on the perimeter that can run, so obviously angles are going to be important. and again it's based on what coverage we're in. are we in a two-deep or are we in a one-high? is it man or is it zone? but it's safe to say those safeties are going to have to be active. if it's two-deep they're going to have to be able to get off the hash and provide help and get over there and make a play on the ball. if it's one-high they're obviously not going to be quite as close but still they should be factor on those balls downfield .\" - <mark>philbin</mark> how raiders quarterback carson palmer's ability to throw the deep ball will impact miami's safety \"i thought they played well the other day. we clearly won that phase; i'm convinced of that. they had a huge impact play with the touchdown return. we started the game off right, though we had a penalty on the first return, but our kickoff coverage team did a great job. there were a lot of positives in the film. the effort was exceptional, the play speed. i thought they got off to an excellent start. certainly we have room for improvement and things we've got to get better, but they played winning football .\" - <mark>philbin</mark> on the play of his special teams locker room talk \"definitely i'm excited being able to play in front of the home crowd and i'm familiar with the stadium obviously. i might actually be there as a fan saturday to watch the university of miami play bethune-cookman. my parents will be there to support me and they always have the best tailgates before the game, but they always save the leftovers for me so i'm looking forward to that .\" on playing his first home regular-season game in the nfl \"that definitely reassuring to me and lets me know that my guys know what we're doing and who they have and i feel protected. i feel safe back there, so every time i catch the ball. i know that somebody's blocking somebody and it makes me want to do better for them .\" on what he learned after watching film of his 72-yard punt return for a touchdown at houston \"i think <mark>seymour</mark>'s a great player. he is big, he's quick and he's strong and he can rush the passer and can shed blocks well. it's going to be a good test for us. every time he's played us it's been a big test. he was a great player with the patriots and he's a great player with oakland so wherever he's at he's going to do a good job .\" on facing raiders defensive tackle <mark>richard seymour</mark> ##around five or six months ago, bess got a tattoo on his back of his jersey number 15 that was done to the precise dimensions of his actual jersey. he said it's now a permanent reminder of how hard he worked to make the dolphins roster since that was the number assigned to him back in 2008, saying it was the second hardest thing he had done his life behind getting back into college football after being incarcerated. \"it keeps me humble and it keeps me grounded,\" said bess, who turned down a healthy offer from <mark>brandon marshall</mark> two years ago to give up his number. \"it's deeper than money and means too much too me .\" "}, {"articleID": "2017041120_00995216_W", "names": {"Mark Johnson": ["Q1279758", "Q1356869", "Q16189328", "Q16215327", "Q16575072", "Q1727524", "Q28055509", "Q28314503", "Q3294120", "Q47432482", "Q50618258", "Q55013886", "Q59556844", "Q6767862", "Q6768255", "Q6768256", "Q6768258", "Q6768259", "Q6768261", "Q6768262", "Q6768263", "Q6768264", "Q6768265", "Q6768266", "Q6768267"]}, "date": "2017-04-11", "url": "https://flaglerlive.com/106844/bova-threats/", "content": "Joseph Bova, Accused Killer of Store Clerk, Again Declared Incompetent In Threatening Court Appearance FlaglerLive | April 11, 2017 Joseph Bova arriving in court today. (c FlaglerLive) Joseph Bova was off his meds. To say that of the accused killer of store clerk Zuheili Roman Rosado at a Palm Coast gas station in 2013 is not a metaphor, an exaggeration or a put-down. Today, when Bova appeared before Circuit Judge Dennis Craig for the first time in nine months, it was a fact: he had not been taking his psychotropic medication at the Flagler County jail. He had not been doing anything but remain on his bunk, sleeping. It showed. In his last appearance in July, he was trim, almost shaven, had a crew cut and was vivacious enough to keep his head up and speak briefly, politely and somewhat normally to the judge (Matthew Foxman was on the bench in Flagler then). His lawyer, Ray Warren, even said he could be ready for trial later in summer. He wasn't. When Bova walked into court this afternoon, he looked like a wild creature brought in from the wilderness: exploding hair, unkempt beard, baggy eyes he kept closed most of the time, head bent, back bent. He looked as if he would have shuffled even without leg shackles. And that was the better part of him today. When he spoke, it got worse. On several occasions, he threatened Craig that he would be killed in a matter of seconds, that four people in the building would die, that he was being held hostage and that the judge had only one choice: to let him go, or else. Craig was asking him simple questions, among them whether Bova himself felt competent to go to trial. Bova would not answer them. He'd repeat his threats, or make incomprehensible statements as he stood next to Warren. \"Sir I'm threatening your life,\" he told the judge at one point. \"As I understand he's not taking his medication in jail,\" Assistant State Attorney <mark>Mark Johnson</mark> told the judge. Warren has been trying for months to get Bova again declared incompetent to stand trial. The state had initially resisted, particularly last summer, when Bova acted more rationally, and after he had spent a stint in a state psychiatric facility. There, the question of his competence had revolved around Bova's authenticity. Prosecutors doubted that he was truly incompetent. Rather, that he purposefully acted strangely in order to prolong his stay at the psychiatric facility, or to delay his trial. All along, he'd make allegations that people who would try to help him would be harmed--not by him, but by someone, or something. Today, he threatened harm himself. When Craig opened his conversation by asking Bova how he was, Bova at first said he was \"pretty good, sir,\" before immediately correcting himself. \"Actually, not so good .\" He then spoke of an \"emergency going on,\" and \"some kind of game that's very important .\" He said he had to be let out to deal with the emergency. Craig asked Bova why he continues to refuse to talk to a doctor, as he has at the county jail. \"There's no need to talk to a doctor,\" Boval said. \"So you voluntarily decided not to talk to the doctor?\" the judge asked. Bova, whenever he wasn't speaking, would look down and to his left, as if suddenly oblivious to his surroundings. Even after the judge asked his questions, Bova would remain in that posture, as if he hadn't heard the question, or didn't want to answer. But he would then come out of that state, lift his head and answer, without quite making sense. He answered the judge's question by mouthing something about President Barack Obama and the courthouse, suggesting that he wasn't aware that there had been an election. \"Do you understand what the counsel is saying today about finding you incompetent?\" the judge asked. \"Oh, sir, that's just an irrelevant practice that's trying to delay things,\" he said. \"So you'd rather not be found incompetent?\" \"I'm looking for a bail immediately,\" Bova replied, \"or there's going to be a serious problem .\" The judge repeated his question about competency. Long silence. Then: \"Sir there's going to be a death to at last four people in this building,\" he said, if the judge didn't let him out. When Craig asked him if he at least understood what he was asking him, Bova repeated that he was being held hostage. Asked again, he told the judge: \"You have seven seconds to respond the way you're supposed to, sir .\" \"All right, let me ask you again,\" a patient Craig said, \"do you think this issue of competency or incompetency--\"\"There' a death toll to at least four more of your council friends if you do not respond responsibly the way you're supposed to,\" Bova replied. A sheriff's deputy stood two feet behind him, three others stood in a corner, closer to the judge, though they did not look any more alarmed than the judge. The room was full of people waiting their turn in an afternoon of pre-trials, jaws closer to the ground than usual for a court audience. He refused to answer questions, calling them \"irrelevant .\" He then got rude, questioning the judge for not responding to his own questions. But at that point, the judge said he'd agree to declare him incompetent for now. What that means is that for the first time in over a year, Bova will return to a psychiatric hospital, where he may be forced to take medication, even if it takes injections against his will. The local jail could not do so without doctors' orders, nor would it want to expose itself to liability. In one instance, he was Baker Acted from the jail, thus ensuring that he would be medicated, at least temporarily. The hospital is required to send a report to the judge every six months. Based on those reports, the case will be reopened, and competency again considered. Recommend or share:"}, {"articleID": "2013020113_00056429_W", "names": {"Joseph Sullivan": ["Q1708062", "Q6287252"]}, "date": "2013-02-01", "url": "http://finance.yahoo.com/news/legg-mason-swings-loss-asset-131612629.html", "content": "tip: use comma (,) to separate multiple quotes. u.s. economy adds 157,000 jobs, jobless rate rises to 7.9% (reuters) - asset manager legg mason inc (lm) said on friday it swung to a quarterly loss due to charges for impaired assets, and reported continued outflows from its equity and bond funds. legg mason reported a net loss of $453.9 million, or $3.45 per share, for the three months ended december 31, its third fiscal quarter. that compared with net income of $28.1 million, or 20 cents per share, in the same period a year earlier. as it had forecast, legg mason's results included pretax charges of $734 million, or $508 million after taxes, to account for writing down the value of assets like fund management contracts and uncertainties such as its ongoing search for a new chief executive. assets under management fell to $648.9 billion from $650.7 billion at september 30. the decline was due to net client withdrawals of $7.5 billion, which was partially offset by market gains and other income of $5.7 billion. during the quarter, equity outflows were $8.3 billion and bond outflows were $6.8 billion, while clients added $7.6 billion to liquidity products like money funds. legg mason interim chief executive <mark>joseph sullivan</mark> called the results disappointing but said the company \"made good progress on a number of strategic fronts\" during the quarter, such as the purchase of london hedge fund firm fauchier partners. the company is \"committed to advancing our business strategy while the board continues the ceo search process,\" <mark>sullivan</mark> said in a statement. your most recently viewed tickers will automatically show up here if you type a ticker in the \"enter symbol/company\" at the bottom of this module. copyright? 2013 reuters limited. all rights reserved. republication or redistribution of reuters content is expressly prohibited without the prior written consent of reuters. reuters shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon. quotes are real-time for nasdaq, nyse, and nyseamex when available. see also delay times for other exchanges. quotes and other information supplied by independent providers identified on the yahoo! finance partner page. quotes are updated automatically, but will be turned off after 25 minutes of inactivity. quotes are delayed at least 15 minutes. all information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. neither yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. by accessing the yahoo! site, you agree not to redistribute the information found therein. capital iq. historical chart data and daily updates provided by"}, {"articleID": "2011040819_00080217_W", "names": {"Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}, "date": "2011-04-08", "url": "http://mypetjawa.mu.nu/archives/207247.php", "content": "? sharia: the answer to stop the cia from blowing air up my poop shoot! egypt fm: gaza a priority in egypt foreign policy what has happened in the gaza strip is unacceptable in terms of human rights [\"liberation' of palestine from the river to the sea] gaza, (pic)--nabil al-arabi, who was named foreign minister after egyptian revolution has confirmed that issues concerning gaza are a priority to egypt's foreign policy .\" we consider the situation in the gaza strip a priority for egypt, especially since what has happened there is unacceptable in terms of human rights, \"mr. arabi said during a joint press release with austrian foreign minister michael spindelegger tuesday night in cairo .\" we are now working to establish a method to deal with those situations. those committees could finalize works this weekend. we are discussing this issue with all sectors of the state in egypt, \"he said. arabi said that egypt also has strong interest in palestinian reconciliation and has contacted both hamas and fatah to discuss it. he added that palestinian authority chief <mark>mahmoud abbas</mark> is scheduled to visit egypt on wednesday to discuss all issues pending reconciling with hamas. he had already met with a delegation from hamas last week. i'm sure the anti-tank missile attack on israeli school bus in"}, {"articleID": "2012071323_00072873_W", "names": {"Julian Robertson": ["Q1712051", "Q6307515"], "Sam Fox": ["Q17490468", "Q5065753"]}, "date": "2012-07-12", "url": "http://rssfeeds.usatoday.com/~r/UsatodaycomWashington-TopStories/~3/Vr7vbGyr8vM/1", "content": "25% of romney bundlers hail from finance sector reprints & permissions washington - republican presidential candidate mitt romney depends on a wide network of venture capitalists, hedge-fund managers and other wall street bankers to raise the hundreds of millions he has amassed in his bid to oust president obama, a usa today analysis of his fundraising operation shows. republican presidential candidate mitt romney speaks at the naacp annual convention wednesday in houston. by evan vucci, ap republican presidential candidate mitt romney speaks at the naacp annual convention wednesday in houston. more than 300 people - or nearly a quarter of the roughly 1,200 individuals usa today has identified as romney fundraisers - come from the world of finance, more than any other sector. more than a dozen come from the ranks of a single company, investment powerhouse goldman sachs, which spent nearly $4.4 million to influence washington policymakers last year. by comparison, 77 of obama's 532 fundraisers work in the securities and investment industry, according to a tally by the non-partisan center for responsive politics. obama has slammed romney's record in private equity, while romney has pledged to dismantle financial-industry regulations enacted during the obama administration. those fundraisers who commit to raising as much as $250,000 to host romney at dinners and receptions include diet guru jenny craig, who hosted romney at her california beachfront home, billionaire hedge-fund guru <mark>julian robertson</mark> and todd heap. romney's supporters have unleashed torrents of campaign cash since he effectively clinched the democratic national committee. the june haul marks the second month in a row romney and the gop have outraised obama, as wall street and other interests turn away from a president who has slammed romney's record as a venture capitalist - and flock to romney, who has pledged to dismantle new financial-industry regulations erected during obama's time in office. unlike obama, romney has refused to name his top fundraisers. usa today reviewed federal election commission data, invitations to 85 romney fundraising events obtained by the non-partisan sunlight foundation, campaign news releases and news accounts to offer a snapshot of romney's fundraising network. political fundraisers, often known as \"bundlers\" for their ability to bundle together contributions from family, friends and business associates, are crucial to politicians collecting money in small increments from thousands of donors. bundlers are so valuable that presidents often reward them with ambassadorships. romney's most prolific supporters also have performed double duty - writing large checks to restore our future, a pro-romney super pac that can raise unlimited amounts to aid his white house bid as long as it operates independently of his campaign. more than 90 of the fundraisers identified by usa today also have contributed $25,000 or more to the super pac. they have donated nearly $18.4 million to the group, which has spent more than $53 million to promote romney and attack his rivals. more on super pacs, romney fundraising story: mitt romney declining to disclose names of campaign bundlers story: payday lenders scrutinized for funneling cash to super pacs story: donors to romney super pac have ties to for-profit colleges story: romney, gop outraise obama and democrats again in june \"you see romney look-alikes - people from the same world he comes from,\" said ellen miller of the sunlight foundation. \"while it's not surprising, it's sobering when you think about who has his left and right ear .\" the romney campaign did not respond to interview requests. bloomfield hills, mich., investment firm said he joined the fundraising team because of his family's close ties to romney's brother, scott, a michigan lawyer. romney's background in government and business have given him skills \"that surpass any candidate i've seen,\" schwartz said. he declined to say how much he has raised. \"we've made our very best efforts,\" schwartz said. romney has also tapped business, religious and family ties to build his fundraising network. his fundraisers include dozens of current and former executives of the consulting and private-equity firms he ran. dozens more are fellow mormons, such as jetblue founder u.s. ambassador to belgium <mark>sam fox</mark>, also have joined the fundraising circuit. scott romney is a national finance chairman. a st. louis businessman, <mark>fox</mark> said president obama \"means well\" but doesn't have the experience to right the troubled u.s. economy. <mark>fox</mark>, who said he had his assistants research romney's career in business and government after romney sought his support in 2005, said \"he's been successful at every problem he's taken on .\" he donated $190,000 to a pro-romney super pac but won't say how much he has raised - only that the \"floodgates opened\" once the former massachusetts governor clinched the nomination in may. neeleman called romney \"one of the smartest guys i know\" and said romney's long volunteer church service - first overseeing a local congregation as a mormon bishop and later as a stake president presiding over several congregations in suburban boston - demonstrates his kindness. the church does not have paid clergy, and bishops and stake leaders have broad responsibilities to manage budgets, deliver sermons and provide spiritual counseling. \"as a mormon, i know what that entails,\" neeleman said. \"you have to be very compassionate and loving. when i people say he's out of touch because he's rich? i'd like to see them give that kind of service .\" neeleman said he hosted a fundraiser for romney at his connecticut home in may, but said he's unsure how much was raised. indeed, without voluntary reporting from the campaigns themselves, it's impossible to determine exactly how much either presidential contender has raised through bundlers. every few months, obama releases a list of bundlers who have collected at least $50,000, but describes their fundraising totals only in broad ranges. the campaign's most recent release shows 532 people directed at least $106.4 million to obama's re-election efforts through april 20. among romney's backers: a georgia executive who was on the invitation as a host of a february fundraising event for romney a month after the securities and exchange commission accused him of insider trading. on jan. 9, the sec filed a civil complaint against parker \"pete\" petit, alleging petit tipped off a friend to the impending sale of matria healthcare, a health-wellness company where petit was ceo. on feb. 8, petit was on the host committee for a romney fundraiser at the w hotel in atlanta, according to an invitation obtained by the sunlight foundation. he gave $2,500 to romney's campaign feb. 6. petit has denied any wrongdoing. his lawyer, aaron danzig, sent usa today a january news release, saying the sec \"has targeted an innocent business executive .\" reprints & permissions, visit our faq's. to report corrections and clarifications, contact standards editor"}, {"articleID": "2010083004_00282903_W", "names": {"Ryan Murphy": ["Q1185730", "Q19979249", "Q21934130", "Q316844", "Q3453832", "Q6379482", "Q6380012", "Q7384364"]}, "date": "2010-08-30", "url": "http://bucksfreepress.co.uk/uk_national_entertainment/8360586.Mad_Men_honoured_at_Emmy_Awards/?ref=rss", "content": "mad men honoured at emmy awards (from bucks free press) the darkly intimate 1960s-era drama mad men and the comedy romp modern family were the big winners at the emmy awards as american life past and present proved a winning formula. \"to our fans, we are so grateful, we are so thrilled that families are sitting down together to watch a television show, and we're so happy that you have let us into your families,\" said steven levitan, modern family executive producer. the best comedy series award was the first for the sitcom, which also captured an acting award for eric stonestreet and a best writing trophy. the best drama series award for mad men was its third consecutive one. series creator matthew weiner seemed to take the night in stride. \"i knew one day i would run somewhere and win a trophy,\" weiner joked earlier in the los angeles ceremony when he dashed to the stage to claim the emmy for best drama series writing with erin levy. glee, the musical-comedy that started the night as the most-nominated series, earned an acting trophy for jane lynch and a directing award for creator <mark>ryan murphy</mark>. bryan cranston's portrayal of a meth dealer in breaking bad and kyra sedgwick's role as a brassy deputy police chief in the closer earned the pair top drama series acting awards. cranston's honour was his third trophy for playing a high school maths teacher gone wrong, while his co-star, aaron paul, earned his first award as best supporting actor for playing his partner-in-crime. archie panjabi of the good wife was honoured as best supporting actress in a drama for her part as a law-firm's in-house private investigator, as emmy voters spread the riches widely among veterans and fresh faces. dating make a date in buckinghamshire now! search for properties across the uk."}, {"articleID": "2018062120_00151114_W", "names": {"John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "John Tavares": ["Q537353", "Q6260293"]}, "date": "2018-06-21", "url": "https://www.brainerddispatch.com/sports/hockey/4463330-barry-trotz-named-islanders-head-coach-three-days-after-resigning-capitals", "content": "Barry Trotz named Islanders' head coach three days after resigning from Capitals Barry Trotz named Islanders' head coach three days after resigning from Capitals By Washington Post Today at 2:25 p.m. Barry Trotz did not wait long to land his next coaching job, signing with the Islanders. Washington Post photo by <mark>John McDonnell</mark> Barry Trotz resigned from the Washington Capitals on Monday, June 18, just 11 days after he and the team won the franchise's first Stanley Cup. He was spotted wearing a suit at the Newark airport later that afternoon, fueling speculation he was meeting with the New York Islanders, the only team that had a head-coaching vacancy. Three days later, Trotz became the Islanders' new coach while the Capitals have yet to name his replacement. Once Washington accepted Trotz's resignation, there were no restrictions on where he could coach, and his move to a Metropolitan Division opponent the Capitals will play at least four times a year stings. Trotz and Washington's split was largely related to financial differences; Trotz asked for a five-year term with a $5 million annual salary, a significant bump from the $1.5 million he was reportedly making each of the past four years with the team. MacLellan said the term especially was \"a sticking point\" because it would have secured Trotz as coach of the Capitals for nine seasons, and that kind of tenure with a team is rare. \"It's a long time and a lot of money to be committing to a coach,\" MacLellan said Monday. \"There are probably four guys that are making that money, so it's the upper echelon. It's the big-revenue teams .\" New York and new general manager Lou Lamoriello got closer to Trotz's price with a deal believed to be in the neighborhood of $20 million for five years, according to Sportsnet's Elliotte Friedman. The Islanders have missed the playoffs the past two seasons, but New York was one the highest-scoring teams in the league last season. Hiring Trotz, the fifth-winningest coach all time, will likely be part of the team's pitch for retaining pending free agent center <mark>John Tavares</mark>. Known for coaching good defensive structure, Trotz could help a team that allowed the most goals in the league last season. The Islanders are also considered a possible trade destination for Capitals goaltender Philipp Grubauer. Washington superstars Alex Ovechkin and Nicklas Backstrom expressed disappointment over Trotz's resignation Wednesday night at the NHL Awards in Las Vegas, but both wished him well and praised his positive impact on them. \"Something you can't take away from Barry is what he's done to this team,\" Backstrom said. \"Him and the coaching staff has been doing a tremendous job to just get us together. He's been schooling us good these four years, and we got a good finish out of it...Hopefully there's no hard feelings. He's always going to be remembered in Washington as a champion, which is great, which he deserves .\" Said Ovechkin: \"He's been very good for me. We've been back and forth all the time, you know? He was hard on me. He give me very good advice because he have experience and that's the whole thing. When the coach know who you are and know how to use you, you just feel great .\" Along with the franchise's first Stanley Cup, Trotz guided the Capitals to back-to-back Presidents' Trophy-winning seasons and three division titles. Washington advanced to the second round of the playoffs in all four seasons he was with the team. Though MacLellan said there's no time frame to name Trotz's replacement, Capitals associate coach Todd Reirden is the overwhelming favorite to get the job, and that Washington seemed to be grooming him for the role for the past year created tension in the relationship between Trotz and the organization. Assistant coach Lane Lambert and Capitals director of goaltending Mitch Korn had followed Trotz to Washington from their previous stop in Nashville, and it's likely they will now join him in New York. Story by Isabelle Khurshudyan. Khurshudyan covers the Washington Capitals. A University of South Carolina graduate, she has worked at The Washington Post since 2014, previously reporting on high school sports and local colleges. Additional Articles Recommended by Brainerd Dispatch"}, {"articleID": "2015031214_00018810_W", "names": {"Sanjay Singh": ["Q16236542", "Q27050566", "Q7418478", "Q7418479"]}, "date": "2015-03-12", "url": "http://www.financialexpress.com/article/miscellaneous/former-congress-mla-claims-he-was-offered-ministerial-berth-by-aam-aadmi-party/52982/", "content": "Former Congress MLA claims he was offered ministerial berth by Aam Aadmi Party Former Congress MLA claims he was offered ministerial berth by Aam Aadmi Party A day after a former Aam Aadmi Party (AAP) MLA accused Delhi Chief Minister Arvind Kejriwal of trying to poach six Congress MLAs...http: //www.financialexpress.com/article/miscellaneous/former-congress-mla-claims-he-was-offered-ministerial-berth-by-aam-aadmi-party/52982/ Asif Mohammed Khan, former Congress MLA from Okhla, has claimed that he held meetings with deputy chief minister Manish Sisodia once and <mark>Sanjay Singh</mark>, another senior AAP leader, twice last year to dicuss the issue. Rubbishing Khan's claim, <mark>Singh</mark> challenged him to provide evidence. \"He (<mark>Singh</mark>) says that he did not indulge in horse trading. I had one meeting with Manish Sisodia ji and two meetings with <mark>Sanjay Singh</mark> in Noida. He never offered me money, but he offered me a ministerial berth and chairmanship of different boards to five MLAs in lieu of support,\" Khan said. The former Okhla legislator added that he had recorded the talks between him and <mark>Singh</mark> and will make the conversations public. \"I will certainly make the evidence public. I am not ready to back track. Now <mark>Sanjay Singh</mark> has accpeted that he has met me,\" he said. Khan said that <mark>Singh</mark> had also instructed him not to make the conversations between the two public until anything concrete came up. \"He (<mark>Singh</mark>) said that if you are quitting the party...we are aware that contesting polls is an expensive affair. Even on that front, we will think about it .\" He also said that the conversation should not go out of the room because some senior leaders of AAP do not want that we should form the government with Congress's support. So, till the time this does not work out the matter should not come on public platform, \"Khan said. <mark>Singh</mark> admitted to have met Khan for government formation lasy year, but denied that he had offered any ministerial berth in lieu of support to the party. Khan's claim assume significance because the AAP had yesterday claimed that it was neither involved in poaching or any kind of horse-trading .\" Using the term horse-trading is far too harsh and irresponsible. We neither lured them with money nor did we offer them with any gains. Political realignments are not new in this country. Please Wait while comments are loading...Former Congress MLA claims he was offered ministerial berth by Aam Aadmi Party Indian rupee rebounds 28p vs US Dollar to end at 62.50 on recovery in stocks Xiaomi Redmi 2 4G launched in India; smartphone priced at Rs 6,999 Xiaomi launches MiPad tablet on Flipkart, prices it at Rs 12,999 FDI inflows, Hindalco, Commodity exchanges, BSE Sensex, NSE Nifty and more Auto and passenger car sale, Indian women at work, BJP-PDP crisis and more Xiaomi Redmi 2 4G smartphone launched in India, to challenge Moto E 2nd gen Gagngrape: \"India's daughter' real reflection of what society thinks, says Udwin Today (12 Mar) This Week (08 Mar - 14 Mar) BSE Sensex up nearly 1% on reforms hopes BSE Sensex jumped on Thursday on hopes Prime Minister Narendra Modi would be able to steer a bill...Moto E, Moto G, Moto X: Motorola to account for a fifth of Flipkart's GMV at Rs 5,000 cr Xiaomi Redmi 2 4G smartphone launched in India priced at Rs 6,999, to challenge Moto E 2nd gen Xiaomi Redmi 2 budget smartphone lunched in India at a price of Rs 6,999, will directly compete with the newly-launched Moto E 2nd Gen which also carries the similar price tag. Indian govt should stop Bollywood from plagiarising: Jeffrey Archer Bestselling author Jeffrey Archer is angry over some Bollywood producers\" stealing \"his work without making any compensation...AirAsia flight QZ8501\" not giving up' but hunt for bodies drawing to close Silicon Valley sexual discrimination case: Woman says she didn't initially reject advances of colleague Indians look to fly cheap, but frown at making \"sacrifices' on services: Survey Column: India's Dharavi future Land Bill concessions make developing new cities a nightmare, so more urban slums seem likely"}, {"articleID": "2012032004_00060066_W", "names": {"Jean Johnson": ["Q30122394", "Q40890182"], "Mark Hayes": ["Q6767970", "Q6767971"]}, "date": "2012-03-20", "url": "http://kplctv.com/story/17196486/teachers-rally-in-sulphur-against-education-reform-proposals", "content": "teachers rally in sulphur against education reform proposals jasmine stanley claims innocence and asks for trial athletic trainer accused of inappropriate conduct with student mcneese program gives high school students a head start wheel chair lift out of service at beauregard courthouse insurance commissioner donelon talks flood insurance bicentennial commemoration ramps up in april local news, weather, traffic, sports, stocks, movies on your cell phone sulphur, la (kplc) - as governor bobby jindal's education reform package makes its way through the legislature, calcasieu teachers are on the defensive. \"when someone's trying to bully me, there's safety in numbers. and i kind of feel like some is trying to bully me,\" said teacher trevor dean. lobbying to keep their livelihoods teachers met monday evening at sulphur high school. though it wasn't packed by any means, those in attendance were very emotional. \"this is the biggest education bill that we have ever had. it is directed towards public education. it is taking funds from the public education system and putting it into private schools,\" said <mark>jean johnson</mark> la federation of teachers calcasieu chapter president. \"if anyone believes that our children or our teachers should be judged by one standardized test - we have a problem houston,\" said joyce haynes, la association of educators president. students were also on hand to show support for the public school system. \"as a junior it won't be affected by the bill if it is passed. but i have younger siblings who will be affected by it. so they really do need to rally for their jobs because i have a great public education and i feel that they should have the same,\" said kerri racca, sulphur high school junior. \"i'm a senior. i've gone through 13 years of public education and in my opinion i turned out just fine. i'm moving on to lsu in the fall,\" said taylor trahan, sulphur high school senior. the teachers vowed to march the steps of the state capitol. teachers want lawmakers to think before casting their vote. \"listen to educators who know what it's like to be in a classroom. and i would welcome any of the legislators to come in my class for a week or a day, do lesson plans and work with the kids. they need to know what teachers are battling. it isn't just meeting test scores,\" said terri simpson, maplewood middle school teacher. \"we would like lawmakers to know in the upcoming four years that they will be held accountable for their votes they do on this package right now,\" said <mark>mark hayes</mark>, calcasieu association of educators president. the teachers plan to rally at the capitol march 27th. the calcasieu chapter of the louisiana federation of teachers said if the package does pass they're prepared to file suit because they said it is unconstitutional."}]