[{"articleID": "2009110915_00124833_W", "names": {"Fu Lu": ["Q45424321", "Q45486808"]}, "date": "2009-11-09", "url": "http://odditycentral.com/tag/architecture", "content": "\"i had in mind to do something big and i did it.\" that's what simon rodia said about his work. designed by italian immigrant sabato (simon) rodia, watts towers are a famous example of vernacular architecture, located in the watts district, los angeles. the talented construction worker spent all his spare time, between 1921 and 1954, working on this collection of 17 interconnected steel towers. the amateur structures are made from steel rods wrapped in wire and coated in mortar. rodia decorated his architectural masterpieces with found stuff, like bottle caps, seashells, broken glass and pottery. children from all over the neighborhood would search for pieces of glass and bring it to simon rodia, in hope their findings would be included in his project. i chose to name this post \"the other upside-down house\" because i wrote about a very similar house when i started this site. built in 2008, for an art exhibition, the \"other upside down house\" is located on usedom, an island in northern germany. it was financed and constructed by polish partners klausdiusz golos and sebastian mikiciuk, who just wanted to make something different. only, i wonder if they know a practically identical house already exists in their native country of poland. the builders said they were inspired by similar structures in america and spain, that were upside down on the outside, but normal on the inside. visitors of the \"other upside-down house\" said the weird interior make them feel dizzy and disoriented. there's no questioning china's economic boom, but although more and more impressive buildings are being constructed every day, there are some areas that don't even have a proper school. dongzhong (literally translated as \"in cave\" ) is a elementary school located in miao village, china's guizhou province. the strange thing about this learning institution is that it's housed by a giant cave, carved inside a mountain over thousands of years, by wind, rain and earthquakes. there is a small structure put together by the locals, but children attend classes protected only by the cold walls of the cave. adrian reeman, a former merchant navy chef from southampton, has spent the last 23 years of his life transforming his small apartment into a miniature palace of versailles. his painstaking work began in 1986, when he moved in with his wife annette, in the ninth floor flat of a tower bloc in southampton. he hated the copper pebble dash wallpaper he found there and decided something had to be done. at first he just started panelling the walls, without having a clue of what it was going to turn into. although he has no training in constructions or design, and he has never once visited the real versailles, adrian reeman managed to create an honorable small-scale replica of the popular french palace. he now sees no reason to visit the real thing, since he's living in it himself, just on a slightly smaller scale. reeman says he's not 100% happy with how the versailles apartment i've seen some pretty bizarre-but-impressive treehouses in my day, but the minister's house is by far the most impressive, if only through its sheer size. located in crossville, tennessee, the minister's house took horace burgess 14 years to build around an 80-foot-tall white oak tree, with a diameter of 12 feet. the wooden edifice itself is 97-feet-tall and it's supported by six other strong trees that act like natural pillars. burgess says he started working on this giant treehouse after he had a vision back in 1993. god spoke to him and said: \"treehouse, i'll see you never run out of material.\" and so he spent the next 14 years building god's treehouse, using only salvaged materials, like pieces of lumber from garages, storage sheds and barns. so, as far as horace is concerned, god did provide him with all the materials he needed. although he never bothered to measure minister's house (he estimates it must be about 8,000 to 10,000 square feet), he did count the nails he had to hammer into it, 258,000. it cost the 56-year-old landscape architect around $12,000 to construct the world's biggest treehouse. 400-500 people visit minister's house every week, most of them tourists from out of state who heard about a 10-story-treehouse somewhere in tennessee. forced by the downfall of the american housing market, fred milani had to put his backyard replica of the white house up for sale, for just $10 million. american iranian property developer, fred milani, says he doesn't really want to sell his beloved replica of the iconic white house, but he has to. the mini-house is built in the backyard of his atlanta residence and comes complete with its very own oval office and lincoln bedroom, as well as a backdoor pool. if you're expecting an interesting story about how mr. milani decided to have the white house replica built in his backyard, you're in for a big disappointment. he just wanted a house and the architect just asked him \"how about i build you the white house?\" , he agreed and the rest is history. who doesn't want to live in a happy house, right? i bet that's what designer james rizzi thought to himself when he designed the happy rizzi house, in brunswick, germany. what is it with germans and wacky-looking houses? after the famous waldspirale of darmstadt, i've discovered the happy rizzi house, where pop-art ant cartoons mix to form a very unique architectural design. built by architect konrad kloster, happy rizzi house is one of the most important monuments in brunswick. in the hills near san chih, northern taiwan, lies the seashell temple, one of the most amazing architectural works in the world. i'm sure many of you have seen photos of it before, it's almost on every spam photo site on the internet, sometimes listed as being in bagkok or taiwan, but i thought it deserved a spot among the oddities on oddity central.almost completely covered with seashells and pieces of coral, pei khe miao (as its known by the chinese) takes your breath away the minute you lay eyes on it. unfortunately there isn't a lot of genuine information concerning the why spend your money on a boring apartment when you can live the rest of your life in a cool abandoned missile silo? bruce townsley, a former social worker from chicago, got the idea of turning a missile silo into a comfortable home in the mid '80s, while watching the johnny carson show. one of the guest had actually set up a home inside a nuclear missile base and bruce just knew that's he wanted for himself. it wasn't until 1997 that he actually got his hands on a missile silo, but since then he turned into real dream house. the living space is around 1,000 square feet and is basically a huge concrete bubble suspended from a central pole. he did a nice job decorating, but he also kept some of the old stuff around, like the massive blast doors. the owner says his missile silo home couldn't withstand a nuclear strike these days, but it handles the strong texas storms just fine. it's amazing how popular wine-corks are these days. some people convert their cars into wine-cork costumes and even insulate their houses. check out this located in fafe, portugal, this unusual stone house bears a remarkable resemblance to the flintstones house. man, i loved that show! i know what you're thinking and you're not the only one, but as fake as these photos may look, the stone house of fafe is very real. i mean it's even been featured in the daily mail. ok, you're right, that's not a valid argument, but this house does exist. the photos taken by jsome1 have been causing quite stir on the internet, partly because he decided to improve the photos a little and make them look fake-ish. but other curious web-surfers have been digging around and found the stone house exists and it's actually a local landmark of the fafe region. the last two photos were used to promote the fafe biking marathon and feature the also known as \"casas colgadas\" , the hanging houses are the most popular attractions of cuenca, spain. the history and exact origin of the hanging houses is unclear. some believe they are of muslim origin, while others say they are medieval. centuries ago, this kind of building was frequently seen throughout cuenca, but nowadays only three \"casas colgadas\" remain, built in a cliff, above huecar gorge. located in darmstadt, germany, the waldspirale apartment-building was designed by austrian artist, friedensreich hundertwasser, and built during the 1990s. there are other apartment buildings in darmstadt, but the u-shaped waldspirale is special. its diagonal roof is covered with grass, shrubs and trees and the facade follows an irregular grid organization. waldspirale has over 1,000 windows, but no two are the same. the handles on the apartment doors and the windows are also unique. personally i think it has a shot at the title of weirdest hotel in the world, but it's definitely not the best looking one. located in hebei province, china, the tianzi hotel was built sometime in the 2000-2001 period. it is a ten-story high representation of <mark>fu lu</mark> shou (good fortune, prosperity and longevity) that apparently holds the guinness world record for the \"biggest image building\" ...whatever that means. you probably won't find much more info about the and it's not just for show guys, people actually live in it! ever since he was a little boy, simon dale dreamed of having a house in the countryside. and even though he's no architect, or even a construction worker, together with his father-in-law and the help of passers-by, simon managed to build this amazing hobbit house in just 4 months. believe it or not this baby only cost around 3,000 pounds to build. though it looks absolutely incredible, aesthetics were not mr. dale's primary concerns. he tried to make his dream home as environment-friendly as he possibly could and hopes he set an example for others. simon dale and his family actually moved into the hobbit house, but they are not stopping here. their next project involves building nine other similar houses in pembrokeshire, britain. \"dug into hillside for low visual impact and shelter stone and mud from diggings used for retaining walls, foundations etc. frame of oak thinnings (spare wood) from surrounding woodland reciprocal roof rafters are structurally and aesthaetically fantastic and very easy to do straw bales in floor, walls and roof for super-insulation and easy building plastic sheet and mud/turf roof for low impact and ease lime plaster on walls is breathable and low energy to manufacture (compared to cement) reclaimed (scrap) wood for floors and fittings anything you could possibly want is in a rubbish pile somewhere (windows, burner, plumbing, wiring ...) woodburner for heating - renewable and locally plentiful flue goes through big stone/plaster lump to retain and slowly release heat fridge is cooled by air coming underground through foundations skylight in roof lets in natural feeling light solar panels for lighting, music and computing water by gravity from nearby spring"}, {"articleID": "2019011505_02876324_W", "names": {"Harry Smith": ["Q10379814", "Q11326841", "Q15492881", "Q15968052", "Q16094193", "Q16225166", "Q16889948", "Q21166778", "Q2496152", "Q25171870", "Q27830837", "Q379471", "Q5672434", "Q5672465"]}, "date": "2019-01-15", "url": "http://kfgo.com/news/articles/2019/jan/15/confederate-monuments-pedestal-ordered-removed-at-university-in-north-carolina/", "content": "Confederate monument's pedestal ordered removed at university in North Carolina Monday, January 14, 2019 11:25 p.m. CST FILE PHOTO: Students and protesters surround plinth where the toppled statue of a Confederate soldier nicknamed Silent Sam once stood, on th By Alex Dobuzinskis (Reuters) - The pedestal for a Confederate monument called Silent Sam that has been a flashpoint for demonstrations at a North Carolina university will be removed, the school's president said on Monday, nearly five months after protesters toppled the statue. The plan to remove the statue's base and commemorative plaques was outlined by University of North Carolina at Chapel Hill chancellor Carol Folt, in a statement that also said she would resign after this academic year's graduation ceremonies. \"The base and tablets will be preserved until their future is decided,\" Folt said in a statement. The effort to eliminate Confederate monuments gained momentum in the United States after avowed white supremacist Dylann Roof in 2015 murdered nine black people at a church in Charleston, South Carolina. The rampage ultimately led to the removal of a Confederate flag from the statehouse in Columbia. Silent Sam was erected in 1913 to honor soldiers of the pro-slavery Confederacy killed during the U.S. Civil War. Protesters used ropes to pull down the statue on Aug. 20. Opponents of Confederate monuments say they glorify the South's legacy of slavery and racism. Supporters view the memorials as emblems of American history. Some University of North Carolina students celebrated the plan to take away the pedestal and plaques on Monday, according to Raleigh television station WTVD. Folt announced her resignation on the same day University of North Carolina's board of governors was meeting in closed session to discuss leadership issues at her Chapel Hill campus, board chairman <mark>Harry Smith</mark> said in a statement. The board was not advised of Folt's plan to remove the pedestal and plaques and was disappointed by her action, <mark>Smith</mark> said, and he added, \"It lacks transparency and it undermines and insults the board's goal to operate with class and dignity.\" Folt, in her statement, acknowledged the decision to remove the objects could upset some people, but said her goal was to preserve public safety and \"begin the healing process.\" In December, officials at Chapel Hill, which is the flagship campus for the University of North Carolina system, recommended that Silent Sam be relocated to a more than $5 million facility to house historical artifacts. But the University of North Carolina board of governors rejected the plan. (Reporting by Alex Dobuzinskis; editing by Darren Schuettler) More From National No clear path for California as massive PG & E utility nears bankruptcy Alaska officials probing BP oil, gas wells at Prudhoe Bay after spill Burgers by candlelight: Trump lays out fast food for college football champs \"El Chapo' dreamed of biopic for years before capture, says trial witness Stormy Daniels sues over Ohio strip club arrest, calling it political New Illinois governor promises balanced budget for state Comments"}, {"articleID": "2015030520_00005512_W", "names": {"Yossi Cohen": ["Q15725863", "Q16130461"]}, "date": "2015-03-01", "url": "http://mwcnews.net/focus/politics/50047-netanyahu-a-danger-to-israel.html", "content": "In an unprecedented move, 200 veterans of the Israeli security services accused Prime Minister Benjamin Netanyahu on Sunday of being a \"danger\" to Israel. The new group, called Commanders for Israel's Security, warned that Netanyahu was doing irreparable harm to the country's relationship with Washington, just two days before he is due to address the US Congress. The Israeli prime minister is expected to use the speech to try to undermine negotiations currently taking place between major world powers and Iran. He has claimed that any agreement reached at the talks' conclusion, later this month, will leave Iran a \"nuclear threshold state\" hellbent on destroying Israel. Half a dozen former generals spoke out at a press conference in Tel Aviv on Sunday, urging Netanyahu to cancel the speech before ties with the US deteriorate even further. The White House is reported to be furious that Netanyahu arranged his appearance before Congress behind President Barack Obama's back. With an Israeli election less than three weeks away, Netanyahu has already faced attacks from centrist political rivals and parts of the Israeli media over his clashes with the White House on Iran. But it is the first time he has faced a large-scale backlash from members of Israel's security establishment - and is likely to be more damaging to Netanyahu's popular image as a strong leader on security matters. The group comprises retired officers and those serving in the reserves, all of whom held a rank equivalent to general. Many are household names. Yaron Ezrahi, a politics professor at Hebrew University and expert on Israeli-US relations, said there was no precedent for what he termed a \"rebellion\" by so many former senior officials. \"This is a very powerful and distinguished group of former commanders, who are extremely worried about where Netanyahu is taking Israel right now,\" he said. \"It is clear they are speaking not only for themselves but also on behalf of many active commanders who are not allowed to speak their mind but share this group's views.\" 6,000 years of experience General Amnon Reshef, widely regarded in Israel as a hero for his role in the 1973 war against Egypt and Syria, said the group's membership had grown rapidly since he established it three months ago. \"We are experts with more than 6,000 years of security experience between us,\" he told Middle East Eye. \"It is time the prime minister listened to us before he wrecks our strategic interests with our closest ally.\" Nothing good for Israel can come from humiliating the US president. \"Among the generals denouncing Netanyahu on Sunday was Amiram Levin, a former head of the elite Sayeret Matkal commando unit, in which Netanyahu himself served. Reshef's attack echoed that of Meir Dagan, a former head of Israel's spy agency Mossad, who has called separately for Israeli voters to remove Netanyahu. Dagan, who is due to speak at an anti-Netanyahu rally next Saturday, told the Yedioth Aharonoth daily last Friday that the Israeli prime minister was taking\" intolerable risks \"with Israel's security.\" The veto umbrella provided by the Americans [at the United Nations Security Council] could vanish, and Israel would promptly find itself facing international sanctions, \"he added. Ezrahi said the spate of attacks on Netanyahu by such high-level figures could become a\" turning-point \"in the elections.\" The difference between a right-wing Netanyahu government and a centrist one is a handful of seats, so these criticisms have the potential to do him a lot of damage. \"Netanyahu's stance on Iran received a further blow last week with publication of a leaked Mossad document. It showed that he had misled the United Nations in 2012 about his own intelligence services' assessment of the threat posed by Iran's nuclear programme. According to the Mossad report, Tehran was not actively pursuing a military nuclear programme. In contrast, Netanyahu had warned the international community that the Iranians were only a year away from building a bomb. Iran denies that its nuclear research is aimed at developing weapons, saying it seeks only a civilian energy programme. Growing distrust In a possible sign of the increasing distrust between the Israeli prime minister and his closest security officials, Netanyahu is reported to have kept his national security adviser, <mark>Yossi Cohen</mark>, in the dark about his address to Congress. The US media reported last week that <mark>Cohen</mark>, a former senior Mossad official, had privately expressed concern to US officials about Netanyahu's speech. Reshef said that the group would use its high profile to wage a public relations campaign to persuade the Israeli public that Netanyahu's approach was wrong.\" It is not going to be easy, \"he said.\" Israelis have been brainwashed for many years. We need to give them a different message - they need to understand the real situation and Israel's true interests. \"A poll by the Israel Democracy Institute recently found that 58 per cent of Israeli Jews believed a Netanyahu government would be best placed to deal with Israel's security issues. Reshef said Commanders for Israel's Security had wider concerns about Netanyahu's policy in the region. The group was set up late last year to put pressure on Netanyahu's government to re-enter peace talks with the Palestinians based on the Arab Peace Initiative, a Saudi plan that would normalise relations between Israel and the Arab world in return for the establishment of a Palestinian state.\" We can't keep waging a war every couple of years in Gaza or with our neighbours, \"said Reshef. Netanyahu has in the past justified his refusal to agree to a complete withdrawal from the occupied West Bank on the grounds that Iran would set up\" terror bases \"there as soon as the army left. Reshef rejected this scenario.\" The IDF [Israeli military] is very strong and can defend Israel's borders. We can deal with the threats from all of Israel's enemies. \"Hawkish views The group includes security veterans known for their hawkish positions, including former military chief of staff Dan Halutz. He called for leftwing activists who criticised an operation he ordered in 2002 against Hamas leader Salah Shahadeh in Gaza that killed more than a dozen Palestinian civilians, most of them children, to be tried for treason. Ezrahi told MEE there were two specific factors driving the security establishment's campaign against Netanyahu. The first related to the damage he was seen to be doing to the traditionally strong ties between the Israeli and US militaries.\" These commanders have spent a lot of time in the US, at the Pentagon. They have a close working relationship with the US command and rely on their support for equipment, strategy, intelligence-sharing. All of that is under threat from Netanyahu's behaviour. \"Further, Netanyahu's removal of a diplomatic horizon had left senior commanders feeling they were carrying an impossible burden in policing the occupied territories.\" They recognise that there is no military solution to Israel's predicament with the Palestinians and that borders created by force are inherently fragile and insecure. \"Tamir Pardo, the current Mossad head, is reported to have privately rejected Netanyahu's claim that dealing with Iran was Israel's top priority. According to the Haaretz newspaper, he told a group of Israeli businesspeople last summer that the\" biggest threat to Israel's security is the conflict with the Palestinians and not Iran's nuclear program. \"Of particular concern among the security agencies, said Neve Gordon, a politics professor at Ben Gurion University in Beersheva, has been Netanyahu's threats to launch an attack on Iran without support from Washington.\" The view is that an Israeli attack could only set back Iran's nuclear programme a few months or a year, but the consequences in the region would be harsh indeed, \"he said.\" They don't see any benefits from Netanyahu's approach, but they do see a lot of dangers. \"Jittery about Pentagon ties Almost as soon as he stepped down as head of Mossad four years ago, Dagan slammed Netanyahu's idea of an Israeli attack on Iran, calling it the\" stupidest thing I have ever heard \". In his interview on Friday, Dagan said covert operations designed to bring about regime change were a better approach:\" What we could have done was gain time with secret operations or nurture opposition forces and minorities within Iran. \"According to Israeli analyst Ben Caspit, the security establishment has become increasingly jittery about the future of its relationship with the Pentagon. Caspit said some officials were worried that the US might consider abandoning its traditional Middle East allies, such as Israel, Saudi Arabia and Egypt, in favour of strengthening relations with Tehran. They fear that the Pentagon might conclude its support for Iran is more important in stabilising the region than backing Israel. Citing a senior US official, Caspit dismissed the idea as a\" conspiracy theory \", but observed it was one gaining traction among Israeli security service staff. Such fears will only have been heightened by reports that the Obama administration is refusing to share information with Israel about the Iran talks after suspicions that Netanyahu has been leaking details to undermine the White House's position. Ezrahi said Netanyahu was currently more concerned about keeping the electoral support of his rightwing constituency than antagonising his military commanders. Netanyahu had earlier staked much of his credibility with the Israeli public on bombing Iran but had been blocked by opposition from his commanders, as well as the US and Europe, added Ezrahi. He now needed to create a similar kind of\" drama to prove he is a tough military leader \"by taking on the White House in place of Iran. Ezrahi said:\" The speech is like a diplomatic missile aimed directly at the White House. \"That view was confirmed by Israeli political analyst <mark>Yossi</mark> Verter. He said Netanyahu's election strategists had concluded that\" every American slap in Netanyahu's face only strengthens support for their party's leader among his electoral base \". One reportedly told him:\" Obama is our best campaigner. \"Uri Avnery, a veteran peace activist and former MP, wrote at the weekend that the address to Congress would be a perfect election stunt for Netanyahu.\" It will show him at his best. The great statesman, addressing the most important parliament in the world, pleading for the very existence of Israel. \"If Netanyahu wins the election on 17 March, as is currently predicted, Ezrahi expected him to seek a unity government with the centrist Zionist Camp party.\" He will be facing threats of economic sanctions and diplomatic isolation, and will want to present a more moderate face to the world. \"Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License"}, {"articleID": "2014011409_00030212_W", "names": {"David Alvarez": ["Q26234692", "Q5230747", "Q5241510", "Q5241511"]}, "date": "2014-01-14", "url": "http://cbs8.com/story/24439359/sdpoa-backs-faulconer-sen-fienstein-endorses-alvarez", "content": "SDPOA backs Faulconer; Sen. Fienstein endorses <mark>Alvarez</mark> SAN DIEGO (CNS) - Councilman Kevin Faulconer's mayoral campaign Monday gained the support of the San Diego Police Officers Association, while his opponent, Councilman <mark>David Alvarez</mark>, was endorsed by Sen. Dianne Feinstein, D-Calif. \"Kevin Faulconer's experience and proven leadership make him the best candidate for mayor,\" said police union President Brian Marvel. \"He has demonstrated a deep understanding of the dire need to rebuild the San Diego Police Department and retain experienced police officers to keep our neighborhoods safe.\" Last summer, Faulconer spearheaded a City Council effort to increase allowances for officer uniforms and equipment, and hike funding for SDPD recruiting drives. <mark>Alvarez</mark> voted in favor of the plan. Years of recession-era funding reductions for the police department have ended, but the SDPD has in recent months employed roughly 130 fewer officers than called for in the city's budget--largely due to defections to nearby agencies that offer better take-home pay. \"There should be no higher goal for local government than keeping our neighborhoods safe, and if we continue with fiscal reforms at City Hall we can direct the savings toward ensuring every San Diegan lives in a safe and vibrant community,\" Faulconer said. Feinstein said her support for <mark>Alvarez</mark> in the Feb. 11 runoff election is based on his opposition to assault weapons. <mark>Alvarez</mark> said he was \"so honored to stand with Senator Feinstein to get high powered assault weapons off of our streets. We've seen one too many breaking news stories ripping communities apart. Let's put an end to these senseless acts of violence with common sense solutions.\" <mark>Alvarez</mark> has been endorsed by numerous Democratic state officials and the city of San Diego's lifeguards. meta itemprop = \"datePublished\" content = \"2014-01-13 16:57:51\" > Police investigate woman's death near Birch Aquarium A woman was found mortally wounded with apparent stab injuries Monday in a ravine near the Birch Aquarium at Scripps Institution of Oceanography. A woman was found mortally wounded with apparent stab injuries Monday in a ravine near the Birch Aquarium at Scripps Institution of Oceanography. meta itemprop = \"datePublished\" content = \"2014-01-13 14:43:04\" > Trial ordered for man accused in La Jolla double shooting A preliminary hearing is scheduled Monday for a biotech executive accused of wounding his estranged wife's brother and a former business partner in separate shootings in La Jolla last year. A preliminary hearing is scheduled Monday for a biotech executive accused of wounding his estranged wife's brother and a former business partner in separate shootings in La Jolla last year. meta itemprop = \"datePublished\" content = \"2014-01-14 00:58:22\" > SDPOA backs Faulconer; Sen. Fienstein endorses <mark>Alvarez</mark> Councilman Kevin Faulconer's mayoral campaign Monday gained the support of the San Diego Police Officers Association, while his opponent, Councilman <mark>David Alvarez</mark>, was endorsed by Sen. Dianne Feinstein, D-Calif. Councilman Kevin Faulconer's mayoral campaign Monday gained the support of the San Diego Police Officers Association, while his opponent, Councilman <mark>David Alvarez</mark>, was endorsed by Sen. Dianne Feinstein, D-Calif. meta itemprop = \"datePublished\" content = \"2014-01-13 02:31:28\" > Woman who fell to death at Sunset Cliffs ID'd Authorities released the name Monday of a 25-year-old Northern California woman who fell to her death at Sunset Cliffs during a family visit. Authorities released the name Monday of a 25-year-old Northern California woman who fell to her death at Sunset Cliffs during a family visit. meta itemprop = \"datePublished\" content = \"2014-01-13 14:21:35\" > Police break up brawl between Broncos, Chargers fans in National City A peaceful Chargers gathering in National City turned violent following the game against the Denver Broncos. A peaceful Chargers gathering in National City turned violent following the game against the Denver Broncos. meta itemprop = \"datePublished\" content = \"2014-01-12 23:19:46\" > Motorcyclist killed in collision in El Cajon Authorities released the name Monday of a man killed in a weekend motorcycle crash in his East County hometown. Authorities released the name Monday of a man killed in a weekend motorcycle crash in his East County hometown. meta itemprop = \"datePublished\" content = \"2014-01-13 14:57:16\" > Pedestrian struck by car in Barrio Logan A man was struck by a car and seriously injured in Barrio Logan early Monday, police said. A man was struck by a car and seriously injured in Barrio Logan early Monday, police said. meta itemprop = \"datePublished\" content = \"2014-01-13 14:54:08\" > Motorist crashes into power pole in Lemon Grove An investigation was under way Monday into whether alcohol played a role in a crash in Lemon Grove in which a motorist slammed his pickup into a power pole, knocking out electricity to An investigation was under way Monday into whether alcohol played a role in a crash in Lemon Grove in which a motorist slammed his pickup into a power pole, knocking out electricity to nearby residences and traffic intersections. About 140 Camp Pendleton Marines will say goodbye to family and friends Monday as they depart for Afghanistan, where they will remain until late this year. About 140 Camp Pendleton Marines will say goodbye to family and friends Monday as they depart for Afghanistan, where they will remain until late this year. meta itemprop = \"datePublished\" content = \"2014-01-13 14:11:35\" > Fans welcome Chargers back with cheers And while the season is now over the Chargers and their fans--the team was met by a hero's welcome as they returned to San Diego."}, {"articleID": "2017110300_00561004_W", "names": {"Ian Hughes": ["Q15819828", "Q16148972", "Q21289123", "Q21549958", "Q48817102", "Q56254266", "Q5981847", "Q5981848", "Q5981850"]}, "date": "2017-11-03", "url": "http://au.news.yahoo.com/a/-/world/37725700/third-of-young-britons-refuse-to-wear-poppy-for-remembrance-day/", "content": "A third of Brits under the age of 25 are reportedly refusing to wear the poppy as Remembrance Day draws closer because they believes that it glorifies war. The research, carried out by Consumer Intelligence, found that some 11 percent of the country will not wear poppies as part of the Royal British Legion appeal, which raises £ 43 million for ex-service personnel every year. Some even claimed that they feel bullied into wearing it, while others said they refused to wear it as a show of opposition against current military action. A third of Brits under 25 are refusing to wear poppies for Remembrance Day. Photo: AP The survey, which polled Brits in the run-up to Remembrance Sunday, also found that 29 percent of people believe that it should be compulsory to wear it. <mark>Ian Hughes</mark>, the Chief Executive of Consumer Intelligence said: \"The Poppy Appeal commands widespread support and raises huge sums but not everyone agrees with it or backs it\" . UK Prime Minister Theresa May receives her poppy. Photo: AP \"It is interesting however that tolerance of those who oppose poppies is so high with most people accepting it is a matter of personal choice.\" The wearing of a white poppy has also been popularised in recent years, warn as a sign of remembrance by pacifists and anti-war activists."}, {"articleID": "2012031516_00067568_W", "names": {"David White": ["Q16194395", "Q17402764", "Q18668702", "Q19519442", "Q21063316", "Q21623298", "Q22076684", "Q266207", "Q353983", "Q41429213", "Q5241016", "Q5241017", "Q5241021", "Q5241022", "Q5241025", "Q54322010", "Q58195813"]}, "date": "2012-03-15", "url": "http://stuff.co.nz/waikato-times/news/6584121/Ticket-glitch-keeps-fans-waiting", "content": "ticket glitch keeps fans waiting cricket fans should pre-purchase tickets or get along to hamilton's seddon park early this morning to avoid missing any of the second day of action after a technical issue left dozens of fans waiting outside yesterday. new zealand cricket chief executive <mark>david white</mark> said a large walk-up crowd combined with a system slowdown had unfortunately caused some delays yesterday, but entry should be easier today. fans laden with bags and seats queued for nearly an hour outside the first day of the black caps versus south africa test as ticket staff struggled to process any tickets being bought using eftpos or credit cards. the game started at 10.30 am, but the slow-moving queues outside were only starting to ease an hour later. security staff worked to alleviate the problem by selling cash tickets beside the queue and letting those patrons in through a separate entrance, but many had no cash. mr <mark>white</mark> said it was unfortunate that some members of the public experienced longer than expected queues yesterday. \"we always encourage fans to pre-purchase tickets so they can get direct entry to venues.\" mr <mark>white</mark> said ticketek had apologised for the slow ticketing system and had resolved the problem. \"there is a lot of interest in this match, with the main issue being the volume of people wanting tickets close to the start of play.\" former hamilton man chris voerman, who had travelled from auckland for the game, said he had driven past before the game even started and was dismayed by the queues. \"it's ridiculous,\" mr voerman said. \"i've never seen anything like it at a cricket match before. it's not the size of the crowd, it's the crap organisation.\" martin cambden said he had spent almost as long standing in the queue as he did in the car driving from auckland. \"it's a joke.\" mr cambden said he would probably send cricket new zealand an email to express his displeasure at missing so much of the morning's cricket. \"there's just no need for it to be this bad.\" however, barry leabourn, from tauranga, said he was impressed by the effort to manage the situation by offering cash sales. mr leabourn said compared with cricket grounds overseas, seddon park's queues were \"nothing\" . louise.risk @ waikatotimes.co.nz ad feedback -? fairfax nz news"}, {"articleID": "2009012317_00039279_W", "names": {"Chris Matthews": ["Q15735939", "Q25189328", "Q5107375", "Q5110828", "Q5112832", "Q948687"]}, "date": "2009-01-23", "url": "http://breitbart.com/article.php?id=D95SVOC00&show_article=1", "content": "president barack obama speaks to reporters during a meeting about the economy...washington (ap) - in a long-expected move, president barack obama plans to sign an executive order ending the ban on federal funds for international groups that perform abortions or provide information on the option, officials told the associated press on friday. liberal groups welcomed the decision while abortion rights foes criticized the president. known as the \"mexico city policy,\" the ban has been reinstated and then reversed by republican and democratic presidents since gop president ronald reagan established it in 1984. president bill clinton ended the ban in 1993, but president george w. bush re-instituted it in 2001 as one of his first acts in office. the policy bans u.s. taxpayer money, usually in the form of u.s. agency for international development funds, from going to international family planning groups that either offer abortions or provide information, counseling or referrals about abortion. it is also known as the \"global gag rule,\" because it prohibits taxpayer funding for groups that lobby to legalize abortion or promote it as a family planning method. the democratic official and senior u.s. official who disclosed the plans did so on the condition of anonymity because they were not authorized to pre-empt obama's announcement. obama was expected to sign the executive order at a low-key event, one day after the 36th anniversary of the landmark supreme court ruling in roe v. wade that legalized abortion. the move was not a surprise as both obama and secretary of state hillary rodham clinton, who will oversee foreign aid, had promised to do away with the gag rule during the presidential campaign. clinton is to visit the u.s. agency for international development, through which much u.s. foreign aid is disbursed, later on friday. obama has spent his first days in office systematically signing executive orders reversing bush administration policies on issues ranging from foreign policy to government operations. but, save for ending the ban, obama has largely refrained from wading into ideological issues, perhaps to avoid being tagged a traditional partisan from the outset after his campaign promises to change \"business as usual\" in the often partisan-gridlocked capital. rather, obama has chosen to focus initially on issues in which there is consensus across the political spectrum and support from the public, such as closing the prison camp for suspected terrorists at guantanamo bay, cuba, to making government documents more accessible. in a move related to the lifting of the abortion ban, obama also is expected to restore funding to the u.n. population fund (unfpa) at his earliest opportunity, probably in the next budget. both he and clinton made this a campaign issue. the bush administration had barred u.s. money from going to the fund, contending that work in china supported a chinese family planning policy of coercive abortion and involuntary sterilization. unfpa has vehemently denied that it does. organizations that had pressed obama to make the abortion-ban change were jubilant. \"women's health has been severely impacted by the cutoff of assistance. president obama's actions will help reduce the number of unintended pregnancies, abortions and women dying from high-risk pregnancies because they don't have access to family planning,\" said tod preston, a spokesman for population action international, an advocacy group. anti-abortion groups criticized the move. \"president obama not long ago told the american people that he would support policies to reduce abortions, but today he is effectively guaranteeing more abortions by funding groups that promote abortion as a method of population control,\" said douglas johnson, legislative director of the national right to life committee. racist cookies: famed nyc bakery under fire for obama-inspired \"drunken negro faces' <mark>chris matthews</mark> shuts down reporter's discussion of caroline kennedy rumor was lack of sleep to blame for diane sawyer's unusual post-inaugural moments on gma? audio: irate broadway star patti lupone stops show to call out picture-taking audience member"}, {"articleID": "2013041121_00000663_W", "names": {"David Lynn": ["Q1175360", "Q28155105", "Q5236858", "Q58003126"], "Zach Johnson": ["Q139360", "Q24248263", "Q28220606"], "Tim Clark": ["Q23418760", "Q25190253", "Q29642470", "Q30315192", "Q30743874", "Q58160453", "Q713594", "Q7803315", "Q7803316", "Q7803317", "Q7803318"]}, "date": "2013-04-11", "url": "http://au.news.yahoo.com/a/-/sport/16690952/smooth-start-for-woods-as-leishman-leads/", "content": "connect with friends on facebook and start sharing new and exciting content. tiger woods opened his 19th masters campaign with a confident two-under 70 on thursday as he sought to crown a remarkable return to the top with a long-overdue 15th major title. the 37-year-old american, who regained the world number one spot last month after a two-and-a-half-year hiatus, got off to a quiet enough start, but was two under by the turn with birdies at six and eight. watched by the new love in his life, reigning winter olympic downhill champion skier lindsey vonn, the 14-time major winner stayed there until the par-five 13th, where he moved to three-under. a bogey at the bunkerless 14th hole set him back, but he parred his way in from there to tuck himself nicely in behind the leaders. the early playing conditions in the 77th edition of the year's first major were benign, with little wind, and that led to some fireworks from the early starters. none sparkled more than cricket-loving australian marc leishman, who pounded out four birdies in a row from the 13th to come in with a superb six-under 66. \"got off to a shaky start - had a few nerves early on, but got that out of the way with a birdie at three and then we were away,\" he said. england's <mark>david lynn</mark> had earlier fired a four-under par 68 to set the early pace. the 39-year-old, who finished runner-up to rory mcilory in last year's pga championship, got to five-under after 15 holes, but a bogey at 17 pegged him back. us veteran jim furyk and 2007 masters winner <mark>zach johnson</mark> both came in with 69s, with eight players - kevin na, david toms, brandt snedeker and john huh, all of the united states; <mark>tim clark</mark> of south africa, englishmen lee westwood and justin rose and kj choi of south korea - all safely home at two-under 70. reigning champion bubba watson struggled throughout and was well down the field on 75. but it was woods that was once again the full focus of attention as a win on sunday would crown his return to the top after three years of turmoil and doubt in his personal and professional life. turn sharing on remind me when i share"}, {"articleID": "2018040501_00063491_W", "names": {"Steve Howard": ["Q23670647", "Q2457386", "Q7612886"]}, "date": "2018-04-05", "url": "https://vtdigger.org/2018/04/04/uvm-health-system-pitches-new-psychiatric-hospital-berlin/", "content": "Share Tweet Share Email The Senate Institutions Committee heard testimony Wednesday on a new proposal to overhaul the mental health system. Photo by Elizabeth Hewitt/VTDigger S tate officials are considering a dramatic realignment of Vermont's mental health system that could result in more inpatient beds, shorter waits and less pressure on the state's emergency rooms. The proposals--unveiled Wednesday in simultaneous meetings before the Green Mountain Care Board and the Senate Institutions Committee--feature a new \"acute inpatient\" mental health facility of still-undetermined size on the Central Vermont Medical Center campus in Berlin. That project would produce a ripple effect, allowing the current Vermont Psychiatric Care Hospital in Berlin to become a less-intensive \"secure residential\" facility to replace the much smaller Middlesex Therapeutic Community Residence. Because those changes would take several years, officials also are considering the addition of temporary mental health treatment capacity in either Swanton or Brattleboro. Taken together, the projects would represent tens of millions of dollars of investment. And some of that would come from University of Vermont Health System, which would allocate budget overages incurred by UVM Medical Center toward mental health projects. \"I think the intent on our part was to say, we recognize this need, and we want to be a participant in the solution,\" said Dr. Robert Pierattini, who chairs the Psychiatry Department at the University of Vermont College of Medicine. The proposed changes result from the collision of two seemingly unrelated issues: UVM Medical Center overshot its revenue target in fiscal year 2017, and the state's hospitals are dealing with an increasing number of mental health patients in emergency rooms. The Green Mountain Care Board, which regulates hospital budgets, has been considering how to address the fact that UVM Medical Center's net patient revenues exceeded its state-approved budget by $38.3 million last fiscal year. A few weeks ago, the board pitched a unique solution: UVM Medical faces a possible 3 percent rate cut penalty, but the rate cut could be alleviated if the hospital agrees to make a significant investment in the state's mental health system. That system is under strain. One indicator is the fact that many mental health patients are forced to spend extended periods in emergency rooms due to a lack of available inpatient beds. On Wednesday, the Vermont Association of Hospitals and Health Systems presented data to the care board showing that the total number of days mental health patients spent in emergency rooms jumped 28.6 percent from 2015 to 2016. The statistic increased by another 29.7 percent from 2016 to 2017, when mental health patients spent a total of 5,237 days in emergency rooms. Melissa Bailey, the commissioner of the Department of Mental Health. File Photo by Erin Mansfield/VTDigger The number of mental health patients showing up at emergency departments waxes and wanes. But in the past few weeks, \"it has picked back up with a fury,\" Mental Health Commissioner Melissa Bailey said. \"We have a number of people who are waiting.\" Bailey told the care board she could not propose a single policy solution to address the increasingly intense demands on the state's mental health system. \"I'd love to sit here and say there is one easy answer,\" she said. \"What I can tell you is, that's not possible.\" That's not to say, however, that there aren't answers. And some care board members believe their budget-regulation talks with UVM Medical Center may provide a way to ease pressure on the mental health system. While the board did not vote on the matter Wednesday, one option presented to members is allowing the hospital to set aside $21 million of its fiscal 2017 revenues in order to \"enhance inpatient mental health treatment capacity in Vermont.\" Pierattini presented a plan to do just that. The proposal's centerpiece is for Central Vermont Medical Center--which is part of University of Vermont Health System--to host a new inpatient psychiatric facility. It seems likely that officials will target a bed number higher than the current psychiatric hospital, which has 25 beds. But Pierattini said he could not commit to a size for the new facility. \"We don't have a number,\" he said. \"I think arriving at that number is going to require considerable deliberation.\" But Pierattini also said the facility \"has the potential to improve care in several ways.\" First and foremost, it could provide more treatment capacity for more-timely admissions. Also, Pierattini noted that Berlin is a central location that \"would serve the entire state.\" And he said the proposed hospital's proximity to Central Vermont Medical Center and other psychiatric facilities could be advantageous. \"There's an advantage of having things together in a closer, overall, operation,\" he said. \"You can just manage your resources more thoughtfully.\" Under UVM's preliminary plan, the state's psychiatric hospital would be transformed into a secure residential setting. That's meant as a place for mental health patients to go when they're ready for discharge from a psychiatric hospital but still require support and supervision. The state's Middlesex residential facility--which has just seven beds and was supposed to be temporary--would be phased out. Bailey was enthusiastic about the UVM plan. \"We're very pleased and really interested in exploring it more with them and getting into the details,\" she said. \"We think, for parity purposes, to have psychiatric care (become) part of the general hospital is absolutely the direction to go.\" Secretary of Human Services Al Gobeille. File photo by Mike Dougherty/VTDigger State Human Services Secretary Al Gobeille also threw his support behind the proposal to locate a new inpatient mental health facility at Central Vermont Medical Center. UVM Health Network is a good partner for the state because it is large enough to take on the task of running a major mental health unit, Gobeille said. \"This is not a small undertaking,\" he said. For that reason, it will take some time even if everything goes smoothly. UVM's proposed psychiatric facility would require a certificate of need from the care board, and there would be other planning and permitting work needed before the project could move forward. According to Gobeille, UVM Health System has estimated that the new mental health facility would take three to four years to be operational. So Gobeille, in his presentation to the Senate Institutions Committee, said the state should take smaller, more-immediate steps to expand Vermont's mental health treatment capacity until the UVM Health Network-run facility opens. One option would be to revamp a unit at Northwest Regional Correctional Facility in Swanton to make it a 12-bed facility that serves people who enter the mental health system through the courts. The administration pitched that idea earlier this year, but the House did not include funding for it in the fiscal 2019 budget approved last month. Another option would be a new facility. Gobeille said the state is considering some properties in Chittenden County or central Vermont to temporarily house mental health services, but he did not offer specifics. Gobeille also told lawmakers that \"the best idea\" for a temporary facility may be to partner with the Brattleboro Retreat to conduct repairs on a wing of that facility. The state would help cover the costs. No matter the solution, Gobeille emphasized the need for short-term mental health beds. \"If you don't do the temporary (treatment options), I think we've failed this session,\" he said. Sen. Peg Flory, R-Rutland, chair of the Senate Institutions Committee. On the left is Sen. Dick Mazza, D-Grand Isle. File photo by Erin Mansfield/VTDigger Sen. Peg Flory, R-Rutland and Institutions Committee chair, said there are a lot of questions about how the administration's proposal would work. She said she does not have enough details to know what steps the Legislature would need to take before the session ends in May. \"It's got a lot of moving parts, considering we have about a month left to get these sorted out,\" Flory said. She asked Agency of Human Services officials to put together more information about how the proposal would compare to the state's current mental health system. Flory acknowledged an immediate need to expand treatment capacity. However, she is wary of spending money out of the capital bill--which is paid for by issuing bonds--on temporary solutions. \"You can make a better decision if you know what your mid-term and long-term results are going to be,\" Flory said. \"But I'm not sure we'll have those definitive answers in time this year.\" VSEA Executive Director <mark>Steve Howard</mark>. File photo by Elizabeth Hewitt/VTDigger <mark>Steve Howard</mark>, who heads the Vermont State Employees' Association, said he has concerns that a partnership with UVM Health Network on a new acute-treatment facility would create potential cracks in the system that could leave some people without access to care. <mark>Howard</mark> also has concerns that the proposal would result in fewer state employee positions. But Green Mountain Care Board Chair Kevin Mullin said the new facility could improve quality of care and access to care while reducing hospital costs associated with emergency room stays. Mullin also said it's \"a question of parity.\" \"We say that there is parity between physical and mental health,\" he said. \"And yet, no one would ever allow somebody with a broken arm or a heart problem to sit in the emergency room for more than a week at a time while they were waiting for care.\" Share Tweet Share Email If you read us, please support us."}, {"articleID": "2009111720_00275930_W", "names": {"Olli Jokinen": ["Q18632809", "Q28785376", "Q28785633", "Q706944"], "Chris Drury": ["Q2495654", "Q471491"], "Craig Anderson": ["Q3362665", "Q42841467", "Q5180694", "Q5180695", "Q5180696", "Q56334031", "Q719882"]}, "date": "2009-11-17", "url": "http://ca.entertainment.yahoo.com/s/cbc/091117/sports/sports_hockey_sp_nhl_avalanche_flames", "content": "saskatchewan (cbc) - the flames will see a top-line forward return just in time for tuesday's first-place duel with the colorado avalanche at the saddledome in calgary (9:30 p.m. et). left-winger curtis glencross is expected to rejoin jarome iginla and <mark>olli jokinen</mark> on the flames' no. 1 unit after serving a three-game suspension for a blindside hit that left the new york rangers' <mark>chris drury</mark> with a concussion. the blow landed in the middle of the recent furor over so-called \"head shots\" in the nhl because, even though no penalty was called on the play, glencross delivered a high shot to a player who did not have the puck. it appeared the calgary forward was anticipating that <mark>drury</mark> would receive a pass as the rangers broke out of their own zone. in any event, glencross was forced to sit out road games in montreal, buffalo and toronto a stretch in which the flames went 2-0-1 to extend their points streak to six games. the run has moved calgary (12-4-2) within a point of colorado, the surprise early leaders of the northwest division. glencross, 26, is no sniper he averaged 14 goals over his first two nhl seasons and has four in 15 games this year but flames coach brent sutter expects the 6-foot-1, 195-pounder to reintroduce his skating and forechecking ability. \"he's not a 40-goal scorer,\" said sutter, who had glencross skating on the top line at monday's practice. \"curtis brings a certain element to our team that we need as long as he is playing within the confines of his game.\" he has to go up and down the ice with speed, shoot pucks and get on the forecheck. \"glencross said he's looking forward to rejoining the gifted <mark>jokinen</mark> and iginla, who has seven goals in his last six games.\" it's great to play with players of that calibre, \"glencross said.\" iggy is pretty hot right now. you just have to give him the puck. \"while things are looking up for calgary, it's the opposite for the avalanche, who have lost a season-high three in a row and five of their last seven. that on the heels of a stunning 10-1-2 start that included a 3-2 victory in calgary on oct. 28. coloraro (12-5-3), picked by many to finish last in the division, is coming off an 8-2 drubbing in vancouver on saturday. <mark>craig anderson</mark>, an early-season vezina trophy frontrunner for his stellar play in net, gave up four goals in two periods before giving way to peter budaj. the backup fared even worse, allowing four more goals on eight shots. kansas city's zack greinke wins al cy young award with 16-8 record, 2.16 era voracek scores shootout winner to lift blue jackets to 3-2 win over oilers"}]