[{"articleID": "2016080123_00399248_W", "names": {"Ben Nelson": ["Q4886211", "Q4886212", "Q4886215", "Q58257672", "Q718542"]}, "date": "2016-07-31", "url": "http://heavy.com/news/2016/07/seth-rich-dnc-voter-election-fraud-democratic-national-committee-wikileaks-murdered-shot-conspiracy-washington-clinton-data-analyst-emails/#comments", "content": "DNC staffer, Seth Rich, in his DNC profile picture. (LinkedIn/Seth Rich) Seth Conrad Rich, 27, a staffer and self-described data analyst who worked for the Democratic National Committee on voting issues, was shot and killed in Washington D.C., and his murder remains mysterious. \"Police have found little information to explain his death,\" said The New York Daily News. Conspiracy theories are raging about Rich's death because of his DNC employment and the lack of an obvious motive or suspect in the case. Rich was shot on July 10, 2016 at 4:15 in the morning near a Washington D.C. neighborhood where he lived, said CBS News. The Washington Post wrote on July 11: \"Police said they have no suspects, witnesses or motive, though they are looking at whether Rich could have been slain in an attempted robbery .\" Here's what you need to know 1. His Father Says Key Items Were Not Taken Even Though It's Being Called a Possible Robbery Seth Rich was murdered in July 2016. (Facebook/Seth Rich memorial page) NBC Channel 4 in Washington says that Seth's mother, Mary Rich, said police \"told her family her son may have been the victim of an attempted robbery .\" Rich's father told The Washington Post that Seth's watch, wallet and credit cards were not taken, but he thinks Rich was \"killed after resisting a robbery in which the assailant got nothing .\" However, Acting Capt. Anthony Haythe of the Metropolitan Police Department's homicide branch said in a July news conference that all motives were being considered, said CBS. The New York Daily News quote d police as saying, \"There is no immediate indication that robbery was a motive in the attack...but it has not been ruled out as a possibility .\" The police said they are looking into whether Rich's death was tied to other robberies in the area, and his roommate told WUSA9 that Rich \"was probably walking home from his girlfriend's apartment when he was robbed and then shot .\" The Washington Post said there were two robberies \"in the city in the hour preceding the shooting, both more than one mile away .\" 2. There Was a Struggle Before Rich Was Shot Multiple Times, Including at Least Once in the Back Seth Rich was a DNC staffer when he was murdered. (Facebook/Seth Rich Memorial Page). Rich's mother told NBC Channel 4 in Washington D.C. that her son's \"hands were bruised, his knees are bruised, his face is bruised, and yet he had two shots to his back, and yet they never took anything .\" The Washington D.C. Medical Examiner's office told Heavy that Rich died from gunshot wound to the torso and the manner of death was homicide. The office did not say how many times Rich was shot and said that autopsy reports are not publicly released to the news media in D.C.. The Washington Post says at least one of Rich's multiple gunshot wounds was in the back. The shooting occurred in northwest Washington D.C.'s Bloomingdale neighborhood, said WUSA9. He was taken to the hospital, where he died, said WUSA9. Rich was discovered by police who were patrolling the area and was conscious and breathing at first, said CNN. He was talking on the phone with his girlfriend when the shooting occurred and told her not to worry about it when she heard a noise, said NBC 4. There is a $25,000 reward being offered in the Rich murder case. 3. Hillary Clinton Mentioned Rich's Death in a July Speech & Debbie Wasserman Schultz Praised Him The Washington Post has posted video of that speech. \"Surely, we can agree that weapons of war have no place on the streets of America,\" Clinton said after mentioning Rich as an example of someone killed who doesn't make the headlines. She said he had worked on voting rights for the DNC. According to CBS, former Democratic National Committee Chairwoman Debbie Wasserman Schultz said that Rich was a \"dedicated, selfless public servant who worked tirelessly to protect the most sacred right we share as Americans .\" Seth came into work every day to fight for all Americans' right to vote. We miss him so much https: //t.co/PzzFXab0b9 pic.twitter.com/wvhHEjs0Rz--The Democrats (@ TheDemocrats) July 11, 2016 Remember his name and add him to the rolls of justice. #SethConradRich. He lived to make a difference. He believed in voting rights .--Donna Brazile (@ donnabrazile) July 11, 2016 To People Magazine, friends described Rich as self-deprecating, non apathetic, a bit of a goofball, and someone who \"would stand up for anybody .\" 4. Rich Worked on the DNC's Voter Expansion Efforts & Described Himself as a Data Analyst Seth Rich with friends. (Facebook/Seth Rich memorial page). On his LinkedIn page, Rich described himself as \"Experienced and impassioned data analyst. I have an enormous interest in public service and working towards making the world a better place .\" The page says that Rich had worked as the DNC's Voter Expansion Data Director since 2014. Before that, he was a Research Data Associate for Greenberg Quinlan Rosner; a Boating Education Director and Staff Programming Director at Camp Ramah in Wisconsin; a research intern for Senator <mark>Ben Nelson</mark>; a member of the campaign staff for the Nebraska Democratic Party, an enumerator for the Census Bureau, a field organizer for Senate campaigns, and other jobs. People Magazine says he worked on voter expansion efforts for the DNC and The Washington Post says that, as a DNC staffer, he worked on a project to \"help voters easily find their polling places .\" Rich graduated from Creighton University with a B.A. in Political Science: Public Policy and History, said his LinkedIn page. 5. Conspiracy Theories Have Sprouted up Online About Rich's Murder The cover photo of the Seth Rich memorial page on Facebook. (Facebook/Seth Rich memorial page) Various conspiracy theories have sprouted up about Rich's death, without concrete evidence to back them up, but fueled in part by the WikiLeaks dump of almost 20,000 DNC emails, which led to the resignation of Wasserman Schultz. Inquistr reported \"a number of far-left and even far-right political blogs theorized that Rich--who worked on voter data--may have been a whistleblower threatening to expose election fraud carried out to help Hillary Clinton win the Democratic primary .\" On Reddit, people have theorized--again without any evidence to back it up--that Rich was the person who gave WikiLeaks the DNC emails. However, numerous news sites, such as NBC, have reported that government officials and security firms believe that Russian intelligence was behind that leak; WikiLeaks denies being tied to Russian intelligence but won't reveal its sources for the emails, which, among other things, appear to show DNC officials favoring Hillary Clinton over Bernie Sanders during the primary. Reddit threads devote exhaustive discussion to dissecting the Rich murder case. Other conspiracy theories range from accusations that Rich was a DNC whistleblower to those theorizing he was about to testify or was collaborating with the FBI. Again, there is no evidence to back those theories up. Snopes is one of the sites that has sought to debunk evidence-less claims that Rich was about to collaborate with the FBI or was bumped off by a Clinton \"hit\" team. Heat Street is another. Guccifer 2.0: 5 Fast Facts You Need to Know Who is Guccifer 2.0, the \"hacktivist' who may be behind the WikiLeaks' Democratic National Committee email dump? Or is he really the Russians? Click here to read more READ: WikiLeaks Releases Thousands of DNC Emails, Calls, Documents WikiLeaks says it has released about 20,000 internal Democratic National Committee documents it says involve prominent figures like Hillary Clinton, Chuck Todd, and Bernie Sanders. Read. Click here to read more Jessica McBride is a Heavy contributor. She was a crime, government, and breaking news reporter for the Milwaukee Journal Sentinel and reporter for the Waukesha Freeman newspaper. Her award-winning work has appeared in numerous magazine, newspaper, and online publications. She has also appeared as a crime reporter on Investigation Discovery Channel, History Channel, and Oxygen Channel. She can be reached by email at jessica.mcbride @ heavy.com. August 1, 2016 4:48 pm"}, {"articleID": "2012050708_00069309_W", "names": {"Robert Lewandowski": ["Q151269", "Q16596664"], "Mario Gomez": ["Q16729352", "Q3815119", "Q45766"], "William Hill": ["Q16209612", "Q18719475", "Q22667358", "Q39070895", "Q8009538", "Q8012338"]}, "date": "2012-05-07", "url": "http://goal.com/en/news/1717/editorial/2012/05/07/3086173/hulk-hits-form-as-bas-dost-finishes-on-a-high-how-the", "content": "more on: ajax, arsenal, borussia dortmund, chelsea fc, fc k? ln, heerenveen, liverpool, losc lille m? tropole, man utd ., manchester city fc, montpellier hsc, newcastle, olympique de marseille, stade rennais fc, tottenham, twente, jan vertonghen, shinji kagawa, bas dost, gast? n ram? rez, <mark>robert lewandowski</mark>, yann m \"vila, lukas podolski, olivier giroud, luuk de jong, edinson cavani, javi mart? nez, eden hazard, hulk, mapou yangambiwa tweet 0 comments proshots analysis by chris davie the season is already over for some players across the continent and what could be next in store for those who have enjoyed a solid campaign is an active transfer window. goal.com brings you both the best and the worst individual displays across europe over the past week as we track those who could be moving to the premier league this summer. bet: returns: sunderland? 70.00 draw? 45.00 man utd .? 14.44 bet: returns: sunderland? 80.00 draw? 45.00 man utd .? 14.00 bet: returns: sunderland? 72.50 draw? 40.00 man utd .? 14.00 good week...porto had already retained their portuguese league crown by the time their penultimate game of the season against sporting lisbon came around but that didn't stop hulk from grabbing the headlines once again. the brazilian was threatening throughout the fixture but it took until the 82nd minute for the forward to break sporting's defence from the penalty spot. hulk saved his best until last however, as a storming run from the halfway line saw him power past two sporting defenders before rounding rui patricio and slotting home. the 25-year-old is likely to be one of europe's hottest properties this summer despite possessing an? 85 million release clause. chelsea are believed to be the premier league front-runners for the brazil international, however, roman abramovich could be fighting off interest from french club paris saint-germain. hulk d.o.b: jul 25, 1986 age: 25 club stats this season liga sagres appearances 25 european & cup appearances 13 total appearances 38 total goals 21 international file senior debut brazil, 2009 senior apps 9 senior goals 0 it was also a good week for bas dost, who netted in heerenveen's 4-3 victory against twente last wednesday and took his tally to 38 for the season on sunday as his side rounded off the season with a loss to feyenoord. the 22-year-old ended his campaign as the eredivisie's top scorer with 32 goals. luuk de jong grabbed a double for twente in their 4-3 loss against heerenveen, while newcastle united target douglas also featured and scored in the defeat. de jong failed to find the net in his side's 4-2 defeat at venlo on sunday but the liverpool target finished second in the eredivisie's scoring charts, while his manager, steve mcclaren, claimed the forward is perfect for the premier league. jan vertonghen enjoyed a solid outing in ajax's 2-0 victory at home to venlo last wednesday, while the arsenal and tottenham target got on the scoresheet in his side's 3-1 win at vitesse on sunday. olivier giroud netted late on in montpellier's 2-2 draw at home to evian last tuesday and was influential throughout. defender mapou yanga-mbiwa also featured and despite being at the heart of a defence which shipped two goals, the 22-year-old was impressive in the air and with his distribution. arsenal target yann m\" vila was comfortably rennes' best player in their 2-0 defeat at bordeaux last wednesday as he provided a strong presence in midfield. eden hazard may not have got on the scoresheet in lille's 1-0 victory over nice but the forward was instrumental throughout the fixture. tottenham's january target loic remy netted the winner in marseille's victory over nancy. gaston ramirez, who reportedly remains on liverpool's radar, continued his excellent scoring form last wednesday by netting the winner in bologna's victory at catania last wednesday but missed his side's win against napoli through suspension. bad week...out of position and off the pitch in the 72nd minute, javi martinez cut a frustrated figure against real madrid last wednesday. martinez, who primarily operates as a defensive midfielder, has been used mainly at centre-back by athletic bilbao coach marcelo bielsa this season, but the 23-year-old looked out of his comfort zone against jose mourinho's charges from the start after giving away a penalty in the 11th minute. the spain international continued to struggle with the pace of cristiano ronaldo and saw red 18 minutes from time for a second handball. martinez continued his spat with ronaldo and the pair had a heated exchange after real madrid's 3-0 victory. arsenal are believed to be in the hunt to sign martinez as he appears to be a cheaper option than rennes' defensive midfielder m \"vila. javi martinez d.o.b: sep 2, 1988 age: 23 club stats this season la liga appearances 30 european & cup appearances 21 total appearances 51 total goals 4 international file senior debut spain, 2010 senior apps 7 senior goals 0 it was also a bad week for edinson cavani, who, despite scoring a penalty in napoli's 2-0 win against palermo last tuesday, struggled to make an impact in his side's 2-0 defeat at bologna on sunday. shinji kagawa failed to make an impression in dortmund's final game of the season against freiburg. the japan international failed to ignite his side in the final third and was substituted for ivan perisic after 65 minutes. lukas podolski played his final match for koln who suffered a 4-1 defeat at home to bayern munich and were subsequently relegated from the bundesliga. the arsenal-bound striker had missed a few days of training because of illness prior to the match and an assist for milivoje novakovic's goal was his only highlight in the loss. surprise package...dortmund ended their bundesliga-winning campaign with a 4-0 victory over freiburg and <mark>robert lewandowski</mark> was on form once again as he bagged a double in the convincing win. the forward's first strike oozed composure as he plucked neven subotic's raking 45-yard pass from the air and went on to escape freiburg defender mensur mujdza before rounding daniel batz and slotting into an empty net. <mark>lewandowski</mark>'s second came seven minutes later as he held this ground in the box and pounced on lukasz piszczek's parried shot to take his tally to 27 for the season and ended third in the bundesliga top-scorer chart behind <mark>mario gomez</mark> and klaas-jan huntelaar. <mark>robert lewandowski</mark> d.o.b: aug 21, 1988 age: 23 club stats this season bundesliga appearances 34 european & cup appearances 12 total appearances 46 total goals 27 international file senior debut poland, 2008 senior apps 40 senior goals 18 last month, dortmund coach jurgen klopp hit out at bayern munich's reported interest in <mark>lewandowski</mark>, who had snubbed an offer from the bundesliga champions to extend his contract beyond 2014 .\" who do they think we are? he is not available, \"said klopp .\" do bayern think that they can just come along and ask if \"lewi' would like to play for them when <mark>mario gomez</mark> can't for some reason? that's a load of rubbish and can be ruled out .\" the poland international has been in fine form for dortmund this term and the 23-year-old's rounded ability would sit well in side who could struggle for goals in the premier league next season. <mark>lewandowski</mark>, however, recently drew criticism from dortmund team-mate kagawa, who blasted the striker for his single-minded mentality in front of goal. \"<mark>lewandowski</mark>'s game is purely focused on trying to score himself, rather than playing together with his team-mates,\" kagawa told nikkei. \"he never looks around him for players who are in a better position than him. that's why i hardly get the ball from him. there's nothing you can do about that, though. that's simply the type of player he is .\" follow chris davie on sign up with 188bet for a free bet up to? 25 - great prices, every game open an account with sportingbet today and get up to? 50 in free bets! sign up with <mark>william hill</mark> for a free bet up to? 25 sign up with bet365 for a free bet up to? 200 sign up with paddy power for a free bet up to? 50 tweet follow goal.com on twitter follow goal.com on facebook"}, {"articleID": "2009031123_00059012_W", "names": {"Mario Soto": ["Q6764973", "Q687898"], "Alex Gonzalez": ["Q281706", "Q3129298", "Q3291768"]}, "date": "2009-03-11", "url": "http://daytondailynews.com/n/content/oh/story/sports/pro/reds/2009/03/10/ddn031009spredsnotes.html?cxtype=rss&cxsvc=7&cxcat=35", "content": "good times on tap there's plenty of fun on tap across dayton for st. patrick's day. seen and overheard: warm weather sign, surf is up at dayton area stores book nook: miami university - hotbed of radicalism...chick ludwig at large: bengals eye ot; browns want a...qb? ohio politics: john boehner has some stuff he wants to talk to...dayton daily news | photo galleries | editorial cartoons on rush limbaugh reds notes cueto ankle injury \"no problem,' says g.m. jocketty hal mccoy staff writer tuesday, march 10, 2009 clearwater, fla. - cincinnati reds general manager walt jocketty, told there was a rumor that pitcher johnny cueto was injured, checked it out and said,\" nothing wrong. \"an american league scout asked early monday,\" how's cueto? i heard he was hurt. that's what a reds official told me. \"cueto pitched 4 2/3 innings sunday, march 8, for the dominican republic in the world baseball classic, giving up no runs and three hits while striking out five. to be certain, jocketty called reds coach/dominican pitching coach <mark>mario soto</mark>,\" no problem, \"jocketty said .\" cueto did twist his ankle a bit covering first base, but <mark>soto</mark> said, \"no problemo,' and cueto did his running today .\" it's still early jeff keppinger has been playing shortstop until <mark>alex gonzalez</mark> makes his field debut tonight in tampa against the new york yankees. keppinger is hitting .090 (2-22) and outfielder jacque jones is hitting .111 (2-18) but manager dusty baker is not concerned, \"because we're talking, what, 15 at-bats? it took me 200 at-bats into the season before i felt comfortable .\" i've seen guys hit .400 in the spring but when they put that third deck on the field (a major-league park) he doesn't hit at all. \"encarnacion hurting third baseman edwin encarnacion missed a second straight game with a sore hand, but it isn't considered serious .\" he is hurting a little bit, but we're at a point where we don't have to rush, \"said baker .\" it's his left hand, the same as last spring, something you get from checked swings and not swinging properly. \"kennard improves baker used centerville native jeff kennard as an example of not rushing to judgment .\" kennard looked great sunday (one inning, one hit, three strikeouts), \"he said .\" before that, he didn't look good at all (two innings, six runs, six hits). \"rss copyright © 2009 cox ohio publishing, dayton, ohio, usa. all rights reserved."}, {"articleID": "2013111421_00081198_W", "names": {"Steve Davis": ["Q1275803", "Q16201101", "Q30122863", "Q310450", "Q3529787", "Q7612349", "Q7612350", "Q7612351", "Q7612353", "Q7612354", "Q7612355", "Q7612356", "Q7612358"], "David Wheeler": ["Q16235156", "Q212790", "Q3703176", "Q5241010"]}, "date": "2013-11-14", "url": "http://feeds.nbcnews.com/c/35002/f/663306/s/33ad7e83/sc/42/l/0Lusnews0Bnbcnews0N0C0Inews0C20A130C110C140C214510A290Ewhitey0Ebulger0Elooking0Eat0Elife0Eafter0Edealing0Edeath0Ein0Eboston0Dlite/story01.htm", "content": "Recommended: Whitey Bulger looking at life after dealing death in Boston Recommended: Secret service agent removed after leaving bullet in woman's hotel room Recommended: Baby boy gunned down with his dad in New Orleans car ambush Recommended: Illegal ivory crush in Denver to send message to poachers, traffickers time pubdate datetime = \"2013-11-14T08:15:44 -05:00\" > Whitey Bulger looking at life after dealing death in Boston A booking photo of James \"Whitey' Bulger. Bulger. By Alexandra Pournaras and Tracy Connor, NBC News On the first day of his sentencing hearing, Whitey Bulger was called a\" rat, \"a\" coward, \"\"Satan\" and a \"sad, lonely, irrelevant old man .\" For part two, he'll learn if he's getting a new label: lifer. A federal judge is set to sentence the notorious gangster Thursday morning for 11 murders and a host of other crimes committed during his reign as South Boston's crime kingpin in the 1970s and 1980s. Prosecutors have recommended two life sentences plus five years, but even if the judge doesn't go that far, any stringent sentence will mean the 84-year-old will be behind bars until he dies. Defiant to the end, Bulger refused to meet the relatives' eyes as they vented grief and rage they have carried for decades. \"Look at me,\" pleaded Theresa Barrett Bond, daughter of Arthur \"Bucky\" Barrett, who was killed in 1983. Patricia Donahue, wife of one of Whitey Bulger's victims faced the former gangster during his sentencing hearing, says she wanted to give her husband a personality. Bulger instead studied the papers in front of him. <mark>Steve Davis</mark>, whose sister Debra was strangled in 1981, also demanded Bulger look at him and swore when he wouldn't. \"I'd like to strangle him myself,\" he said. The once-feared Winter Hill Gang leader, who spent 16 years on the lam, was convicted in August of 31 out of 32 counts, and the jury found prosecutors proved Bulger was involved in 11 out of 19 murders in the indictment. One by one, victims' relatives stood up and told stories of fathers and husbands who went out one day and never came home, who missed first days of schools and weddings. They blasted Bulger for his cruelty but also blamed the FBI for turning a blind eye to his crimes while he was working as an informant. It was a tip from a corrupt agent that led Bulger to skip Beantown in 1994, the start of a long exile that saw him named one of the FBI's most wanted fugitives. He was nabbed in 2011 while living in California with his girlfriend, Catherine Grieg, who is serving eight years for helping him elude capture. The trial featured a rogue's gallery of murderous ex-cronies - including John \"The Executioner\" Martorano and Stephen \"The Rifleman\" Flemmi - who took the stand to pin crime after crime on Bulger. The star witnesses were so unsavory that the jury let Bulger off the hook for eight killings, but found he had enough blood on his hands to support a racketeering conviction. The victims' families said there was some solace in the knowledge that Bulger would spend the rest of his day in a prison cell. \"You don't even matter anymore,\" said <mark>David Wheeler</mark>, whose businessman father was executed on Bulger's orders. Exclusive: Obama personally apologizes for Americans losing health coverage (6710) Family demands charges after unarmed 19-year-old woman shot dead in potential (1162) NJ mourners on their way to funeral beat driver for honking his horn (885) \"What I'm trying to do is do my job': Ted Cruz makes late-night debut (1696)"}, {"articleID": "2013080915_00054820_W", "names": {"Paul Dean": ["Q334578", "Q3370998", "Q53843476", "Q57269178", "Q7150199", "Q7150200"]}, "date": "2013-08-09", "url": "http://www.salemnews.com/archive/x389851586/Peabodys-Waselchuk-reflects-on-pitching-against-Aaron#disqus_thread", "content": "John Waselchuk might never have known he was mentioned in \"The Last Hero A Life of Henry Aaron\" if his grandson hadn't found out about it. The book which is written by Howard Bryant is a biography of one of America's greatest baseball players of all-time. Fifty years ago the Peabody Hall of Famer pitched to the great Aaron in the South Atlantic League which was known as the Sally. Waselchuk, one of many great baseball talents to come out of the Leather City in the 1940's, made a lasting impression on one of the greatest hitters to ever play the game. And, Waselchuk earned the bragging rights to the claim that he struck out the legend. \"My grandson is a computer buff, and he saw my name in Aaron's book,\" said Waselchuk, a 1945 Peabody High graduate. \"It had been out two or three months before he saw it (released in 2010). Aaron called me\" the pip-squeak of Peabody, Mass.' \"I was 5-foot-8, 150 pounds, but a very hard thrower. Aaron said I had the best curve ball in the league. I know he hit me, but I struck him out. Hank Aaron was probably the best hitter in the big leagues, and back then there was no talk about drugs. I never heard one word about anybody on drugs in my whole career. It was a lot different than it is today with all the steroid stuff .\" Waselchuk will never forget playing for the Cubs minor league team in Macon, Georgia in 1953 when they faced Jacksonville. The Braves had three of the first black players in the league as a couple of teams in the league were beginning to break the color line. Aaron and Felix Mantilla went on to become major league stars. At that time most areas in the South were still segregated, there were only five African-Americans in the entire league. Jim Crow laws were still in existence in many cities where the Sally League played, and Aaron, who came out of the Negro League, was keenly aware of racism because he experienced it first-hand. Fans were even separated in the stands with one section for whites and another for blacks. In the book Aaron said he couldn't remember which city was the worst because they were all bad. White fans often yelled insults at black ball players; It was a tense situation both on and off the field. One game that summer, Waselchuk was on the mound for the Macon Peaches when Mantilla came to the plate. Mantilla, who was from Cuba, had been getting hit all season, and was not happy about a ball up around his head. In his book Bryant describes the incident in some detail, writing: \"Then came the game in July when a career minor-leaguer named John Waselchuk threw at Mantilla's head one time too many. Waselchuk was a pip-squeak from Peabody, Massachusetts - five eight, 150 pounds - but a hard-throwing one, with the best curveball in the Sally. Waselchuk was a tough kid, a veteran; he'd joined the navy directly after graduating from high school, then sailed the Mediterranean for three years before signing with the Cubs organization in 1949 .\" Mantilla didn't take it kindly and started for the pitcher's mound. Aaron told Bryant the atmosphere was tense, and he feared a race riot might break out. After the benches cleared police arrived on the scene with firearms ready and went into the crowd to keep blacks and white apart. It was black teammate Horace Garner who grabbed Mantilla and threw him to the ground to calm things down. \"I remember the ball park being so crowded that night with a lot of black people in the stands,\" Waselchuk said. \"They never saw any black players back then so I guess they came out to get a look at Aaron and Mantilla. I was pitching that night and right away I threw a couple high and inside. My catcher called the signs, and I did what he said .\" I guess I threw too close, and he (Mantilla) didn't like it. There was a big ballyhoo. The police went out on the field to calm things down. I didn't know a lot about Aaron or Mantilla at the time, but some of the guys on my team did. I guess that's why my catcher called those pitches to try to slow him down and brush him back. I always just did what my catchers told me to do; I wasn't trying to hit him. That's one game I'll never forget, and I guess Aaron must still remember it, too. I had a good laugh about being called the pip-squeak. When I was little, my brothers used to call me Wolfie, and it stuck. \"Hammerin' Hank went on to have a great major league career with the then Milwaukee and later Atlanta Braves. He hit at least 30 homers in a season 15 times and was the first player to ever hit 500 dingers and get 3,000 hits. He is best remembered for surpassing Babe Ruth's home run record, and was a first ballot selection to the Hall of Fame. Aaron was a top prospect out of Alabama, who after a brief stint in the Negro League, made a name for himself in the SALLY (South Atlantic League) where most of the teams were located in the Southeastern part of the country. He led his team to the league championship in 1953 before going up to the Show. Waselchuk's career After he got out of the Navy, Waselchuk signed with the Cubs and was assigned to Springfield in the New England League after spring training .\" I was so happy because there was a team in Lynn, and I was going to be playing close to home, \"Waselchuk said .\" Then I heard the rumor that the \"Axe' was in town. I had no idea who they were talking about, but it was the farm director. He started sending players down, and I got called into his office. I was off to Clovis, New Mexico to play for a team that was in last place. My manager was <mark>Paul Dean</mark>, who was Dizzy <mark>Dean</mark>'s brother .\" Waselchuk had a 16-9 record and made the all-star team in his first year there. He and a teammate drove to Albuquerque to play in the game. Things were going so well he felt he would be moved up the following year, but after only four days of spring training was told to go back to Clovis. \"I was disappointed; that took a little starch out of me,\" he said. \"I figured I was going to move up. Back then there weren't very many major league teams like there are today, and you went where they told you or you didn't play. At mid-season I was sent to the Three I's League (Illinois, Indiana, and Iowa) to play in Decatur, Illinois. I finished the season there, and the next year went to Greensboro, North Carolina in the Carolina League .\" I won 15 games and lost 9 with 4 shutouts, and came back home to my father and mother's farm in South Peabody. I was always glad to get away from the farm because my father was a workaholic and kept me busy all the time. I was looking forward to getting a new contract, and when I opened the mail my contract was for the same club and the same money so I had to go back. My next move was to Class A Macon in the Sally where I spent two years. \"Old Timers Jimmy Fund Game Waselchuk is the only living member of the first Old Timer's Baseball Game, the a popular event with the Peabody Police that takes place each Labor Day and raises money for The Jimmy Fund .\" Buzz Surman suggested it to me, and at first I wasn't interested, but I came home and talked it over with my wife, \"said Waselchuk .\" She told me to do it, and that first year we raised $10,000 which I thought was wonderful. I got a bunch of people from all over to come to Emerson Park to play. Johnny Marco, Kenny St. Pierre, Buzz, and so many others that were there every year are all deceased now. \"I usually make a little speech, and I used to throw out the first pitch. Every year the Peabody Police leave a jersey in my mail box with a note saying\" Make sure you are there .' \"This year's game, the 57th, will be held on September 2 at Emerson. The game begins at 10 a.m. but the festivities for kids start at 8 a.m.\" It's a lot of fun and for such a great cause, \"said Waselchuk .\" I wouldn't miss it. \""}, {"articleID": "2011062210_00086470_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Andrew Mitchell": ["Q333261", "Q4758038", "Q4758039", "Q4758043", "Q48796982", "Q54310554", "Q57820261"]}, "date": "2011-06-22", "url": "http://spectator.co.uk/coffeehouse/7044093/public-opinion-on-international-aid-isnt-where-cameron-thinks-it-is.thtml", "content": "\"my dad's taste in music is so embarrassing - he likes the same stuff i like .' wednesday, 22nd june 2011 public opinion on international aid isn't where <mark>cameron</mark> thinks it is <mark>andrew mitchell</mark> was recently informed that the public is split 50:50 for and against increasing the international aid budget to? 12 billion in 2013. a yougov poll for politics home suggests that he should get some better advice. the poll shows that while the public is indeed split fairly evenly on the general principle of aid (41 per cent in favour, 38 per cent against), when it comes to the government's promise to increase the aid budget by a third, those against outnumber those for by more than 2 to 1. the policy is by no means a cameroon brainchild. in 1970 the united nations set the target for government aid at 0.7 per cent of gni; in 2004 the labour government pledged to meet it by 2013 and in 2006 <mark>david cameron</mark> signed the tories up to that pledge. it was a key part of the wristbands and huskies\" detoxification \"of the\" nasty party'. unfortunately for <mark>cameron</mark>, he seems to have misjudged public sentiment on this issue. only 7 per cent say the decision to increase the aid budget makes them more favouable towards the conservatives, while 37 per cent say it makes them less favourable. why the negativity? there is a good deal of concern about the effects of international aid. 49 per cent say it \"enhances the power of bad governments in developing countries\" , while 55 per cent believe it \"discourages governments in developing countries from spending money on their own people\". there is also widespread scepticism as to how well aid is spent. the strongest argument against aid seems to be that it \"fails to reach ordinary people in the developed world, and is wasted by corrupt governments\" : 69 per cent agree. people are also not swayed by the \"it's in our own interests\" arguments for aid. half reject the arguments that it helps reduce terrorism, and 44 per cent say it does not reduce immigration into the uk. in addition, the plurality that believes we have a \"moral responsibility\" to give aid is surprisingly small: 38 per cent agree, while 33 per cent disagree. on the other hand, 41 per cent agree with the claim that \"international aid improves diplomatic relations with countries in receipt of aid, whose support we may need in the future\" - this seems to be the most convincing argument in favour of aid (just 22 per cent disagree). the poll also raises a further worry about <mark>cameron</mark>'s policy: that it may actually reduce charitable donations to developing nations. a full quarter of respondents say the that if the government does increase aid, they would be less likely to donate to an overseas aid charity, including 17 per cent who would be much less likely to. the present finder 1,700 unusual christmas presents request catalogue 01935 815 195 quote spec10 for 10% discount www.presentfinder.co.uk"}, {"articleID": "2019052408_00045214_W", "names": {"Lawrence Wong": ["Q22099560", "Q6504758"]}, "date": "2019-05-24", "url": "https://www.theonlinecitizen.com/2019/05/24/former-cna-reporter-recalls-how-pm-lee-threw-a-tantrum-after-being-questioned-about-ho-chings-salary/", "content": "Former CNA reporter recalls how PM Lee threw a tantrum after being questioned about Ho Ching's salary Kathleen. F 2019-05-24 Current Affairs Former Channel NewsAsia (CNA) reporter Haseenah Koyakutty shared a blog post written by Reform Party chief, Kenneth Jeyaretnam in which he again questions the secrecy behind the salary of Temasek Holdings CEO and wife of Prime Minister Lee Hsien Loong, Ho Ching. Ms Koyakutty said she's \"glad' that Mr Jeyaretnam is remaining persistent on the issue which she herself has attempted to dig into several times before. #Singapore #Succession #HoChing: Kenneth ain't gonna let go on this Ho Ching salary topic, and I'm glad persistence pays!\" At least the fact that the @ wpsg has asked (the) question for the first time is a breakthrough of sorts. \"⬇ ️ 1/5 https: //t.co/KHKrvy54YY--Haseenah Koyakutty (@ HaseenahKoya) May 21, 2019 She explained that she had once asked the Prime Minister Lee Hsien Loong in a media face time in about this very topic in 2004 just before he assumed the Premiership and that he apparently\" did not like it'. A civil servant had apparently told the reporter that the PM went \"ballistic' afterwards. Ms Koyakutty also noted that the PM hadn't answered the question properly. She said,\" I appreciated the civil servant's initiative to let me know as a friend but had PM addressed by question properly back then without temper tantrum, maybe he wouldn't be in hot soup today? \"She then drew a comparison to Myanmar's own Aung San Suu Kyi's\" entitled' behaviour which has revealed itself in the past few years. #Singapore #Succession #HoChing: Hey PM Lee, is it true you went ballistic? Lol. It's a very Suu Kyi kinda entitled princess or princeling behavior. #JustSaying And oh, when will you #ResignPMLee? 5/5--Haseenah Koyakutty (@ HaseenahKoya) May 21, 2019 TOC has reached out to the Prime Minister's Office for comment on these statements made by Ms Koyakutty. No answers, only deflections In his article, Mr Jeyaretnam highlights Worker's Party MP Png Eng Huat asking the Ministry of Finance (MOF) in Parliament for details about the remuneration of the top brass at Temasek Holdings and GIC--a holding company and sovereign wealth fund, both owned by the Singapore government. In Parliament, Second Finance Minister <mark>Lawrence Wong</mark> responded to MP Png's question by saying that the government has an \"arms-length' relationship with Temasek and GIC and that the government refrains from interfering with their Boards' decisions, such as the appointment of Ho Ching as CEO of Temasek. He later adds that salaries at Temasek and GIC are decided respectively by independent boards .\" Broadly speaking, both entities adopt remuneration frameworks that are based on performance and industry benchmarks \", he explained. Mr Jeyaretnam said,\" If I am wrong about the likely billions of dollars Ho Ching has been paid, then why has the Government refused to tell us her earnings? Why is it a state secret? \"Temasek, as TOC has reported before, is an exempt private company under the Singapore Companies Act, meaning it is not required to publish its audited statutory consolidated financial statements. Without those, we have no way of know just how much Ho Ching makes as CEO. When Mr Png pointed out in a follow up question that the government should know the remuneration structures of the companies of which they are the major shareholders, Mr <mark>Wong</mark> proceed to merely explain\" the system' they are attempting to design with Temasek and GIC--sidestepping any discussion of remuneration. This response is entirely contradictory to what the Minister of Law and Home Affairs K Shanmugam had said in parliament before that \"you can ask for whatever information that you want and we will either have to give you the information or we will have to explain to you why we cannot give it\". Mr <mark>Wong</mark>'s answer to WP's question clearly is neither informative nor does it explain why the actual answer cannot be given. It's merely deflective. We still don't know what Ho Ching's salary is or why that information cannot be made public."}, {"articleID": "2016080123_00071299_W", "names": {"Tom Bolton": ["Q29382785", "Q6960309", "Q7815005", "Q7815006"]}, "date": "2016-08-01", "url": "https://www.noozhawk.com/article/bill_macfadyen_2-year-old_saved_from_drowning_near_steanrs_wharf20160729", "content": "Bill Macfadyen Local News Bill Macfadyen: Rapid Response from Passersby Prevents 2-Year-Old from Becoming Drowning Victim Before bringing the heat, NoozWeek's Top 5 also has a La Cumbre Plaza holdup, a Paula Lopez sighting that has come and gone, and a depraved double-sexual assault Share on emailShare on print The political conventions are over, and we have our 2016 presidential nominees. That asteroid option is looking better and better. While we await the apocalypse, there were 91,801 people who read Noozhawk this past week, based on our Google Analytics. Here's my own take on your top stories: 1. 2-Year-Old Pulled from Ocean Near Stearns Wharf as Possible Drowning Reported The quick actions of passersby--including a visiting firefighter from Florida--helped save the life of a 2-year-old boy who was pulled from the ocean near Stearns Wharf in Santa Barbara the evening of July 24. The child was found submerged just after 6 p.m. in an incident that initially was called in as \"a possible drowning .\" Santa Barbara Fire Battalion Chief Chris Mailes said good Samaritans immediately set to work trying to revive the boy before emergency personnel could get there a few minutes later. The child was rushed to Santa Barbara Cottage Hospital by American Medical Response ambulance. Details of his condition were not immediately available, but a witness later told our Giana Magnoli that he had made a full recovery. Virginia Beaufort, a program coordinator at UC Santa Barbara, came upon the commotion with her boyfriend, Steven Curry, a firefighter from Rockledge, Fla., not to be confused with another Warrior with a different spelling of his first name. She said Curry administered mouth-to-mouth resuscitation on the youngster while a second passerby assisted with chest compressions. According to Beaufort, authorities let her know that the child was OK. New to Santa Barbara and to Noozhawk, she was not prepared for the idiotic--my word, not hers--comments a couple of readers posted on our story. \"I am a little appalled at the inaccurate comments people add to news stories,\" Beaufort said. \"I noticed some suggesting that the child passed away...So inappropriate!\" Yes, Virginia, I agree. But at least they didn't accuse the kid of toddling while texting. Not yet anyway. 2. Man Robbed at Knifepoint at La Cumbre Plaza in Santa Barbara Knife-wielding bandits held up an unsuspecting shopper at Santa Barbara's La Cumbre Plaza on July 23, making off with the merchandise he had just purchased. Santa Barbara police Lt. Kenneth Kushner said the victim was walking to his car when he was confronted by a man and a woman in the parking lot. The man brandished a knife and demanded the packages. Kushner said the victim complied, and the couple ran off with their loot. The shopper was not injured in the incident. It seems so anti-climactic after nearly a year of sound and fury. And delays. So many delays. Back in the news. (Santa Barbara County Jail photo) After reaching a plea deal in her DUI case and being sentenced to jail earlier this year, former KEYT and KCOY News anchor Paula Lopez Ochoa is instead in the Santa Barbara County Sheriff's Department electronic-monitoring program. Sheriff's spokeswoman Kelly Hoover said Lopez applied for and was accepted into the monitoring program, rather than going to actual jail. She declined to disclose specific restrictions of the monitoring, but said enrollees are allowed to leave their residences to go to work, school, counseling and religious services. A Superior Court judge will review Lopez's case again on Oct. 28. As just about everyone knows, Lopez was arrested during a Sept. 6-7 incident in Goleta and subsequently charged with several misdemeanor counts, including driving under the influence and battery on a police officer. The altercation occurred a few hours after it was reported that a motorist, believed to be Lopez, was seen driving the wrong way on Highway 101 on the Gaviota coast. Under the terms of her plea deal, Lopez was sentenced to 120 days in jail and three years of probation, which includes attending DUI school, continuing her therapy, not using alcohol, and taking the anti-alcohol drug Antabuse for three years. Lopez has acknowledged an ongoing battle with alcoholism, and has said she was getting medical treatment after a day-long disappearance and a separate public intoxication arrest in 2013. I wish her all the best with her recovery, and I hope she and her family are getting the help they need. [Noozhawk's note: I had just posted this when our Giana Magnoli got word that Lopez already has been released from electronic monitoring. She was added to the program June 9 and was a free woman as of July 28--pending probation, of course. For the math-challenged like me, that's 50 days of her 120-day sentence .] A transient from Ventura County was arrested by Santa Barbara police the night of July 23 after a day-long manhunt following an alleged sexual assault of two young girls. Chalk up this arrest to community policing. (Santa Barbara Police Department photo) The suspect--identified as 39-year-old Matthew Robert Torres--was tracked down via an impressive police review of surveillance video from area businesses. He was taken into custody downtown, about two miles away from the alleged crime scene. According to Sgt. Riley Harwood, officers were dispatched on a suspicious subject call to a waterfront-area apartment just after 4 a.m.. He said a man allegedly had entered the unlocked residence while the family was asleep, went into a bedroom where the two sisters slept and assaulted them. The girls are both under the age of 14, he added. \"Noise made by the girls roused their father, who confronted Torres and ushered him out of the apartment,\" Harwood said. \"Once Torres was gone, the victims' father checked on his daughters and discovered that they had been molested .\" Detectives sprang into action, and found a business in the 200 block of State Street that had surveillance footage of a man matching the suspect's description. The images were released to the public, and the public responded. Officers spotted Torres around 9:30 p.m. and arrested him near the Ralphs supermarket at the corner of Chapala and Carrillo streets. \"He is a major, major threat to the community, and I'm really glad we were able to take him into custody,\" Lt. Kenneth Kushner told our <mark>Tom Bolton</mark> after the arrest. Torres was booked into County Jail on two counts of sexual assault and burglary. Bail was set at $100,000. 5. Late-Night Sundowner Winds Cause Record High Temperatures in Santa Barbara Because of the east-west orientation of Santa Barbara County's South Coast and the Santa Ynez Mountains rising above it, sundowner winds are largely a Santa Barbara phenomenon. The offshore winds blow when a region of high pressure is directly to the north, and they're strongest when a pressure gradient forms perpendicular to the mountains' axis. They also can be hot as hell because the air heats up and dries out as the gusty winds descend the mountainside. Sundowners typically occur in the late afternoon or early evening, so it was pretty unusual when the temperature began spiking late on the night of July 22. Since I'm a heat freak and had all of the windows open at my house in the Montecito foothills, I couldn't help but notice that the balmy conditions at actual sundown had risen to 81 degrees by around 10:30 p.m. Less than an hour later, my thermometer displayed 94, and when I opened the back door it was like opening a fully engaged oven--if the oven had a powerful fan blowing the air right at me. As it turns out, it was a record-setting night. According to National Weather Service meteorologist Scott Sukup, the Santa Barbara Airport hit 94 degrees at 11:43 p.m., melting the previous high for the day, a 92 back in 1960. I loved it, but our Alaskan malamute was not so welcoming. I turned on the AC for her. • • • Last Year on Noozhawk • • • Bill Macfadyen's Story of the Week Let's cut to the cheese, er, the chase: Divers Discover 340-Year-Old \"Dairy Product' in Shipwreck. • • • • • • How You Can Help Noozhawk If you really like what you're seeing on Noozhawk, you can help support our work by joining our Hawks Club. High-quality journalism doesn't come cheap, and each donation helps us continue to provide you with unmatched local news and in-depth reporting on the issues that you care about. How can you help? It's easy. & raquo; Join our Hawks Club. Red-Tailed Hawk, $5 a month; Cooper's Hawk, $10 a month; Red-Shouldered Hawk, $25 a month; Birds of a Feather, $52 a year. Checks can be snail-mailed to Noozhawk, P.O. Box 101, Santa Barbara 93102. & raquo;. (JavaScript must be enabled to view this email address) or market your business, organization, service or event."}, {"articleID": "2011121002_00002990_W", "names": {"John Ramsay": ["Q22639403", "Q43393546", "Q43913797", "Q506719"], "Ian Rankin": ["Q318431", "Q5982668"], "Alan Brown": ["Q18377883", "Q19883288", "Q22958634", "Q3528979", "Q43240621", "Q4706257", "Q4706259", "Q4706261", "Q4706263", "Q47546087"]}, "date": "2011-12-10", "url": "http://scotsman.com/morgan_academy_fired_up_to_give_their_local_rivals_a_hot_reception_1_2001747", "content": "morgan academy fired up to give their local rivals a hot reception published on saturday 10 december 2011 01:48 there is nothing like a local derby to warm supporters on a wintry afternoon and morgan academy fp president <mark>john ramsay</mark> is looking forward to seeing his side take on old rivals dundee hsfp in the rbs caledonia regional cup today. the rbs premier one side make the short journey to the premier three outfit's alloway place ground for the 2pm kick-off with a large crowd set to be in attendance. both clubs are holding pre-match lunches, with the dundee hsfp supporters being bussed up in time for kick-off, and <mark>ramsay</mark> said: \"it has been a few years since we were able to welcome dundee hsfp to our place in a competitive fixture, so everyone is looking forward to it .\" we know they are a very good side, but our players will be up for giving it everything they have got. \"dundee hsfp head coach <mark>ian rankin</mark> has named a strong squad including scotland club internationals harry duthie, andy dymock and <mark>alan brown</mark>. he said:\" the last few weeks have seen some players playing british & irish cup games, some playing for the twos, some playing under dual registration arrangements and some resting and recovering from niggling injuries. \"this week, however, all are back and, after an encouraging performance against heriot's recently, our squad is looking forward to renewing acquaintances with their closest neighbours .\" that match takes place in pool a, as does kirkcaldy against aberdeen grammar (2pm). for the visitors, morgan ward and alex haggart start at half back, with rob aloe returning from new zealand and taking a place on the bench. grammar skipper murray douglas hails from kirkcaldy, so he will be especially keen to return north with a win. in pool b, perthshire welcome stirling county to the north inch with falkirk travelling to cupar to face howe of fife. both start at 2pm. at netherdale gala and hawick meet in the rbs border regional cup, while peebles host selkirk and kelso visit jed-forest. this trio of matches are at 3pm. sign in to be able to comment on this story. parks plays down edinburgh's metro marvel as he focuses on cup progress temperature: 3 c to 5 c wind speed: 10 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by temperature: 3 c to 7 c wind speed: 13 mph temperature: 3 c to 7 c wind speed: 18 mph temperature: 4 c to 6 c wind speed: 25 mph"}, {"articleID": "2013011206_00014988_W", "names": {"Tim Chen": ["Q16237700", "Q25189439"]}, "date": "2013-01-12", "url": "http://1888pressrelease.com/billion-announces-g-hn-products-with-marvell-s-g-hn-powerlin-pr-448854.html", "content": "billion announces g.hn products with marvell's g.hn powerline chipset for connected home solutions billion electric co., ltd. has selected marvell's itu-t compliant and homegrid forum-certified g.hn transceiver chipset for fast wired home networking, further accelerating billion's g.hn product portfolio for the connected home. january 12, 2013 - billion electric co., ltd. (taiex: 3027, trading as billion), a leading asia pacific-based supplier of communications, smart grid, smart lighting, and smart energy management solutions, today announces that its latest g.hn product series has selected marvell's itu-t compliant and homegrid forum-certified g.hn transceiver chipset for fast wired home networking, further accelerating billion's g.hn product portfolio for the connected home. \"in las vegas this week, marvell has been showcasing the latest developments in g.hn during the world's largest consumer electronics show (ces). at the same time, we're very glad to announce our new g.hn powerline product series which are powered up by marvell itu-t g.hn-compliant transceiver chipset,\" said greg <mark>chen</mark>, senior vice president of billion. billion's g.hn product bipac 2094 r3, powerline ethernet adapter with ac pass-through power socket, is based on marvell's entire g.hn powerline reference design that enables powerful connectivity and high performance for the delivery of multimedia content to connected devices throughout the smart home. the billion g.hn product series is interoperable with all g.hn bandplans (25mhz/50mhz/100mhz) and coexistent with non-g. hn standards such as ieee1901 and upa. its ldpc forward error correction (fec) and selective packet retransmission technologies make it reliable to provide robust operation. it also supports remote configuration management integrated on-chip and one-step firmware upgrade. \"this is the significant progress we have been waiting for with g.hn. for years billion has made great effort and r & d investment in powerline communication (plc) technologies, and now we've expanded our g.hn-powered product portfolio into higher tiers,\" said <mark>tim chen</mark>, ceo of billion. \"billion aims to further build valuable collaborative relationships with worldwide strategic partners to boost more leading-edge g.hn solutions for the market .\" "}]