[{"articleID": "2010041502_00040033_W", "names": {"Bill Elliott": ["Q22583261", "Q28457876", "Q862090"], "Bill Blair": ["Q3639952", "Q4908167", "Q4908168", "Q8005606"]}, "date": "2010-04-15", "url": "http://torontosun.com/comment/2010/04/14/13587411.html", "content": "the mental health crisis that has swept workplaces across canada has hit law enforcement, and it will take a police cultural transformation to reverse the tide. mark bonokoski's powerful series depicts the human face of this crisis. the struggle to survive. the gripping battle against isolation. real life sagas of courage and pain. this landmark series is really an opera penned by a master storyteller of truths both hard and joyful, setting forth the fundamental proposition that mental illness is part of the human journey - in this case, the human journey of police and policing. depression and anxiety disorders - including post-traumatic stress disorder (ptsd) - are being recorded among police at rates higher than the national average. among rcmp members, mental disabilities now represent nearly half of all disabilities and i project that this trend is taking hold among police organizations across canada. a number of factors are in play. one is chronic job stress driven not so much by the risks of the work that police do but by the kind of workplace they inhabit. a second - compounding the first - is the embedded frustration related to the increased complexity of basic police work. growing demands range from the court, exponential growth of paper work, and autocratic managerial styles of senior officers who are also under the bureaucratic gun. a third is the accumulative effects of years of exposure among police veterans in their pre-retirement years to the horrors of everyday life they confront - everyday. a fourth, the hardening links between things like hypertension, no sleep, chronic pain and depression and anxiety. depression increases the risk of heart attack among police officers, weakens their immune system, and destroys the capacity to concentrate and relax. a vicious circle. these are not conditions of weak character, or human weakness of any kind. these are physical conditions with psychological effects. chronic job stress is caused by chronically excessive over-production of hormones, affecting brain function, blood flow and the health of the human heart. for too long, these conditions have been perceived as \"invisible\" or \"personal\" or even faked. all of this is plain wrong. in fact, using powerful brain scans, doctors can watch just how the brain changes among soldiers suffering ptsd and concussion-type injuries. we can see ptsd as it happens. we can see depression as it happens. and there is hope for the future. the neural signs of ptsd are not permanent and can change with treatment. a cure is possible. and through research now being done by harvard and mcgill in a joint project for the us army, a cure may be on the way. that said, clinical treatments for depression and anxiety are just part of what needs to happen. fundamentally, we need psychologically-healthy workplaces for police. i see clear evidence of embedded frustration among the rank and file. tremendously tense perception of senior management. gruelling doubts that the public supports police. these sensations flow into, through, and around the workplace of police and signal a public health problem right in the heart of our police community. managing the police workplace isn't easy. but its clear, a quiet revolution of management practices is called for, and one has begun at the rcmp. a transformation process in our national police force is underway. one of the stepchildren of that is a slate of \"principles of wellbeing\" to guide the future management of the rcmp. the focus is on member and employee health, wellbeing and employee renewal. 1. management practices of the future that promote employee and family wellbeing as an everyday cultural norm. 2. fairness and transparency defining how workload is assigned. 3. a priority on human relations in the rcmp workplace. a revolutionary concept in police work. members will be trained for this. the principles of wellbeing also set out a commitment to managing the distress of rcmp members more effectively. rcmp commissioner <mark>bill elliott</mark> launched an initiative earlier this year boldly aimed at \"the prevention and treatment of post-traumatic stress disorder and compassion fatigue .\" compassion fatigue. the heart of a police officer breaking again and again as he or she picks up the pieces of lives on the street, in the back lots and among families of every walk of life. toronto police chief <mark>bill blair</mark>, in a conversation with me, made it very clear he is committed to promoting the mental health of police. i serve on an informal, grassroots committee among toronto police members and advocates who are proposing a mental learning initiative. i am confident chief <mark>bill blair</mark>, who also serves as president of canadian chiefs of police association, will spread that message nationally. police chiefs are well-placed to lead a national mental health campaign. suicide prevention of suicide is a significant dimension of that. police experience its aftermath in the community and its tragedy among their own numbers. we rely upon cops for a lot and it would be more than timely for civic leaders, politicians judges and lawyers to help police navigate the mental health storm now gathering in law enforcement. police work is more complex today than ever. the courts demand more than ever. public expectations are climbing higher than ever. depression and anxiety among are growing faster than ever among police. this calls for a new approach to police health and safety - one that serves and protects the mental health of the men and women who serve and protect us."}, {"articleID": "2019111816_00141720_W", "names": {"Mike Murray": ["Q16091548", "Q6380412"]}, "date": "2019-11-18", "url": "https://www.timesleader.com/news/762936/nanticoke-native-palovchak-named-times-leader-circulation-director", "content": "Lori Vandermark. Aimee Dilger | Times Leader - WILKES-BARRE--A newspaper industry industry veteran with a diverse background including advertising and marketing experience has returned to the Times Leader Media Group as the organization's new circulation director. Nanticoke native Lorri Palovchak comes to the paper most recently from the Luzerne County Transportation Authority, where she was manager of public relations. \"We are extremely lucky to be able to add a person of Lorri's caliber to our team,\" Times Leader Media Group Publisher <mark>Mike Murray</mark> said. \"In addition to her general newspaper circulation knowledge, her service and communication expertise will aid us in providing an even better customer experience for our readership,\" <mark>Murray</mark> added. \"We look forward to her joining us .\" Palovchak, who previously worked at the Times Leader as single copy marketing manager in 2003-04, is enthusiastic about her return to the publication. \"I think the Times Leader is an incredible product. We need to make sure we can deliver that incredible product to the customers,\" she said. \"We need to have top-notch customer service and get them the paper when they need it, because we know people depend on it .\" Palovchak is a 1982 Greater Nanticoke Area graduate who spent two decades moving around the country and overseas with her late husband, Frank Vandermark, who served in the U.S. Air Force. She began her newspaper career while the couple were living in Biloxi, Miss. \"I was a military wife and we were looking to make some money, so my husband and I became adult carriers,\" Palovchak recalled. It was at the time when the Knight-Ridder chain, which owned the Biloxi paper (and formerly owned the Times Leader) was switching from youths to adults as newspaper carriers, she explained. \"My husband was in computers, so we literally started computer billing before anyone else did and we turned our route into a business,\" Palovchak said. \"We got so good at it they started giving us routes that went down. We would fix it up and build it up and give it back to them .\" That led to a promotion. \"I was the first carrier ever hired as a district manager,\" Palovchak said. \"I worked in home delivery and I really enjoyed it. I had a lot of success, and I liked building routes and building carriers .\" Palovchak also participated in what that paper's editor called \"total newspaper training,\" a program that allowed leaders in each department to learn how every other department operated. It would lead a path to a new career in the next town. \"I really enjoyed my time in advertising. So when we left Biloxi and went to Colorado Springs, I tried my hand at advertising,\" she said. For the next five-a-half years she sold advertising to the military market for a military newspaper there. Next was Belleville, Ill., and another Knight-Ridder paper where Palovchak worked as a single copy manager. From there the family moved to Germany, \"where there weren't a lot of newspaper openings,\" she said, but Palovchak did operate a gas station on a NATO base. Stateside once again, it was back to the couple's native Northeastern Pennsylvania, and a year at the Times Leader. Palovchak worked for a family business for a time, and then at West Side Career & Technology Center as their career resource recruiter. She later became a certified trainer for the Commonwealth of Pennsylvania, working in emergency management for such events as flood recovery and the 2015 Papal visit. In that year she joined LCTA, initially as a marketing coordinator. But it also was a year marked by deep personal loss. \"My late husband was one of the 22 veterans a day who take their lives,\" Palovchak said. She is active in the veterans community, and works on suicide awareness with veterans groups. \"It's very dear to my heart,\" Palovchak said. Last year she married David Palovchak, and the couple live in Swoyersville. \"We are fully committed to NEPA,\" said the mother of two and grandmother of three. \"This is home .\" For that reason, Palovchak is focused on how to meet the needs of existing and future customers of the hometown newspaper. \"I'm pretty technical. I get news on social media, I get news on the Internet, but I also need to have a newspaper in my hands,\" Palovchak said. \"My vision is to make sure that we continue to get the product in front of current subscribers but also new subscribers, make sure Millennials know what it's like to have a newspaper in their hands and also promote the community service that we provide,\" she added. \"We need to make sure that our customers know that we care .\" Lori Vandermark. Aimee Dilger | Times Leader https: //www.timesleader.com/wp-content/uploads/2019/11/web1_TTL111319LoriVandermark1.jpgLori Vandermark. Aimee Dilger | Times Leader Nanticoke native Palovchak has extensive newspaper, marketing experience By Roger DuPuis [email protected]"}, {"articleID": "2017030817_01328596_W", "names": {"Charlie Baker": ["Q28051620", "Q5076629", "Q5084482", "Q56254750"]}, "date": "2017-03-08", "url": "http://www.tribtown.com/2017/03/08/us-st-patricks-parade-gays-the-latest/", "content": "BOSTON--The Latest on the decision by the organizers of Boston's St. Patrick's Day parade to deny permission for a gay veterans group to participate (all times local): 12:30 p.m.. The decision by the organizers of Boston's St. Patrick's Day parade to bar a group representing gay veterans from participating is leading to more political fallout. Republican Gov. <mark>Charlie Baker</mark> said Wednesday he would not participate in the March 19 parade if OutVets was excluded. He says denying veterans the chance march in a parade that honors veterans \"doesn't make any sense .\" Democratic U.S. Rep. Seth Moulton called for an outright boycott of the parade. This year's Chief Marshal also stepped down in light of the vote to bar OutVets. Dan Magoon, executive director of Mass Fallen Heroes, says the freedom to hold the parade has been won by the spilled blood of all veterans. Boston Mayor Marty Walsh previously said he would not participate if OutVets was excluded. 7:45 a.m.. The organizers of Boston's St. Patrick's Day parade made history in 2015 when after decades of resistance they allowed a group of gay veterans to participate. Now, that group, OutVets, say they have been denied a spot in this year's parade scheduled for March 19. OutVets said on their Facebook page that \"While the reason for our denial is unclear, one can only assume it's because we are LGBTQ .\" Ed Flynn, a member of the South Boston Allied War Veterans Council, the parade's organizer, says he voted to allow OutVets to participate. The vote Tuesday was 9-4. The Navy veteran said he was \"saddened and outraged\" that the council \"voted to turn back the clock on equality .\" Emails and phone messages for the council were not immediately returned Wednesday morning."}, {"articleID": "2018011900_00722964_W", "names": {"Jerry Brown": ["Q152451", "Q717620"], "Juan Rivera": ["Q19879381", "Q25280722", "Q861215"]}, "date": "2018-01-19", "url": "http://www.nbcbayarea.com/news/california/AG-California-Is-Not-in-the-Business-of-Deportation-469927783.html", "content": "AG on ICE Sweeps: California Is \"Not in the Business of Deportation' By Don Thompson Published 50 minutes ago NEWSLETTERS Receive the latest california updates in your inbox Email Privacy policy | More Newsletters NBC 7 California's attorney general said Wednesday he is concerned about open-ended immigration sweeps at a time he and other state officials say the Trump administration should be concentrating on deporting dangerous felons. Attorney General Xavier Becerra said while it is the federal government's responsibility to protect the nation's borders, the goal should be public safety, not deporting otherwise law-abiding immigrants who are in the country illegally .\" We will, as always, work with our federal partners in every respect to go after drug dealers, human traffickers, potential terrorists, \"Becerra said .\" We're not in the business of deportation. We're in the business of public safety. \"Becerra and other Democrats spoke in response to an anonymous report in the San Francisco Chronicle on Wednesday that said federal officials are preparing for a major immigration sweep in San Francisco and other Northern California cities. House Passes Budget Bill Aimed at Averting Shutdown Immigration and Customs Enforcement spokeswoman Sarah Rodriguez said agency policy is to neither confirm nor deny the possibility or existence of a specific operation. ICE Acting Director Thomas Homan has repeatedly lambasted California and Gov. <mark>Jerry Brown</mark>, a Democrat, over a new state law that strictly limits the cooperation of local law enforcement with federal immigration authorities when they are booked into jail for other reasons. A day after the law took effect in California, he said ICE will\" vastly increase our enforcement footprint in the state of California. \"\"California better hold on tight,\" he told Fox News on Jan. 2. \"They're about to see a lot more special agents, a lot more deportation officers in the state of California. If the politicians in California don't want to protect their communities, then ICE will .\" Activists Urge Travelers to \"Know Your Rights' Democratic U.S. Sens. Dianne Feinstein and Kamala Harris sent Homan a letter Wednesday asking to be briefed on how raids are prioritized and for all communications regarding upcoming raids in California .\" Diverting resources in an effort to punish California and score political points is an abhorrent abuse of power, not to mention a terrible misuse of scarce resources, \"they wrote. Immigrant rights advocates had not stepped up their activism in response to the report, but said anxiety remained high. Haitians Face Hurdles After Protected Status Renewal Delays\" We're always worried of what's going to come next from this administration, \"said <mark>Juan Rivera</mark> of Carecen SF, a nonprofit that assists Central American immigrants in the San Francisco Bay Area and is part of a rapid response network that alerts immigrants about ICE raids. Becerra and former U.S. Homeland Security Secretary Janet Napolitano, now the University of California president, spoke at a news conference urging young immigrants to apply to remain in the country after a federal judge prevented Trump from ending the Deferred Action for Childhood Arrivals program. Napolitano said when she was secretary under President Barack Obama from 2009 to 2013, immigration officials concentrated on deporting felons, particularly violent felons, gang members, security threats and those caught soon after crossing the border .\" The current administration has kind of erased all of those priorities and said anybody in the country without documentation is fair game, \"she said .\" I think one can question whether that is the best use of our law enforcement resources. \"Deportation arrests have surged about 40 percent under Trump's presidency, even without a budget increase. Homan, in a recent interview with The Associated Press, said authorities still target people with criminal histories but limits on access to local jails will prompt them to chase them elsewhere, potentially arresting others who happen to be there and are in the country illegally. Trump and other administration officials have singled out San Francisco for criticism, repeatedly raising the 2015 fatal shooting of Kate Steinle by Mexican man who had been deported five times and was recently acquitted of murder. Copyright Associated Press"}, {"articleID": "2020020821_00238273_W", "names": {"James Weir": ["Q19325090", "Q22969585"]}, "date": "2020-02-08", "url": "http://www.gattonstar.com.au/news/how-mkr-became-dead-in-the-water/3940083/", "content": "Written off as an absolute failure, MKR has copped a series of humiliating blows this week thanks to a trend filtering through a lot of shows, says <mark>James Weir</mark>. TV How MKR became \"dead in the water' by <mark>James Weir</mark> 9th Feb 2020 7:36 AM 0 You know a TV show is dead in the water when people would literally rather watch footage of public transport. That's what happened to My Kitchen Rules this week when it returned to humiliating ratings. Its Monday night premiere pulled in just 517,000 people in capital cities and by Tuesday it sank to 402,000. Meanwhile, Married At First Sight premiered to 1,154,000. The final punch in the guts for MKR? Great Australian Railway Journeys over on SBS pulled in more viewers than the former juggernaut. What is Great Australian Railway Journeys? From what I gather, it's basically just some British guy who catches a train around Australia. It's a step above the\" slow TV \"movement where people tune in to watch a train slowly roll through the countryside for eight hours. Yep, it's actually a thing. Maybe that's how Gladys Berejiklian can get some money back on those old-timey trams no one asked for. None of us want to ride on them because it's not the 1940s. But she could strap a GoPro to the front and sell the footage to Seven to replace MKR with. It's a win for Sydney and a win for Seven and a win for us because apparently that's what we want to watch. We'd rather be locked on Gladys' slow trams than watch MKR. Anyway, the word from viewers is they miss the original MKR recipe. Seven has messed with the formula that made it a ratings smash in an attempt to rival the drama on Married At First Sight. Last year there was a storyline about two contestants hooking up. And while filming for this year's season was going on, reports surfaced that a crew member was accused of filming two contestants while they had sex on a couch. We've seen lots of insane stuff on MAFS over the years - cheating, a mild-choking, an attempted glassing. But we've never seen full-blown sex acts. You know something's inappropriate when even MAFS producers draw a line. People don't want hook ups with their cook ups! The only cheating scandals we want on MKR involve someone putting laxatives in another team's baked quail. All these TV shows are becoming the same and it's hard to tell them apart. MKR is morphing into MAFS with its sexiness and drunken dinner parties. Pretty soon Survivor will also probably introduce some kind of drunken tribal circle where someone gets a coconut thrown at their head .\" Any minute there's going to be sex on Survivor - some of those people are very, very attractive, \"columnist and author Kerri Sackville said on the Not Here To Make Friends podcast. And she's right - this week there was a wrestling challenge on Survivor that viewers compared to porn. If you missed it, I can send you my screenshots. Honestly, I'll probably start watching survivor now. Anyway, Kerri was a guest on the podcast with Sam Dastyari and we were talking about all these reality shows becoming the same and how they should just be rolled into one so we can save time .\" I do think we can bring them all together, \"she said .\" What we need to do is get all the MAFS couples onto the Survivor island. And then the MKR people come in and they cook them a meal. And they're all starving so, whatever the food is, they just think it's fantastic - so no one's crying which means they have to create drama in other ways. \"Even Dancing With The Stars, which returns tonight, is cashing in by casting one of MAFS' old cheaters. I just hope Great Australian Railway Journeys doesn't buckle to the trend and introduce a sex scandal. No one wants to see that. More screenshots of the Survivor porn from my archives. IT'S HARD TO RESPECT A BUSINESSMAN ON A RAZOR SCOOTER In big cities around Australia, professionals and business executives are whizzing around on Razor scooters and we're all pretending like that's normal. It's not. I can't respect a businessman on a scooter - it's like a visual oxymoron. Someone who's loving the scooter trend is Deborra-Lee Furness. She has been whizzing around Manhattan on a scooter for the past few months and I'm just obsessed with it. I've even set up a Google alert for\" Deb Lee Furness scooter \"so I don't miss an update. Whenever I'm feeling down, I just scroll through photos of Mrs Hugh Jackman hooning around the streets of SoHo and all is right in the world again. Me leaving work early before my boss notices. DIGGING THROUGH THE MAFS REJECT BIN About 15,000 Aussies applied to be on Married At First Sight this year and only 20 were successfully recruited into the mess. This begs the question: Where the hell are these 14,980 rejected applicants and who the hell are they? I've launched a Freedom Of Information request to get to the bottom of this and we're slowly getting answers. If you or someone you know was rejected, please get in touch. On this week's episode of the Not Here To Make Friends podcast, an asexual woman called in and told her story about being ghosted by the MAFS producers. Ouch, huh? You'd think producers would love to throw an asexual person in the mix. Then again, producers probably realised halfway through the interview process that - given this is basically a show about horny people cheating on each other - they probably wouldn't provide the level of drama required. On tonight's episode of the podcast, we'll hear from a man who is attracted to guys and girls but wanted MAFS producers to pair him with a wife. Why did producers say no? We'll find out. Download and subscribe to the podcast. Twitter and Facebook: @ hellojamesweir 0 editors picks Read More Login to follow <mark>james weir</mark> Read More Login to follow mkr Read More Login to follow my kitchen rules Read More Login to follow television Read More Login to follow editors picks <mark>james weir</mark> mkr my kitchen rules television"}, {"articleID": "2012072809_00065647_W", "names": {"Mohamad Ali": ["Q11883098", "Q16053529"]}, "date": "2012-07-28", "url": "http://twocircles.net/2012jul28/donate_relief_works_assam%E2%80%99s_riot_and_flood_victims.html", "content": "indian muslim lakhs of people rendered homeless and are in relief camps need urgent help by tcn staff reporter, new delhi: first devastating flood and now bloody riots have made lakhs of people, mostly muslims, homeless in various districts of assam. with humanitarian crisis looming large as the victims are not getting proper support from the government, markazul ma'arif, which is working in collaboration with jamiat ulema, assam and ajmal foundation, has issued an appeal for help. \"in the ongoing communal riot from 18 july 2012 in 7 districts of assam including 4 under the bodoland territorial council (btc), according to our estimate some 3 lakh people are already displaced, they virtually lost everything save life. here we are deliberately not mentioning the figure of those killed in the ethnic riot because the official figure 52 till 27 july is completely contradictory from what we have from ground. majority of the victims are poor bengali speaking muslims. similarly the present flood situation in assam has been devastating which succumbed around 150 lives and some 25 lakhs people became homeless,\" said markazul ma'arif in the appeal. \"our officials and volunteers are working in the affected areas. we seek urgent financial assistance from philanthropist ngos as well as individuals for the ongoing relief works in assam,\" the group appealed. talking to tcn over phone, maulana burhanuddin qasmi, director, markazul ma'arif said his group in collaboration with state jamiat ulema and ajmal foundation had set up relief camps in boangaigaon, nagaon, dhubri and goalpara districts for flood victims. there were around 50000 people in those camps. they had started to provide them food packed for 30 days. each packet for an average five-member family contained 30kg rice, 6kg pulse, 4kg sugar, 2kg salt, 3kg gram and 1/2kg tea leaf, each packet costing rs 1000. in total it was a rs 8 crore project. but all of a sudden communal riot broke out in several districts of assam, making many more lakh people homeless. maulana qasmi said, the riot was so sudden and fast that at organizational level they could not set up camps. victims fled their homes and villages and they were given shelters in neighboring districts. \"right now our volunteers under the leadership of mp maulana badruddin ajmal are visiting camps in villages and towns and providing relief at the sites. we are providing food and plastic tents,\" said maulana qasmi. he informed that villagers erected relief camps in dhubri, bongaigaon, chirang and kokrajhar districts. how to donate for inland contributions: account name----------markazul ma'arif education and research centre account number-------- 01920200003728 account type------------ current name of bank----------- dcb bank branch name------------ <mark>mohamad ali</mark> road, branch address-------- palton road, opp crawford market, mumbai-400 001 ifsc code--------------400072019 micr code----------dcbl0000019 purpose---------------- - relief for floods and riot victims in assam for foreign contributions: account name-------- - markazul ma'arif bank name------------ - state bank of india branch name----------- hojai branch code------------ 002065 account no------------ - 11284630356 address------------------main road, hojai, pin - 782435 city----------------------- dist. - nagaon state----------------------assam, india micr code--------------782002506 ifsc code------------ sbin 0002065 swift code------------ - sbi hojai branch does not have swift facility yet, it should be done through sbi overseas branch delhi to sbi overseas branch guwahati (capital of assam). with ifsc code it will enter tour account. reason------------------- relief for flood and riot victims note--any transfer whatsoever to any bank account may please be communicated with transaction receipt immediately. web page addresses and e-mail addresses turn into links automatically. unless otherwise noted, you can republish our articles for free. you just have to credit twocircles.net and link it back to us, and you can't edit our material or sell it separately. (we're licensed under"}, {"articleID": "2011062312_00075203_W", "names": {"Liam Fox": ["Q16300641", "Q332374", "Q6539597"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2011-06-23", "url": "http://middle-east-online.com/english?id=46897", "content": "london - britain's military operation in libya will cost around? 260 million, defence secretary <mark>liam fox</mark> revealed thursday, after the government had said in march the cost would only be in the tens of millions. the estimated cost of britain's role in the six-month campaign of air strikes against moamer kadhafi's forces was \"in the region of? 120 million\" , <mark>fox</mark> said in a written statement to lawmakers. an additional? 140 million would have to be spent to replace missiles and other munitions if the mission continued at the same rate, he said. the total cost of $416 million (292 million euros) could prove an embarrassment to the government. chancellor of the exchequer <mark>george osborne</mark> said at the start of the campaign that it would cost \"in the order of the tens of millions not the hundreds of millions of pounds .\" the cost is being met from government reserves, rather than normal budgets, at a time when <mark>cameron</mark>'s government has imposed deep cuts to public spending, including the defence budget, as it seeks to slash a record deficit. some experts anticipate the cost of the libyan campaign could rise to? 1 billion if raids drag on throughout the year. prime minister <mark>david cameron</mark> insisted this week that british forces can maintain the current level of operations in libya despite concerns raised by senior military figures. britain deployed apache attack helicopters over libya this month in an attempt to use their formidable firepower to break the stalemate in the fight between rebels and kadhafi's forces. royal air force typhoon and tornado aircraft have conducted hundreds of bombing missions over libya along with aircraft from the united states and france."}, {"articleID": "2014083101_00037606_W", "names": {"Claire Thomas": ["Q16231575", "Q29866814"], "Jennifer Cohen": ["Q27811419", "Q6178217"], "Kevin Mchale": ["Q314427", "Q40444", "Q6396937"], "Harry Shum": ["Q16905622", "Q348649"], "Ryan Murphy": ["Q1185730", "Q19979249", "Q21934130", "Q316844", "Q3453832", "Q6379482", "Q6380012", "Q7384364"]}, "date": "2014-08-30", "url": "http://primetime.unrealitytv.co.uk/glee-spoilers-lea-michele-celebrated-birthday-glee-finale-spoilers/", "content": "Home> American TV Shows> Glee finale spoilers & Lea Michele did THIS for her birthday! Glee finale spoilers & Lea Michele did THIS for her birthday! Tweet August 30th, 2014 by Emily H. Lea Michele is officially another year older. The superstar celebrated her 28th birthday in LA yesterday with some of her closest girlfriends, and thanks to Twitter, she brought us all along for the ride. The \"Cannonball' singer kicked off her birthday celebrations by tweeting,\" So excited for tonight's bday celebration dinner with yummy food by @ TheKitchyKitchen \", along with the pic below of <mark>Claire Thomas</mark>' book and a very special birthday menu. Four hours later, the party was well and truly underway when Michele snapped a pic from girl's night, calling her besties\" The best girlfriends in the world...\"From this pic, we know the star was celebrating with FOX Television Executive Stephanie Herman, actress Aubrey Dollar,\" Once Upon a Time' actress Joanna Garcia and Switch Boutique owner <mark>Jennifer Cohen</mark>. It was then time for the brunette beauty to blow out the birthday candles. \"A very Happy Birthday\" , she captioned the pic below, \"Thank you @ KitchyKitchen for such a delicious meal and this AMAZING cake!\". But it wasn't just her girls that were showing her some birthday love, Michele also got a whole lot of love from her fellow \"Glee' co-stars. <mark>Kevin McHale</mark> (Artie) tweeted,\" Happy birfffdayyyyy @ msleamichele \", <mark>Harry Shum</mark> Jr. (Mike) tweeted out\" Wishing @ msleamichele a very very very Happy Happy Joy Joy Birthday! \"and Darren Criss's (Blaine) 140 character note read;\" a very happy birthday to one of my favorite singers and drinking buddies @ msleamichele \". Mark Salling (Puck) also wished a happy birthday to his\" sister from another mister \", calling her\" cosmically wonderful \"and finishing up with\" Love you so much \"(aww!), whilst Jenna Ushkowitz (Tina) pulled double duty, wishing a happy birthday to her co-star & to her Mum .\" Happy Birthday to the beautiful ladies, @ msleamichele and my MOMMA!! #MamaUshkowitz Love u guys!!! \", she tweeted. The birthday lady was clearly feeling all the love. The\" Brunette Ambition' author thanked her friends and fans on twitter by posting, \"So much birthday love today...Makes me so happy...Thank you all for making this day so extra special!\" We're glad that our favourite lady got to enjoy her birthday with some downtime, because she's set to be pretty busy for the next few months. Michele and her co-stars are all expected to head back to the \"Glee' set next week to start filming on the sixth and final season of the hit. As we told you earlier this week, Michele's character, Rachel Berry, will be to rebuild the New Directions after her LA television career turned out to be a\" humiliating failure \". Michele and her co-stars are also expected to be filming some\" emotional scenes \"in the coming months, according to co-creator <mark>Ryan Murphy</mark>. We're not quite sure what those scenes will entail yet, and neither does <mark>Murphy</mark>... When asked last Monday if he had a plan for the series finale, <mark>Murphy</mark> admitted;\" I did. I don't anymore \", admitting that after the untimely passing of Michele's on and off-screen boyfriend Cory Monteith (Finn Hudson), the show's ending is still up in the air. <mark>Murphy</mark> admitted that\" having a happy ending and them [Berry and Hudson] both getting their dreams \", was the original way the story would end, but that\" the fact that that can't be is a big pain in all of our hearts. \"\"Glee' is expected to return to FOX next year. An official air date has not yet been confirmed. How would you like to see the series end? Tell us your thoughts, and your birthday wishes for Lea Michele, in the comments below. Leave a Reply Click here to cancel reply. Name (required) Mail (will not be published) (required) Notify me of follow-up comments by email. Notify me of new posts by email."}, {"articleID": "2020031113_00113448_W", "names": {"Charles Michel": ["Q5080932", "Q56084814", "Q950958"], "Giuseppe Conte": ["Q3770348", "Q46756395", "Q53844829"]}, "date": "2020-03-11", "url": "http://express.co.uk/news/world/1253757/Coronavirus-update-EU-commission-Ursula-von-der-leyen-italy-lockdown-PM-Conte", "content": "Four confirmed cases of the virus have been recorded in the European Commission after a further three cases tested positive today according to Italian journalist David Carretta. The Commission has now cancelled training courses and other non-essential events until April 3. Nick Ferrari confronts Tory MP following Dorries' coronavirus news EU stats PROVE Europe will be worst hit continent A further three European Commission officials are awaiting their test results. On Tuesday, EU leaders agreed to step up their response to the outbreak following the continued spread across the continent. The 27 leaders held a teleconference on Tuesday evening focusing on containing the impact on the European economy. With Italy now in lockdown, Commission President Ursula von der Leyen announced a new € 25billion (£ 21.8 billion) investment fund. Coronavirus: Cases in EU Commission increase to four (Image: GETTY) Coronavirus: There will be more funding to deal with the virus (Image: GETTY) Ms von der Leyen said: \"We will use all of our means at our disposal to make sure that our economy can weather this storm .\" The spread of the virus takes place and will take place. \"The most important part right now is to slow down the spread to prolong the time before infection takes place .\" EU Council President <mark>Charles Michel</mark> insisted the markets must still function properly despite the outbreak. JUST IN: FTSE 100 risers and fallers: Which shares have gone up or fallen? Coronavirus update: <mark>Giuseppe Conte</mark> hits out at EU response (Image: GETTY) Man Utd forward Marcus Rashford sends coronavirus message to fans Bank of England WARNING: Interest rates could be cut to nearly ZERO He warned any \"unjustified obstacles\" need to be avoided in order not to hinder EU trade even more so. Italy has reported the highest amount of cases outside of China and currently stands at 10,149. There have been a further 631 mortalities causing the country to placed into lockdown. Due to the lockdown, all sporting events have been cancelled while schools and universities have also been shut until April 3. DON'T MISS Coronavirus: Are you at risk of death from the virus? [Latest] Nicola Sturgeon squirms as she is grilled on Scotland's COVID-19 plan [Latest] Coronavirus conspiracy: Ex-Iranian president claims virus was from lab [Latest] Coronavirus: A digital meeting was held earlier this week (Image: GETTY) Coronavirus: <mark>Charles Michel</mark> also claimed trade must not be disrupted by any fruther delays (Image: GETTY) Transport will remain operational but the movements of the public will be restricted to try and restrict the spread of the contagion. Only those with work or family needs will be allowed to travel. Italy's Prime Minister <mark>Giuseppe Conte</mark> said: \"Our habits must be changed, changed now. We all have to give up something for the good of Italy .\" We will succeed only if we all collaborate and we adapt right away to these more stringent norms. \"Coronavirus World Map Live (Image: Express) In light of the crisis spreading across the country, the Italian government has hit out at the EU for not coming to its aid quick enough. Although EU officials did hold a conference to address the outbreak of the contagion across the continent, Italy's ambassador to the EU, Maurizio Massari said Brussels needed to do more. He warned Brussels must\" go beyond engagement and consultations \"and devise\" emergency actions that are quick \". Mr Massari said:\" We must ensure, under EU coordination, the supply of the necessary medical equipment and its redistribution among those countries and regions most in need. Coronavirus: Workers spray tourist sites in Venice (Image: GETTY) \"Today, this means Italy; tomorrow, the need could be elsewhere. Italy has already asked to activate the European Union mechanism of civil protection for the supply of medical equipment for individual protection .\" But unfortunately not a single EU country responded to the commission's call. \"Only China responded bilaterally. Certainly this is not a good sign of European solidarity .\" "}, {"articleID": "2015081903_00157754_W", "names": {"John Hoffman": ["Q16106293", "Q16196063", "Q59247363"]}, "date": "2015-08-19", "url": "http://lebanondemocrat.com/article/wilson-county-fair/699286", "content": "Lebanon man brings home tractor at Great Giveaway <mark>John Hoffman</mark> selects <mark>John</mark> Deere Aug 18, 2015 A Lebanon man was the big winner Tuesday night at the annual Great Giveaway. <mark>John Hoffman</mark> selected the <mark>John</mark> Deere tractor as his prize. <mark>Hoffman</mark> said he \"probably had about 40 tickets .\" <mark>Hoffman</mark> lives on a small farm in Lebanon, so the tractor will be put to good use. He said this will be his first <mark>John</mark> Deere. \"I have Massey Ferguson's,\" he said. The winning ticket was handed out at the Lebanon Kroger."}]