[{"articleID": "2013031104_00014073_W", "names": {"Lawrence Wright": ["Q18706520", "Q353893", "Q6504763", "Q6504767"], "David Greenspan": ["Q16187095", "Q28155022"]}, "date": "2013-03-11", "url": "http://playbill.com/news/article/175718-Bianca-Amato-Quincy-Tyler-Bernstine-and-Luke-Robertson-Star-in-Publics-Neva-About-Widow-of-Chekhov-Opening-March-11", "content": "bianca amato, quincy tyler bernstine and luke robertson star in public's neva, about widow of chekhov, opening march 11 by, written and directed by guillermo calder? n, officially opens march 11 at 7:30 pm. advertisement performances continue through march 31 in the public's anspacher. previews began march 1. quincy tyler bernstine (masha) and luke robertson (aleko). the production also features costume design by susan hilferty. \"in a gorgeously crafted reflection on life, art and the revolutionary impulse, chilean writer-director guillermo calder? n's anton chekhov's widow, the actress olga knipper, who arrives in a cold and dimly lit theatre in st. petersburg in the winter of 1905 to rehearse the cherry orchard. as she and two other actors await the rest of the cast, they huddle together, act out scenes from their lives and muse on their art form and on love - while, unseen, striking workers are being gunned down in the streets by the tsarist regime during what will be known as bloody sunday.\" calder? n's criticaly acclaimed production, diciembre, was seen as part of the public's 2011 under the radar festival. single tickets, priced at $55, are on sale at (212) 967-7555, publictheater.org, or in person at the public theater box office at 425 lafayette street. christopher durang, in a russian mood by way of bucks county, lands on broadway <mark>lawrence wright</mark>'s fallaci, directed by the public's oskar eustis, premieres march 8 at berkeley rep photo call: bianca amato, quincy tyler bernstine and luke robertson star in public's dallas theater center will stage les mis? rables and new york-bound musical premiere bianca amato, quincy tyler bernstine and luke robertson star in public's it's a bird...it's a plane...it's superman chicago cinderella the trip to bountiful the testament of mary sleeping rough happy birthday peter and the starcatcher three trees stomp the last five years ann cat on a hot tin roof hands on a hardbody telly leung, allie trimm, david burtka, merle dandridge, shoshana bean sing music of scott alan in march concert march 11 peretz hirschbein's yiddish drama the inn, directed by <mark>david greenspan</mark>, opens march 11 in manhattan box office opens march 11 for broadway's starry the trip to bountiful"}, {"articleID": "2018052909_00273916_W", "names": {"David Thomas": ["Q1176834", "Q19325401", "Q19661636", "Q21453115", "Q21996049", "Q2255794", "Q23020660", "Q27909751", "Q29846103", "Q3018873", "Q3703350", "Q40328171", "Q5240342", "Q5240345", "Q5240349", "Q5240351", "Q5240356", "Q5240359", "Q56187784", "Q56596995", "Q57897985"], "Clint Eastwood": ["Q2979323", "Q43203"]}, "date": "2018-05-29", "url": "https://www.dailypost.co.uk/news/north-wales-news/mans-loving-tribute-brother-who-14716020", "content": "News Man's loving tribute to brother who loved this rare vintage van The 1969 Austin van is one of only seven left in the world and once belonged to <mark>David Thomas</mark>, a former English and PE teacher Share Comments By Mari Jones Reporter 10:54, 29 MAY 2018 News Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email A rare vintage van unexpectedly found neglected in a garage following its owner's death has been lovingly restored by his brother in his memory. The 1969 Austin van is said to be one of only seven left in the world and once belonged to <mark>David Thomas</mark>, a former English and PE teacher known as Dynamite Danny due to his football prowess. After years of teaching in London, he moved back to his hometown of Penycae in Wrexham but became a recluse, according to his brother Terry, a former lecturer in forestry and agriculture economics at Bangor University. Read More In pictures: Llandudno Victorian Extravaganza and Transport Festival Mr Thomas said: \"Everybody loved Danny, as he was known, but I think he expected to find Penycae hadn't changed since he was a boy.\" Obviously, it had and his friends had moved on. \"He lived by himself, sadly became mentally ill, and died when he was 66 from a haemorrhage.\" The Austin van is said to be one of only seven in the world today (Image: UGC TNW) A few weeks later, Mr Thomas received a call from the owner of a lock-up garage in Penycae, who said his brother owed him money. \"I went to the lock-up, not having a clue as to what was inside it, and discovered a 1969 Austin van,\" he said. \"It was in a very bad condition and I decided there and then I was going to restore it in my brother's memory.\" Terry Thomas, pictured on the far left, with his friends from Menai Bridge who helped restore the Austin van (Image: UGC TNW) Mr Thomas, who lives in Menai Bridge in Anglesey, told his story to a group of his friends and they all agreed to help him. \"It's taken us seven years but it has been a labour of love,\" he said. \"It's cost £ 8,000 to restore, and it's probably worth well over £ 20,000 as it's so rare, but I wouldn't dream of selling it.\" Read More <mark>Clint Eastwood</mark>'s £ 150K pink Cadillac that's used as a shopping run-around in Conwy Mr Thomas, who runs the Whistlestop Cafe on Bangor Pier, admits he didn't know what to do with the van once he'd restored it. Terry Thomas superimposed this picture of brother <mark>David</mark> on a snap of the restored Austin van (Image: UGC TNW) He said: \"I asked my wife June:\" What the heck do I do next with it? Do I drive it to <mark>David</mark>'s graveside? \"' His wife suggested they superimpose a photograph of <mark>David</mark> next to the van and put the picture on his gravestone. Read More The vintage Austin 7 with a pedigree pop connection Mr Thomas said:\" My brother was a funny and gentle man, who was a very popular schoolteacher. I think he'd be astounded to know what we've done with his van. \"The plan is to use it to raise money for adult males with mental health problems.\" Share your views about this story using the comment section below. Like us on Facebook Follow us on Twitter Daily Newsletter dailypostwales Follow @ dailypostwales Subscribe to our Daily newsletter Enter email Subscribe Comments Show more comments More On Bangor University Anglesey Gwynedd Menai Bridge Wrexham Education"}, {"articleID": "2011112807_00041654_W", "names": {"King Abdullah": ["Q57298", "Q57464"]}, "date": "2011-11-23", "url": "http://mysanantonio.com/opinion/editorials/article/Kuwait-needs-reform-not-more-repression-2292629.php", "content": "the following editorial appeared in the washington post: kuwait has long prided itself on having the most liberal political system among the arab monarchies of the persian gulf. an elected parliament contains a substantial opposition that regularly criticizes the ruling al-sabah family. yet no one would mistake kuwait for a democracy; the power of the assembly is strictly limited, and organized political parties are nonexistent. a recent dust-up in the parliament suggested that as the arab spring continues, the limited political opening offered by kuwait and other arab monarchies will prove insufficient. thousands of protesters gathered outside the parliament building to protest reports of government corruption, according to news accounts. when police tried to disperse the crowd, dozens of the protesters broke into the parliament, where they sang the national anthem before departing. the demonstration prompted an angry statement by the ruling emir, sheikh sabah al-ahmed al-sabah, who \"ordered the interior ministry and the national guards...to put an end to such shameful provocative acts.\" rather than threatening repression, the emir would be wise to listen to the opposition, which has legitimate grievances. the parliament has been blocked from investigating a major corruption scandal, including reports of multimillion-dollar deposits in the bank accounts of some parliament members and transfers by government officials to foreign accounts. sheikh nasser mohammad al-ahmed al-sabah, the 71-year-old prime minister, who is the emir's nephew, remains in office despite being the target of multiple motions of no-confidence. what kuwait needs is not a crackdown, but a quicker progression toward a genuine parliamentary democracy, in which the prime minister would be chosen by a majority of the parliament. prodded by domestic demonstrations, two other arab monarchies, morocco and jordan, have begun moving in that direction. these partial reforms offer a way forward for kuwait, bahrain, qatar and other persian gulf states - including, inevitably, saudi arabia. each country will move at its own pace, but if revolution is to be avoided, the reform process must progress toward genuine democracy. in an interview with the bbc last week, <mark>king abdullah</mark> predicted the arab spring was \"not even halfway through.\" if that is true, the way to invite the \"chaos\" kuwait's emir is warning would be for his regime and others to resist the imperative for change."}, {"articleID": "2009032713_00043869_W", "names": {"Jeff Carter": ["Q6173518", "Q6173521", "Q6173523", "Q943565"]}, "date": "2009-03-27", "url": "http://counton2.com/cbd/news/national/article/wanted_u.s._marshals_body_found_in_mexico/22787/", "content": "cnn published: march 27, 2009 (cnn) - the body of a fugitive u.s. marshal has been found in the city of juarez, mexico, according to the u.s. marshals service-the latest discovery in a wave of violence that has gripped towns along the u.s.-mexican border in recent months. the body of deputy marshal vincent bustamante-who faced federal charges of stealing weapons and other government property-was found in juarez on wednesday, said marshals service spokesman <mark>jeff carter</mark>. bustamante appeared to have been shot in the back of the head, a federal law enforcement source said. chihuahua state police said the body had multiple wounds to the head-apparently consistent with an execution-style shooting, according to edgar roman, a reporter with xhij television in juarez. bustamante, 48, was charged with stealing u.s. government property including glock and ruger handguns, a shotgun and a pair of binoculars, according to court documents. according to the federal source, who was not authorized to speak about details of the case and asked not to be named, a pawnshop owner became suspicious when bustamante attempted to pawn a shotgun and called the u.s. bureau of alcohol, tobacco, firearms and explosives. the source said bustamante would buy back items he had pawned on his pay days and return them. bustamante's attorney, mike torres, said a warrant was issued for bustamante's arrest after he failed to appear at a court hearing last week. he said bustamante was a 17-year veteran of the marshals and a former el paso police officer who lived in el paso with his wife and two children. \"he was a familiar face around the federal courthouse here,\" torres said. \"i'm very shocked by this and very saddened.\" he had a lot of friends and a lot of people that cared about him. \"<mark>carter</mark> said bustamante was on administrative leave from the marshals and had been required to turn in his gun and badge. he said bustamante had not been in mexico on marshals business and that all of the weapons he was charged with stealing had been recovered. <mark>carter</mark> said bustamante was on\" modified status \"with the marshals, meaning he had been required to turn in his gun and badge outside of his official work hours.\" what i can tell you is that the u.s. marshals service is saddened by the death of deputy bustamante and our thoughts and prayers are with his family, \"he said. <mark>carter</mark> said u.s. marshals are working with the fbi and mexican authorities to investigate the death. he said an autopsy will be conducted in mexico, and another may be conducted once bustamante's body is returned to the united states. juarez, which sits across the border from el paso, texas, has become one of the major battlegrounds as drug cartels fight both each other and mexican authorities. the conflict has made violence increasingly common in juarez, tijuana and other mexican border towns. more than 400 deaths in the region have been attributed to the fighting this year .) please avoid offensive, vulgar, or hateful language. dash cam video: nfl player's mother-in-law dies while dealing with police"}, {"articleID": "2013061508_00037760_W", "names": {"Sandro Silva": ["Q1851114", "Q2707256"], "Jimmy Kimmel": ["Q20793563", "Q4914"]}, "date": "2013-06-15", "url": "http://www.complex.com/music/2013/06/watch-king-louie-send-it-up-kanye-west", "content": "Watch: King Louie Talk About Creating \"Send It Up\" WIth Kanye West As most of you probably already know, King Louie is one of the featured artist on Kanye West's album, Yeezus. Louie sat down with MTV to discuss the recording process for \"Send It Up\" . In the video, King Louie touches on the work ethic that was needed to record with Mr. West: \"When I did the joint, we were in the studio - no B.S., like 20 hours strong, a day\" . He also mentioned that he woke up and \"spit the freestyle\" --which became the actual verse used on the album. Check out the complete recap of King Louie's studio time in Paris with Kanye West. Yeezus will be available June 18th. [via <mark>Sandro Silva</mark> & Quintino - \"Epic (Gent & Jawns Edit)\" 10 Quick Reactions to Kanye West's \"Yeezus\" A Father's Day Gift Guide for Kanye West Footage of 2 Chainz Being Robbed Has Surfaced Listen: Action Bronson and Harry Fraud \"Saab Stories\" EP Watch Lil Wayne's Amazing Appearance on \"<mark>Jimmy Kimmel</mark> Live\" The 20 Best Rappers in Their 20s (Right Now) Freddie Gibbs on Young Jeezy: \"I Know It Hurts You to Hear Your Favorite Rapper's a Fraud\" 10 Rappers Who Rapped About Croissants Before Kanye Watch Videos of Famous Musicians Before They Got Famous 10 Quick Reactions to Kanye West's \"Yeezus\" The 50 Funniest Comedians on Twitter A $AP Rocky's Best Style Instagram Pics The 25 Best Sneaker Photos on Instagram This Week"}, {"articleID": "2017090717_00358374_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}, "date": "2017-09-07", "url": "http://wtop.com/ncaa-football/2017/09/dormadys-early-results-encouraging-for-no-25-tennessee/", "content": "Dormady's early results encouraging for No. 25 Tennessee By The Associated Press September 7, 2017 1:19 pm 09/07/2017 01:19 pm Share Tennessee quarterback Quinten Dormady (12) throws from the pocket in the first half of an NCAA college football game against the Georgia Tech, Monday, Sept. 4, 2017, in Atlanta. (AP Photo/John Bazemore) KNOXVILLE, Tenn. (AP)--If Tennessee's Quinten Dormady improves as much throughout the season as he did over the course of his first career start, the Volunteers won't have to worry about their quarterback situation. After winning a preseason competition with redshirt freshman Jarrett Guarantano, Dormady struggled initially but came on strong down the stretch to spark the 25th-ranked Volunteers to a 42-41 double-overtime victory over Georgia Tech. The performance should give Dormady a confidence boost heading into Tennessee's home opener Saturday with Football Championship Subdivision program Indiana State (0-1). His second-half surge certainly caught the attention of his teammates. \"I'm really proud of him, how he handled himself,\" running back <mark>John Kelly</mark> said. Dormady said he wasn't particularly nervous about making his first start, but the statistics show how much he improved as the game wore on. After going 8 of 20 for 52 yards in the first half, Dormady was 12 of 17 for 169 yards with two touchdown passes the rest of the way. Tennessee coaches had talked during the preseason about the possibility of playing both Dormady and Guarantano in the opener, but Dormady said he didn't look over his shoulder or worry about the possibility of getting pulled from the game during his early struggles. \"I wasn't focused on that,\" Dormady said. \"I was just focused on executing. It took us a little while to get going, but when we finally did hit (our) stride, it felt pretty good out there.\" Dormady never did get removed from the game, and he eventually rewarded the coaching staff's faith in him. He led Tennessee (1-0) to touchdowns on five of its last six possessions, including a game-tying 93-yard drive in the final five minutes of regulation. He never got sacked and didn't commit any turnovers. His performance should provide some hope that Tennessee has found a capable replacement for Joshua Dobbs, who started 35 games over the last four seasons before getting drafted in the fourth round by the Pittsburgh Steelers. \"I can't say enough about Quinten,\" offensive tackle Brett Kendrick said. \"He always had his composure. He reminded me a lot of Dobbs (in that) was a calming presence on the sideline. There's no worry in him. You always want someone like that in a quarterback.\" Dormady's emergence in the second half and overtime was particularly noteworthy because it came without Jauan Jennings, who started the season as Tennessee's top returning receiver. Jennings got injured in the first half of the Georgia Tech game and is out indefinitely. Jennings' absence will force Dormady to develop a rhythm with Tennessee's other receivers. He already appears to have found a favorite target in Marquez Callaway, who caught four passes for 115 yards and two touchdowns against Georgia Tech. Tennessee's matchup with Indiana State should help Dormady build that trust with receivers while also correcting mistakes he made in the opener. \"For me, I think it's just making the easy throws,\" Dormady said. \"That comes with me and the receivers, just with our timing and things ....We'll get things fixed. That will probably be the biggest jump. We've just got to make the routine plays.\" The Indiana State game also should provide an opportunity for Guarantano to make his debut. Television cameras during the Georgia Tech game showed Guarantano sitting apart from Dormady on the sideline without wearing a headset, leading to questions about how the redshirt freshman was handling the backup role. Guarantano hasn't been made available to the media this week, but Tennessee coach Butch Jones spoke out in the redshirt freshman's defense and noted his backup quarterbacks typically don't wear headsets during games. \"They'll continue to compete\" Jones said. \"I know there was a lot out there with Jarrett, and all I can tell you is Jarrett's a good teammate. He's always been a good teammate. He's a competitor and wants to be it there but also has a tremendous amount of respect for everyone in this program and the players.\" NOTE: Tennessee announced Thursday that reserve cornerback Baylen Buchanan has an ankle injury that will prevent him from playing against Indiana State. ___ More AP college football: http: //collegefootball.ap.org and https: //twitter.com/AP_Top25 ___ Follow Steve Megargee at www.twitter.com/stevemegargee Copyright © 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, written or redistributed."}, {"articleID": "2013022700_00010142_W", "names": {"Matt Smith": ["Q1882744", "Q20713866", "Q24809160", "Q27074050", "Q30123100", "Q312385", "Q3299556", "Q3852033", "Q40281443", "Q43091034", "Q54152850", "Q6789356", "Q6789357", "Q6789358", "Q6789359", "Q6789360", "Q6789363", "Q6789364", "Q6789365", "Q6789366", "Q6789367", "Q6789368", "Q6791245"], "Connor Brown": ["Q16209503", "Q29052057", "Q50544930", "Q5162005"]}, "date": "2013-02-27", "url": "http://foxsports.com.au/football/everton-succeed-where-merseyside-rivals-liverpool-failed-progressing-in-fa-cup-with-win-over-oldham/story-e6frf423-1226586676990?from=public_rss", "content": "progress...everton's leon osman celebrates with kevin mirallas. everton succeeded where merseyside rivals liverpool had failed by beating oldham athletic 3-1 on tuesday to reach the fa cup quarter-finals. goals from kevin mirallas, leighton baines and leon osman took david moyes' side into the last eight, where they will face wigan athletic, with oldham's cup talisman <mark>matt smith</mark> replying for the visitors. \"we've been close a couple of times and that whets your appetite. we want to go further, but we've got a tough tie next,\" baines told itv. \"we're at home so we'll be favourites, but we've had tough games against them the last couple of seasons and they're coming off the back of a good win (over reading) at the weekend, so they'll be confident.\" beaten semi-finalists in last season's competition, everton were without the injured marouane fellaini but made a purposeful start and took the lead in the 15th minute. after a patient build-up, darron gibson shaped a beautiful cross into the box from deep on the right and mirallas stole in to finish with an adroit half-volley from eight yards. oldham almost drew level immediately through former everton youngster jose baxter, who seized on a loose ball on the edge of the box but saw his curling shot bounce back off the right-hand upright. the visitors then had a penalty appeal turned down when phil jagielka's clearance struck gibson on the arm. their resurgence proved short-lived, however, as baines helped everton stamp their authority on the tie. having seen a vicious strike saved by oldham goalkeeper dean bouzanis minutes earlier, the england left-back doubled his side's advantage from the penalty spot in the 34th minute after <mark>connor brown</mark> was penalised for handball. everton centre-back jagielka blazed over the oldham bar early in the second half, while bouzanis saved from osman. in response, oldham introduced giant striker <mark>smith</mark>, scorer of two goals against liverpool and an injury-time equaliser in the first game with everton. oldham rallied, lee croft firing wide from a good position, but in the 62nd minute, everton struck again. steven pienaar whipped a cross into the box from the left and osman's flicked header deceived bouzanis, who was distracted by the onrushing nikica jelavic."}, {"articleID": "2012062518_00100421_W", "names": {"Kelly Macdonald": ["Q230383", "Q6386172"], "Emma Thompson": ["Q168724", "Q29054751", "Q53109451"], "Benjamin Walker": ["Q41968257", "Q4889361", "Q817734"]}, "date": "2012-06-25", "url": "http://goupstate.com/article/20120625/ent/120629837", "content": "film was first of disney's pixar animations with female lead disney's \"brave' princess tops box office with $66.7 m debut, scares lincoln's\" vampire' to 3rd published: monday, june 25, 2012 at 2:45 p.m. last modified: monday, june 25, 2012 at 2:45 p.m. los angeles (ap) a new disney princess has ascended to the box-office throne with a no. 1 debut for pixar animation's \"brave.\" facts weekend box office 1. \"brave,\" $66.7 million ($13.5 million international). 2. \"madagascar 3: europe's most wanted,\" $20.2 million ($30.1 million international). 3. \"abraham lincoln: vampire hunter,\" $16.5 million ($8.1 million international). 4. \"prometheus,\" $10 million ($12.7 million international). 5. \"snow white & the huntsman,\" $8.01 million. 6. \"rock of ages,\" $8 million. 7. \"that's my boy,\" $7.9 million. 8. \"the avengers,\" $7 million ($2.3 million international). 9. \"men in black 3,\" $5.6 million ($10.5 million international). 10. \"seeking a friend for the end of the world,\" $3.8 million. the latest from the makers of \"wall-e,\" \"finding nemo\" and the \"toy story\" movies opened with $66.7 million domestically, according to studio estimates sunday. \"brave\" added $13.5 million in 10 overseas markets for a worldwide start of $80.2 million. featuring a feisty scottish princess, \"brave\" was the first of disney's pixar animations with a female protagonist. and it left american hero abraham lincoln in the dust. the 20th century fox action tale \"abraham lincoln: vampire hunter\" opened far back at no. 3 with $16.5 million, behind \"madagascar 3: europe's most wanted.\" dreamworks animation's animated \"madagascar\" sequel had been no. 1 for two weekends and added $20.2 million to raise its domestic total to $157.6 million. \"brave\" is the 13th-straight pixar release to open at no. 1 since \"toy story\" launched hollywood's age of computer animation in 1995. \"their track record is just unbelievable,\" said paul dergarabedian, analyst for box-office tracker hollywood.com. \"the pixar brand just carries so much weight with the audience, it doesn't matter almost what the story is about if it has the pixar name.\" the weekend's other new wide release, steve carell and keira knightley's apocalyptic romance \"seeking a friend for the end of the world,\" misfired with just $3.8 million, debuting at no. 10. the focus features film, playing in much narrower release than other top-10 movies, stars carell and knightley as heartbroken neighbors on a road trip as a killer asteroid hurtles toward earth. woody allen's italian romance \"to rome with love\" pulled in huge audiences in limited release, debuting with $379,371 in five theaters. that gave the sony pictures classics release a whopping average of $75,874 a theater, compared to $16,028 in 4,164 cinemas for \"brave.\" \"brave\" features a voice cast led by <mark>kelly macdonald</mark> and <mark>emma thompson</mark> in a mother-daughter story of a young scottish princess defying tradition that requires her to marry against her will. the film proved that audiences will turn up for a female hero, not just the male protagonists of past pixar flicks, such as woody and buzz of \"toy story,\" the robot of \"wall-e\" or the rat and his chef buddy of \"ratatouille.\" \"brave\" matched the $66.1 million debut of pixar's \"cars 2,\" with male automotive lead lightning mcqueen, over the same weekend a year ago. \"it is a phenomenal thing, these guys and their mastery of big storytelling and character development, delivering something that plays well to adults as well as kids, to girls as well as boys,\" dave hollis, disney's head of distribution, said of pixar. the audience for \"brave\" did lean toward females, who accounted for 57 percent of viewers. two-thirds of the film's business came from families, who also continued to flock to \"madagascar 3,\" making a rare weekend when two pg-rated movies led the box office. the r-rated \"abraham lincoln: vampire hunter\" was a clever idea the 16th u.s. president waging his own civil war against the blood-suckers of the republic. but critics were unimpressed, and action fans had only a passing interest in the movie, which featured relative unknown <mark>benjamin walker</mark> as lincoln. still, it was made for $69 million, a modest budget for a summer action movie, and 20th century fox had hopes it would hold up well over the next week or so before \"the amazing spider-man\" and \"the dark knight rises\" swoop in to take over cinemas in july. \"it's actually a good start for this movie,\" said chris aronson, the studio's head of distribution. \"this is an interesting and untested genre that i think audiences are going to continue to seek out. mash-ups have been done, but the historical mash-up has not been done.\" estimated ticket sales for friday through sunday at u.s. and canadian theaters, according to hollywood.com. where available, latest international numbers are also included. final domestic figures will be released monday. 1. \"brave,\" $66.7 million ($13.5 million international). 2. \"madagascar 3: europe's most wanted,\" $20.2 million ($30.1 million international). 3. \"abraham lincoln: vampire hunter,\" $16.5 million ($8.1 million international). 4. \"prometheus,\" $10 million ($12.7 million international). 5. \"snow white & the huntsman,\" $8.01 million. 6. \"rock of ages,\" $8 million. 7. \"that's my boy,\" $7.9 million. 8. \"the avengers,\" $7 million ($2.3 million international). 9. \"men in black 3,\" $5.6 million ($10.5 million international). 10. \"seeking a friend for the end of the world,\" $3.8 million. ___ online:"}, {"articleID": "2010012804_00008881_W", "names": {"Jochen Hecht": ["Q56955647", "Q68755"], "Ryan Miller": ["Q1521532", "Q24005534", "Q250011", "Q29998663", "Q3943079", "Q58227811", "Q7384338", "Q7384339"], "Jacques Lemaire": ["Q3159369", "Q681705"]}, "date": "2010-01-28", "url": "http://sportingnews.com/nhl/article/2010-01-27/sabres-miller-get-better-devils-shootout", "content": "senior bowl dish: ford setting himself apart; brown looking strong senior bowl dish: ford setting himself apart; brown looking strong rising, shining at the senior bowl: five players who are turning heads of nfl execs former usc running back stafon johnson trying to forge nfl career after injury buffalo, n.y.--<mark>jochen hecht</mark> and jason pominville gave the buffalo sabres a full two points in <mark>ryan miller</mark>'s pre-olympic showdown with martin brodeur. <mark>hecht</mark> responded to brodeur's quick poke-check attempt with a nifty deke of his own in the second round of the shootout, pominville sealed it with a goal in the next round, and the sabres snapped a four-game winless streak with a 2-1 victory over the slumping new jersey devils on wednesday night. <mark>miller</mark> preserved the bonus point by stopping zach parise and jamie langenbrunner in the first two rounds to snap a personal three-game shootout losing streak. \"i wasn't going into the game banging my head against the wall, but i knew i could be better in the shootout,\" <mark>miller</mark> said. brodeur finished with 30 saves, while <mark>miller</mark> made 39 stops in a game that featured a potential olympic matchup. <mark>miller</mark> will likely be the starter for the united states, while brodeur looks to earn the starting nod for canada next month in vancouver. german olympian <mark>hecht</mark> beat brodeur with a heads-up play. \"i didn't make my mind up until he got close,\" brodeur said about the shootout showdown. \"i thought he wasn't really looking at me.\" <mark>hecht</mark>, who's perfect on all three shootout attempts this season, certainly was. \"i saw him early enough to get out of the way, and it was an empty net,\" he said. adam mair scored in regulation for buffalo (31-14-7), which returned home after a 2-3-2 trip. \"it was a hard game,\" said sabres coach lindy ruff, who shook things up with his struggling team by sitting the defensive pair of toni lydman and steve montador in favor of andrej sekera and nathan paetsch. \"the effort was good. we stayed away from the situations that we got ourselves into the last couple of games.\" brian rolston scored the only goal for the offensively-challenged devils (34-16-2), who've scored just 12 times during an eight-game stretch in which they've won just twice (2-5-1). \"we did a good job of creating opportunities, but we didn't finish,\" said langenbrunner, who was whistled for goalie interference 8 minutes into the third period after delivering a blow to <mark>miller</mark>'s head, then struck <mark>miller</mark> in the mask with a slap shot in overtime. \"(<mark>miller</mark>) bailed them out of a few situations.\" sabres center tim connolly failed to register a point, snapping his career-high 16-game points streak. brodeur, meanwhile, rebounded from a poor start against ottawa on tuesday in which he was pulled after allowing three goals on 12 shots over the first two periods. new jersey was playing its fourth game in six nights, while the sabres returned tuesday from their season-long seven-game swing out west. \"to me, it looked like you were looking at two tired teams,\" ruff said. \"there was only pockets of energy here and there.\" mair gave buffalo the early lead with his second of the year with 5:46 to go in the first period. standing in front of the net, mair was able to get a piece of derek roy's slap shot from the top of the right circle. rolston tied it with his 16th with 5:09 remaining in the second period. after a long pass from johnny oduya at the red line, rolston raced along the left wing before unleashing a slap shot from the left circle that beat <mark>miller</mark> on the short side. \"when you get more chances, you want to win,\" devils coach <mark>jacques lemaire</mark> said. \"you get a point, but this is a game that i felt we should have won.\" notes: <mark>miller</mark> snapped a three-game home losing streak against the devils...brodeur dropped to 5-1-2 in his last eight against the sabres...paetsch picked up his first assist of the season on mair's goal...mair has goals in each of the last two games, the first time in his career he's scored in back-to-back contests...there were only two penalties called in the game...the sabres are 8-0-3 in their last 11 at home. use of and/or registration on any portion of this site constitutes acceptance of our"}, {"articleID": "2017111411_00414016_W", "names": {"Ed Gillespie": ["Q18686352", "Q5334860"]}, "date": "2017-11-14", "url": "http://open.salon.com/2017/11/14/newspapers-should-stop-endorsing-candidates_partner/", "content": "(Credit: Shutterstock/Salon) Why newspapers should stop endorsing candidates Ralph Northam, Democrat of Virginia, has cruised to a victory even though Virginia newspapers didn't endorse him Jeff South, The Conversation 2017-11-14T11:00:05 Z • 2017-11-14T11:00:05 Z • 0 Comments 0 Comments This piece originally appeared on The Conversation. Ralph Northam, a folksy Democrat from the Eastern Shore, beat out <mark>Ed Gillespie</mark>, former chairman of the Republican National Committee, in Virginia's heated gubernatorial race. Northam's victory was remarkably comfortable. He won with 54 percent of the vote. His opponent, a Washington lobbyist who sought to distance himself from President Donald Trump, received 45 percent. But you would have predicted just the opposite if you had been following newspaper endorsements in Virginia leading up to Election Day. I'm a journalism professor, so I was closely following the media's engagement in this election. And over the past month or so, I observed with interest as most of Virginia's newspapers favored <mark>Gillespie</mark> over Northam, a pediatric neurologist who served six years as a Virginia state senator and four as the state's lieutenant governor. Who got it wrong The Richmond Times-Dispatch, in an Oct. 27 editorial, for example, praised <mark>Gillespie</mark> for running \"an energetic, inclusive, moderate-conservative, solutions-oriented campaign.\" In a swipe at Northam, the paper said <mark>Gillespie</mark> \"knows, unlike most Democrats, that more government spending is not the cure for all that ails society.\" Newspapers in Roanoke, Fredericksburg, Winchester, Harrisonburg, Lynchburg and Halifax also urged readers to vote for <mark>Gillespie</mark>. One week later, in early November, the editorial board of the Daily Progress, Charlottesville's local paper, opined that because Republicans also control Virginia's General Assembly, \"we believe <mark>Ed Gillespie</mark> has the best chance of leading Virginia to a brighter economic future.\" The editors of The Free Lance-Star in Fredericksburg agreed. \"Unlike his Democratic rival, Lt. Gov. Ralph Northam, <mark>Gillespie</mark> is not in favor of expanding Medicaid,\" they asserted just days before Northam would go on to win Virginia, a Republican stronghold turned swing state. In the end, Northam received endorsements from only three newspapers: The Virginian-Pilot, in Norfolk, where he now lives; the Daily Press of nearby Newport News; and the Washington Post. Credibility problem As Northam cruised to his nine-point victory over <mark>Gillespie</mark>, I couldn't help but think that maybe it's time for newspapers to stop telling their dwindling number of subscribers how to vote. News organizations already have a credibility problem: Polls show that only 13 percent of Americans trust their local paper \"a lot.\" And while journalists swear there's a wall between the editorial staff that endorses candidates and the reporters who write the news, many readers are skeptical: They suspect that a newspaper's endorsement influences what should be objective coverage. In my opinion, getting out of the endorsement game would help newspapers regain trust, fend off charges of bias and show respect for the public's decision-making abilities. Some opt out Some news organizations are starting to recognize this. In the runup to the gubernatorial election, the editorial board of the Martinsville Bulletin wrote that the newspaper wouldn't be making endorsements in state or local races: \"It's not for a lack of interest. It's that we truly do not feel it's our job to tell any of you who to vote for.\" The Martinsville Bulletin, which serves communities along Virginia's border with North Carolina, questioned the point of endorsements: A person or organization announces who they support, with the implication everyone else should follow suit. We see that as tricky for a news organization, where the goal is to be objective. If we do a piece on candidate X, but we've endorsed candidate Y, how can you be expected to trust it? That's a valiant acknowledgment from a small-town paper, but newspaper endorsements--no matter their credibility or weight--won't be easy to extirpate. They have a very long history in the United States. During the presidential election of 1860, for example, the editorial page of The New York Times announced its support for \"Mr. Lincoln, of Illinois, familiarly known as\" Old Abe,' age 51, height six feet seven, by profession Rail-Splitter. \"Abraham Lincoln won that election, of course. But overall, newspaper endorsements have had mixed results in influencing voters or forecasting election outcomes. Most papers, for instance, endorsed Hillary Clinton over Trump last fall--and were soundly repudiated at the polls. Bad for business It's not just arrogant for newspapers to issue endorsements in elections--it may also be financially unwise. Newspapers already face severe economic challenges as they lose readers--and thus advertising--to digital platforms. Readers turned off by an endorsement are likely to seek their news elsewhere. Digital outlets like Slate and BuzzFeed do not endorse candidates. Indeed, in Virginia you could already see signs of readers' rejection of this blatant display of politics in the media. In the comments reacting to the Richmond Times-Dispatch's endorsement of <mark>Gillespie</mark>, one person wrote,\" If the RTD thinks he is a wise choice, I now understand why the RTD is losing readership. \"Not the best move, in the end. Screenshot, Richmond Times Dispatch Many media experts believe that for newspapers to survive, they must position themselves as community forums--platforms for engaging the audience and fostering a dialogue. That means hosting a conversation, not delivering a lecture. By forgoing endorsements, newspapers could better fulfill that role: They would be making a statement that news organizations provide impartial information--and readers should act on it as they see fit. Plus, if Virginia's race is any indication, they're not so great at the endorsement game, anyway."}]