[{"articleID": "2012031617_00072311_W", "names": {"Ted Stevens": ["Q50599", "Q7693764"]}, "date": "2012-03-16", "url": "http://abajournal.com/news/article/report_blasts_feds_for_systematic_concealment_of_significant_exculpatory_ev/?utm_source=feedburner&utm_medium=feed&utm_campaign=ABA+Journal+Daily+News", "content": "news report blasts feds for \"systematic concealment' of exculpatory evidence in alaskan senator's case in a more than 500-page report filed thursday in federal court in washington, d.c., a court-appointed lawyer tasked with investigating the failed federal prosecution of the late u.s. sen. <mark>ted stevens</mark> of alaska not only sharply criticized the government's handling of the case, citing a lack of supervision and inadequate effort to comply with rules regarding the provision of helpful evidentiary material to the defense, but gave specific examples of wrongdoing .\" the investigation and prosecution of u.s. senator <mark>ted stevens</mark> were permeated by the systematic concealment of significant exculpatory evidence, which would have independently corroborated senator <mark>stevens</mark>'s defense and his testimony, and seriously damaged the testimony and credibility of the government's key witness, \"said special counsel henry schuelke iii in the report. document (pdf). however, schuelke did not call for contempt charges against the prosecutors, because they did not violate any specific court orders by failing to produce material to the defense as required, according to the bloomberg .\" were there a clear, specific and unequivocal order of the court which commanded the disclosure of this information, we are satisfied that a criminal contempt prosecution would lie, \"wrote schuelke. died in a plane crash. but his chief defense lawyer, brendan sullivan, called the examples of misconduct cited by schuelke frightening and pointed out if his client, as a sitting u.s. senator, could be targeted in a case involving\" the wors [t] misconduct we've seen in a generation by prosecutors at the department of justice and the fbi, \"anyone could. among other misconduct, the government failed to disclose that a key witness had not only allegedly been involved with what the report termed a\" juvenile prostitute \"but arguably had sought a false affidavit from her. had the defense team known this, it could have severely damaged his credibility on the stand, sullivan said. an investigation is ongoing by the department of justice office of professional responsibility concerning the conduct of the prosecutors involved in the case. abajournal.com:\" inexperience and staffing problems plagued <mark>stevens</mark> prosecutors \"generation y has become\" generation why bother,' stats suggest; are careers affected? do elite law grads disdain longtime biglaw work? stats suggest lower-tier \"strivers' stick around posner opinion hits\" dreadful muddle' of vague judicial terminology, takes a swipe at cat's paw screenwriter's inspiration for \"my cousin vinny': what if your lawyer failed the bar five times? how criminal defendants could crash and reform the system: band together and refuse plea bargains ohio assistant attorney general among the injured in stabbing spree; suspect is shot by police billionaire spanx inventor gave up idea of law school after doing poorly on lsat generation y has become\" generation why bother,' stats suggest; are careers affected? law prof's popular book argues drug war is a system of racial control bright colors help some lawyers, both male and female, command a courtroom, practitioners say movie fan sues over theater's high snack prices and ban on outside food"}, {"articleID": "2018070918_00026586_W", "names": {"John Kennedy": ["Q16090838", "Q16105132", "Q16195622", "Q1700694", "Q20737930", "Q25190305", "Q28530228", "Q43021748", "Q48775493", "Q548829", "Q593437", "Q59417950", "Q6242832", "Q6242834", "Q6242838", "Q6242847", "Q6242859", "Q6242864", "Q6242872", "Q6250211"]}, "date": "2018-07-09", "url": "https://www.mediaite.com/tv/gop-senator-john-kennedy-on-russia-trip-i-told-them-to-stop-screwing-with-american-elections/", "content": "During an appearance on CNN today, GOP Senator <mark>John Kennedy</mark> of Louisiana attacked Russian Foreign Minister Sergey Lavrov as a \"bully\" and a \"smart-ass,\" while also demanding the Kremlin \"stop screwing with American elections .\" \"I went for two reasons,\" <mark>Kennedy</mark> said of his recent trip to Russia. \"Number one, to deliver a message. I delivered that to the foreign minister, to the speaker of the house, and to a number of their senators .\" He continued by elaborating on his reasons for the visit: \"This is what I said Number one, stop screwing with American elections. Number two, get out of eastern Ukraine and let them self-determine. Number three, get out of Crimea and let Crimea self-determine. Number four, stop screwing around in Syria and help us settle the mess. And number five, do not allow Iran to get a foothold in southern Syria. Because if you do that, there's going to be another war. Israel is not going to stand for <mark>Kennedy</mark> went on to say that the meeting with the Russian foreign minister was\" probably the toughest \"part of his trip .\" We exchanged words--he's a bully, \"the Republican lawmaker said .\" He impressed me as the sort of guy who started out in the world as a smart-ass and worked his way up. And it was a pretty tough meeting. But I think our message was delivered. \"<mark>Kennedy</mark> added that he and his colleagues informed the Russian that if they\" screw with the elections this fall, \"then\" the Congress is going to double down on sanctions. \"Watch above, via CNN. [image via screengrab] Follow the author on Twitter (@ calebecarma). Have a tip we should know? tips @ mediaite.com Follow Mediaite Follow @ mediaite Like us on Facebook filed under CNN, <mark>John Kennedy</mark>, Russia"}, {"articleID": "2017082600_00686847_W", "names": {"Jimmy Carter": ["Q23685", "Q6199776"]}, "date": "2017-08-26", "url": "http://wtol.com/story/36221306/trump-setting-records-for-low-presidential-approval", "content": "Trump setting records for low presidential approval - Toledo News Now, News, Weather, Sports, Toledo, OH Trump setting records for low presidential approval - Toledo News Now, News, Weather, Sports, Toledo, OH Member Center: Trump setting records for low presidential approval 2017-08-26T00:34:38 Z2017-08-26T00:41:10 Z (Source: AP Images) Donald Trump started as the most unpopular new president in the history of modern polling. After seven months, things have only gotten worse. Plunging into undesirably uncharted territory, Trump is setting records with his dismally low approval ratings, including the lowest mark ever for a president in his first year. In fact, with four months left in the year, Trump has already spent more time under 40 percent than any other first-year president. At 34 percent, his current approval rating is worse than former President Barack Obama's ever was. Trump's early descent in the polls defies some longstanding patterns about how Americans view their president. Such plunges are often tied to external forces that the president only partially controls, such as a sluggish economy or an all-consuming international crisis. In Trump's case, the economy is humming and the foreign crises have been kept to a minimum. Americans also tend to be optimistic about their new leaders, typically cutting them some slack during their early days in office. Not with Trump. \"Most presidents begin with a honeymoon period and then go down from that, and Trump had no honeymoon,\" said Gallup editor-in-chief Frank Newport. It's a jarring juxtaposition for the reality TV star-turned-president who spent months on the campaign trail obsessing about his poll numbers and reading them to massive rally crowds while vowing that he'd win so much as president that Americans would get sick of it. Since he took office, the poll number recitations have stopped. Trump is now viewed positively by only 37 percent of Americans, according to Gallup's most recent weekly estimate. (Obama's lowest weekly average never fell below 40 percent .) It's even lower - just 34 percent - in Gallup's shorter, three-day average, which includes more recent interviews but can also involve more random variation. To be sure, approval ratings can fluctuate - sometimes dramatically. Some presidents have seen their positive reviews dip below 40 percent, only to recover strongly. Bill Clinton, whose rating fell to 37 percent in early June 1993 after policy stumbles, quickly gained ground. Later that same month, he climbed to 46 percent, and ended his eight years enjoying approval from 66 percent of the nation. Trump has defied the trends before. But if history is a guide, his numbers don't bode well. Low approval ratings hamper a president's ability to push an agenda through Congress and make it more likely the president's party will lose seats in Congress in the midterm elections. Scott de Marchi, who teaches political science at Duke University, says his research suggests approval ratings tend to affect whether a president can persuade Congress to do his or her bidding. That's primarily true with complex issues like tax reform, where Americans care about the outcome but may not have strongly formed opinions. In those cases, Americans are more likely to support whatever plan the president proposes if they broadly approve of the president himself. \"The problem with Trump is that on any area like the budget or tax policy or even health care, people need to be led to a position to support,\" de Marchi said. Since Gallup began tracking presidential approval, four presidents - Harry Truman, Gerald Ford, <mark>Jimmy Carter</mark> and George H.W. Bush - spent significant time below 40 percent during their first four years. Clinton's and Ronald Reagan's forays below the 40 percent mark also came during their first terms. But neither stayed there long. Of those who spent at least a few months below 40 percent approval in a first term, only one - Truman - recovered enough to win re-election. Still, several others reached lows at some point in their presidency that are worse than Trump's, including several who dropped below 30 percent. Truman hit 22 percent in February 1952, during a drawn-out Korean War stalemate and accusations of corruption in his administration. Richard Nixon hit 24 percent at the height of the Watergate scandal just before his resignation in 1974. <mark>Carter</mark> bottomed out at 28 percent in the summer of 1979, amid that year's oil crisis. Trump's average approval rating so far: Just 40 percent. That's even lower than the previous average low for a first-term president, 46 percent, set by <mark>Carter</mark>. Newport, the Gallup chief, said Trump's struggles are unusual in that such abysmal numbers can usually be tied to a single, specific issue bedeviling the country. With Trump, Newport said, \"it's a more general kind of issue with the man himself and a more general dissatisfaction with the way things are going in the country .\" In July, Gallup posed another question to Trump's disapprovers: Why? Nearly two-thirds cited his personality or character, while less than a third cited issues, policies or job performance. By contrast, when Gallup asked the same question about Obama in 2009 and George W. Bush in 2001, less than 2 in 10 disapprovers cited similar concerns about personal characteristics. The vast majority of Republicans support Trump while the vast majority of Democrats oppose him. Such political polarization might be both a blessing and a curse for Trump, preventing him from achieving higher ratings but also keeping him from falling even further. \"When Trump has done things that have generated an enormous amount of attention and people have anticipated his rating could go down, it has not,\" Newport said. \"And that's because he's being propped up by Republicans .\" It's unclear whether Trump's most recent bout with controversy - his response to racially tinged clashes in Charlottesville, Virginia - further harmed his approval ratings. It could be he's close enough to bottoming out that the latest dust-up will have little effect. In a Washington Post-ABC News poll conducted Aug. 16-20, just 28 percent said they approve of Trump's response to Charlottesville. But 37 percent said they approved of the job Trump is doing overall - almost the exact same percentage that approved in the same poll a month earlier. Yet if the famously image-conscious Trump aspires to undo some of the damage, there's reason to hope. \"The history of presidential job approval ratings shows an enormous amount of fluctuation,\" Newport said. \"There's no historical reason why his ratings couldn't go up .\" Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. WTOL 11 Top Stories WTOL 11 Top Stories More>> Friday, August 25 2017 8:30 PM EDT 2017-08-26 00:30:30 GMT (Source: WTOL) Health officials say mosquitoes capable of spreading the Zika virus have been documented in Michigan for the first time. Friday, August 25 2017 8:27 PM EDT 2017-08-26 00:27:49 GMT Updated: Friday, August 25 2017 8:28 PM EDT 2017-08-26 00:28:58 GMT (Source: AP Images) President Donald Trump has pardoned former sheriff Joe Arpaio following his conviction for intentionally disobeying a judge's order in an immigration case. Friday, August 25 2017 8:16 PM EDT 2017-08-26 00:16:43 GMT (Source: RNN) The father of a 4-year-old Ohio boy who died after the boy's stepmother put him in a scalding bath has been found guilty of involuntary manslaughter in his third trial. Tuesday, August 22 2017 9:38 PM EDT 2017-08-23 01:38:06 GMT (Source: AP) A young Ohio man engaged to be married next year is among 10 U.S. sailors missing since the USS John McCain collided with an oil tanker off the coast of Singapore."}, {"articleID": "2019062403_00217223_W", "names": {"Arun Kumar": ["Q17068009", "Q18126997", "Q22006074", "Q29477899", "Q33087911", "Q46316835", "Q47120558", "Q4802105", "Q48877186", "Q56451611", "Q58422867", "Q59186893"]}, "date": "2019-06-24", "url": "https://newstodaynet.com/index.php/2019/06/24/vijay-sethupathi-speaks-about-sindhubaadh/", "content": "\"Sindhubaadh is about a man who goes in search of his abducted wife,\" says actor Vijay Sethupathi. Directed by S U <mark>Arun Kumar</mark>, the movie has Anjali as heroine. Vijay Sethupathi's son Surya plays a pivotal role. Music is by Yuvan Shankar Raja. Speaking to News Today, Vijay Sethupathi, says, \"<mark>Arun Kumar</mark> and I share an excellent rapport. We worked together in Pannayarum Padminiyum and Sethupathi before. It is our third collaboration. He is a wonderful filmmaker and I am confident that after Sindhubaadh, he will direct other actors .\" Excerpts from his interview Q: On working with <mark>Arun Kumar</mark> for third time...A: After we did two films, we became very close. <mark>Arun</mark> is like family to me. He had approached many actors in vain and finally I told him we would work together. Hopefully after Sindhubaadh, he will work with others. He is a phenomenal talent. Q: What is Sindhubaadh all about? A: It is about a beautiful emotional connect between husband and wife. It is about a man, who goes in search of his wife abducted by a gang. Q: Tell us about sharing screen with your son Surya? A: <mark>Arun</mark> was keen to cast Surya in the film after watching him in Naanum Rowdy Thaan. We coaxed him a lot and convinced him. He has done a wonderful job. Q: How was it to join hands with Yuvan Shankar Raja again? A: He is a wonderful music composer. There is a soul in his songs. One can easily connect oneself with his numbers. His background score in Sindhubaadh is a big plus. Q: Anjali is a spontaneous performer. Tell us about her role in the movie. A: I essay the role of a person who is short of hearing. Anjali's character has to speak loudly in the film. She is a person who speaks loudly in real life. Whole story revolves around her."}, {"articleID": "2010011302_00041778_W", "names": {"Lois Lane": ["Q18546405", "Q20200826", "Q6485457"]}, "date": "2010-01-13", "url": "http://smallville.wikia.com/index.php?title=Davis_Bloome&diff=108506&oldid=prev", "content": "* davis bloome is the third person to be split in two using [[black kryptonite]], and the first person to die after being from his evil half. * davis bloome is the third person to be split in two using [[black kryptonite]], and the first person to die after being from his evil half. * davis is genetically the son of [[general zod]] and [[faora]]. in the comics, general zod has a son with ursa named lor-zod. doomsday) \"i've always felt like...kind of like there was this darkness inside me...just fighting to get out .\" kryptonian creature doomsday, the result of a fusion of genetic material taken from the most violent kryptonian life-forms and the kryptonians routed by jimmy olsen, who witnessed a murder; davis, however, managed to convince people that jimmy was hallucinating. soon after, chloe and clark kryptonite cage, but it failed and he adapted. so he turned to chloe for help, since being near her suppressed doomsday inside of him. with clark in the fortress, davis went on the run with chloe, vowing never to never look back. the justice league located and captured both chloe and davis with the intention of killing davis in order to protect clark. when davis began transforming into doomsday, chloe used davis begins transforming into doomsday. davis was medium-sized (around 6') with short brown hair and brown eyes. he was often seen wearing his paramedic uniform while working at metropolis general hospital. when off-duty, he usually wore casual dark clothing that was mainly black, dark blue, grey, dark brown and green. according to his biological mother faora, davis was the spitting image of his biological father zod, before he became a phantom wraith. davis' monstrous form as doomsday isn't human-looking at all, and is representative of all the kryptonian creatures fused within his dna. when doomsday was seen transforming back into davis, a bone along the line above his eyebrows was seen growing back into his head before he woke up screaming. witnesses who survived the attack at the ace of clubs described the person responsible as a creature with some kind of bony eyelids. when transformed, doomsday is covered in black spikes and bony protrusions, and is much taller and bulkier than his human form. he has big glaring red eyes, with harder, brighter bones across his eyes and down his nose. his skin is also denser and a dark grey color that makes him look more menacing coupled together with black spikes growing out of every part of his body. \"isis foundation. so, what - adopt a pyramid, save a sphinx, that kind of thing?\" plastique despite the ease with which davis related to his new friends, he carried with him the long-felt feelings of a perpetual outsider. beneath davis' charismatic, easygoing demeanor laid a brooding sense of isolation and insecurity. he was, however, caring and often willing to offer his services to his friends or put his job on the line, such as treating poisoned. however, when transformed (a condition he couldn't control), davis' true personality was utterly ruthless, injuring or killing anyone who stood in his way; a prime example of this is when brainiac lured doomsday into kidnapping chloe, he destroyed clark's barn and injured many people, including jimmy. davis was horrified by the fact that his alter-ego was so violent and destructive, going so far as to take anti-psychotic pills in order to control his transformations; however, his adaptive abilities eventually made him immune to the effect of the pills. while transforming into doomsday, davis tried to warn chloe (and clark, through her) of his alter-ego. as a result of clark's resetting of time, however, davis was the one who was targeted by linda lake instead of clark. at the hospital, linda stated that she knew davis' secret and began agitating him with the intention of getting doomsday to release her; davis' transformation was halted when he suffocated linda to death with a pillow, which led davis to the conclusion that his transformations could only be avoided if he gave into the urge to kill. he later confessed to a priest that he could control his \"inner beast\" by ridding the world of those he deemed evil. doomsday in full view \"that which kills you makes you stronger .\" bloodline davis had a range of abilities while in both his human and alien forms: reactive adaptation - davis/doomsday develops an immunity to any attack that harms him; he cannot be killed the same way twice. according to faora, that which kills him only makes him stronger. (- davis can recover from injury very rapidly, with this ability being linked to his reactive adaptation. when faora impaled him with a steel rod, his injury completely healed within only a couple of minutes. (- doomsday is one of the strongest beings to appear in [1] in human form, davis could tap into doomsday's powers, using his super strength to kill his victims. within seconds, he smothered linda lake and snapped \"evil\" people's necks with ease. davis' strength seemed to be on par with clark when they fought in the fortress of solitude, and was able to overpower clark. doomsday was able to use his strength to perform longevity - davis stated that he is immortal. however this hasn't been proven. (- when davis tried to stab himself with a blade, it shattered into pieces without hurting him. he was also able to withstand a punch from clark while they were battling in the fortress. (- davis can run for long periods of time without tiring. early age; when he was a young boy, exposure to the radioactive element caused him great pain. he later asked chloe to help him die by dowsing him in liquefied kryptonite, but he soon adapted to it and survived. black kryptonite - davis proved to be vulnerable to black kryptonite. davis is formed from genetic matter. krypton through genetic engineering by combining the dna of krypton's strongest and most violent creatures with the dna of the kryptonian warlord general zod and his wife faora. zod and faora sent their son away to earth attached to kal-el's spaceship where, upon landing, he would evolve into the dominant species of the planet. young davis befriends lex luthor. after watching from behind a burnt bush as jonathan and martha took away kal-el, the boy was taken by luthor mansion while tests were being run on him to check if he was the traveler. he befriended lex luthor; as they were playing, the boy was exposed to a chunk of kryptonite and experienced considerable pain. after lionel realized that he had the wrong boy, he had his men leave the boy out in the streets of metropolis. saddened and angered, the boy transformed into doomsday and killed them. sometime later, the young boy would be adopted and be named \"davis bloome .\" according to davis' foster records, his birthday is october 16, 1987, exactly two years to the day before the first meteor shower. he had no information for the first three years of his life. davis lived in five foster homes between september 1990 and may 2006. he went to lowell county high school, and received his paramedic training at metropolis general hospital. [2] davis once gave an interview to a reporter where he talked about running away from foster homes when he was young. he later told chloe sullivan that he had experienced blackouts ever since he was little and that because of it, he felt like an outsider and did not feel comfortable staying in one place too long. davis mutates back to normal before screaming. davis and <mark>lois</mark> save oliver's life ., chloe called in davis to assist in healing him. davis insisted on taking oliver to metropolis general hospital, but chloe convinced him to trust oliver when he said no hospitals. davis agreed, but also informed her that if oliver didn't show any signs of improvement within one hour, he would have no choice but to bring him in. later on, clark visited davis at the hospital just as he was preparing to depart and retrieve oliver. his plan was to give oliver some adrenaline shots, but after seeing another woman who had the same poison die from an adrenaline dosage, he chose not to. davis spent the rest of the time at oliver's side, and was the one who administered the antidote to him when clark retrieved it. when chloe arrived at the davis is covered in blood. while mutated as doomsday, davis went to the ace of clubs, where he went on a rampage, killing several innocent people before mutating back to his normal self. clark arrived on the scene and found davis unconscious and covered in blood. davis later awoke on a stretcher, and was dazed and unaware of how he got there. he then got up and left, going back to metropolis general where he took a shower and found that all the blood on him was not his, and crouched down in despair, wondering what he had done. davis then got changed and took a sample of his own blood before jimmy olsen approached him and asked if he could ride along with him when he went out on duty; davis reluctantly agreed. later, davis cleaned mary pierson's body, finding skin under her fingernails and placing it into a container when chloe came into the room. davis admitted to her that he believed himself to be the killer. chloe took him back to isis where she talked to him, with him telling her that he believed there was evil inside him trying to get out, and that was why he never stayed with one foster home as a child. davis was just about to go out on patrol when clark confronted him about a file he had in his locker about the recent murder victims, noting that he was always the first on the scene. davis said that he was collecting them because he wanted to do more and noted that there was also a figure in the background, and accused clark of being the city's peeping tom. davis then went to meet with jimmy for his ride-along. they were riding in davis' ambulance when davis started to look dreary and pale, and a call for a murder was issued; they responded to it. davis went into the alley and was attacked by a davis comes back to life. when faora bumped into chloe again when she was trying to find out what was happening with her memories, and remarked that she had been acting odd. he then tried to slip a note under her door in the talon, but found that jimmy was there and told him that he (davis) couldn't attend his and chloe's wedding. davis again found chloe when she needed his help due to brainiac taking away her memories until davis was the only person she remembered. he assisted clark and jimmy, and got chloe to the talon, but was forced to knock her out with a drug because she began to get angry and scared. davis left to get help for chloe, but clark super-sped her to the fortress of solitude, where jor-el healed her. jor-el later told clark that brainiac was trying to use chloe as a vessel to contact the \"ultimate destroyer\" who, unknown to clark and jor-el, was davis. after clark left, brainiac asserted his presence over the fortress, telling jor-el that clark - and subsequently the house of el - would fall, and thus a new age of power and strength would begin. he further revealed doomsday's arrival by embedding the kryptonian symbol for \"doom\" into the ground. doomsday in the fortress. later, davis awoke in the fortress, confused about where he was before seeing chloe, now possessed by brainiac. he asked chloe if she was alright, but brainiac responded of how he used her to bring doomsday to him. brainiac planned to rid davis of human emotions by putting him in a kryptonian chrysalis, so he would later destroy clark and then earth. during that time, when clark confronted brainiac who was inside chloe, davis was frozen inside a crystalline cube. once brainiac was defeated, davis reverted to his monstrous form and smashed out of the chrysalis. davis is standing in the pouring rain. davis and clark weakened by kryptonite. later, as he was preparing dinner for chloe, davis accidentally cut himself, but healed instantly, with chloe being curious of that. he later left to bury the body of one of his latest victims. once he returned to his car, tess mercer blew it up with him inside. davis later awakened in the luthor mansion, covered in bandages, and tess told him his life story. going through the mansion, davis remembered that he was greatly harmed by kryptonite. when tess felt that davis had to die in order for the traveler to fulfill his destiny, he attacked her. davis went to chloe to confess his love for her and ask her to help kill him. chloe took davis to a luthorcorp facility where she drenched him with liquid kryptonite. davis, however, managed to survive, declaring himself immortal. he realized that he needed chloe by his side to prevent the beast from coming out. in surprise, chloe obliged to allow him to be near her. when chloe was being threatened by a gangster of milano's in the talon, doomsday clark tries to throw davis into the phantom zone. emil hamilton, davis went to chloe to explain that his urges were becoming more frequent now and that he needs to be physically near her now. chloe then insisted that they run away together after telling davis that he was wanted. when oliver and jimmy were in chloe's apartment, davis knocked them unconscious and tied them up in the talon's basement. as davis strove for control, jimmy taunted davis, who decided to kill one of them but was stopped by clark, who literally dragged him at super speed to the fortress. there, clark told him about sending him to the phantom zone where he wouldn't have to worry about hurting anybody anymore. refusing to live forever in a world without chloe, davis fought clark to prevent him from opening the portal, declaring that he was going to take clark with him if he had to go. after a short scuffle, clark and davis reached a point where neither could overpower the other until chloe arrived, which calmed davis. chloe removed the key to take the both of them out of the fortress away from clark. as davis was getting ready for the road, chloe secretly called clark to call off his search for her and davis. sometime later, as doomsday, davis was attacked by tess' metahuman team, but he escaped and killed neutron. davis and doomsday separated.davis and chloe were in davis murders jimmy olsen. jimmy took chloe and davis to safety in the apartment he had originally bought as chloe's wedding present, called \"the davis' ambulance number was 17. davis was about 6 feet tall; his beast form, on the other hand, is nearly 7 feet tall. davis always wore a watch on his right hand. davis was right-handed. according to his foster records, davis was 21, five months younger than clark kent, as they both departed krypton on clark's ship (with davis as genetic matter) and arrived on earth appearing to be around age 3. lana lang, and oliver queen. although davis didn't realize it until he met his mother as a grown man, his parents were actually still alive and trapped in the phantom zone. davis is smallville' s version of the dc comics character doomsday. originally, davis was announced as a bartender at the ace of clubs. his initial test scenes were also originally planned to be with <mark>lois lane</mark>, who found him unconscious and covered in blood at the ace of clubs. [3] davis is the third smallville main character to have come from krypton. the first two were clark and kal-el's ship as genetic matter is similar to his comic counterpart's exit from krypton, clinging on to a cargo ship after slaying most of the population at the time. davis bloome is the third person to be split in two using black kryptonite, and the first person to die after being from his evil half. doomsday as he appears in the comics superman. doomsday was born on ancient krypton and tortured by an alien scientist named bertron to create the ultimate being, and his body started to evolve into being nearly invulnerable from any physical harm. he became so powerful, he killed most of the planet's population before clinging to a cargo ship fleeing the planet and went into space with nothing but a strong primal hatred of all life. doomsday escaped krypton via a ship that regularly came to deliver supplies to bertron and went on a killing spree across several planets. doomsday faced the green lantern corps, killing several hundred of them, but was ultimately defeated by the alien hero radiant and entombed. since it was deemed that keeping him on their planet would be an insult, doomsday was sent into space, at which time he eventually landed on earth, tomb and all. he escaped and confronted the justice league. after decimating most of its members and almost killing a mother and her children in cold blood, doomsday was confronted by superman. the two fought, leaving utter destruction in their wake. the battle ended in metropolis, where the two beat each other into near submission. doomsday's bone protrusions were so sharp that they were actually able to cut superman's skin, and superman hurt the creature by snapping his bones off of his body using brute force. the battle came down to one final clash, with superman and doomsday hitting each other at the same time. the blow had such force that it broke all the city's windows within a three mile radius. both combatants collapsed dead, taking half of metropolis with them. not long after this, doomsday's body was sent into space. we would find out later, however, that not only would superman return from death, but doomsday would as well."}, {"articleID": "2014042919_00071900_W", "names": {"David Slade": ["Q17180957", "Q371455"]}, "date": "2014-04-29", "url": "http://www.comicbookmovie.com/fansites/notyetamovie/news/?a=99029", "content": "Josh Hartnett Was Up For SPIDER-MAN, BATMAN & SUPERMAN Roles But turned them all down! In an in-depth interview with Details, the Josh Hartnett's name has been linked with a few big superhero roles over the years, but things never progressed beyond very early casting rumor. Recently the actor has shied away from big Hollywood blockbusters (he will next appear in the Showtime horror series Penny Dreadful), and in an interesting interview with Details.com Hartnett explains why he became disheartened, and why some of the bigger roles he was linked to caused him to back away. We already knew that there were some whispers of him being up for Kal El in Bryan Singer's Superman Returns, but it turns out he was in line to play another couple of massive comic book heroes too! \"Spider-Man was something we talked about. Batman was another one. I somehow knew those roles had potential to define me, and I didn't want that. I didn't want to be labeled as Superman for the rest of my career. I was maybe 22, but I saw the danger .\" However, now 35, it seems Hartnett wouldn't be so apprehensive about sticking a costume on. When asked how he's respond now if Warner Bros. called up and asked him to wear a cape, he sounds much more open to it. \"I'd say,\" Let's talk about how it would be done, see if we can get on the same page. \"Compromise doesn't scare me anymore .\" DISCLAIMER: This article was submitted by a volunteer contributor who has agreed to our Think this article is front page worthy? Click on the \"thumbs up\" to the left! Hartnett would've made a great hipster Spidey before it was cool Nuclearpriest Not every actor has to be a big star, he has done good things. MrWilson Nobody sees Dicaprio as Jack, only a few women. And. I'm sure almost no one sees Hanks as Woody ....anybody ripping the guy, mad props for his lady history, including ScarJo! I remember that <mark>David Slade</mark> wants him to be as Fox new Daredevil before rights went back to Marvel. If Disney offer him big screen Daredevil I bet he bite that offer. New \"Body Bags\" Promo For Guillermo Del Toro's THE STRAIN"}, {"articleID": "2014122209_00021254_W", "names": {"Rick Ross": ["Q297831", "Q431969", "Q606032"], "Adam Savage": ["Q297618", "Q58232433"], "Bill Maher": ["Q17183175", "Q25189369", "Q2903288", "Q489", "Q56529291"]}, "date": "2014-12-22", "url": "http://www.inquisitr.com/1697123/rick-ross/", "content": "Man Makes Giant KitKat For Girlfriend: Drool, Then See How He Did It Etsy Selling Pills That Will Let You Poop Glitter - Just In Time For Christmas \"SNL' Gives Ode To The Office Christmas Party With This Music Video Video Of 13 Dogs, 1 Cat Enjoying A Holiday Meal With Human Hands Goes Viral [Video] Pit Bull Shooting Video: Cop Kevin Dupre Shoots Puppy Dog On Camera, Police Say It's\" Justified' \"Cop Lives Don't Matter': Brandon Tate-Brown Shooting Has Police Protesters Saying,\" F ** k Cops' WWE: Batista Tweet Hints Company Is Underutilizing This Superstar WWE: Third Of \"Andre The Giant Memorial' Participants No Longer On Main Roster Saddleback Leather Company: Let's Tip Waitstaff Better For Wishing\" Merry Christmas' Instead Of \"Happy Holidays' 2014 Walmart Christmas Eve Hours: What Time Do Stores Close For Last-Minute Holiday Shoppers? Are You Sitting Too Much? If So, This Video Will Be Very Informative!\" GTA V' Story-driven DLC Now In Development, Alongside Online Heists Looks like Wiz Khalifa, who's known to be a huge fan of smoking marijuana, has met his match. During a recent party at the Supper Club in Hollywood, Khalifa was photographed beside <mark>Rick Ross</mark> who was smoking a huge blunt. <mark>Ross</mark> posted a picture of him and Khalifa on Instagram with the caption, \"Wiz came thru to blow one wit me like a trill yung n *** a shud #hoodbillionaire in da air!\" <mark>Ross</mark> was celebrating the release of his seventh studio album, \"Hood Millionaire\" , and Khalifa came by to <mark>Ross</mark> is not only celebrating the release of his new album, but also the fact that he lost around a massive 85 pounds after a medical scare back in 2011. He told Good Morning America, \"I wanted to cut back on some of the drinking I was doing and sleep a little more, you know, watch what I ate .\" <mark>Ross</mark> revealed that with the help of his own spin on the CrossFit training program as well as a few diet changes, he was able to lose all that weight. told Good Morning America about his health scare two years ago after he suffered two seizures. \"I woke up from that and I was like,\" Wow, I really need to re-evaluate what I'm doing,' \"he said. He started eating healthy, revealing that he added pears to his diet. The revelation became a meme after several of his fans started posting pear emojis on his Instagram .\" I feel I'm fat boy forever. I'm going to always be a fat boy. But it most definitely was just something I had to do, \"<mark>Ross</mark> continued. Despite the fact that he's changing his lifestyle gradually, he assured that it will not affect his music .\" My music comes from the heart, which comes from my mindset, \"he said .\" After I sit down and absorb this great interview, it's something that's gonna come to me that I can put into a record. \"Back in 2009, <mark>Ross</mark> founded the record label the Maybach Music Group. The label released his studio albums Deeper than Rap, Teflon Don, God Forgives, Mastermind, and 2014's Hood Billionaire. The label is also home to other artists such as Wale, French Montana, and Omarion. Atheists Rewrite Ten Commandments, MythBusters' <mark>Adam Savage</mark> Judged New Commands Anonymous Announces Vengeance On North Korea For Sony Hack With #OpRIPNK Prominent Michigan Cancer Doctor Pleads Guilty:' I Knew That It Was Medically Unnecessary' Carl Herold: Popular Reddit User CarlH Accused Of Raping, Torturing 9-Year-Old Son Did Ellen DeGeneres Catch Leah Remini's Husband Cheating On Her? [Video] Malaysia Airlines Flight MH370 Shot Down By U.S. Military, Former French Airline Chief Says\" Destiny': How To Complete \"Urn Of Sacrifice' Quest For\" The Dark Below' h4 class = \"icon-medal widgettitle\" > NEWSMAX h4 class = \"widgettitle icon-featured\" > Featured Articles \"Take Me To Church' With Victoria's Secret Angels: Hozier Accused of Misogyny\" GTA V' Story-driven DLC Now In Development, Alongside Online Heists Five Wonderful Facts About Movie Classic, \"It's A Wonderful Life' <mark>Bill Maher</mark> Gives Berkeley Commencement Speech, Ignores Petition Against Him"}, {"articleID": "2018011616_00593288_W", "names": {"Mark Potter": ["Q6769304", "Q6769305"], "Sarah White": ["Q52727394", "Q57699411", "Q7422897"]}, "date": "2018-01-16", "url": "https://sg.finance.yahoo.com/news/stock-levels-watch-retailers-still-too-high-executives-160744345--finance.html", "content": "View photos Visitors look at watches at the Montblanc stand at the \"Salon International de la Haute Horlogerie\" (SIHH) watch fair, organised by the Richemont group, in Geneva, Switzerland, January 15, 2018. REUTERS/Denis Balibouse More By Silke Koltrowitz GENEVA (Reuters) - Inventory levels at multi-brand watch retailers are still too high, two top industry executives said on Tuesday, suggesting a robust recovery in luxury watch sales may be some way off. Swiss watchmakers are just emerging from a severe downturn, helped by a recovery in demand among their biggest customer group - Chinese shoppers - and echoing a broader pick-up in luxury goods industries from fine wines to designer clothes. But the problem of overproduction and resulting excess stock at watch retailers - which forced some labels into buybacks, in part to prevent their wares from being sold off at steep discounts - is still present, the executives said. \"Inventories at retailers are still huge, especially in Asia. Some brands bought back unsold watches, but the problem has not been solved,\" Richard Mille, head of the eponymous independent label told Reuters in an interview at the SIHH watch fair in Geneva. \"It seems that some people in the watch industry just don't learn the lessons of the past. As soon as demand picks up, they flood the market,\" he said. Laurent Dordet, head of Hermes' <HRMS. PA> watch business, said the brand's own stock levels were healthy. But \"many of our competitors still have overcapacity and produce too many watches that jam the retail network,\" he said. The mood in the aisles of the Geneva show, as well as on luxury group LVMH's <LVMH. PA> boat moored in the city, was brighter than in previous years, with brands such as Audemars Piguet and LVMH's Hublot forecasting further growth in 2018. But the sales recovery so far has been largely limited to watchmakers' own stores, while multi-brand retailers are struggling as many have cash tied up in outdated models that no longer sell. Cartier-owner Richemont <CFR. S>, which made large inventory buybacks during the downturn, reported a 13 percent rise in constant currency sales in its own stores in the quarter to Dec. 31, but a 3 percent decline at third-party retailers that still represent more than a third of group sales. Swiss watch exports, which reflect brands' sales to retail partners, rose a modest 2.8 percent in the first eleven months of 2017. Audemars Piguet, Hermes' watch unit, Roger Dubuis, Parmigiani and Richard Mille all said they were closing points of sales at third-party retailers. CONSOLIDATION The problems at multi-brand stores have already led to some consolidation, ultimately shrinking the number of such outlets. Last year, Canada's Birks Group <BGI. A> sold its U.S.-based subsidiary Mayor's Jewelers to Britain's Aurum Holdings. \"There are too many retailers, this cannot go on. Their margins have shrunk, they have financial problems,\" Mille said. Patrick Pruniaux, chief executive of Kering's <PRTP. PA> Ulysse Nardin brand, said he was comfortable that his brand relied entirely on third-party sellers, but also said he expected further mergers and acquisitions among retailers as some were just not up to the new challenges in their industry. Cartier said on Monday its inventories had returned to healthy levels, but it might still resort to selective buybacks. Berenberg analyst Zuzanna Pusz said in a note on Tuesday that Richemont's close monitoring of the wholesale market suggested inventory levels were still too high. (Editing by <mark>Mark Potter</mark> and <mark>Sarah White</mark>)"}, {"articleID": "2018080721_00016401_W", "names": {"President Bush": ["Q207", "Q23505"], "Big Ben": ["Q2902145", "Q295364", "Q537679", "Q599161", "Q657876"], "Taj Mahal": ["Q353023", "Q59627566"]}, "date": "2018-08-07", "url": "http://pastemagazine.com/articles/2018/08/supreme-court-nominee-brett-kavanaugh-thinks-the-p.html", "content": "Supreme Court Nominee Brett Kavanaugh Thinks the President Can Ignore Laws He Doesn't Like By Allison Bolt | August 7, 2018 | 4:50 pm Share Tweet Submit Pin In 2013, President Trump's Supreme Court nominee Brett Kavanaugh stated that it's a \"traditional exercise\" for a president to ignore new laws passed by Congress if the White House believes they are unconstitutional. For Democrats, knowing Kavanaugh's position on giving Trump total power makes the future look even more bleak. Kavanaugh said that if the president signs a bill into law \"and says these certain provisions in here are unconstitutional, and we're not going to follow those provisions, that is a traditional exercise of power by Presidents .\" This statement was in reference to President George W. Bush's controversial \"signing statements .\" A signing statement takes place when a bill has been passed by Congress and arrives on the president's desk and he signs it into law, but adds notes addressing sections of the bill he deems to be unconstitutional. Basically, a president can bypass laws passed by Congress without vetoing them, which would allow congress to override the president's decision. <mark>Bush</mark>'s use of signing statements were often condemned by critics for abusing power and ultimately ignoring laws passed by Congress. <mark>Bush</mark> objected to over 500 provisions in more than 100 pieces of legislation passed by Congress. <mark>Bush</mark>'s signing statements were often on legislation that discussed the war on terror, affirmative action programs and even bills that created basic qualifications for executive appointees. One of his most controversial signing statements took place while Kavanaugh was serving as the White House staff secretary. This particular signing statement was on a torture ban bill which outlawed the torture of detainees. In the statement, <mark>Bush</mark> declared he could override and bypass this new legislation. In an Aug. 13, 2013, opinion Kavanaugh wrote, \"If the President has a constitutional objection to a statutory mandate or prohibition, the President may decline to follow the law unless and until a final Court order dictates otherwise .\" He wrote a similar opinion in 2011. Sen. Chuck Schumer (D-NY) said, \"Understanding the nature of his involvement in those actions is absolutely critical to evaluating the type of justice he would be on the bench. If Republicans continue to stonewall, the American people will wonder what they are hiding .\" Many allies of Kavanaugh have pointed to the fact that President Obama once said, \"For nearly two centuries, Presidents have issued statements addressing constitutional or other legal questions upon signing bills into law .\" However, a law professor at the University of Texas and CNN analyist Stephen Vladeck said: President <mark>Bush</mark> wasn't the first to use signing statements, but he used them more often than both his predecessors and successors, and, as importantly, he consistently used them to advance an aggressive theory of constitutional limits on Congress' power to interfere with the Executive Branch that was largely a novelty. Some Republicans, such as Senate Judiciary Charimain Chuck Grassley (R-IA), say Democrats are just attempting to delay Kavanaugh's confirmation. Yet GOP Sen. Tom Thom Tillis (R-NC) said, \"I want to learn about what he has done in the 307 opinions and his writings about his jurisprudence and whether or not he's qualified to be in the role of the Supreme Court .\" On Aug. 2, Democrats demanded full access to all of Kavanaugh's documents during his time in the <mark>Bush</mark> administration from 2003-2006. Also on Thursday, the Senate Judiciary Committee stood in front of a large wall of 167 boxes labeled \"Kavanaugh records\" in an attempt to illustrate Democrats are only attempting to stall the Supreme Court appointment. Tillis said, \"If you were to stack up all these pages, it would be taller than the <mark>Big Ben</mark>, taller than the Statue of Liberty, taller than the Capitol Dome, and taller than the <mark>Taj Mahal</mark>. Here's the reality: The same people that are asking for the documents oppose Judge Kavanaugh .\" Apparently some poor staffers spent their evening assembling boxes labeled the \"Kavanaugh Files\" ...Senate Republicans holding a press conference momentarily to object to Democratic demands for documents tied to the Supreme Court nominee @ SpectrumNewsDC @ SpecNewsRDU pic.twitter.com/c4kcetvdCu"}, {"articleID": "2010110923_00344016_W", "names": {"John Newman": ["Q12433089", "Q19043224", "Q20675622", "Q29033956", "Q43134714", "Q54323793"], "Michael Rose": ["Q1356968", "Q15999967", "Q22107437", "Q24040317", "Q24678814", "Q29159682", "Q3026030", "Q47739312", "Q6833963"]}, "date": "2010-11-09", "url": "http://huliq.com/10282/veterans-day-tributes-already-underway-across-america", "content": "submitted by dave masko on 2010-11-09 lincoln city, oregon - although veterans day is not officially celebrated until thursday, many communities across the u.s. have already paid tribute to those who wear the country's military uniform with various veterans' day themed tributes. one of the nation's top public events to honor veterans took place in the coastal oregon community of lincoln city back in september. \"celebration of honor\" honors veterans over five days now in its fourth year, this annual \"celebration of honor\" tribute in lincoln city lasts for five days with dozens of daily activities to honor both veterans and their family members. against a backdrop of 1,000 american flags and the striking panorama of the pacific ocean, suzanne totten walked slowly with an oregon army national guardsman to present a flag for her late husband douglas in the \"field of honor .\" totten said she was \"deeply moved\" after the ceremony. \"douglas served during world war ii, and was badly injured on iwo jima. now that he's passed, it brings great comfort to be here for this celebration of honor for all our veterans,\" said totten with tears in her eyes as she stood in pleased surprise that so much had been done to honor her late spouse and other oregon veterans. this section of the chinook winds casino resort property is reserved each year for what's been dubbed as the \"field of honor,\" consisting of 1,000 american flags that serve as a reminder to all that this last week in september is reserved for the annual \"celebration of honor\" events in lincoln city. sar richards, general manager of chinook winds, led the opening ceremony events that included presentations of the oregon honorable service medal for veterans who served in world war ii, the korean, vietnam and gulf wars, as well as current local military members serving in iraq or afghanistan. \"our family members have had many sleepless nights wondering if their loved ones would return home okay,\" said richards in thanking all the hundreds of family members who accompanied the veterans to this annual event that's hosted by chinook winds casino resort and the lincoln city community. richards, who's a member of the confederated tribes of siletz indians that own chinook winds casino resort, also reminded those gathered--for this unique pre-veterans day tribute--that the generation serving today also deserves a place of honor alongside previous generations for the courage they have shown. at the same time, dozens of oregon national guardsmen - many in their early 20's--beamed with pride as the crowd both applauded their service and thanked them individually after the opening ceremony. joining richards and other casino staff and community volunteers was a special citizen who veterans of oregon call \"the heart and soul\" of this annual celebration of honor. \"i can say enough about the casino's community relations manager, teresa simmons whose done so much over the years to make this event such a success,\" said <mark>john newman</mark>, who heads the veterans of oregon program that travels throughout the state to honor veterans. celebration of honor is about never forgetting america's fallen heroes chinook winds casino resort has established itself as the \"place for veterans,\" because of this annual celebration of honor event. the casino also features a large memorial to gulf war veterans that's in front of the casino. locals in lincoln city think this patriotic out-pouring \"is strictly sincere and not any sort of advertising gimmick,\" said retired air force chief master sgt. ted logan of salem, oregon. \"i served on the air force honor guard when i was a young troop, and during my 33 years on active duty i've seen many, many tributes for our veterans. and, i'm talking arlington cemetery and the lot, but nothing has watered my eyes as much as this celebration here. i think chinook winds has really set the standard for honoring all our veterans,\" explained logan, while speaking passionately about what he witnessed during the five day tribute, sept. 22 through sept. 26. logan also said he was struck by the determination of the casino workers and community members \"who publically thanked all veterans. what they've done here is to create an atmosphere that unites all our generations of american services members .\" ted kutsch, a vietnam war veteran, concurred with logan and many others who had high praise for an event that's been called one of the largest and most comprehensive week long celebration for veterans in america today. kutsch, 72, travels each year to the \"celebration of honor\" from his home in lapine, oregon, said he joined the marines at the tender age of 16 \"so i could serve my country. i guess i couldn't hardly wait to do my service,\" he said with a spark of pride in his eyes. kutsch went on to serve nine years in the marines and then another 16 years in the oregon national guard. what logan and kutsch don't like to remember or talk about, however, is the disgraceful way americans treated military members both during and after the vietnam war. \"people would spit on me when i was wearing my uniform downtown. now, i walk around lincoln city like a hero. it sure feels nice to be here and feel that sort of love and respect from complete strangers who salute me when they see my old vietnam veteran ball cap .\" at the same time, many of the civilians who attended the \"celebration of honor\" events noted they \"could never properly thank both the veterans and their families for the sacrifices they've endured .\" but, this annual event \"gives us that opportunity and that's why it's golden,\" said <mark>michael rose</mark> who's a retired professor from nearby oregon state university. while there was plenty of american flag waving and other patriotic ceremonies, \"oregonians are more included to be focused on people. they enjoy sharing their feelings with each other, and nothing is more satisfying than something like this because it's so positive. what's better at this time in our country's history than to celebrate our heroes in uniform,\" explained <mark>rose</mark> who's specializes in political science. get huliq news on twitter! e-mail us news tips at info @ huliq.com share society veterans day tributes"}]