[{"articleID": "2013031416_00012506_W", "names": {"Jack Payne": ["Q10449107", "Q16236439", "Q21622339"]}, "date": "2013-03-14", "url": "http://nola.com/outdoors/index.ssf/2013/03/pre-katrina_maps_show_where_sp.html#comments", "content": "in heavily eroded areas like delacroix, old maps and charts are invaluable for finding new fishing spots, particularly this time of year. capt. <mark>jack payne</mark> has been studying satellite maps that predate the 2005 passage of hurricane katrina to learn where the old ponds and small lakes were. for the past several weeks, he's been fishing those water bodies, and has been catching plenty of keeper speckled trout. \"some of the spots we were fishing today were old duck ponds prior to katrina,\" <mark>payne</mark> said after a wednesday-morning trip. \"now, that old pond is surrounded by open water that's 20 times the size of the pond before katrina. so you kind of look at your old charts, and you see the pond before katrina, and of course, that's going to be your deepest water .\" the washouts surrounding those old ponds may be a foot or two deep, but the ponds themselves are in 4 - to 5-foot wheelhouse that <mark>payne</mark> said is the magic zone for this time of year. \"everybody thinks those trout run out of the area when a front comes through, but they really don't; they just run to the deeper part,\" <mark>payne</mark> said. \"if there's a 6-foot section in that (washout), the trout will pile in there. when the water warms back up, they'll disperse out in the (washout).\" <mark>payne</mark> fishes out of a 23-foot kenner, and he's fearless about exploring. he's constantly looking for new hotspots, and is frequently rewarded. after putting nearly two dozen trout in the boat during wednesday's short trip, he made a quick drift in a washout he had never fished before, and caught several more fish. he filed it away in his memory bank for further exploration this weekend. newcomers to the area who attempt to mimic the technique should look for old passages to the ponds, and definitely bring along a push pole. they might also want to make sure their sea tow memberships are up to date."}, {"articleID": "2019052617_00335146_W", "names": {"James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"], "Sophie Turner": ["Q240573", "Q735034"], "James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"]}, "date": "2019-05-26", "url": "http://scores.nbcsports.msnbc.com/en-xl/asia/nepal/four-killed-seven-injured-in-three-explosions-in-nepali-capital-police/ar-AABWzwA?li=BBJGzsi", "content": "Portals Navigation Outlook.com Skype Microsoft Store Facebook Twitter Office OneDrive Receive your emails here See your recent emails Send a quick email Manage your calendar with easy access Sign in with any Microsoft account: Outlook, Hotmail, MSN, Live What is a Microsoft account? SIGN IN Create Now Sign In Microsoft Store OFFICE 365 - Buy & Download directly from Microsoft UPGRADE TO WINDOWS 10 - Big savings on a huge selection of products Surface Windows Support Facebook Check News Feed See notifications View messages Confirm friend requests Get your Twitter Updates Sign In See your recent documents, or start one for free with Office Online. Sign in Sign in to your Microsoft account to see recent OneDrive contents. Sign in TRENDING TODAY Curtea De Arges / 23 ° C Change Close Set Default Location Search Display Temperature In Fahrenheit Celsius Done Make MSN my home page AFRICA ASIA AUSTRALASIA EUROPE LATIN AMERICA MIDDLE EAST NORTH AMERICA powered by Microsoft News Latest Stories TRENDING Thaci seeks a joint Albania border Bloomberg Sasha Obama steps out for prom Newsweek Why Jasmine does not bare her belly? USA TODAY News Storm unearths \"sunken' forest Mirror Final votes cast in Europe polls AFP Federer makes winning return AFP You can't\" starve' cancer, but you might help treat it with food The Atlantic More news Germany's Jews in Kippah warning The Hill Gove joins race to be next UK PM The Independent Chernobyl beats GoT in IMDb chart Sky News Best of week Directed by: <mark>James Cameron</mark>> Starring: <... \"src =\" http: //static-global-s-msn-com.akamaized.net/hp-neu/sc/9b/e151e5.gif \"title =\" 92. Titanic (1997) - Courtesy of Paramount Pictures \"> 100 saddest movies of all time 24/7 Tempo Most unlikely celebrity couples Photos Game of Thrones finale details INSIDER Celeb Buzz <mark>Sophie</mark> hints about wedding No. 2 ETOnline Nick's sweet tribute to Priyanka BANG Showbiz Ed Sheeran may become billionaire BANG Showbiz Royal watch Diana's statue at Palace delayed Daily Mail Charles to discuss climate change Daily Mail Harry\" s pal posts a tribute to new dad US Weekly Most read in Europe Russia ordered to free sailors Associated Press Contest to replace ex-British PM Reuters Ukraine polls campaign kicks off AFP How linen became favourite sustainable summer wardrobe staple The Independent FEATURES British spy lied to Nazis to protect the man she loved Daily Mail How cartoons saved my life BBC News Opinion: Europe's real threat - Oligarchs Newsweek MOST READ ON MSN Messi writes history again SB Nation Trans model accused of rape The News International Clooney fears for family's safety USA TODAY Take a break Guess the location of famous statues Photos News in pictures Photos Video: Pole vault fail injures athlete BuzzVideos Sport Hamilton wins Monaco GP Reuters Kerber loses opener in Paris Associated Press Juventus shortlist Sarri & Pochettino The Guardian Odd jobs of famous people before they made it big Photos Weddings How to travel with a wedding dress PopSugar Royal guest styles you can afford Evening Standard Tips to buy a bridal gown The Independent Actors who hated their on-screen character StarsInsider Health New way to treat Down's syndrome Mirror Meet the ultra runner The Telegraph VR app could help spot Alzheimer's Daily Mail The 100 greatest <mark>James Bond</mark> cars Motoring Research Travel Experience the midnight sun National Geographic Why you need to visit Montenegro TravelPulse The rebirth of Anguilla The Telegraph Tech & Science Announcement's on Alexa devices The Verge SpaceX satellites are driverless Quartz Space mud hits Earth Popular Science Previous Slide Next Slide Man killed in shark attack in Hawaii beach The Independent Everest ice melt reveals dozens of dead bodies Newshub Travolta thanks Pitbull for helping him accept baldness FOX News Zimbabwe crowns albino pageant king and queen New York Daily News Famous football players on and off the pitch Photos Rare albino panda caught on camera in China AFP Sources: Three dead in new attack on Burkina Faso church AFP The lost Leonardo? Louvre show ditches Salvator Mundi The Guardian Four killed, seven injured in three explosions in Nepali capital Reuters To accommodate Trump, Japan alters the rules of sumo Quartz Scientists witness birth of submarine volcano for first time Gizmodo Australia Strong quake rocks northern Peru, one dead Reuters Europe Edit Remove Section Move Section Up Move Section Down Add Section Below Orban hopes for anti-immigration shift in Europe in vote Reuters Papal audience: Māori King invites Pope Francis to New Zealand Radio New Zealand Countries to watch as divided Europe chooses its parliament Associated Press Russia, eyeing Arctic future, launches nuclear icebreaker Reuters Malta rescues 216 migrants from Mediterranean Sea Associated Press Lithuanian candidates say tone down Russia rhetoric Associated Press EU votes as populists seek historic breakthrough AFP Greek PM calls EU poll a vote of confidence Reuters World Edit Remove Section Move Section Up Move Section Down Add Section Below F-15 pilots saw jet crash into ocean Sun Sentinel Iran scribes \"insult' Sunnis, get fired AFP Woman leads prayer in Ghana Legit 12 civillians killed in Syria bombing AFP World Tornado hits US state, 2 dead Iraq to execute 3 French IS recruits Venezuela-Norway back to crisis talks Case against Solomons PM quashed 25 Nigerian troops killed in ambush 10 die from ship gas leak in China Tanzania to boost dairy production B'desh man killed by India's BSF SL detain nearly 100 in raids AFP Life Edit Remove Section Move Section Up Move Section Down Add Section Below Nick's sweet post for Priyanka on their first dating anniversary BANG Showbiz Diana statue set to go on display is delayed Daily Mail Ed Sheeran may become a billionaire as he turns 30 BANG Showbiz Moby apologises to Portman Bang Showbiz <mark>Sophie Turner</mark> drops hints about wedding no. 2 to Joe Jonas ETOnline Life Mel B reacts to sound issues Meghan to miss meeting Trump Ariana's wax figure criticised Lindsay praises Paris Hilton What did GoT ending mean? Cannes race wide open Kim, Kanye mark 5th anniversary Ingredient for scrambled eggs Sport Edit Remove Section Move Section Up Move Section Down Add Section Below Neymar arrives at Brazil camp ahead of Copa America AFP Federer makes winning return AFP Hamilton wins Monaco GP in the spirit of Lauda Reuters Kerber loses opener in Paris Associated Press Sport Rooney gives DC United 1-1 tie Valverde vows to fight on at Barca Mourinho undecided on next role Smith unfazed by\" cheat' chants Cowboys NRL player hospitalised DRC's Ngalina makes MLS debut Fiji eyeing World Series summit Keita in Guinea's AFCON squad Iran set for Volleyball Nations League Iran Daily Features Edit Remove Section Move Section Up Move Section Down Add Section Below Alarming trend of beached whales filled with plastic Vox.com Sports pictures of the week Photos British spy lied to Nazis to protect the man she loved Daily Mail Why combating mistrust is hard in Ebola-ravaged Africa National Geographic Video Edit Remove Section Move Section Up Move Section Down Add Section Below Real-life Iron Man flies jet-powered rocket suit Newsflare Hospital staff celebrates end of baby girl's chemo treatment Rumble Stunning look inside an obsidian rock revealed Newsflare Drone captures guy's phone sliding off a cliff's edge Dailymotion Mom hilariously gets stuck in locker BuzzVideos Orca pod surfaces from right underneath sightseeing boat Rumble Snow and stairs are painful enemies BuzzVideos <mark>Sophie Turner</mark> misses smelly Game of Thrones filming Dailymotion The world's largest moving ice carousel BuzzVideos The Queen is being Trumped Dailymotion How Chinese Bai ethnic minority tie-dye clothes Newsflare Police releases extreme near-miss footage Rumble It's snow joke! Prank ends in face-first fall BuzzVideos Water-loving horse hilariously drinks water from the hose Rumble Giant anaconda bites firefighter BuzzVideos Killer whale incredibly strikes stingray with its fin Rumble Photos Edit Remove Section Move Section Up Move Section Down Add Section Below Actors who hated their on-screen character StarsInsider Odd jobs of famous people before they made it big Photos Cannes red carpet looks over the years Photos Highest grossing Oscar-winning films of all time Photos Voices behind famous animated characters Photos Dazzling tiaras worn by the royals Photos Jaw dropping pictures of world's most dangerous roads Love Exploring The 100 greatest <mark>James Bond</mark> cars Motoring Research They said what? Most controversial quotes by sports stars Photos Stunning pictures of beautiful train stations Love Exploring Directed by: <mark>James Cameron</mark>> Starring: <... \"src =\" http: //static-global-s-msn-com.akamaized.net/hp-neu/sc/9b/e151e5.gif \"title =\" 92. Titanic (1997) - Courtesy of Paramount Pictures \"> 100 saddest movies of all time 24/7 Tempo Wedding dresses from the 1900s to today Photos Famous fathers with lots of kids Photos Incredible images that are optical illusions Photos Vintage photos of famous landmarks Photos Famous languages from shows Photos Click here for more"}, {"articleID": "2019043005_00238946_W", "names": {"David Cooper": ["Q1174057", "Q21466815", "Q21466821", "Q24005495", "Q24005496", "Q24682145", "Q3017703", "Q30602629", "Q5232549", "Q5232551", "Q57427555"]}, "date": "2019-04-30", "url": "http://www.shropshirestar.com/news/crime/2019/04/30/bridgnorth-police-target-speeding-and-anti-social-drivers/", "content": "Bridgnorth police target speeding and anti-social drivers Less than an hour ago Speeding and anti-social drivers are being targeted by police in Bridgnorth after continuous reports of reckless driving. Subscribe to our daily newsletter Sign Up West Mercia Police has increased its evening and overnight patrols in the town, as well as using a number of speed monitoring devices during the day, following numerous reports of cars being driven recklessly and at speed around Innage Lane and Innage Lane Car Park over the last few weeks. Bridgnorth councillor for Castle ward, <mark>David Cooper</mark>, said the area attracted bad behaviour and suffered significant damage, particularly to the 19th century Innage Lea building, following an arson attack in late 2016. \"Innage Lane has been subject to anti-social behaviour in recent years due to the age of it and parts, especially around Innage Lea, not being developed in recent years--something which is looking like it will soon change,\" he said. PCSO Mal Goddard, of Bridgnorth Safer Neighbourhood Team, said: \"There have been reports of cars being driven at speed and in an anti-social manner in the area of Innage Lane and the Innage Lane Car Park over the last few weeks .\" Unfortunately no witnesses have been able to provide the police with any registration details of the vehicles involved. \"In an effort to deter such activity, a number of patrols have been conducted during the evening and overnight, as well as speed monitoring during the day. This activity will continue to further deter such behaviour .\" Warning notices can also be issued to the registered keeper of vehicles being driven on public roads in an anti-social manner, which in this case is defined as being driven in a manner that is, or likely to, cause alarm and harassment. \""}, {"articleID": "2009080412_00048477_W", "names": {"Michael Stone": ["Q15987708", "Q21067357", "Q344648", "Q43198636", "Q6834644", "Q6834645", "Q6834647", "Q6834648", "Q786093"], "Steve Martin": ["Q16473", "Q2347163", "Q48152466", "Q55085130", "Q55085225", "Q7613276", "Q7613279", "Q7613281", "Q7613283"]}, "date": "2009-08-04", "url": "http://crisitunity.wordpress.com/2009/08/04/michael-stone-workshop-part-one/", "content": "the workshop was in asheville, north carolina, which i had heard of before but had never visited. apparently, so i'd heard, it was one of those little bastions of insane liberalism that you find throughout generic stretches of the bible belt (iowa city is seemingly another example). the workshop was one module of the 500-hour teacher certification this studio, asheville yoga center, offers, although that was irrelevant to me as i am not yet 200-hour certified. all levels were of course welcome, and my teacher jennifer told me she was going and that i ought to come too, so i took her advice. she also offered me half of her hotel room for the two nights we would be there, which was generous and lovely of her. she also offered to loan me plane fare, but a third round-trip plane flight with layover was not something i could handle in a single month, so i said i'd drive. mapquest said that asheville was eight hours and seventeen minutes away from where i live. it also said that i'd be on a single highway, i-81, for 320 miles. i was basically traversing the whole length of virginia on a diagonal, and it was a part of virginia that i'm pretty sure i've never driven through. it turned out that this is a lovely, if very hilly, trip. the drive there and back was largely without incident, except for a rainstorm so severe that it was too dangerous for me even to pull over. i hydroplaned a few times, once with justin timberlake on my ipod, and i couldn't help thinking this is not the last thing i want to hear before dying in a wet wreck. (my ipod deserves mention during this trip; it heroically played for almost nine straight hours on the way down and about eight hours on the way back .) the wipers on the crazy high setting, the one where you think surely the wipers will just fly right off the car, were of almost no help in visibility. it was a crazy rainstorm, but i can thank my stars that it came at a point where the road was fairly straight and fairly flat - instead of at the tennessee-north carolina border, which was a petrifying climb straight up and over and then down again. i coasted down on neutral on the way back and hopefully saved myself a little gas. jennifer's husband has traveled a great deal for his job in the past, so she had platinum status at our hotel, which meant free wine and haagen-dazs and breakfast. also the beds were quite comfy and they gave us little chocolates in the shape of north carolina, with a small white dot where asheville is. very cute. now, the workshop itself was with a gentleman from toronto named <mark>michael stone</mark>, who has written a brilliant if not easily digestible book called the inner tradition of yoga, which is arranged very loosely around various topics of yoga philosophy. he is a wonderful writer, and a great soul, and his photo on the back made him look like, as jennifer said it, a \"yoga hottie\". the picture turned out to be quite kind to him - he seemed not to have shaved or had a haircut since the picture was taken - and his personality was thoroughly different than the writing made it seem, but for all that it was amazing to study with him. he was so funny, and so thoughtful, and so committed to his lifestyle that it was inspiring. he made all kinds of wonderful yoga jokes, like telling us that utkatasana translates as \"favorite pose\" or \"easiest pose\" in sanskrit (i can't imagine that it's anyone's favorite pose, it's not at all pleasant or easy to do, and it translates literally as \"powerful pose\" , but also as \"chair\" or \"awkward chair\" or \"fierce\" ), and getting us into upward-facing dog and then chatting for a few minutes about the weather and whatnot while we waited, giggling in agony, for him to tell us to release, and so on. when walking around while we were in uttanasana, he talked in a low voice about all the \"stories\" that we tell ourselves (this is a major precept in his book), all the little insecurities that our brains like to chatter about as we're trying to concentrate on our yoga. \"i don't know what i'm doing in north carolina. her pants are so cute. why am i still talking to these people? they stopped listening a long time ago. i know i don't have anything good to say. i wonder what's happening back home .\" except the things he actually said were vastly funnier than these examples. i loved this. it made me feel 800 times better about my own inner monologue, which i feel it is hopeless for me to try to get rid of. his style of teaching was also so sure, and although his rhythm and pronunciation when he spoke reminded me of nothing so much as <mark>steve martin</mark> - that same exactness of consonants, the same elastic masculine tone - he did have a lovely voice. the main pieces of the workshop were sitting meditation, lecture/questions, asana, and pranayama. we did some of each in every session. we also did two brief workshop exercises, which i'll talk about in my next post. i learned something about myself and my current practice and my future practice in each piece. in sitting meditation, i learned that i am not afraid of meditation being a somewhat futile exercise for me for the rest of my life, but am also not afraid to let it grow very, very slowly. in lecture, oh, innumerable things. \"our fantasies of enlightenment obscure enlightenment .\" \"objectivity is a fairy tale .\" \"...recognizing that my viewpoint is just a viewpoint .\" \"enter there .\" in asana, i think i truly understood beginner's mind, the approach to asana as if it is new each time, and not feeling constrained by what i have been taught. such freedom there. in pranayama, i learned a lot about my limits, and about not being afraid to disobey the teacher if it's not right for me. i explored breathing and my feelings about it, and learned that there is something severely unresolved in me as regards breath. more on that also in my next post. there was so much more to this experience: jennifer's parents, asheville in its supreme vibrancy, an interesting guy whose energy i failed to fully understand, the exhaustion of ashtanga-style asana practice, the difficulty of mysore-style asana, and many, many tears. but i'm at 1100 words and i need to save the rest for another time. possibly related posts: (automatically generated)"}, {"articleID": "2012072620_00046957_W", "names": {"Jeff Harris": ["Q21598191", "Q6174019", "Q6174021"], "John Morris": ["Q19276793", "Q19325579", "Q203188", "Q21501583", "Q24844367", "Q3048680", "Q48744064", "Q53774610", "Q54635355", "Q56036931", "Q6249470", "Q6249477", "Q6249486", "Q6249491", "Q6249494", "Q6249495", "Q6249496", "Q6249497", "Q931890", "Q958669"], "David Steiner": ["Q5240060", "Q5240062"]}, "date": "2012-07-26", "url": "http://recyclingtoday.com/Article.aspx?article_id=130729", "content": ", headquartered in houston, has announced plans to reorganize its operations. wm says the goal of the restructuring is to flatten the company's management structure, which will allow it to sharpen its focus on its three major initiatives: yield management, improving efficiency in operations and meeting customers' needs. the principal organizational changes that will take place are: removal of the management layer consisting of four geographic groups (eastern, midwest, southern and western); consolidation and reduction of the number of areas managing the core collection, disposal and recycling businesses from 22 to 17; reduction of corporate support staff to better align their support with the needs of the operating units while reducing costs; and additionally, wm has announced the following appointments: james trevathan jr., previously executive vice president - growth, innovation and field support, has been appointed executive vice president and coo. <mark>jeff harris</mark> and <mark>john morris</mark> have each been appointed senior vice president, field operations. <mark>harris</mark> was most recently senior vice president - midwest group, and <mark>morris</mark> was most recently chief strategy officer. in their new roles, they will oversee the 17 operating areas. <mark>david steiner</mark>, president and ceo of waste management, says, \"the steps we are taking to restructure our organization are expected to provide two very important results for us. first, the restructuring is expected to reduce our cost structure by about 100 basis points in 2013. this is a good step toward our longer-term goal to reduce costs by 200 to 400 basis points. second, we believe that eliminating a layer of management and restructuring our support staff around our three major initiatives will intensify our focus on achieving those initiatives .\" <mark>steiner</mark> continues, \"jim trevathan has been in a role where he had all of the operations staff that supports the field reporting to him. in order to improve the connection between that staff and field operations, it makes sense to have the persons responsible for field operations also reporting to jim. in addition, we have two excellent executives to fill those field operations roles in <mark>jeff harris</mark> and <mark>john morris</mark>. the 17 area vice presidents will report directly to one of these two senior vice presidents .\" recyclingtoday: agilyx ceo named entrepreneur of the year recyclingtoday: what are you doing for independence day? bbq? fireworks? recyclingtoday: rt @ scrapwarecorp: did you know knowledge is power? see what @ recyclingtoday had to say about scrapwaresv2 via recyclingtoday: our 2012 paper recycling conference europe will be held 6-7 nov. in london! follow the link for more info & to sign up. recyclingtoday: rt @ veoliaes: tomorrow is a big day for veolia! stay tuned for some exciting news out of our operations in west carrollton, ohio! recyclingtoday: meet <mark>morris</mark> scrap metal co. inc. recyclingtoday: scrap industry vet & long-time recycling today friend larry sax is just getting started. read our interview w / larry recyclingtoday: @ thecpgrp your new logo looks great! congratulations! recyclingtoday: rt @ thecpgrp: new cp group logo released to show all five companies as one #strong, single entity. the complete #mrf provider!...recyclingtoday: recyclers discuss copper scrap theft in hong kong recyclingtoday: an indianapolis shopping mall firm reports recycling success recyclingtoday: have you heard of marck industries? they're are one to watch for june! recyclingtoday: wtsa calls for rate increase. find out by how much: recyclingtoday: rt @ thecpgrp: what is your #opinion? la bans plastic bags at retail establishments @ recyclingtoday recyclingtoday: from bir: nonferrous scrap recyclers in the eurozone feeling the impact of regional fiscal problems recyclingtoday: los angeles bans plastic bags at retail locations recyclingtoday: rt @ iscrapapp: in 2011 according to the dutch company arn, 96% of the weight of end-of-life vehicles in the netherlands were recycled. v...rtglobaledition: @ veolia_es_uk opens new mrf rtglobaledition: why should you join us at the 2012 paper recycling conference europe? watch this video & find out rtglobaledition: what does india's new #electronics #recycling law mean? rtglobaledition: interseroh shareholders approve name change. rtglobaledition: our 2012 paper recycling conference europe will be held 6-7 nov. in london! follow the link for more info & to sign up. rtglobaledition: scrap industry vet & long-time recycling today friend larry sax is just getting started. read our interview w / larry rtglobaledition: recyclers discuss copper scrap theft in hong kong rtglobaledition: the latest on the paper markets rtglobaledition: why does the copper market have scrap recyclers talking? rtglobaledition: from bir: cloudy with a chance of sun rtglobaledition: from bir: nonferrous scrap recyclers in the eurozone feeling the impact of regional fiscal problems rtglobaledition: interesting article what are your thoughts on this matter? rtglobaledition: rt @ alcoa: alcoa among top ten great places to work in mexico - new york--(business wire)--alcoa (nyse: aa) operations in monter...http:...rtglobaledition: @ simsrecyclingus india facility achieves r2 certification rtglobaledition: #prc 2012 registration is now open! join us in chicago oct. 14-16 rtglobaledition: rt @ unthashredders: here at the #ifat you can have a look inside the secondary shredder. #fb rtglobaledition: on the go, but want to keep up with the latest recycling news? we have an app for that check it out! rtglobaledition: @ unthashredders to bring the \"magic shredder\" to ifat rtglobaledition: munich bound! we're getting ready for ifat 2012. who will we see there? rtglobaledition: @ cascadesdd wins isri annual design for recycling award"}, {"articleID": "2017111002_00416619_W", "names": {"Rob Gray": ["Q55631792", "Q7340165"], "Devin Davis": ["Q3392563", "Q5267485"]}, "date": "2017-11-10", "url": "http://www.houstonchronicle.com/sports/cougars/article/Rob-Gray-Houston-set-to-open-season-against-12346288.php", "content": "<mark>Rob Gray</mark>, Houston set to open season against McNeese State Top scorer works on getting more assists this year By Joseph Duarte, Houston Chronicle November 9, 2017 Photo: Yi-Chin Lee, Staff Houston guard <mark>Rob Gray</mark> led the American Athletic Conference with 20.6 points per game last season. In a moment of levity, <mark>Rob Gray</mark> was asked about hairstyle, more precisely how he plans to wear his early in the season. Go with the curly, flowing locks? Or wear it in a Samurai-style bun? \"It's starting to get annoying because it's getting in my face a lot, so I might have to start wearing it up more,\" <mark>Gray</mark> said. \"I don't put much thought into it. Just how I feel .\" Hair isn't the only new look <mark>Gray</mark> will introduce. A senior guard for the University of Houston, <mark>Gray</mark> has proven he can score. Now, entering his final season, he's embracing a new role: passer. More Information With construction underway on a modernized basketball arena, the University of Houston will play its home schedule this season just a few blocks away. The Cougars will play 13 of 15 home games at Texas Southern's H & PE Arena. The only exceptions are Jan. 20 against Wichita State and March 4 against Connecticut, which are likely to be played at Toyota Center. \"If this is what we have to do to get a brand-new arena, I'd go play on an out-door court in the rain,\" coach Kelvin Sampson said. The $60 million Fertitta Center is set to open for the 2018-19 season. \"Scoring (has been) a strong point in my game that I feel the other team's scouting report will definitely have a target on me,\" said <mark>Gray</mark>, who is among the nation's top returning scorers. \"Like coach (Kelvin) Sampson said, this year my role is different. I don't have to score 20 points a game, maybe, for us to win. Maybe I'll get 10 assists instead .\" As the Cougars begin the season at 7 p.m. Friday against McNeese State at Texas Southern's H & PE Arena, Sampson has a roster that, even with the loss of NBA draft pick Damyean Dotson, is deep enough to take some of the scoring load off the 6-1 <mark>Gray</mark>. Depth a strength For starters, UH has more options in the post, a healthy <mark>Devin Davis</mark> and a deep backcourt that should be among the strengths as the Cougars look to build off consecutive NIT appearances and snap a seven-year NCAA Tournament drought. \"A lot more guys around him that can score,\" Sampson said. \"There were a couple positions (last season) we couldn't score at that limited us .\" As one of the Cougars' primary scorers, along with Dotson, <mark>Gray</mark> led the American Athletic Conference with 20.6 points per game. He was also second on the team with 91 assists and 63 3-pointers. In Sunday's final exhibition against Angelo State, <mark>Gray</mark> went nearly six minutes without attempting a shot and finished with eight points, five assists and four rebounds. \"I have other guys around me and I just have to be a great decision-maker and make the right decision whether it's to shoot or pass,\" said <mark>Gray</mark>, who is tied for ninth among returning scorers. For as much as <mark>Gray</mark> has accomplished on the court, a transformation off the court has been equally noticeable. During his first season in 2015, <mark>Gray</mark> was benched for one game for what he described as \"some things I had to learn .\" \"When I first got here I just wanted to explore the city and just meet new people and have fun at the University of Houston,\" <mark>Gray</mark> said. \"Now I'm more focused on my goals. I'm about to graduate in December. I'm just trying to wrap up my college career on the right path and make the most of it while I have the opportunity .\" Translator Any type of bowl a success for UT this season Upon <mark>Gray</mark>'s arrival, Sampson said the talented guard's \"beat was to a little bit different drummer .\" \"He was listening to a drummer somewhere, but it wasn't necessarily in our band,\" Sampson said. \"It was another stage over there that was playing reggae and we were over here playing golden oldies. I said,\" <mark>Rob</mark>, here's our drummer dude. Listen to our drummer .' \"Following Dotson A sign of how much progress <mark>Gray</mark> has made was evident recently when Sampson invited a guest speaker on leadership. Afterward, Sampson and <mark>Gray</mark> spent 20 minutes exchanging text messages .\" About what he learned and how he can apply it to our team, \"Sampson said .\" I think more than anything that shows his maturity. <mark>Rob</mark> has really developed. \"After being roommates with Dotson, <mark>Gray</mark> also has hopes of following in his footsteps and landing in the NBA .\" It just shows you that it's a reality now, not so much a dream, \"<mark>Gray</mark> said .\" It gives you a purpose every day when you wake up and get ready for practice. You know you're doing it for a reason. \""}, {"articleID": "2011062720_00047625_W", "names": {"Peter Welch": ["Q1112656", "Q22946128"], "Chris Gibson": ["Q32722", "Q5106653"], "Tom Burke": ["Q2439560", "Q27981577", "Q47593862", "Q7815131", "Q7815133", "Q7815134"]}, "date": "2011-06-27", "url": "http://vtdigger.org/2011/06/27/welch-announces-veterans-outreach-program/?utm_source=rss&utm_medium=rss&utm_campaign=welch-announces-veterans-outreach-program", "content": "for immediate release monday, june 27, 2011 contact: scott coriell <mark>welch</mark> announces bipartisan legislation to expand successful vermont veterans outreach program bennington, vt - at the veterans outreach and family resource center in bennington monday, rep. <mark>peter welch</mark> announced bipartisan legislation to expand the impact of the successful vermont guard outreach program that helps veterans returning from deployments in afghanistan and elsewhere. <mark>welch</mark>'s national guard outreach act (h.r. 2403) will capitalize on the success of vermont's first-of-its-kind program, expanding its reach nationwide. the vermont program has served as a model for other states and a front-page article last year in stars and stripes described it as a model for the nation. introducing the legislation with <mark>welch</mark> is rep. <mark>chris gibson</mark> (r-n.y.), who serves on the house armed services committee. the vermont guard pilot program was started in 2006 with the help of federal grants secured by sen. bernie sanders. vermont's congressional delegation has since worked to ensure the program remains funded, most recently helping to secure funding through the end of 2011. the program sends outreach specialists door-to-door and provides guard members and their families access to health care services, marriage and financial counseling, substance abuse treatment and other services that are critically important to guard members returning from deployments. the outreach specialists are themselves veterans who can relate to the reintegration process and know well the difficulties faced by guard members and their families. \"this legislation takes a good vermont idea to the rest of the country,\" <mark>welch</mark> said. \"it is effective because guard members do not have to seek out help - help is offered to them by trained veterans who know their struggles .\" <mark>welch</mark> was joined for monday's announcement by brigadier general thomas drew, deputy adjutant general of the vermont national guard, program outreach specialists, veteran <mark>tom burke</mark> and a representative from rep. <mark>chris gibson</mark>'s office. h.r. 2403 was referred to the house armed services committee."}, {"articleID": "2019041809_01377712_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-04-18", "url": "https://www.euronews.com/2019/04/18/ivanka-trump-passed-on-world-bank-job", "content": "Ivanka Trump passed on World Bank job By Euronews with Associated Press • last updated: 18/04/2019 - 08:13 Ivanka Trump on April 17, 2019. - Copyright Text size Aa Aa Ivanka Trump has confirmed that she passed on the job of World Bank chief after her father asked her if she was interested. The US President's daughter is currently a White House senior adviser. She told the Associated Press on Wednesday that her father raised the job \"as a question\" and that she told him that she was \"happy with the work\" she's doing. <mark>Donald Trump</mark> told The Atlantic last week that he considered his daughter, Ivanka, for the top position at the World Bank. \"She would have been great because she's very good with numbers,\" he explained. Instead, she worked on the selection process for the new head of the World Bank, David Malpass, whom she said would do an \"incredible job. The US and Europe have a long-standing agreement that the US has the right to select the head of the World Bank while the head of the International Monetary Fund is usually European. Share this article"}, {"articleID": "2018110915_00119105_W", "names": {"Kevin Chapman": ["Q15303992", "Q3195676"]}, "date": "2018-11-09", "url": "http://nbc29.com/story/39453321/psychologist-explains-why-you-cant-just-buy-one-thing-at-target", "content": "Psychologist explains why you can't just buy one thing at Target Posted: Updated: Credit: Shutterstock We're all familiar with that thing that happens at Target--the one where you walk in to buy dog biscuits and shampoo and push a cart with more than a hundred dollars' worth of stuff out the door an hour later. It even has a name and an Urban Dictionary entry; it's the Target Effect. It's something many of us joke about, but this unintended overspending can wreak havoc on a family's finances and lead to money stress. If it's a problem, what's to be done? Avoid Target altogether? It's my favorite store to shop for household items so I didn't want to give it up, but repeated hundred--and even two hundred dollar trips--I hadn't budgeted for left me planning to stick with online shopping where I'd be less tempted by the latest must-have thing from Hearth & Hand with Magnolia or that good-smelling candle. But I wondered if it was possible to overcome the Target Effect with less drastic measures. To find out I talked with Louisville-based licensed clinical psychologist <mark>Kevin Chapman</mark>, who specializes in anxiety and related disorders. And yes, according to <mark>Chapman</mark>, it can be done. He shared his Target intervention tips with NBC News BETTER. A HAPPY SHOPPER IS A SPENDING SHOPPER First, we have to understand how this effect works: in short, it just feels good to be in Target. \"The lighting, the bright colors...it brightens your affect and you tend to have a pretty good time so it's conducive to buying,\" <mark>Chapman</mark> said. Of course being able to stop at Starbucks for a vanilla crème cold brew can also induce us to spend more time, he said. Spending more time translates to spending more money--and buying things we didn't intend to. Target is also very clever at placing things in strategic places to boost cross-selling, and many stores now are rolling out lifestyle settings that help shoppers visualize the goods in their own home. Meanwhile they're employing \"psychological pricing,\" <mark>Chapman</mark> said. \"They give you the impression that you're getting a deal .\" It's a dead simple trick, but one we fall prey to. \"Because it has a 9 on the end of it it appears to be on sale,\" he said, \"so how could you pass it up?\" But we can't blame it all on the retailer. To understand how some of us are affected by Target's sales-boosting techniques we should look at why others aren't, <mark>Chapman</mark> said. THE TARGET EFFECT AS A SYMPTOM \"People who aren't affected, I would consider to be much more emotionally regulated,\" he said. \"They're not engaging in retail therapy--which is just code for shopping as an emotional behavior to provide relief from strong emotions .\" \"Many people just have a hard time dealing with certain emotional experiences, say anxiety,\" he went on. So they \"try to do things to feel better. Retail therapy makes them feel better temporarily but the problem is it contributes to more negative consequences .\" Despite that, he said, \"since we're creatures of habits,\" the next time I'm triggered I do what worked before, but it backfires and I feel like garbage .' \"So the Target Effect is less its own thing, he said, than a symptom of a different problem. TOOLS TO REIN YOUR WORST TENDENCIES Still, though, there are tools shoppers can use to prevent overbuying .\" One strategy is to have a strict budget and to know \"this is what I have every month,'\" he said. \"That's not particularly sexy but stating that is important. Frugal and financially consciousness people...create a budget and don't engage in impulsive buying .'\" I learned that myself during a period of unemployment in our household. When there was literally no money available to overspend we just didn't. But what if you are less disciplined and/or aren't as financially limited? \"The only way to not succumb [to the Target Effect] is to reprogram your mentality about even going,\" <mark>Chapman</mark> said. \"One thing I would encourage people to think about is the idea of not--quote unquote--window shopping. Window shopping is a misnomer, so why are you wandering around Target if you don't need to be there? This will decrease impulsive buying tendencies. If I don't need to shop and it's not in my budget simply don't go to Target .\" Well, there's that. But what about once we're there, and we need a few household things? GIVE YOURSELF A PEP TALK BEFORE HEADING IN \"People who are emotionally regulated who won't fall victim, they're choosing their thoughts and appraisals beforehand, kind of like pep talking,\" <mark>Chapman</mark> said. We can all use these thoughts, he said. \"For instance, say I know I have a problem with Target Effect. Before I go I have to be diligent enough to say I'm not drinking the Kool-Aid today. I have to strategically pick certain thoughts before I even get in my car that are conducive to only buying what I want to buy .\" Key to these thoughts are that they're short and easily memorizable, and realistic, he said. \"One example of a thought to be would be' I only need detergent,'\" <mark>Chapman</mark> said. \"The reason that thought is important is the word need based on my budget, the only thing I need to purchase and the only reason I need to go is to purchase this product. [If I] rehearse that, my behavior is guided to the laundry aisle, [I] look at nothing else, and checkout .\" Wait, really? Just repeat to yourself you only need detergent? Yes, <mark>Chapman</mark> said. Say, \"I budgeted for dog food so I put on a thought like' I only need dog food .' That dictates I can only buy dog food so if I buy anything else I'm violating my code .'\" Ok, but it's very easy to see this thought turning into \"Yes I only need dog food, BUT ...' Right? But I see this cute rug on sale, or wouldn't it be nice to have this yummy smelling hand soap? NEED MORE BACKUP? ASK YOURSELF THESE QUESTIONS In this case, <mark>Chapman</mark> said,\" Use disputing questions. \"These are\" all-purpose questions that force you to challenge [those] thoughts. Before I go I need to practice that dialog. I'm only going for dog food but I find this other item conveniently nearby would make me feel better. What's the evidence that I need that [item], that it would make me feel good? You have to base it on evidence that I need that item. Are you 100 percent sure you need to buy it? No, you want it. What's another perspective?' I would regret it .' \"But for this to work, he said,\" you have to practice it before you go. \"If you think it will take more than repeating some thoughts to combat your Target Effect behavior, there's another level, <mark>Chapman</mark> said. Drawing up on his experience with people with anxiety, he recommends exposure therapy .\" Go into Target practicing those mantras, and having a companion with [you], going in with the intention of that one item you choose in advance, purchase the item, flee the store, and after the fact, process how you feel emotionally after. If you didn't buy the Poo-Pourri, did the sky fall? \"Now\" Ask \"what did I learn?'\" he said. \"You learn' I can go to Target and buy one thing .' That forms a new association in your brain that tell you can buy one thing at Target .\" Now that association can't be rewritten overnight, he said; it can take some practice. But he's so confident, \"I would straight up take someone who tells me they are a victim of the Target Effect and take them in and show them,\" he said. Looks like I know who to call next time I just need detergent."}, {"articleID": "2014110608_00046934_W", "names": {"Edwin Edwards": ["Q18160058", "Q737491"], "Ralph Abraham": ["Q18683775", "Q973595"], "John Fleming": ["Q1699042", "Q1699486", "Q1700075", "Q27951103", "Q28434600", "Q29642671", "Q3181504", "Q43914501", "Q6233427", "Q6233431"], "Robert Bell": ["Q17375839", "Q23541365", "Q3063343", "Q3113271", "Q3434544", "Q3434545", "Q47541907", "Q58416741", "Q58416759"], "Peter Williams": ["Q12798640", "Q16106852", "Q16189569", "Q16751058", "Q19877010", "Q21066726", "Q23020690", "Q23900914", "Q24192582", "Q24704507", "Q24716880", "Q29034177", "Q29643792", "Q3376966", "Q37842905", "Q56989523", "Q57313212", "Q6193763", "Q7177725", "Q7177726", "Q7177727", "Q7177728", "Q7177730", "Q929719"]}, "date": "2014-11-06", "url": "http://wwl.com/Edwards-earns-runoff-spot-kiss-McAllister-goodbye/20259775", "content": "<mark>Edwards</mark> earns runoff spot; kiss McAllister goodbye The short, promising congressional career of Republican Vance McAllister came to an abrupt halt in Tuesday's elections in Louisiana, while the long and storied political career of <mark>Edwin Edwards</mark> was, at least temporarily, resurrected. McAllister, a married, family values Republican, lost the 5th District seat he was elected to less than a year ago after a video surfaced early this year showing him kissing another woman. <mark>Edwards</mark>, the four-term governor and thrice-married ladies' man, earned a runoff spot in the 6th District. He had to overcome a more serious scandal - his 2000 corruption conviction and subsequent prison term. That he has, at least for now, made for good headlines Tuesday but neither his success nor McAllister's defeat appear likely to do much to change Louisiana's congressional layout. Monroe's Democratic Mayor, Jamie Mayo, will face Republican physician <mark>Ralph Abraham</mark> in the Dec. 6 runoff in northeast Louisiana's 5th District, which has been a reliably Republican district for years. In the 6th, <mark>Edwards</mark> will face former state coastal restoration chief Garret Graves in a Baton Rouge-area district that has gone reliably Republican in the last two presidential races. <mark>Edwards</mark> was undaunted as he addressed supporters Tuesday night with his wife, Trina - five decades his junior and the mother of their toddler son - standing beside him. \"On the 7th day of December I'll address you as the congressman from the 6th District of Louisiana,\" <mark>Edwards</mark> said. Graves finished ahead of a divided Republican field that included state Sen. Dan Claitor, businessman Paul Dietzel and state Rep. Lenar Whitney. All sought to replace incumbent Republican Bill Cassidy, who is running for the Senate seat held by Democrat Mary Landrieu. In the 5th District, Monroe Mayor Jamie Mayo, a Democrat, earned a runoff spot against physician <mark>Ralph Abraham</mark>, who edged out other Republicans including Zach Dasher, a relative of the \"Duck Dynasty\" reality TV family. The state's other four House races were milder affairs in which incumbents faced no well-known opposition. Republicans Steve Scalise in the 1st District, Charles Boustany in the 3rd and <mark>John Fleming</mark> in the 4th and Democrat Cedric Richmond in the 2nd all won easily on Tuesday. <mark>Edwards</mark> staked out notably centrist views in the 6th District race, in contrast to his Republican opponents. He backed same-sex civil unions (but not gay marriage); supported a minimum wage increase; favored the expansion of Medicaid under the Affordable Care Act even as he voiced complaints about the act overall. Rounding out the field were Republicans <mark>Robert Bell</mark>, Craig McCulloch and Trey Thomas; Libertarian Rufus Craig Jr.; Democrats Richard Lieberman and <mark>Peter Williams</mark>. McAllister was considered something of a dragon slayer last November when he won a race to fill the unexpired term of another Republican, Rodney Alexander. The Saints are 4 and 4 and coming home to the Dome for the next three games. Are you waiting for one more win to think playoffs? Will it take 2 more to think that or playoffs, playoffs are you crazy too early for that. Waiting for one more win to think playoffs Will take 2 more to think that or playoffs"}]