[{"articleID": "2014041123_00080590_W", "names": {"Tony Parker": ["Q193108", "Q19588477", "Q52151028", "Q52899347"], "Tim Duncan": ["Q193020", "Q7803451"]}, "date": "2014-04-11", "url": "http://www.brightsideofthesun.com/2014/4/11/5604800/western-conference-playoff-report-april-11th", "content": "In the comments of yesterday's playoff report an exchange with NateSuns86 led me to prepare a breakdown of all scenarios where the Suns went 2-1 over their next 3 and also 1-2 over their next 3. One of the assumptions I made in those scenarios was that Dallas would defeat San Antonio last night. So I threw it on the ground. Because I'm an adult and not a part of your system I had almost a fully flushed out word document with the new scenarios which took into account the Dallas loss - then Golden State lost to the Nuggets. That loss brought all sorts of other tiebreaker scenarios to the forefront and broke my brain entirely. But since I'm nice - here's roughly where we are tiebreaker wise: Suns/Mavericks - head to head even at 1-1, winner of Saturday's game wins the tiebreaker. Suns/Grizzlies - Grizzlies are up 3-0 on head to head and have already won the tiebreaker. Grizzlies/Mavericks - Mavericks are up 3-0 head to head and have already won the tiebreaker. Suns/Warriors - head to head is even at 2-2 so we move to the next tiebreaker for teams in the same division - division record, which is clinched by GSW already (10-5 to 7-8). Suns/Mavs/Grizz - the tiebreaker is record in games among the three teams, Dallas is 4-1, Memphis is 3-3, and Phoenix is 1-4. Each team has 2 to play. The only way this goes well for the Suns is if Memphis loses their last 2 and the Suns win their last 2 but if that happens there won't be a 3 way tie anyway. Suns/Grizz/Warriors - same three way tiebreaker. Memphis is 5-2 (2-2 against GSW, 3-0 against Phoenix), Golden State is 4-4 (2-2 against Phoenix/Memphis), and Phoenix is 2-5 (0-3 against Memphis, 2-2 against GSW). Suns would be dead here. Suns/Mavs/Warriors - same three way tiebreaker. Golden State is 5-3 (2-2 against Phoenix, 3-1 against Dallas), Phoenix is 3-3 (2-2 against Golden State, 1-1 against Dallas), and Dallas is 2-4 (1-1 against Phoenix, 1-3 against Golden State). In the highly unlikely (and potentially impossible event the Suns lose to Dallas and tie these teams, they're done. If any of that is wrong feel free to correct me - I'm sitting in a staff meeting at the moment. Thursday April 10th Key Western Conference Results: Recap) - <mark>Tony Parker</mark> didn't play for the Spurs but it didn't matter. Hell Patty Mills took 25 shots and only scored 26 points and it still didn't matter (although it helped he shot 6/11 from three). The Spurs are really good at winning games. Monta Ellis led the Mavericks with 24 points and you're not reading this part so I'm just going to go into a shopping list - I need cereal and milk. I like cereals with cartoon mascots on the box. Recap) - I'll admit I barely even bothered to watch this game because I thought the Full Squad would take care of business. The Nuggets trailed this game by as many as 12 in the 3rd quarter but the heavenly ascension of Timofey Mosgov (23 points and 29 - yes 29 - rebounds) allowed them to keep it close. It looked like Golden State was going to survive when Steph Curry hit a floater with 5 seconds left but Denver got the ball into Kenneth Faried who hit a shot in the lane to take the game. Steph Curry led Golden State with 24 points and Klay Thompson added 21. LOST 1 - Memphis 46 Friday April 11th Western Conference Games of Significance: Suns @ Spurs - At this point of the morning we don't really even know who's going to play for either team. Coro reported that Dragic is questionable with an ankle injury (roughly his 10 millionth) while other reports suggest both <mark>Tony Parker</mark> and <mark>Tim Duncan</mark> are going to sit out tonight. <mark>Parker</mark> has sat the last two games while <mark>Duncan</mark> suffered a bit of a knee scare in the 1st half last night but still played 39 minutes. I don't think there's any shame in saying we have no clue what's going to happen tonight, so I'll say Spurs by 10. 76ers @ Grizzlies - I hear a lot of you say things like \"anything can happen any night in the NBA\" and \"they're all NBA players\" - but when your team has won 2 games since February started I don't think any of that applies. The Sixers are bad and they should feel bad. Memphis will win this game by 73. Need a morning laugh? Go check out the Philly roster. Warriors @ Lakers - Won't some other playoff contender sleepwalk through a game with a bad Lakers team and take a horrible loss? If so I'd really appreciate it. The odds are against Golden State suffering a second consecutive bad loss but at least the Lakers are sort of an NBA team - unlike Philly. Phoenix Suns playing better than Dallas Mavericks and Memphis Grizzlies, by the? numbers Phoenix Suns Channing Frye nominated for NBA Sportsmanship? Award Forgot password? We'll email you a reset link."}, {"articleID": "2017050217_00815567_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-05-02", "url": "http://vanityfair.com/news/2017/05/infosys-jobs-donald-trump", "content": "Depends on his mood. By Andrew Harrer/Bloomberg via Getty Images. After spending the whole of his campaign and first 100 days in office railing against any company even entertaining the thought of sending jobs overseas or not hiring American workers stateside, <mark>Donald Trump</mark> can claim a victory: Infosys Ltd., Bangalore-based I.T.-services firm, will hire 10,000 Americans within the next two years, as well as open four hubs within the U.S., starting in Indiana this summer. And unlike with previous press announcements from companies like Sprint and GM, which recycled old jobs plans to flatter the president's ego, it appears Infosys really did respond to <mark>Trump</mark>'s harsh rhetoric. Also likely contributing to the move? An executive order <mark>Trump</mark> signed last month, initiating a government review that is expected to make it harder for companies to obtain H-1B visas for workers who might undercut American labor. While tech companies throughout Silicon Valley rely heavily on the H-1B program, which is designed to allow high-skill workers to enter the United States, <mark>Trump</mark>'s directive is expected to focus on restricting visas at the lower end of the skill spectrum, disproportionately affecting call-center companies like Infosys. Perhaps in an attempt to appease the president, Infosys C.E.O. Vishal Sikka offered Reuters a comment on the move that sounded like it could have been dictated by <mark>Trump</mark> himself: \"When you think about it from a U.S. point of view, obviously creating more American jobs and opportunities is a good thing .\" While the move isn't guaranteed to get Infosys out of <mark>Trump</mark>'s crosshairs, it is almost certain to increase the company's labor costs. \"This is positive in one aspect and negative in another,\" IDBI Capital Market Services analyst Urmil Shah told Bloomberg. \"Increasing local hiring is important for Indian IT firms to retain ongoing projects in the US, as well as secure new ones. The downside is that the costs will rise .\" Share Email Facebook Twitter"}, {"articleID": "2017032005_00415967_W", "names": {"Chris Miller": ["Q13638984", "Q25184124", "Q283700", "Q5107465", "Q5107466", "Q58011841"], "Gareth Edwards": ["Q1381089", "Q21461670", "Q2451678", "Q5522829", "Q5522830", "Q5522832"]}, "date": "2017-03-19", "url": "http://heroichollywood.com/han-solo-film-different-rogue-one/", "content": "Now that the dust has settled on Rogue One, all eyes are turning on Star Wars: The Last Jedi and the upcoming Han Solo film. Seeing as J.J Abrams already established the tone, setting, and characters for the upcoming Skywalker Trilogy, everyone's focused on the Han Solo film. After all, it's an unknown quantity, but it has been proven that solo Anthology films can work in the Star Wars universe with Rogue One. Also read: \"Rogue One' Screenwriter Explains Connections To\" A New Hope' The unique thing about these Anthology films is that they can each have different tones without compromising the tone of the core series. Seeing as Rogue One was a mash-up of a heist/war film, the Han Solo film can be seen as a Western film. With Phil Lord and <mark>Chris Miller</mark> behind the camera and Star Wars veteran Lawrence Kasdan penning the script, the team for the Han Solo film is looking to make something different from <mark>Gareth</mark> Edward's gritty Rogue One. During an interview at the Empire Film Awards, <mark>Gareth Edwards</mark> discussed how both stand-alone films will be different from each other. \"They're amazing filmmakers. I'm very excited about what they do. It'll be a completely different film to what we did. I think they've got the hardest task, I think, out of all the films that I heard about that one is probably the greatest challenge and they're gonna knock it out of the park, but I wouldn't have had the balls to do that .\" Also read: \"Star Wars': First Ever Photo Of Luke Skywalker Revealed Unlike us, <mark>Edwards</mark> has the inside scoop on the upcoming film and is aware of all the minutiae surrounding it. However, this is more of a curse for <mark>Edwards</mark> since he's feeling a bit jealous .\" They've got really good taste. You glimpse things--you try not to--as you're going about your business, but you see stuff. And everything I saw, I got really jealous about it. \"Also read:\" Rogue One' Writer Explains Why Fans Will Never See Draft Of Unused Opening Crawl The Han Solo film just recently went into production and with the principal cast ready, we got our first look at them in the Millenium Falcon. While Phil Lord and <mark>Chris Miller</mark> keep busy, we're not sure what <mark>Gareth Edwards</mark> is up to next. He was originally attached to direct the sequel to his 2014 reboot of the Godzilla franchise, Godzilla: King of Monsters. However, he left the project last year and was replaced with Michael Dougherty, who directed Krampus. Directed by Phil Lord and <mark>Chris Miller</mark>, the Han Solo film stars Alden Ehrenreich, Donald Glover, Woody Harrelson, and Emila Clarke. The Han Solo film is set to hit cinemas on May 25, 2018. Source: Empire (via Facebook) Kotobukiya Reveals \"Star Wars' Celebration Exclusive Figures Previous 1 of 5 Next Star Wars Celebration is always a fun time for everyone involved. The filmmakers get to reveal and show footage from their new films, fans get to meet their favorite Star Wars actors, get autographs, and grab exclusive collectibles that can't be found anywhere else. This year's Star Wars Celebration is taking place in Orlando, Florida from April 13th to the 16th. While a majority of the event is currently under wraps, one thing is certain: Kotobukiya will be delivering the goods. Kotobukiya has revealed their upcoming slate of exclusive Star Wars Celebration figures and this year, their figures have a distinct theme: droids. Four new ARTFX + figures will be released, both for fans who are stuck at home, and those at the event itself. The droids include R4-M9, R5-D4, RX-X2, Triple Zero (0-0-0), and BT-1. You can check out the full gallery of the figures, including their details below the pictures by clicking NEXT. If you can't make it to the event, you can pre-order the figures on Kotobukiya's official website. Be sure to check back when Star Wars Celebration Orlando begins as we'll have all the latest information on your favorite franchise in a galaxy far, far away. Source: ComicBook.com Previous 1 of 5 Next VIEW IN GALLERY"}, {"articleID": "2016070411_00527369_W", "names": {"John Munro": ["Q23416422", "Q33127369", "Q43910966", "Q6249828"]}, "date": "2016-07-04", "url": "http://www.smh.com.au/comment/column-8/column-8-20160704-gpxxt6.html", "content": "Column 8 Reprints & permissions As there is to be a census in August, is there a legal or philosophical reason we could not have the same sex marriage question asked then? Would this not save the country a much needed $160 million, \"ponders Geoff Spicer in Lane Cove .\" Is there a reason why there seems to be more death and funeral notices in the Herald on Saturdays compared with weekdays? \"asks Allan Gibson, of Cherrybrook .\" Also during the week Wednesdays seem to reveal more notices than the other four days. Surely someone out there just dying (sorry unfortunate pun) to qualify for a C8Phd can bring life to this grave concern. \"\"It used to take me half my lunchtime to find the end of the cling wrap to get at my sandwiches. Putting the apple sticker under the last corner as I wrapped them solved that problem. And once you have found a use for the sticker it is no longer an annoyance,\" says Jock Brodie of Epping. \".. when did Um...You know...and I mean...become part of the Australian language? If you listen to people speaking on radio (Radio National is the worst) most interviewees cannot put a sentence together without saying at least four or five\" ums \", two or three\" you knows \"and in some cases\" I mean \". A couple of months ago a women on RN began each sentence with\" Um...you know...I mean...\"I had to turn it off. Surely these people know the subject before agreeing to be interviewed? Am I being too harsh?\" asks Greg Dark in Port Macquarie. Tidying up to Brexit TV (C8). \"It's not just that The ABC is screening 30 + years old episodes of The Bill that's a worry, <mark>John</mark> Rand; it's the amazing racism of the time being portrayed. That they are being screened in young children's viewing time in 2016 suggests that those responsible at the ABC haven't twigged yet what vile content some of these episodes contain,\" says Col Jackman in Bilgola Plateau. \"Far be it for Brexit to justify the removing of the old episodes of The Bill,\" says <mark>John Munro</mark> up in Middle Ridge, Qld. \"Let's hope we can look forward to reruns of Minder, The Avengers and Keeping Up Appearances, not to mention Are You Being Served and The Young Ones. Bring 'em all back .\" Brawl erupts at Melbourne Central Fists fly as security guards tackle teen skateboarder. (Video courtesy Seven News Melbourne) PT1M6S300169Mon Jul 04 09:12:01 UTC 2016"}, {"articleID": "2015061502_00012968_W", "names": {"Gary Peters": ["Q1230954", "Q1494930", "Q5525742", "Q56560036"], "Susan Collins": ["Q22279", "Q7647692"]}, "date": "2015-06-15", "url": "http://ktvz.com/news/wyden-intros-bill-to-cut-craft-brewers-taxes-rules/33551552", "content": "Deschutes Brewery founder <mark>Gary</mark> Fish backs Sen. Wyden's bid to cut regulations, taxes on craft brewers PORTLAND, Ore. - Sen. Ron Wyden, D-Ore ., said Friday he has introduced legislation that would promote continued job creation in the growing craft beverage, cider, wine and distillery industries throughout Oregon and the country. The Craft Beverage Modernization and Tax Reform Act, S. 1562, introduced Thursday, would cut taxes and modernize outdated regulations for craft brewers, cider makers, vintners, and distillers. Junction City police chief sues city, ex-administrator Most Oregon sex offenders not listed on public website Bundy denies firing gunshots near US researchers in Nevada In Oregon, those industries are responsible for an estimated 40,000 jobs collectively and generate about $6 billion annually in revenue. \"Oregon's craft beer, wine, cider and spirits producers are both world-renowned and a huge boon to our state's economy,\" said Wyden, co-chair of the Senate Bipartisan Small Brewers Caucus. \"Each of these industries is unique, and this legislation takes targeted approaches to update antiquated rules and reduce taxes for these growing businesses to ensure that these innovators continue to create high-quality jobs for Oregonians,\" added Wyden, the top Democrat on the Senate Finance Committee, which oversees excise taxes and alcohol regulations. Wyden's legislation builds on a consensus reached among multiple industry groups. And it builds on a number of popular proposals, including the Small BREW Act sponsored by Senators Ben Cardin (D-Md .) and <mark>Susan Collins</mark> (R-Maine); the Fair BEER Act sponsored by Senators Roy Blunt (R-Mo .) and Tammy Baldwin (D-Wisc .); the Distillery Excise Tax Reform Act sponsored by Senator <mark>Gary Peters</mark> (D-Mich .); the CIDER Act sponsored by Senator Charles Schumer (D-N.Y.); the AGED Spirits Act sponsored by Senate Majority Leader Mitch McConnell (R-Ky .); and the Craft Beverage Bond Simplification Act, which was approved by the Finance Committee earlier this year. In addition, Wyden's legislation includes a variety of new proposals to reduce tax and regulatory burdens for each industry. \"As co-chair of the Senate Bipartisan Small Brewers Caucus, Senator Wyden has been a longtime champion for America's craft brewers and we appreciate his strong support,\" said Bob Pease, CEO of the Brewers Association. \"He has been diligently working to reduce federal excise taxes for craft brewers through his co-sponsorship of the Small BREW Act. Now with the introduction of the Craft Beverage Modernization and Tax Reform Act, Senator Wyden has gone even further to ensure growth for small and independent brewers .\" \"We applaud Senator Wyden for this positive step forward in addressing beer excise tax reform in a fair, equitable and comprehensive way,\" said Jim McGreevy, president and CEO of the Beer Institute, a national trade association representing brewers, beer importers and industry suppliers. \"The beer-specific provisions of this bill will help brewers and beer importers of all sizes. We look forward to working with the Senator and our industry partners to build support for this important legislation .\" \"Oregon's breweries contribute mightily to our state's economy and Senator Wyden's legislation will allow our small businesses to build on what they've done naturally for decades - create good-paying jobs all across our state,\" said Deschutes Brewery Founder <mark>Gary</mark> Fish, Board Chair of the Brewers Association. \"A fresh approach to eliminating outdated regulations and lowering taxes is a recipe for breweries' uniquely Oregon success story to continue for years to come .\" \"The Oregon Winegrowers Association thanks Senator Wyden for his continuing support and leadership on issues that help improve the competitiveness of Oregon's craft beverage brands,\" said Association Board Director and Treasurer Steve Thomson, Executive Vice President at King Estate Winery. \"Under his proposal, Oregon's midsize and small family wineries would see a significant new tax benefit, enabling them to reinvest in their businesses and further fuel the wine industry's growth and contribution to the Oregon economy. Currently Oregon's 605 wineries, 950 vineyards, and related businesses account for 17,100 jobs, $208 million in tourism, and $3.35 billion in total annual economic impact spread across Oregon's 36 counties .\" \"I am excited to a see very progressive and comprehensive approach to positively change the excise tax for the cider industry, dramatically improve the small producer credit so growth is not taxed excessively and at the same time offer our regulating body, the TTB, more funds to assist our growing industry with compliance,\" said James Kohn, owner of Salem-based Wandering Aengus Ciderworks. \"The Craft Beverage Modernization and Tax Reform Act is a comprehensive piece of legislation that tackles some of the most significant barriers that America's distillers currently face, and it provides a measure of excise tax parity that will boost investment and create new jobs in communities across the country,' said Thomas Mooney, President of the American Craft Spirits Association and Co-Owner & CEO of House Spirits Distillery in Portland .\" These issues are important to the rapidly growing number of American craft distillers, and this bill comes only days after the introduction of the bipartisan Distillery Innovation and Excise Tax Reform Act of 2015 (HR 2520) in the House. On behalf of more than 700 distillers across the country, and as an Oregon distiller myself, I thank Senator Wyden for his leadership in taking on these important issues in the Senate. \"In addition to providing tax relief for Oregon's brewers, cider makers, vintners, and distillers, this legislation would also reduce compliance burdens for craft beverage producers by exempting nearly 90 percent of all industry members from complex bonding and bi-weekly tax filing requirements. The bill would exempt aged beers, ciders, wines, and spirits from complicated and burdensome accounting rules. It would reform rules on brewers to encourage more collaboration and streamline regulations. And it would equalize the playing field for all distilled spirits producers. Finally, this bill would cut administrative backlogs by ensuring the Alcohol and Tobacco Tax and Trade Bureau, which is charged with regulating these industries, is sufficiently funded. Additional enforcement funding and authority would help offset the cost of this bill by cracking down on tax cheats. Copyright 2015 KTVZ. All rights reserved. This material may not be published, broadcast, rewritten or redistributed Comments The views expressed are not those of this company or its affiliated companies. Please note by clicking on\" Post \"you acknowledge that you have read the Terms of Service and the comment you are posting is in compliance with such terms. Confirm Unsubscribe Are you sure you would like to unsubscribe from all current subscriptions? Please set an email address for your profile. To complete your registration on this site, please supply an address."}, {"articleID": "2018082900_00258932_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"], "Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"], "James Mattis": ["Q1680776", "Q267902"]}, "date": "2018-08-29", "url": "http://meforum.org/articles/2018/where-is-the-us-turkey-crisis-headed", "content": "Where Is the US-Turkey Crisis Headed? Jerusalem Post August 24, 2018 As <mark>Trump</mark> and Erdogan dig in, the chances that the two countries can return to a stable relationship is shrinking. Turkey and Turks \"Turkey buying the Russian S-400 missile defense system would threaten the security of our F-35 aircraft and let Putin collect critical intelligence on us. We must pass my provision in the defense bill this week to block the F-35 delivery until Turkey ends its deal with Russia,\" wrote US Sen. Chris Van Hollen on Wednesday. His comments came a day after US National Security Adviser <mark>John Bolton</mark>, visiting Jerusalem, said that Ankara made a \"big mistake\" by not releasing US Pastor Andrew Brunson. \"Every day that goes by, that mistake continues. This crisis could be over instantly if they did the right thing as a NATO ally, part of the West, and release pastor Brunson without condition .\" In Turkey the comments by <mark>Bolton</mark> were met with anger. Ibrahim Kalin, spokesman and adviser to President Recep Tayyip Erdogan, said that Turkey's judicial independence was being challenged by Washington. \"There is a rule of law in Turkey, and the Andrew Brunson case is a legal issue. There is an ongoing legal process related to this individual,\" Kalin said. Turkey and the US face their greatest diplomatic crisis in recent memory as both countries engage in a war of words that has also harmed the Turkish economy. Five years ago, $1 was worth two lira. Now you can get six liras for the same dollar. In the last month the lira lost almost a quarter of its value against the dollar. This has caused a crisis in Turkey, in which Qatar has now pledged $15 billion to support the Turkish economy, further tying Ankara and Doha together. It has also caused Turkey to strengthen its ties to Moscow. Over the last three years Turkey has increasingly grown closer to Moscow, Qatar and Iran on a variety of issues. But Ankara had hoped briefly that <mark>Donald Trump</mark>'s election in October 2016 would bring warmer relations. The view from Ankara is that the US has been working with allies of the Kurdistan Worker's Party (PKK) in Syria. The PKK's Syrian affiliate is named the People's Protection Units (YPG). The YPG has been the main force fighting ISIS in Syria since 2014, and the US helped the YPG push ISIS back from Kobani in 2015 and then began to work closely with the YPG in its rebranded form as the Syrian Democratic Forces (SDF). The SDF liberated Raqqa last year, and the US is increasing its footprint in Syria, sending new special envoys and diplomatic staff, as well as securing hundreds of millions in assistance for stabilization from Saudi Arabia and the United Arab Emirates. Turkey's conduit to <mark>Trump</mark>'s White House was supposed to be <mark>Michael Flynn</mark>, <mark>Trump</mark>'s first national security adviser. According to the BBC Ankara asked for <mark>Flynn</mark>'s help in getting a cleric named Fethullah Gulen deported from the US back to Turkey, where he faced charges connected to the 2016 coup attempt. But <mark>Flynn</mark> was fired by <mark>Trump</mark> and got snared in the Russia collusion investigation of Robert Mueller. Erdogan flew to Washington in May 2017 to meet <mark>Trump</mark>. But the visit turned sour when Turkish security personnel were filmed beating up protesters next to the Turkish Embassy in an embarrassing and unprecedented incident. Things went downhill slowly from there. Turkish officials repeatedly warned that Turkish forces and their Syrian rebel allies wanted to move on Manbij in northern Syria, a town held by the SDF east of the Euphrates. Instead, in January 2018, Turkey and its Syrian rebels invaded Afrin in northwestern Syria, a small Kurdish canton held by the YPG. This angered the SDF, which shifted forces from fighting ISIS and warned the Americans that they shouldn't abandon their friends in Syria. After Turkey took Afrin in March 2018, it set its sights again on Manbij. In June 2018 Secretary of State Mike Pompeo flew to Ankara and worked up a \"road map\" on Manbij with Ankara. There would be independent patrols around the town, with Turkish and US troops coordinating. These were supposed to lead to \"joint patrols,\" but in August Secretary of Defense <mark>James Mattis</mark> said there were more details to be ironed out. The problems in Manbij were playing out against the larger dispute between Ankara and Washington. The pawn in this dispute became Brunson, who had been arrested in Turkey and accused of being connected to the coup plot. \"A fine gentleman and Christian leader in the United States is on trial and being persecuted in Turkey for no reason,\" <mark>Trump</mark> tweeted on April 17. \"A total disgrace that Turkey will not release respected US Pastor,\" he tweeted again on July 18. According to a report on Ynet, <mark>Trump</mark>'s team sought out a deal with Ankara where Israel would release a Turkish woman detained for ties to Hamas, in exchange for Brunson. She was released and flew back to Turkey on July 15. But although Brunson was let out to house arrest on July 25, he wasn't released. <mark>Trump</mark>, apparently feeling betrayed, announced a doubling of tariffs on steel and aluminum on August 10. Since then the Turkish economy has been damaged. Average Turks have taken to the Internet to express anger, bashing iPhones, cutting up dollars and encouraging Muslims around the world to support the lira as a form of religious support for Turkey. This is part of the current mood in Ankara that is increasingly one that views the world through the lens of political Islam. But at the same time that Turkey asserts that the charges against Brunson are just an \"independent\" judicial issue, a report on The Wall Street Journal website claimed on August 20 that Ankara had proposed freeing the pastor in exchange for the end of a US investigation into a Turkish bank. Probably the story is more complex than that. Turkey also wants Gulen deported. The fact that two \"deals\" regarding Brunson were reportedly in the works seems to indicate that the story of \"judicial independence\" is not entirely rock solid. Turkey is willing to negotiate. That calls into question what exact evidence there is regarding Brunson. The <mark>Trump</mark> administration has made Brunson the centerpiece of its policy, as opposed to discussing wider issues such as why Turkey is buying the S-400 from Russia and Turkey's role in Syria. US media have begun to discuss whether the NATO alliance with Turkey is beneficial. \"Time for Turkey and NATO to go their separate ways,\" reads a piece in The Washington Post. Another piece at Foreign Policy says, \"<mark>Trump</mark> is the first president to get Turkey right .\" The rift was already there, says The National Interest. Indeed, the rift has been growing for more than a decade since the US invasion of Iraq in 2003, when Turkey rejected a proposal to base US troops on its soil. The problem with the <mark>Trump</mark> administration's crackdown on Turkey relations is that it could be reversed easily if the pastor is released. It could also change dramatically when <mark>Trump</mark> leaves office, as the next US administration will seek to do the opposite of everything <mark>Trump</mark> did. In US foreign policy circles, there is a vibrant pro-Turkey lobby that argues for \"engagement\" with Ankara, that worries that any pressure from the US will result in Turkey's growing embrace of Iran and Russia. It sees the SDF as a temporary ally, a group that was convenient when fighting ISIS, but which can be quietly abandoned in the next few years, as Washington maneuvers back to Ankara, which is seen as a 70-year ally since the start of the Cold War. These voices ignore Turkey's own agency and independent policy. They don't see Turkey as a full-fledged country making its own choices. They see it as only reacting to whatever the US is doing. But Turkey's crackdown on the press and frequent outbursts in Ankara harshly slamming various European countries or the US are not just reactions; they represent a growing Turkish national wand religious consensus. <mark>Trump</mark> could make a deal, but the long-term relationship will likely remain unstable. Seth Frantzman is The Jerusalem Post's op-ed editor, a Writing Fellow at the Middle East Forum, and a founder of the Middle East Center for Reporting and Analysis."}, {"articleID": "2013070817_00079697_W", "names": {"John Williams": ["Q11310708", "Q12633687", "Q131285", "Q1367551", "Q14950380", "Q15429336", "Q15821602", "Q1606354", "Q16105524", "Q16224055", "Q1702438", "Q18385583", "Q19325807", "Q20821181", "Q20821436", "Q21176199", "Q21481534", "Q22019624", "Q2333172", "Q24249667", "Q25190475", "Q2567288", "Q2688830", "Q28434529", "Q29643791", "Q30122882", "Q30612128", "Q370293", "Q3809678", "Q46993819", "Q49546744", "Q51585685", "Q54932733", "Q56187903", "Q56597939", "Q56604636", "Q6264302", "Q6264304", "Q6264308", "Q6264311", "Q6264317", "Q6264319", "Q6264346", "Q6264352", "Q6264355", "Q6264357", "Q6264363", "Q6264366", "Q6264372", "Q6264380", "Q6264382"], "Craig White": ["Q3526919", "Q47128766"], "Sean Morris": ["Q7441275", "Q7441276"]}, "date": "2013-07-08", "url": "http://www.granthamjournal.co.uk/news/local/cannabis-dealer-who-made-2-4k-through-crime-in-grantham-to-have-assets-of-60-seized-1-5261056", "content": "click here If you have not signed up previously It's free and only takes a minute! Arrange your newspaper/digital subscriptions online Grantham court: Attack was \"vicious and unprovoked' Grantham court: Grown men did not behave themselves Princess Diana tree bears fruit for the first time Classical guitarist <mark>John Williams</mark> to perform at Lincoln Cathedral before retirement VIDEO: Ropsley Fox crowned champions of Lincolnshire Bytham won cricket competition - but the beer was ruined! Grantham Journal Cartoon: Tony Hook King's School leavers run riot in Grantham, throwing paint, water bombs and firecrackers Highways chief tours battered roads of Barrowby Grantham Journal Letter:\" What has our MP done for you?' Man denies Costcutter robbery and possession of a machete A Grantham drug dealer given a suspended jail sentence has had assets of just? 60 confiscated following a hearing at Lincoln Crown Court. <mark>Craig White</mark> was given a 12-month sentence suspended for two years with 12 months' supervision when he was sentenced last year. This week, Judge <mark>Sean Morris</mark> ruled that <mark>White</mark> benefited from his crimes by? 2,400 but has only? 60 worth of available assets. He ruled that <mark>White</mark> should hand over the money or face a day in jail in default. An earlier hearing was told that <mark>White</mark> was found with over? 250 worth of cannabis when he was stopped and searched by police in Hornsby Road, Grantham. Phil Howes, prosecuting, said <mark>White</mark>'s phone was seized and later examined. He added: \"The phone is of significance. It appears he was being directed as to what to do and as to where to go although he did a little bit of street dealing as well .\" <mark>White</mark> was released and bailed but five months later was stopped again by officers as he cycled along Goodliff Road in the town. He ran away but discarded a plastic bag which was later found to contain cannabis worth? 400. Mr Howes said: \"We say he was a commercial supplier and played a significant role. Clearly he was a trusted lieutenant of others .\" <mark>Craig White</mark>, 28, of Clyde Court, pleaded guilty to possession of 40.58 g of cannabis with intent to supply on March 27, 2012. He also admitted possession of 25.48 g of the same drug with intent to supply on October 27, 2011. Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Get your favourite newspaper at a great low price. Call us on 0844? 292? 0216 or If you wish, you can contact us using any of the methods below. This website and its associated newspaper adheres to the Press Complaints Commission's Code of Practice. If you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the Editor by clicking here. If you remain dissatisfied with the response provided then you can contact the PCC by clicking here. Grantham Journal provides news, events and sport features from the Grantham area. For the best up to date information relating to Grantham and the surrounding areas visit us at Grantham Journal regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Google Ads? Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Webtrends / Google Analytics? This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers? This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore? ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting? Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot? We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online? Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This? Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend."}, {"articleID": "2010082422_00306001_W", "names": {"Steve O'Brien": ["Q16212485", "Q55196718"]}, "date": "2010-08-24", "url": "http://ca.news.yahoo.com/s/cbc/100823/canada/canada_toronto_ttc_cutomer_service_report978", "content": "toronto (cbc) - an external review looking into how to improve customer service at the toronto transit commission is calling for sweeping changes that it admits will not come cheap. renewed focus on customer service at the ttc is \"long overdue,\" the report released monday said. it issued 78 recommendations on how to improve the experience of the estimated 1.5 million riders who use the system daily, including changes in governance, like the appointment of a \"chief customer service officer\" and an internal customer service advisory group. the report notes, however, that the \"initiative will be costly to implement and maintain, and some recommendations may lead to changes in ttc policy. still, the result will be worth the considerable effort and investment of resources .\" the question, of course, is: where will the money come from? \"the report didn't provide estimates for how much the recommendations would cost. ttc vice-chair joe mihevc cautioned that some of the recommendations might not be adopted anytime soon .\" i think at this point today, we want to hear the recommendations and bring them inside the commission. doing a cost evaluation and that i think that's some homework that we will need to do, \"he said .\" so there are some things that i think you will see the ttc embrace, and embrace very quickly. other things require money and reorganization and a lot more thoughtfulness as to how to do them, and we will need to take some time to do that, \"said mihevc. the ttc commissioned the report in january after being peppered with complaints about service. it appointed a panel of 10 external experts headed by <mark>steve o'brien</mark>, general manager of one king west hotel & residence to draw up the report. the panel members, all volunteers, aren't receiving payment. some of the report's recommendations include: the report was originally supposed to be released june 30. it was delayed by what the ttc called the\" depth and volume of [the panel's] work, combined with their own professional commitments. \"the transit agency hit the news over the conduct of some of its frontline workers early this year, including a collector who was pictured snoozing while on the job. the ttc also had to deal with the fallout from this year's 25-cent fare hike and a shortage of tokens ahead of the price increase. in 2009, the ttc received 31,000 complaints between jan. 1 and nov. 30, a 15 per cent rise over 2008 .\" the customer service panel's work is an absolute start in a new direction for the ttc, \"said mihevc."}, {"articleID": "2010022008_00116313_W", "names": {"Aaron Rose": ["Q4662383", "Q56253752"], "Brian Butler": ["Q27656034", "Q4963235", "Q52829012", "Q54371158"]}, "date": "2010-02-20", "url": "http://coolhunting.com/culture/projections-fil.php", "content": "<mark>aaron rose</mark>'s five-week film series, \"projections,\" brings some of the more obscure and rarely-screened gems of the silver screen to l.a.'s roberts & tilton gallery starting this weekend. like his renowned beautiful losers exhibit and documentary, the fest's setting lends white-wall cred to the often ghettoized micro-length format. as <mark>rose</mark> explains, \"some of the most inspiring films iâ € ™ ve ever seen have been under five minutes long .\" while a majority come from lesser-known filmmakers, plenty of established art house directors, including spike jonze, harmony korine, jean luc godard and roman coppola, will show their flicks too. diarist cinema pioneer jonas mekas opens the festival with a special outdoor screening of his legendary \"walden: diaries, notes and sketches,\" a sprawling portrait of new york's 1968 avant-garde scene and his first feature length film. playing daily, the films run on a continuous basis for five weeks. notable films include <mark>brian butler</mark>'s \"night of pan,\" featuring kenneth anger and vincent gallo and \"thorn and toad\" by tobin yelland. <mark>rose</mark> also shows his own latest work, the short documentary \"become a microscope\" about sister corita, a catholic nun who created provocative art for over 20 years. style nice collective spring 2010: the gathering digital artist paints animated light graphics on models for fashion label nice collective's northern california camp-themed shoot tech htc legend and desire two new android phones featuring htc sense travel the shop at the standard new york the standard's meatpacking hotel launches a new store as stylish as the hotel itself style link about it: this week's picks opening ceremony's patchwork-bright tumi bags, olympic design, a blog devoted to letterpress and wood type, and more"}, {"articleID": "2017060311_00594066_W", "names": {"Peter Mann": ["Q55093391", "Q7175640"]}, "date": "2017-06-03", "url": "http://www2.tbo.com/ap/world/pop-star-ariana-grande-visits-fans-in-hospital-ap_world5bd32a40f584437ab20d67fdd22d7ebc", "content": "LONDON (AP)--Pop star Ariana Grande surprised young fans injured in the Manchester Arena attack, hugging the thrilled little girls in their hospital beds as they recovered from injuries sustained in the May 22 suicide bombing. The attack at Grande's concert last week killed 22 people and injured dozens of others, many of them teenagers. The singer returned to Britain on Friday ahead of a concert to benefit victims and their families. Grande shared an image of her visit to Royal Manchester Children's Hospital with her 107 million Instagram followers. The caption was simply a heart. Others touched by the visit posted pictures on social media, including a group shot with Grande among the nurses caring for the children hurt in the blast. <mark>Peter Mann</mark>, whose daughter Jaden was injured in the attack, posted several photos of Grande and the youngster on Facebook. \"So happy she came i could burst!,\" he wrote. \"Never seen jaden so happy! even cried again myself .\" Tasha Hough also shared photos of Jaden and Grande on social media. \"I think she's a little star struck. No1 deserves this more than her. That smile! And what a lovely girl Ariana Grande is .\" Grande will be joined by a number of pop stars for the One Love Manchester concert on Sunday, including Justin Bieber, Katy Perry, Coldplay, Take That and Miley Cyrus."}]