[{"articleID": "2017050515_00099368_W", "names": {"Abdul Sattar": ["Q17486434", "Q4409050", "Q59490492"]}, "date": "2017-05-05", "url": "http://www.wbrc.com/story/35351068/pakistan-afghan-border-cross-fire-kills-15-on-both-sides", "content": "Pakistan-Afghan border cross-fire kills 15 on both sides - WBRC FOX6 News - Birmingham, AL Pakistan-Afghan border cross-fire kills 15 on both sides - WBRC FOX6 News - Birmingham, AL Member Center: Pakistan-Afghan border cross-fire kills 15 on both sides 2017-05-05T15:11:25 Z2017-05-05T15:11:25 Z (AP Photo/Arshad Butt). A Pakistani victim of cross border firing rests at a hospital in Quetta, Pakistan, Friday, May 5, 2017. Afghan security forces backed by artillery fired without provocation on Pakistani census workers and soldiers escorting them...By <mark>ABDUL SATTAR</mark> and MUNIR AHMEDAssociated Press QUETTA, Pakistan (AP) - Backed by artillery, Afghan security forces fired across the border on Pakistani census workers and troops escorting them on Friday, killing nine and drawing a response from the military, Pakistan said. On the Afghan side, officials reported six killed in the incident, a significant escalation of hostilities between the two neighbors. Pakistani government and military officials said the artillery rounds that hit in the border town of Chaman in southwestern Baluchistan province were unprovoked but Afghan provincial officials claimed that the Pakistanis fired first. The incident was the latest escalation between the two neighbors who share a volatile and porous boundary. Pakistani army spokesman Maj. Gen. Asif Ghafoor said the army shut the border crossing in Chaman in response to the early morning attack, blocking all movement of people and supplies to its landlocked neighbor. Residents in the area said Pakistani and Afghan security personnel exchanged fire using light and heavy weapons. \"So far, we have received nine bodies. These civilians were killed as a result of the Afghan shelling,\" said Akhtar Mohammad, a doctor at the state-run hospital in Chaman. At least 42 people were reported wounded on the Pakistani side, including women and children, and Mohammad said some of the wounded were in critical condition. Prime Minister Nawaz Sharif issued a statement describing the Afghan firing as \"unfortunate\" and urged Kabul to put an end to cross-border attacks that threaten efforts to bring peace to Afghanistan. Pakistan's foreign ministry spokesman Nafeez Zakaria said the census workers were on their side of the border when Afghan forces opened fire. According to local residents, dozens of shells slammed into nearby villages, as well as close to the regional headquarters of Pakistan's paramilitary forces. Several of the wounded said their homes were destroyed in the exchange. Gen. Abdul Raziq, the police chief in Afghanistan's Kandahar province, blamed Pakistan for initiating the gunbattle. He accused Islamabad of using the census as a mask to conceal the crossing of militants from Pakistan into Afghanistan. Raziq said six people - four Afghan policemen and two civilians - were killed while another 37 were wounded by Pakistani forces' fire. Among the Afghan wounded were 23 civilians. \"Pakistani forces were trying to infiltrate Afghan territory but Afghan forces stopped them; that's when the fight started,\" said Raziq. In Islamabad, the foreign ministry said it had summoned Afghanistan's chargé d'affaires to complain about the firing. Pakistan and Afghanistan routinely accuse each other of providing sanctuaries to their enemy insurgents - something both sides deny. Despite several high-level visits by Pakistani intelligence and security officials to Afghanistan in recent weeks, relations between the two countries continue to deteriorate. Gen. Ghafoor also accused Afghan forces of creating obstacles for census workers in villages divided by the Pakistan-Afghanistan border. He did not elaborate on what those obstacles entailed. Later Friday, the Pakistani military said a hotline had been established between the two sides and that the cross-border shooting had stopped. Pakistani Maj. Gen. Sahir Shamshad Mirza asked the Afghan military to ensure its forces stay on their side and take every step to \"defuse the situation\" while the Pakistani military would \"work within our own border .\" Pakistan shares a 2,200-kilometer - (1,375 mile -) long porous border with Afghanistan. Pakistan currently hosts 1.5 million registered Afghan refugees and another 1 million unregistered. They routinely get caught in the middle when tensions between Pakistan and Afghanistan escalate. Pakistan started conducting a nationwide census in mid-March, with censor-takers going door-to-door to collect information. The census - the country's first since 1998 - has reignited a centuries-old border dispute between Pakistan and Afghanistan. The boundary, known as the Durand Line - named for Sir Henry Mortimer Durand, the former British diplomat who first established the border in 1896 - runs through vast ethnic Pashtun areas on both sides, in some places straight through villages. Any attempt to make the border a permanent one has been fiercely opposed by Afghanistan. The two countries routinely squabble over the disputed border line, incidents which at times escalate into armed conflict. In March this year former Afghan President Hamid Karzai again said that Afghanistan would never accept the Durand Line as an international border, stoking fears on the Pakistani side. ___ Ahmed reported from Islamabad. Associated Press writers Mirwais Khan in Quetta, Pakistan; Kathy Gannon in Multan, Pakistan; Zarar Khan in Islamabad and Amir Shah in Kabul, Afghanistan, contributed to this report. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2019011620_00201845_W", "names": {"Theresa May": ["Q264766", "Q30161835"], "James Smith": ["Q1027519", "Q10464386", "Q16534411", "Q16885746", "Q20738160", "Q2389622", "Q37615128", "Q3808437", "Q39395048", "Q39502042", "Q43911922", "Q52440", "Q54557216", "Q56724422", "Q57903671", "Q5925871", "Q6143308", "Q6143312", "Q6143324", "Q6143330", "Q6143331", "Q6143337", "Q6143352", "Q6201315"], "Joachim Lang": ["Q126071", "Q15433775", "Q15821061", "Q28260740"], "Sebastian Wood": ["Q4128233", "Q57033046"]}, "date": "2019-01-16", "url": "http://www.keyc.com/story/39797855/the-latest-uks-may-wins-vote-to-keep-job-brexit-chaos", "content": "The Latest: UK's <mark>May</mark> wins vote to keep job, Brexit chaos 11 hrs 7 mins ago Updated: LONDON (AP) - The Latest on Brexit (all times local): 7:20 p.m. British Prime Minister Theresa May's government has survived a no-confidence vote called after <mark>May</mark>'s Brexit deal was overwhelmingly rejected by lawmakers. The House of Commons expressed confidence in the government by 325 votes to 306, meaning <mark>May</mark> can remain in office. Had the government lost, Britain would have faced an election within weeks while preparing to leave the European Union on March 29. Despite the reprieve, <mark>May</mark> faces a monumental struggle to find a way out of her country's Brexit impasse. She has until Monday to come up with a new blueprint for Britain's EU exit after the deal she reached with the EU went down to a crushing defeat in Parliament on Tuesday. ___ 6:10 p.m. France's parliament has adopted a law allowing for emergency measures to deal with Britain's March 29 exit from the EU. The National Assembly voted Wednesday on the final reading of a special law drafted to handle a \"no-deal\" Brexit. The law includes things like extra customs officers after Brexit day, and a temporary rule allowing Britons employed in France to keep their jobs after March 29 even though they will no longer be EU citizens. European Affairs Minister Nathalie Loiseau called for calm, but stressed the importance of having a contingency plan. Supporters argued the French law was especially necessary after the British Parliament on Tuesday overwhelmingly rejected a divorce deal negotiated between the U.K. government and the EU. That deal had laid out ways to smooth over the transition. Without a deal, it's unclear how both sides will handle cross-border trade, finance and travel when Britain leaves. ___ 4:45 p.m.. A top French border police official says checks of the English Channel for illegal immigration won't change after Britain leaves the European Union on March 29. Franck Toulliou, the second-in-command of France's Air and Frontier Police, said French authorities will continue monitoring freight trucks that migrants try to hop in Calais before the vehicles enter the tunnel that leads to England. French maritime authorities are also cracking down on boats carrying migrants, which the area has seen a recent spike in. In an interview with The Associated Press on Wednesday Toulliou warned that Brexit will affect travelers with British passports seeking to enter France since they will no longer be EU residents. He spoke after British lawmakers rejected a divorce deal laying out rules for Britain's transition out of the EU. ___ 2: 30 p.m. French fishermen are expressing fear that seafood supplies would be hard-hit if Britain leaves the European Union without a deal on post-Brexit relations with the EU. Gerard Romiti, president of France's national committee for fisheries, said in a statement issued Wednesday: \"We are navigating through troubled waters .\" Fishermen from northwestern France heavily rely on access to British waters in the Atlantic Ocean, English Channel and North Sea, which now is granted and regulated by EU rules. The French committee urged European and French authorities to take \"all necessary actions\" to anticipate the potential impacts of a no-deal Brexit on fishing fleets and the sustainability of fisheries resources. ___ 1:30 p.m. British lawmakers have begun debating a motion of no-confidence in Prime Minister Theresa May's government. Opposition Labour Party leader Jeremy Corbyn called for a confidence vote after the House of Commons overwhelmingly rejected <mark>May</mark>'s Brexit deal with the European Union. Opening the debate, Corbyn said the defeat was the biggest in British history and called on the government to \"do the right thing and resign .\" He said that \"if a government cannot get its legislation through Parliament, it must go to the country for a new mandate .\" <mark>May</mark> has refused to resign, and is likely to win Wednesday's vote with backing from her Conservative Party and its Democratic Unionist Party allies. If she loses, the country likely faces a snap general election. ___ 12:40 p.m. Irish leader Leo Varadkar says that it is now up to the British government to come up with alternatives to avoid an exit from the European Union without an agreement. Varadkar says that if Prime Minister Theresa May's government is willing to shift some of its so-called red lines in negotiations, then the position of negotiators in the EU would also change. The Irish prime minister says that \"the onus is on Westminster\" to come up with solutions. Varadkar says \"we've always said that if the United Kingdom were to evolve its red lines on the customs union and the single market, that the European position would evolve also .\" EU negotiator Michel Barnier also said Wednesday that if <mark>May</mark> shifts the red lines they will open the political declaration on future relations. ___ 11:35 a.m. Finnish Prime Minister Juha Sipila is urging all British citizens living the Nordic country to immediately register at Finland's immigration service to make sure they receive a living permit in case of no-deal Brexit. Sipila told Finnish news agency STT Wednesday that the temporary permit will be issued so that the 5,000 Britons currently living in the country of 5.5 million can continue their stay if Britain exits the European Union without a deal. He said the likelihood of a no-deal Brexit has increased as a result of the British parliament's decision to reject Prime Minister Theresa May's Brexit deal Tuesday. The Finnish government's social benefits office Kela said there <mark>may</mark> be major changes to what social benefits British citizens in Finland <mark>may</mark> be entitled to in case of a Brexit without an agreement, but did not provide details. ___ 11:10 a.m. French wine and spirits makers are warning that Britain crashing out of the European Union without a deal could hurt trade. A day after British Prime Minister Theresa May suffered an overwhelming defeat over her Brexit deal, the federation of French wine and spirits exporters said Tuesday that \"the specter of a\" no deal' could have serious consequences for the economy and the citizens of both parties. \"According to the federation, called FEVS, Britain is France's second-biggest destination for exports of spirits and wine and France imports a large quantity of British spirits. FEVS President Antoine Leccia said:\" This vote is prejudicial to the historical and fruitful commercial relationship between our countries. \"___ 11 a.m.. A top official at the French presidency said Europeans would make no concessions on Brexit that would damage the European Union's core principles, including the integrity of the single market. The French official said that any request by Britain to seek an extension to the Brexit timetable would need to come with a new plan and a strategy from the British government. The official was speaking anonymously in line with the French presidency's customary practice. He added that\" nobody believes \"the European Union would now be\" weak and febrile. \"\"And I don't think <mark>Theresa May</mark> believes it\" , he added. The French parliament votes on Wednesday afternoon to adopt preparatory measures to get the country ready in case of no deal. - By Sylvie Corbet ___ 10:50 a.m. Russia's foreign minister says Moscow isn't taking any sides in the controversy over Britain's exit from the European Union. Sergey Lavrov was speaking Wednesday at a news conference a day after the British parliament overwhelmingly rejected British Prime Minister Theresa May's Brexit deal. He rejected allegations that Russia was gloating in the turmoil, saying that Russia is interested in seeing a \"united, strong and, most importantly, independent European Union .\" Lavrov reaffirmed that Russia would stand ready to develop ties with Britain and the EU irrespective of the outcome of talks on British departure from the EU. ___ 10:10 a.m. German Chancellor Angela Merkel says there's still time for negotiations between the European Union and Britain over its departure from the bloc. Merkel says that she regretted the decision by British lawmakers to oppose the agreement negotiated by British Prime Minister Theresa May and the EU. Merkel told reporters in Berlin that \"we will of course do everything to find an orderly solution, but we are also prepared if there is no orderly solution .\" Merkel said \"we still have time to negotiate, but we are now waiting to see what the British prime minister proposes .\" ___ 9:45 a.m. Bank of England Governor Mark Carney says financial markets appear to have taken a fairly benign view of the big defeat of Prime Minister Theresa May's Brexit deal and seem to believe Brexit <mark>may</mark> be delayed. Addressing lawmakers on the Treasury Select Committee, Carney said Wednesday that the market reaction since Tuesday evening's vote indicates that investors think the \"prospect of no deal <mark>may</mark> have diminished .\" Carney made clear that wasn't necessarily his view and that he wouldn't put too much stock on short-term movements in financial markets. But he also said the move higher in the pound could be an indication that investors think the date when Britain leaves the European Union will be extended. He said the market interpretation of <mark>May</mark>'s 230-vote defeat reflects \"some expectation the process of resolution would be extended .\" At present the country is due to leave on March 29 but the government could ask the EU to extend that date. On Wednesday, the pound was up 0.2 percent at $1.2888. ___ 9:35 a.m. Germany's foreign minister says \"the time for little games is now over\" on Brexit because the clock is ticking to avert a hard rupture between the U.K. and the European Union. Heiko Maas suggested British lawmakers who voted against the deal negotiated by Prime Minister Theresa May should recognize the importance of the issue, adding that \"we need a solution, and we need it quickly .\" Maas told Deutschlandfunk radio that British lawmakers in London so far had only shown \"what they don't want, and that's not enough .\" He dismissed the notion that <mark>May</mark> might get a substantially better deal if she goes back to Brussels, saying \"if there was anything else one could have offered Britain it would have had to have been done in the last weeks .\" Maas wouldn't rule out extending the March 29 deadline for Brexit, but noted that \"this won't really be easy, because we have the European elections in <mark>May</mark>.\" ___ 9:15 a.m. U.K. financial markets have taken the overwhelming defeat of Prime Minister Theresa May's Brexit deal in stride. The pound was up 0.1 percent at $1.2869 in early morning trading, while the FTSE 100 index of leading British shares was down 0.1 percent at 6,888. Though uncertainty surrounding Britain's exit from the European Union remains elevated, many in the markets think <mark>May</mark>'s defeat by lawmakers Tuesday evening makes it less likely the country will crash out of the bloc on March 29 with no deal. <mark>James Smith</mark>, an economist at ING, says the \"calm market response\" suggests investors think at the very least that the government will end up having to seek an extension to the Brexit timetable. Traders will remain focused on developments in Parliament later, where lawmakers will vote on whether they have confidence in the government. ___ 9:10 a.m.. The head of an influential German business lobby group says the U.K. Parliament's vote against the Brexit deal with the European Union shows \"hysteria has won .\" <mark>Joachim Lang</mark>, chief executive of the Federation of German Industries, says that lawmakers' rejection of the deal is \"dramatic\" and \"the chance to find a way out of this chaos has been passed up for now .\" The group, known by its German acronym BDI, warned that Britain is getting closer to a disorderly departure from the EU and \"the responsibility for avoiding this lies solely with the government and opposition in London .\" The BDI said trade in goods and services between Germany and Britain amounts to about 175 billion euros ($200 billion) a year. It said \"any uncertainty would endanger tens of thousands of companies and hundreds of thousands of jobs in Germany and especially in the United Kingdom .\" ___ 9 a.m. Britain's envoy to Germany says the European Union might help avert a \"no-deal\" Brexit if it's prepared to shift its position on the terms of future border controls with Ireland. Britain's ambassador in Berlin, <mark>Sebastian Wood</mark>, says that the current \"backstop\" solution is opposed both by U.K. lawmakers who want the country to leave the EU, and those who don't. In an interview with German public broadcaster ARD, <mark>Wood</mark> noted that Britain wouldn't have the right to get out of the backstop unilaterally \"and many have noticed this .\" He said \"this might be the most important question in the coming days and weeks, and the EU can perhaps be a little helpful in that area .\" ___ 8:50 a.m. British Prime Minister Theresa May faces a no-confidence vote a day after Parliament rejected her Brexit deal by an historic margin. <mark>May</mark> is battling to save her job after staking her political reputation on a last-ditch effort to win support for the divorce agreement she negotiated with the European Union. Though defeat was widely expected, the scale of the rout - 432-202 - was devastating for <mark>May</mark>'s leadership. Immediately after the vote, Labour leader Jeremy Corbyn tabled a no-confidence motion, saying it will give Parliament a chance to give its verdict \"on the sheer incompetence of this government .\" Still, most analysts predict <mark>May</mark> will survive because her Conservative Party and the Democratic Unionist Party, which supports it, are expected to vote against the motion. ___ 8:15 a.m. European Union Brexit negotiator Michel Barnier says the bloc is stepping up preparations for a chaotic no-deal departure of Britain from the bloc after the rejection of the draft withdrawal deal in London left the EU \"fearing more than ever that there is a risk\" of a cliff-edge departure. Barnier regretted Westminster's massive rejection of the deal he negotiated with the government of British Prime Minister Theresa May and said that any future deal would still have to include approving the withdrawal agreement. He said Wednesday that \"whatever happens, ratification of the withdrawal agreement is necessary. It is a precondition .\" He said that a linked political declaration offered \"possible options\" for further talks. Copyright 2019 The Associated Press. All rights reserved. This material <mark>may</mark> not be published, broadcast, rewritten or redistributed."}, {"articleID": "2012091822_00033186_W", "names": {"Kevin Wilson": ["Q19665226", "Q55362441", "Q57440043", "Q6397778", "Q6397779", "Q6397780"], "Michael Turner": ["Q1372347", "Q1372443", "Q15969753", "Q1929622", "Q2083939", "Q20853582", "Q43210688", "Q562007", "Q6834989", "Q6834993", "Q6834994", "Q6834995"], "Joe Frazier": ["Q102301", "Q6209921"]}, "date": "2012-09-18", "url": "http://ktvn.com/story/19577223/escobar-suspended-3-games-for-slur-on-eye-black", "content": "a.j. allmendinger has been reinstated by nascar after completing its \"road to recovery\" program. the first phase of his comeback complete, an optimistic aj allmendinger is ready to get on with his life. meta itemprop = \"datepublished\" content = \"2012-09-18 22:12:22\" > jeremy lin begins workouts with rockets jeremy lin begins workouts with rockets jeremy lin is finally getting his own bed. jeremy lin is finally getting his own bed. meta itemprop = \"datepublished\" content = \"2012-09-18 21:52:23\" > where have all the passing yards gone in big ten? where have all the passing yards gone in big ten? indiana coach <mark>kevin wilson</mark> knows stats can be misleading. indiana coach <mark>kevin wilson</mark> knows stats can be misleading. by ralph d. russo ap college football writer they say no team is unbeatable. they apparently haven't seen alabama play recently. by ralph d. russo ap college football writer they say no team is unbeatable. they apparently haven't seen alabama play recently. meta itemprop = \"datepublished\" content = \"2012-09-18 17:42:08\" > nfl films president steve sabol dies at 69 nfl films president steve sabol dies at 69 nfl films president steve sabol has died from brain cancer. he was 69. with the eye of an art history major, steve sabol filmed the nfl as a ballet and blockbuster movie all in one. meta itemprop = \"datepublished\" content = \"2012-09-18 21:42:27\" > 2 big weeks in golf, 2 different prizes 2 big weeks in golf, 2 different prizes two big weeks in golf could not be more different. two big weeks in golf could not be more different. meta itemprop = \"datepublished\" content = \"2012-09-18 21:32:19\" > escobar suspended 3 games for slur on eye-black escobar suspended 3 games for slur on eye-black toronto shortstop yunel escobar was suspended for three games tuesday by the blue jays for wearing eye-black displaying a homophobic slur written in spanish during a game last weekend against boston. toronto shortstop yunel escobar was suspended for three games tuesday by the blue jays for wearing eye-black displaying a homophobic slur written in spanish during a game last weekend against boston. meta itemprop = \"datepublished\" content = \"2012-09-18 21:32:19\" > qb vince young out of the game and out of money qb vince young out of the game and out of money six years after entering the nfl as the third player taken in the draft, vince young finds himself without a team and with just a fraction of the money he received from a contract that guaranteed him $26 million. six years after entering the nfl as the third player taken in the draft, vince young finds himself without a team and with just a fraction of the money he received from a contract that guaranteed him $26 million. meta itemprop = \"datepublished\" content = \"2012-09-18 13:31:55\" > atlanta falcons rb <mark>michael turner</mark> arrested for dui atlanta falcons running back <mark>michael turner</mark> was jailed on charges of drunken driving and speeding, just hours after he scored a touchdown in the team's win over the broncos. atlanta falcons running back <mark>michael turner</mark> was jailed on charges of drunken driving and speeding early tuesday, just hours after he scored a touchdown in the team's win over the denver broncos. meta itemprop = \"datepublished\" content = \"2012-09-18 21:12:20\" > the associated press pro32 nfl power rankings, as voted by a 12-member panel, with first-place votes in parentheses, records through sept. 17, total points based on 32 points for a first-place vote through one point...college football's top coach does it different nhl, union have contact, but no talks scheduled with lockout looming, nhl and union get back in touch but no new negotiations scheduled retired: uconn basketball coach jim calhoun quits philly mayor kicks off campaign for <mark>frazier</mark> statue philadelphia mayor kicks off campaign for statue honoring hometown boxer smokin' <mark>joe frazier</mark> ap baseball writer new york (ap) - toronto shortstop yunel escobar was suspended for three games tuesday by the blue jays for wearing eye-black displaying a homophobic slur written in spanish during a game last weekend against boston. escobar apologized \"to all those who have been offended\" for what he said was meant to be \"just a joke .\" \"it was not something i intended to be offensive,\" he said through a translator. \"it was not anything intended to be directed at anyone in particular .\" the suspension - issued after input from commissioner bud selig, the players' union and team management - was to have started tuesday night at yankee stadium. the game between toronto and new york was rained out. as part of his penalty, escobar's lost salary during the ban - about $82,000 - will be directed to two advocacy groups, the gay & lesbian alliance against defamation and you can play. escobar will also take part in an outreach initiative to promote tolerance to others based on their sexual orientation, and participate in a sensitivity training program. pictures posted online showed the 29-year-old cuban infielder with the message written in his eye-black, a sticker players wear under their eyes to reduce sun glare, during saturday's home game against boston. major league baseball regulations prohibit derogatory words and symbols on uniforms. writing something of that nature on eye-black would fall under that category, mlb spokesman pat courtney said. \"mr. escobar has admitted that his actions were a mistake and i am hopeful he can use this unfortunate situation as an opportunity to educate himself and others that intolerance has no place in our game or society,\" selig said in a statement. glaad president herndon graddick commended the decision. \"today's actions show that mlb and the toronto blue jays are committed to creating an environment that all fans and families can enjoy, not a place where discriminatory language and anti-gay attitudes are accepted,\" graddick said in a statement. in may 2011, mlb suspended atlanta pitching coach roger mcdowell for two weeks without pay for inappropriate comments and gestures with homophobic and sexual overtones he made toward fans before a game in san francisco. meta itemprop = \"datepublished\" content = \"2012-09-17 00:29:14\" > surprise discovery made at home of nv recluse despite having $200 in his bank account when he died, officials discovered walter samaszko jr.'s house had gold bars and coins valued at least $7 million. despite having $200 in his bank account when he died, officials discovered walter samaszko jr.'s house had gold bars and coins valued at least $7 million. meta itemprop = \"datepublished\" content = \"2012-09-16 16:37:25\" > nhp: head-on collision kills three in douglas county troopers say it happened saturday around 11:45 p.m. on u.s. 395 in the holbrook junction area. troopers say it happened saturday around 11:45 p.m. on u.s. 395 in the holbrook junction area. meta itemprop = \"datepublished\" content = \"2012-09-17 23:10:20\" > expansion continues at legends at sparks marina construction projects continue, with new stores expected to open soon at legends at the sparks marina. construction projects continue, with new stores expected to open soon at legends at the sparks marina. meta itemprop = \"datepublished\" content = \"2012-09-16 16:54:53\" > one killed in single-vehicle accident in douglas county troopers say the accident happened sunday around 4:30 a.m. on u.s. 395 near lucerne street in the minden area. troopers say the accident happened sunday around 4:30 a.m. on u.s. 395 near lucerne street in the minden area. meta itemprop = \"datepublished\" content = \"2012-09-18 00:24:37\" > police seek man who exposed himself to young girls reno police are asking for your help finding a man they believe has exposed himself to young girls in two separate incidents in the last three weeks. ktvn-tv phone: (775) 858-2222 fax: (775) 861-4298"}, {"articleID": "2011040802_00071333_W", "names": {"David Ortiz": ["Q19402485", "Q28815032", "Q38332228", "Q448005", "Q54541573"], "Carl Crawford": ["Q1037431", "Q26273593"], "Darnell Mcdonald": ["Q3016418", "Q5224127"], "Chris Perez": ["Q21063605", "Q2964837", "Q5107817"]}, "date": "2011-04-08", "url": "http://cbs42.com/sports/story/From-favorites-to-flops-Red-Sox-come-home-at-0-6/9FCehzR-SkOQOBeXSqXBIg.cspx", "content": "boston (ap) - the deliveryman unloaded cases of beer from his truck just outside fenway park. a worker cleared the dust and litter just inside gate d with a high-powered vacuum. the historic home of the boston red sox was just about ready for its 100th opener on friday. the team needs plenty of work. the high-priced red sox were a popular pick to win the world series. so far they've lost every game, six in a row, their worst start in 66 years. the team batting average is .181. the era is 7.13. but even with the rival new york yankees coming in for a three-game series, signs of panic seem as rare as a red sox rally. \"we're going to score a lot of runs,\" said jon lester (notes), who pitched seven shutout innings in thursday's 1-0 loss to the cleveland indians. \"it's just a matter of time .\" back home, fans, usually quick to ask \"what haven't you done for me lately?\" were surprisingly calm in their calls to all-talk radio shows. brandon in allston: \"i don't think the red sox are done .\" but another caller said the team seemed to lack focus and a third questioned manager terry francona's toughness. francona was loose before thursday's game and matter of fact afterward. that was a sharp contrast to st. louis manager tony larussa, who went on a postgame rant after wednesday's 3-1 loss to pittsburgh when asked about the cardinals' offseason effort to improve its lineup-an effort that, so far, has failed. for the red sox, the pressure is building to get that first win, especially with saturday's and sunday's games against the yankees on national television. but they'll have the advantage of playing before their own fans, a full house that is sure to cheer loudly during pre-game introductions. their reaction might be different if starter john lackey (notes) struggles. \"there's not two red sox teams. there's only one,\" designated hitter <mark>david ortiz</mark> (notes) said. \"you gotta cheer for this one if you are a red sox fan, right?\" history works both ways. sure, the red sox haven't been 0-6 since 1945. but in francona's eight seasons as their manager, they've had a winning record after six games just once and still won two world series. in 2009, they had two six-game losing streaks and reached the playoffs. besides, the red sox are only 4 1/2 games out of first place in the al east with 156 games left. and they picked up two of baseball's top position players in the offseason, first baseman adrian gonzalez (notes) and left fielder <mark>carl crawford</mark> (notes). gonzalez has been the lone bright spot in the batting order with a .350 average, one homer and five rbis. only two other players-ortiz and dustin pedroia (notes) - are batting above .250, and the red sox have been outscored 38-16 in sweeps at texas and cleveland. but with a 10-game homestand, they're optimistic they can turn that around. \"we've got great fans on our side,\" said youkilis, who is batting .133 with one rbi and two hits in 15 at-bats. \"we thrive on them and they thrive on us .? we've got a good team. we've just got to get out of this little funk we're in .\" we're frustrated as hell because we never thought we'd be here, but we are here, so you've got to deal with it. \"the yankees enter the series with a 4-2 record. but they know that one week, no matter how well or poorly a team plays, hardly indicates how it will finish the season .\" who cares if they're 0-6 or 6-0? \"new york reliever joba chamberlain (notes) said .\" they're still a talented ballclub. and we know that. we're not looking at their record. we're looking at the talent they're putting on the field that we're going to have to face. we're not playing their record. we're playing their team. \"derek jeter (notes) put it more simply:\" i think a lot of times people pay too much attention to the first week of the season. \"still, that week has been filled with poor hitting and starting pitching, fielding and running gaffes and relievers who can't find the plate. in wednesday's 8-4 loss to the indians, dennys reyes (notes) came out of the bullpen and threw 12 pitches, 11 of them balls and two that hit batters. dan wheeler (notes) relieved him with the bases loaded and got michael brantley (notes) to line to third baseman youkilis, who dropped the ball. youkilis stepped on third for the forceout then threw to catcher jason varitek (notes), who assumed the force was still in effect and stepped on the plate but didn't tag travis buck (notes), who scored .\" it was totally my fault, \"the red sox captain and 15-year veteran said. on thursday, <mark>darnell mcdonald</mark> (notes) pinch ran after <mark>ortiz</mark> walked with two outs in the ninth and cleveland leading 1-0. j.d. drew (notes) then hit the ball off pitcher <mark>chris perez</mark>'s (notes) leg for a single. but third baseman adam everett (notes) fielded it and, when <mark>mcdonald</mark> rounded second and slipped trying to get back, threw there for the final out .\" we've got to put ourselves in a better position that when somebody does slip, it doesn't cost us the chance for a game, \"francona said. the miserable start is disappointing to francona, but it hasn't wiped out his sense of humor. on thursday morning, when the red sox were still 0-5, he was asked if the team can feed off the fenway crowd's energy .\" i had 12 pieces of bacon this morning, \"he said .\" i'm going to feed off that. \"now they're 0-6-two pieces for every loss .\" this, \"francona said,\" hasn't been a real kind road trip. \"you can send a story to multiple email addresses by separating the email addresses with a semicolon (;)"}, {"articleID": "2011082210_00085426_W", "names": {"Paul Lambert": ["Q246724", "Q42306921", "Q47511367", "Q52134533", "Q7151926", "Q7151928", "Q7151929", "Q7151930"]}, "date": "2011-08-22", "url": "http://pinkun.com/barnett_red_card_cost_us_dear_says_lambert_1_1001032", "content": "<mark>paul lambert</mark> consoles leon barnett after his red card against stoke city. picture: paul chesterton / focus images paddy davitt monday, august 22, 2011 11:26 am to send a link to this page to a friend, simply enter their email address below. the message will include the name and email address you gave us when you signed up. to send a link to this page to a friend, you must be logged in. the norwich city boss insisted that jon walters' tumble under leon barnett's challenge just past the hour mark originated well outside the canaries' penalty area. john ruddy beat away the former ipswich captain's spot kick but barnett's straight red left <mark>lambert</mark>'s side undermanned when kenwyne jones rose highest to connect with glenn whelan's cross deep into stoppage time. \"it was at least three yards outside,\" said <mark>lambert</mark>. \"it was never a penalty in a million years. how he gave that - his positioning was so far behind it. the assistant seemed to give it .\" i've seen it since and it changed the game. it was a big, big decision and a major turning point. we looked comfortable with how we had started the game. \"it was bad enough getting himself sent off, but the actual contact, the initial contact, was outside. i think anywhere on the pitch it would be a free kick but it's a double hit with the penalty and the red card .\" it pushes you on the back foot against 11 men and you are up against a really good side, but the effort was excellent. he was the last man so he had to go. i think with 11 men we would have seen it through. i thought leon's general game was excellent but the contact was outside the box. when you go down to 10 men at this level it becomes really tough. \"<mark>lambert</mark> remained upbeat afterwards despite the late heartache .\" for us the disappointment is there not to have won the game, but i'm not too despondent about it because there was a big, big effort from everybody, \"he said .\" for the first home game i thought we played really well. i think we showed we could adapt. stoke are a really good side, who are difficult to play against. they got a terrific point against chelsea and then had a hard game in europe and got a great result there so we were under no illusions coming into this game. \"commitment-wise and effort-wise we gave as good we got. i can't ask for any more with how they played the game. i was delighted with a lot of aspects. it's a testament to our lads that we continued to hang in, even when we are on the back foot .\" <mark>lambert</mark> believes his men have already proved they are fast learners in the premier league after a brace of battling displays during the opening week of the new campaign. \"we've only played two games so lets not get carried away,\" he said. \"we'll certainly try everything we can to win football matches and that is what we'll try to do. i'm happy with how we have adapted so far. it's new to us and two years ago we were in league one\" that is the magnitude of it. it might take us time to adapt to certain things but we're in here on merit. it's not as if we're here by default. we have to have a level of performance that is very high. if you ask stoke, then we gave them a fright. \"ritchie de laet glanced home bradley johnson's inviting cross in a vibrant first half with fellow close season arrival anthony pilkington underlining his class in a wide left role .\" pilks was very good. he is coming back from a long term injury and i thought he played well, \"said <mark>lambert</mark>.\" he (de laet) was excellent i thought, just his all round game. he scored the goal and it just shows you how important set pieces are in the game. if you can defend them and score at the other end you'll do okay. audio optional - mp3 files only not a member yet? register to create your own unique pink un - norwich city football club news account for free."}, {"articleID": "2018111306_00524842_W", "names": {"Jared Smith": ["Q14918430", "Q17042774", "Q55169623"]}, "date": "2018-11-13", "url": "http://www.mariettatimes.com/news/2018/11/veterans-march/", "content": "Veterans march Reporter jpatterson @ mariettatimes.com JANELLE PATTERSON The Marietta Times Members of the Marietta Fire Department lead the Veterans Day Parade down Putnam Street Monday with flags raised for the country, prisoners of war and those missing in action. JANELLE PATTERSON The Marietta Times Liberty <mark>Smith</mark>, 5, right, hands out artificial poppies during the Veterans Day Parade in Marietta Monday in remembrance of those who have served in the U.S. military. JANELLE PATTERSON The Marietta Times Marietta High School's color guard moves in sync Monday during the Veterans Day Parade in Marietta Monday. JANELLE PATTERSON The Marietta Times Liberty <mark>Smith</mark>, 5, right, hands out artificial poppies during the Veterans Day Parade in Marietta Monday in remembrance of those who have served in the U.S. military. Attendees of the Veterans Day Parade in Marietta, weren't looking for candy when they lined Putnam Street Monday. \"We talked on the way over about how we're here to say thank you,\" said Nancy Morehead, 59, of Boaz, as she shepherded her grandchildren, husband, sister and daughter across the street prior to the parade. \"These children are privileged that they don't have any immediate family who has served in a war, but they do have a heritage of relatives who have. And we talked about how those sacrifices aren't to be taken lightly and they should be proud of their heritage .\" Morehead's grandson, Willem Nuhfer, 9, of Boaz, explained that he had learned in school about veterans and what the annual recognition day means. \"We're free and safe because they fought for us,\" he said as he waved an American flag in the chilly wind Monday. Nuhfer, and his cousins Jesse Morris, 9, and Justus Morris, 6, shouted thank you throughout the parade to the passing veterans and danced to the patriotic songs played by Marietta High School's marching band. JANELLE PATTERSON The Marietta Times Members of the Marietta Fire Department lead the Veterans Day Parade down Putnam Street Monday with flags raised for the country, prisoners of war and those missing in action. The three were even excited to receive an artificial poppy from Liberty <mark>Smith</mark>, 5, who walked in the parade with her father, Washington County Veteran Service Commissioner <mark>Jared Smith</mark>. \"Liberty told me when it was all finished today that it was the best day ever, and she stuck with me not only for the parade but also for the luncheon at the Masonic Temple afterward,\" explained <mark>Smith</mark>. \"She said she was stopped by a World War II veteran and he thanked her for helping him with his dishes and that made her feel so good .\" <mark>Smith</mark> said he let his daughter walk in the parade to help instill a sense of community service. \"I was passing out poppies to honor veterans,\" explained Liberty. \"My dad was a veteran and I like him so much .\" The poppy, since the First World War, has been used as a symbol of remembrance of war veterans lost, and for the welfare of those still remaining after conflict. JANELLE PATTERSON The Marietta Times Marietta High School's color guard moves in sync Monday during the Veterans Day Parade in Marietta Monday. Korean War Veteran Bob Baumgarner, of Marietta, said he was thankful he could watch the parade. \"I didn't walk, but I liked to see it,\" he said. \"It's a good day to remember the sacrifices of all veterans .\" Baumgarner waved not only to the veterans of World War II, Vietnam and more recent conflicts, but also representatives from the Washington County Veteran Service Commission, the Order of the Purple Heart, Marietta College and the Marietta Shrine Club, all of whom marched in the parade. Volunteer fire departments also followed the patriotic tunes resounding from Marietta High School's marching band, Wall of Sound, led by the high school's color guard and followed by Troop 207 of the Boy Scouts of America."}, {"articleID": "2015110122_00085169_W", "names": {"Peter Knudsen": ["Q16633153", "Q27893614", "Q3900875"]}, "date": "2015-11-01", "url": "http://greenevillesun.com/news/ap_national_news/search-on-for-black-box-in-wreckage-believed-to-be/article_8ed25d88-5f64-5e0e-9551-b31a143fb452.html", "content": "MIAMI (AP)--Sonar indicates that the wreckage believed to be the cargo ship El Faro landed upright on the ocean floor, which may aid efforts to recover the ship's voyage data recorder, a National Transportation Safety Board spokesman said Sunday. \"The ship will certainly not be recovered; the ship is going to stay there. The containers are too deep to do any kind of recovery mission,\" said <mark>Peter Knudsen</mark>, NTSB spokesman. \"If human remains are encountered, an attempt would be made to recover them .\" Subscription Required An online service is needed to view this article in its entirety. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Already a Print Subscriber? Login Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Need an account? Create one now. Choose an online service. 1 Online Subscription Current print subscribers 1 Current Subscriber Access 6-days per week, print subscribers may click this option to gain access to the e-edition. Already a Print Subscriber? None of these apply to you? Back Need an account? Create one now. You must login to view the full content on this page. Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Need an account? Create one now. kAmx? G6DE:82E @ CD 2C6 DE: = = 2H2: E:? 8 G:56 @ 4 @? 7: C> 2E: @? E92E E96 HC64 <286 7 @ F? 5 $2EFC52J:? \"d [___ 766E @ 7 H2E6C 62DE @ 7 E96 q292> 2D: D E96 t = u2C @ [H9:49 H6? E>: DD:? 8 ~ 4E]\" 5FC:? 8 wFCC:42? 6 y @ 2BF:?] p = = bb 4C6H> 6> 36CD @? 3 @ 2C5 H6C6 = @ DE] k ^ Am kAmQ (92E E96J 56E64E65 H: E9 D @? 2C H2D 23 @ FE E96 D: K6 2? 5 D92A6 @ 7 E96 t = u2C @ [Q z? F5D6? D2:5 3J E6=6A9 @? 6 H: E9% 96 pDD @ 4:2E65! C6DD] k ^ Am kAm ~? 46 E92E: D 4 @? 7: C> 65 [2 C6> @ E6 = J @ A6C2E65 [566A @ 462? G69:4 = 6 42 = = 65 r & #' \\ a \"H: = = FD6: ED G:56 @ 42> 6C2 E @ 5 @ 4F> 6? E E96 HC64 <286 2? 5 563C: D 7:6 = 5 [2D H6 = = 2D 2EE6> AE E @ = @ 42E6 2? 5 C64 @ G6C E96 52E2 C64 @ C56C--E96 D9: AVD Q3 = 24 <3 @ I] Q% 92E C64 @ C56C H @ F=5 92G6 42AEFC65 E96 4C6HVD 4 @? G6CD2E: @? D @? E96 3C:586 2D H6 = = 2D:? 7 @ C> 2E: @? 23 @ FE E96 D9: AVD 6BF: A> 6? E [:? 4 = F5:? 8 6? 8:? 6 A6C7 @ C> 2? 46 2? 5 CF556C> @ G6> 6? ED] k ^ Am kAm% 96 C64 @ C56C H @ F=5 36 @? 564 <? 62C E96 fh_\\7 @ @ E D9: AVD H966=9 @ FD6 2C62 [2? 5: ED C64 @ G6CJ H @ F=5 36> @ C6 492 = = 6? 8:? 8:7 E96 D9: A 925 = 2? 565 FAD:56 5 @ H? [z? F5D6? D2:5] k ^ Am kAmQ (6 5 @ <? @ H E96 D9: A [7C @> E96 D @? 2C\\86? 6C2E65:> 286D [5 @ 6D 2AA62C E @ 36 FAC:89 E [D @ E92EVD 6? 4 @ FC28:? 8 [Q 96 D2:5] k ^ Am kAm% 96 C64 @ G6CJ @ A6C2E: @? D 4 @ F=5 E2 <6 FA E @\" d 52JD [56A6? 5:? 8 @? H62E96C 2? 5 D62 4 @? 5: E: @? D] k^Am kAm% 96 r & #' \\ a \": D 56D:8? 65 E @ H @ C <FA E @ 2> 2I:> F> 56AE9 @ 7 a _ [___ 766E @ 7 D62H2E6C [244 @ C5:? 8 E @ E96} 2GJ]% 96 t = u2C @ H2D C6A @ CE65>: DD:? 8 62DE @ 7 E96 q292> 2D [2? 5: E 2AA2C6? E = J 42> 6 E @ C6DE 2E 2 56AE9 8C62E6C E92? E96 7:? 2 = C6DE:? 8 A = 246 @ 7 E96%: E2?:4 [H9:49 =:6 D @ G6C\" a [d __ 766E 5 @ H?:? E96? @ CE9 pE = 2? E:4] k ^ Am kAmQxEVD G6CJ [G6CJ 492 = = 6? 8:? 8 2E E9 @ D6 56AE9D] x> 28:? 6 @ A6C2E:? 8 D @> 6E9:? 8 F? 56C 23 @ FE EH @ \\2? 5\\2\\92=7>: = 6D @ 7 H2E6C H: E9 F? 56CH2E6C 4FCC6? ED 2? 5 E @ E2= 52C <? 6DD]% 96? J @ F 92G6 E96 H62E96C 2E E96 DFC7246 E @ 244 @ F? E 7 @ C [Q D2:5 y:> $E2A = 6D [2 D9: A 42AE2:? 2? 5> 2C: E:> 6 4 @? DF=E2? E 32D65:?} @ CH6 = = [| 2DD249FD6EED] k ^ Am kAmx? G6DE:82E @ CD H: = = 36 = @ @ <:? 8 7 @ C 2? J D:8?:7:42? E D:8? D @ 7 52> 286 @ C G: D:3 = 6 4 = F6D 2D E @ H96E96C E96 4C6H 925 E:> 6 56A= @ J =:76 C27ED [96 D2:5] k ^ Am kAmQ% 96C6> 2J 36 2 E6 = = E2 = 6 D:8? =: <6 96C 324 <: D 3C @ <6? @ C E92E D96VD DA =: E:? 92 = 7 2? 5 E92E 42FD65 2 BF:4 <D:? <:? 8 [Q $E2A = 6D D2:5] k ^ Am kAm% 96 t = u2C @ VD 42AE2:? 42 = = 65:? 367 @ C6 E96 G6DD6 = 5: D2AA62C65 [D2J:? 8 E96 D9: A 925 = @ DE: ED 6? 8:? 6 A @ H6C 5FC:? 8: ED G @ J286 7C @> y24 <D @? G: ==6 [u= @ C:52 [E @ $2? yF2? [! F6CE @ #:4 @]% 96 42AE2:? [|:4926 = s2G:5D @? [D2:5 E96 D9: A H2D =: DE:? 8 [2? 5 E2 <:? 8 @? H2E6C] k ^ Am kAmp? 6IE6? D: G6 r @ 2DE vF2C5 D62C49 27E6C E96 t = u2C @ VD 5: D2AA62C2? 46 7 @ F? 5 @? = J 7= @ 2E:? 8 563C: D 2? 5 @? 6 3 @ 5J:? 2 DFCG: G2 = DF: E [H9:49 H2D? @ E C64 @ G6C65] k^Am kAm% 96 t = u2C @ H2D D4965F = 65 7 @ C C6E: C6> 6? E 7C @> r2C:3362? 5FEJ 2? 5 7 @ C? 6H C6EC @ 7: EE:? 8 7 @ C D6CG:46 36EH66? E96 (6DE r @ 2DE 2? 5 p = 2D <2 [4 @> A2? J @ 77:4:2 = D 92G6 D2:5] q @ E9 E96 t = u2C @ 2? 5: ED D: DE6C D9: A H6C6 D = 2E65 E @ 36 C6A = 2465 3J EH @? 6H D9: AD] p3 @ 2C5 H96?: E 5: D2AA62C65 H6C6 7: G6 6? 8:? 66CD 7C @>! @ = 2? 5 [H9 @ H6C6 H @ C <:? 8 @? E96 C6EC @ 7: EE:? 8 2D E96 D9: A D2: = 65 E @! F6CE @ #:4 @] k ^ Am kAm}% $q:? G6DE:82E @ CD 92G6 D2:5 s2G:5D @?:? E6? 565 E @ A2DD ed>: = 6D 7C @> E96 46? E6C @ 7 E96 DE @ C>--2 C: D <J 564: D: @? [244 @ C5:? 8 E @:? 56A6? 56? E> 2C: E:> 6 6IA6CED] k ^ Am kAm000k ^ Am kAm | 2C46 = @ 4 @? EC:3FE65 E @ E9: D C6A @ CE 7C @> q @ DE @?] k^Am & copy; 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Thank you for reading 12 free articles on our site. You can come back at the end of your 30-day period for another 12 free articles, or you can purchase a subscription at this time and continue to enjoy valuable local news and information. If you need help, please contact our office at 423-638-4181. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Already a Print Subscriber? Login Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Need an account? Create one now. Choose an online service. 1 Online Subscription Current print subscribers 1 Current Subscriber Access 6-days per week, print subscribers may click this option to gain access to the e-edition. Already a Print Subscriber? None of these apply to you? Back Need an account? Create one now."}, {"articleID": "2011070823_00015841_W", "names": {"John Joseph": ["Q15485792", "Q250428", "Q56678901", "Q6242098"]}, "date": "2011-07-08", "url": "http://statesman.com/blogs/content/shared-gen/blogs/austin/blotter/entries/2011/07/08/wife_of_slain_musician_will_no.html", "content": "the blotter what's on the blotter? police press releases, public safety updates, traffic updates and general breaking news. what's on this page? the entry titled \"wife of slain musician will not face charges in death of intruder .\" wife of slain musician will not face charges in death of intruder by claudia grisales | friday, july 8, 2011, 05:04 pm a travis county grand jury has declined to indict rhonda maddox in the death of a man who broke into her southwestern travis county home last year, said travis county sheriff's office spokesman roger wade. in december 2010, <mark>john joseph</mark> debrecht suffered a gunshot wound and head injury during a struggle at the home of musician bill maddox, who was also shot and died at the scene, authorities said. debrecht died later at university medical center brackenridge, officials said. deputies were called to maddox's home in the 9200 block of rock way drive on the morning of dec. 27 after debrecht, who lived nearby, used a rock to break the front glass door and enter the house, wade said. after debrecht was inside, bill maddox told his wife, rhonda, to call 911, wade said. the two men began to struggle and bill maddox told rhonda to shoot debrecht, wade said. debrecht was shot in the shoulder, but he got up and during a struggle was able to get the gun away from rhonda maddox, wade said. debrecht shot bill maddox in the abdomen before the two fell down a flight of stairs, wade said. during the fall, debrecht suffered a head injury, wade said."}, {"articleID": "2020020317_00026326_W", "names": {"Anthony Mason": ["Q4773038", "Q4773043", "Q573600"], "Andy Reid": ["Q2622812", "Q27830815", "Q470738", "Q4761219"]}, "date": "2020-02-03", "url": "https://www.wcbi.com/damien-williams-talks-attitude-after-chiefs-super-bowl-win/#respond", "content": "US & World News National Share on Facebook Tweet on Twitter The Kansas City Chiefs won their first Super Bowl in 50 years last night with a dramatic comeback. Down by 10, the team scored 21 points in the fourth quarter to beat the San Francisco 49ers 31-20. Running back Damien Williams had a huge part in that historic run, scoring two touchdowns in the fourth quarter. Appearing on \"CBS This Morning\" Monday, Williams was enjoying the moment. \"It feels great,\" he said. \"You know, I feel like it still hasn't kicked in yet [that] I'm a Super Bowl champion .\" - Advertisement - Kansas City Chiefs running back Damien Williams scores a touchdown during the second half of Super Bowl LIV against the San Francisco 49ers, Sunday, February 2, 2020, in Miami Gardens, Fla.. Charlie Riedel/AP Co-host Gayle King said, \"Patrick [Mahomes] said he never lost faith. I wonder how you don't lose faith after two interceptions, you're down in the fourth quarter. Watching at home, I think a lot of people lost faith. What do you say to yourself, what do you do to yourself, to say,\" We are going to pull this out and do it now'? \"\"Me personally, I was going up and down the sidelines because when you've got a guy like Pat who is our vocal leader--he's just our leader, period--and having a game that he was having, somebody has to, you know, step up and be that vocal leader and kind of let everybody know, you know,\" We're not out of this game. Keep fighting, keep pushing .' \"\"The type of persona Pat is, he's a competitor .\" \"Tyrann Mathieu said about you, you have a lot attitude on offense, you\" run angry,' \"King said .\" What does that mean? \"Oh yes, most definitely,\" Williams said. \"I have a lot of attitude, especially with this game. I love what I do. And also, I have a chip on my shoulder. I've always been overlooked, and I keep that in my back pocket .\" Kansas City Chiefs running back Damien Williams. CBS News Co-host <mark>Anthony Mason</mark> said, \"You entered the league as an undrafted free agent. You've become only the second undrafted player to rush for 100 yards in a Super Bowl. That's vindication if ever there was any .\" \"Goodbye, chip!\" laughed King. \"Nah, I gotta keep that chip!\" Williams replied. He was also asked about Chiefs coach <mark>Andy Reid</mark> and what the win meant to him. \"Oh, man,\" Big Red' gave me a big hug. Big, big, big hug, \"Williams said .\" He's excited. He got on the bus with that trophy and he didn't let it go. He held it tight. And that's what you want to see--he looked like a big kid in the candy shop! \"So, what is next for the 27-year-old running back?\" Oh, man, enjoy the moment. Live in the moment. Be the moment, \"he said .\" You know, I have three beautiful kids. I'm going to enjoy this moment with them and make sure they remember this for the rest of their lives. \""}, {"articleID": "2018031511_00044907_W", "names": {"Frank Howard": ["Q5487338", "Q5487340", "Q5487342"], "Bob Lanier": ["Q4933111", "Q888056"], "Mark Schmidt": ["Q16229217", "Q57167391"], "John Marshall": ["Q11727936", "Q16227857", "Q1700966", "Q201423", "Q20675590", "Q20675591", "Q20684714", "Q21064499", "Q28709713", "Q29033953", "Q30604090", "Q3809459", "Q47540656", "Q51588456", "Q56808914", "Q58104514", "Q6246855", "Q6246857", "Q6246861", "Q6246867", "Q6246869", "Q6246871", "Q929340"], "Steve Fisher": ["Q30188272", "Q7612541", "Q7612543", "Q7612549"], "Fred Taylor": ["Q15994449", "Q359884", "Q3752661", "Q5496385", "Q5496387", "Q5496388"], "Bob Knight": ["Q16538199", "Q4933049", "Q888594"]}, "date": "2018-03-15", "url": "http://www.nydailynews.com/newswires/sports/syracuse-outlasts-arizona-state-article-1.3875616", "content": "Syracuse coach Jim Boeheim has made a concession for his thin roster--shorter practices and more sleep, especially for the Big Three. Good formula so far. The Orange, the last team selected for the NCAA Tournament, survived to play another day, holding off Arizona State 60-56 on Wednesday night in the First Four. Syracuse guards Tyus Battle and <mark>Frank Howard</mark> are 1-2 in the nation in minutes played and freshman Oshae Brissett is sixth, all of them averaging at least 38 per game. Despite recovering from a case of strep, <mark>Howard</mark> never sat and neither did Battle as the trio, led by Brissett's 23 points and 12 rebounds, combined to score 50 points. \"These two guys are amazing,\" Boeheim said at the podium afterward, looking over at <mark>Howard</mark> and Battle. \"They're going up against tremendous defensive teams all year long. They get doubled in everything every time they come off a screen .\" It's difficult to win when you've got three guys scoring. If they're off a little bit, it puts all the pressure back on our defense. \"That defense rose to the occasion, holding Arizona State to a season low in scoring .\" It was a rock fight, \"Sun Devils coach Bobby Hurley said .\" We didn't make enough shots. \"EYES ON CATS: The Arizona Wildcats will be in the spotlight when they open play against Buffalo, and coach Sean Miller and star freshman forward Deandre Ayton will be a focus as college basketball's season of scandal nears a climax. Miller missed one game and three practices late last month after ESPN reported he discussed a $100,000 payment to Ayton. Miller repudiated the report in a statement two weeks ago and the players don't seem fazed .\" I think off-the-court stuff, we don't really worry about that, \"guard Rawle Alkins said .\" We focus on the court, on the task at hand, this week, and we just take everything game by game. \"Syracuse's Oshae Brissett (11) scores the game-tying basket against Arizona State's Mickey Mitchell, left, during the second half of a First Four game of the NCAA men's college basketball tournament, Wednesday, March 14, 2018, in Dayton, Ohio. Syracuse won 60-56. (AP Photo/John Minchillo) Added Miller:\" Sometimes when adversity strikes it can really rally a group of people, can bring out a closeness that maybe you otherwise would not have felt. And I believe that about our team. \"KANSAS DEJA VU: A year ago Frank Mason III was the catalyst for the Kansas Jayhawks and consensus national player of the year. This year it's been Devonte' Graham's turn at the helm, and the senior has responded by leading Kansas to its 14th straight Big 12 regular-season title, putting him in the hunt for national POY. He's already received the league honor and this week was named a finalist for the Naismith Award .\" I don't really know what to say right now, but it hasn't really hit me yet, \"Graham said .\" But that's an individual award. You know, I'm more of a team guy. So I focus on the team and trying to get past this first game. \"Graham's value cannot be underestimated on a team that lost seven games and won the Big 12 Tournament without 7-footer Udoka Azubuike, who sat out with a knee injury but is expected back in the lineup. NEW YORK STATE OF MIND: The bellwether of NCAA Tournament basketball in upstate New York is usually perennial power Syracuse, but the Orange have company this year with western New York schools St. Bonaventure and Buffalo, and they're ready to make some noise of their own. In fact, the Bonnies, seeded 11th in the East, already have. They beat UCLA in the First Four--their first NCAA Tournament victory since 1970 and the days of <mark>Bob Lanier</mark>--then quickly jetted to Dallas where they'll play sixth-seeded Florida on Thursday night. St. Bonaventure has set a school record for wins in a season with 26 and will be trying to win two games in the NCAA Tournament for the first time since that banner year nearly a half-century ago when it beat Davidson, North Carolina State and Villanova before losing to Jacksonville, the defeat coming with an injured <mark>Lanier</mark> on the bench .\" This victory is for those guys. They didn't get an opportunity to show their talent, \"Bonnies coach <mark>Mark Schmidt</mark> said of that team led by <mark>Lanier</mark>.\" Bonaventure is a unique, special place...and it has great basketball tradition. \"Buffalo won the Mid-American Conference title and opens play against fourth-seeded Arizona in the South Regional. Syracuse's <mark>Frank Howard</mark>, left, and Arizona State's Romello White scramble for a loose ball in the final seconds of a First Four game of the NCAA men's college basketball tournament, Wednesday, March 14, 2018, in Dayton, Ohio. Syracuse won 60-56. (AP Photo/John Minchillo)\" Oh, man, it's going to be special. Hopefully, I can get past the jitters, \"Bulls guard Wes Clark said. PICK TWO: Congratulations Tom Izzo and Geno Auriemma. Former President Barack Obama has picked your teams to win it all in his NCAA Tournament brackets. Obama has Michigan State winning the men's title and--no surprises--UConn winning the women's championship. Obama has the Spartans beating Bucknell, Syracuse, Duke, and top-seeded Kansas to reach the Final Four along with defending national champion North Carolina, Villanova, and Virginia. Then he has Michigan State topping Villanova in the national semifinals and Virginia, the tournament's top seed, for the national championship. On the women's side, Obama has the unbeaten Huskies, the overall No. 1 seed, defeating Saint Francis, Quinnipiac, Duke, and South Carolina to reach the Final Four along with Louisville, Notre Dame and Mississippi State. UConn beats longtime rival Notre Dame in the national semifinals and Mississippi State for the title. The picks were posted Wednesday on the Obama Foundation's website. Last year he picked the North Carolina men and UConn women to win, and at least the Tar Heels obliged. The Huskies had their 111-game winning streak snapped by Mississippi State in last year's Final Four. It's unclear whether President Donald Trump will fill out a bracket. He declined an invitation last year from ESPN to do so on-air, as Obama did during his presidency. GET SHORTY: Demonstrae Jefferson is only 5-foot-7, but the Texas Southern guard sure plays big. He scored 25 points and grabbed eight rebounds in a 64-46 rout of North Carolina Central in the First Four on Wednesday night. Jefferson and Miami freshman Chris Lykes, also 5-7, are the shortest players in the tournament. For the 150-pound Jefferson, it was simply a good time to send a reminder to all the teams that passed him by. Syracuse's Oshae Brissett reacts during the second half against Arizona State in a First Four game of the NCAA men's college basketball tournament Wednesday, March 14, 2018, in Dayton, Ohio. Syracuse won 60-56. (AP Photo/John Minchillo)\" Yeah, when I do play those teams I kind of have an extra edge on my shoulder, like, you kind of missed out on the blessing, \"he said. FIRST TIME A CHARM? No fewer than 15 teams in the tournament are being led by head coaches who have never coached in the Big Dance. Among them are Avery Johnson at Alabama, Loyola-Chicago's Porter Moser, LaVall Jordan at Butler, Travis DeCuire at Montana, and 70-year-old Dan D'Antoni at <mark>Marshall</mark>. D'Antoni, who took over at his alma mater four years ago, is the older brother of Houston Rockets coach Mike D'Antoni and played point guard for <mark>Marshall</mark> in the 1960s. The list of coaches who won the title on their first try include: UConn's Kevin Ollie (2014), <mark>Steve Fisher</mark> at Michigan (1989), George Ireland at Loyola-Chicago (1963), and <mark>Fred Taylor</mark> at Ohio State (1960) with the likes of Jerry Lucas, John Havlicek and <mark>Bob Knight</mark> on the roster. ___ AP Sports Writers Dave Skretta in Kansas and <mark>John Marshall</mark> in Boise, Idaho, contributed. ___ For more AP college basketball coverage: More AP college basketball: https: //collegebasketball.ap.org; https: //twitter.com/AP_Top25 and https: //www.podcastone.com/ap-sports-special-events Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Sign up for BREAKING NEWS Emails privacy policy Thanks for subscribing! Tags: newswires associated press sports newswires Send a Letter to the Editor Join the Conversation: facebook Tweet"}]