[{"articleID": "2018053113_00167729_W", "names": {"Stephen Curry": ["Q352159", "Q43981708", "Q5573861"]}, "date": "2018-05-31", "url": "http://chronicle.northcoastnow.com/browns-notes/2018/05/31/BrownsZone-New-safety-Damarious-Randall-goes-viral-with-tweet-about-Cavs.html", "content": "Advertisement Scott Petrak The Chronicle-Telegram BEREA--Damarious Randall had no clue what he was getting himself into. And he has no idea how he'll get himself out...if necessary. Randall, the new Browns free safety who's a big fan of Golden State Warriors guard <mark>Stephen Curry</mark>, became one of the most popular subjects on the internet the last couple of days after sending this tweet late Monday night: \"If the Cleveland Cavaliers win the 2018 NBA finals I'll buy everyone who retweet's this a jersey...\"As of 9 p.m. Wednesday, it had been retweeted 892,000 times--about 131,000 more than when Randall met with reporters about seven hours earlier. Game 1 of the NBA Finals between Cleveland and Golden State doesn't start until today at 9 p.m.\" Honestly, I didn't think it was going to get over 100, \"Randall said after an organized team activities practice in which he made a diving interception .\" I didn't think people were going to actually view that as a serious tweet from me. But obviously it got the whole world excited about it, and now I'm actually excited about it. \"Randall said he had to ask teammates for the latest retweet counts because his phone shut down when he opened Twitter. For the last week, Randall's tweet was the most retweeted in the U.S., according to Twitter. On one unofficial list, it had the most retweets in history for an athlete .\" Do I get a trophy? \"he asked. No. . But maybe he'll get a plaque for so severely underestimating Cleveland sports fans .\" I definitely didn't think the Cleveland fan base would go this crazy about it, \"he said .\" Obviously, it was a joke, but just to know how passionate this fan base is, I mean, it's just really encouraging. \"Randall is from Pensacola, Fla., and doesn't have ties to the Warriors but started following <mark>Curry</mark> when he came out of college. Randall may have meant the original tweet as a joke but after being challenged, he tweeted there's a\" 100% chance \"he delivers on the promise. He hasn't started working on a payment plan in case the underdog Cavs shock the world .\" I don't think I've ever been a guy that worries about much myself, so we'll talk about it whenever the series is over, \"he said .\" This is just going to make the game a lot, lot more exciting for the fans, for myself. This should be a great, great series. \"Randall started to get himself in trouble Sunday after the Cavs beat the Celtics in Game 7 of the Eastern Conference finals .\" I'm glad the Cavs made it to the finals so I can watch <mark>Curry</mark> light that b * #% $up Game 3 & 4, \"he tweeted. He said Wednesday he wasn't referring to anyone in particular with the expletive .\" Oh, just the stadium, I mean the crowd, ’cause obviously <mark>Curry</mark> does shoot a lot of threes and he scores a lot of points, so that would be lighting it up, \"he said .\" I am not anti-LeBron. I am actually a big LeBron fan as well, but when he's going against Steph, I would rather Steph over LeBron, but at the end of the day, I mean they are both great, great players, and I definitely respect everything that LeBron has done for this community and for this city and state. I mean, he is one of the greatest players to ever touch a basketball if you ask me. \"Randall was acquired from Green Bay in a trade in March. Without having taken a snap in the orange and brown, he made himself a target for many Cleveland fans .\" He definitely did a couple things that the Dawg Pound does not like, \"cornerback TJ Carrie said. Randall isn't worried the anger will follow him into the season .\" No, because obviously I put a lot of work in what I do every day, and week in and week out I'm going to try my best to bring this team wins and to ultimately bring this organization championships, \"he said. Quarterback Tyrod Taylor said there was no need to ruffle feathers .\" Don't hit send, \"he said .\" Should have been smarter about the whole situation, about the tweet. Whether you feel that way or not, don't tweet it. \"Taylor knows the spotlight on athletes is always bright and has a simple method for staying out of trouble on social media .\" I just think of my mom's face. She wouldn't approve of it, \"he said. Coach Hue Jackson used the fervor to address his team about social media. He said he tells the players to keep the focus narrow and not to talk about other teams .\" I think what Damarious found out is that there's a lot of passionate Cleveland fans here and you've got to be careful about what you say, \"Jackson said. Randall planned to sit courtside for Games 3 and 4 at The Q but is reconsidering. Jackson said if he goes he might have to dodge popcorn and soda. Jackson knows about guarantees gone wrong and will jump into Lake Erie on Friday after promising more than one win in 2017. He said he's done stepping out on limbs, won't contribute a penny to the jersey fund and was adamant about where the Browns stand .\" We'll be all pulling for (the Cavs). Every last one of us will be pulling for them starting Thursday night, \"he said. Randall didn't get the memo in time. But he still believes he and Cleveland fans can find common ground .\" I feel like either way it goes it'll be a good thing to just be interacting with the fans, \"he said .\" Even if the Cavs do lose, I actually still plan on doing something for the fans. And if the Cavs win, obviously things are going to get done. \"Contact Scott Petrak at 329-7253 or spetrak @ chroniclet.com. Like him on Facebook and follow him @ scottpetrak on Twitter. Click to view comments Close comments Please enable JavaScript to view the comments powered by Disqus."}, {"articleID": "2017031718_00504439_W", "names": {"Brian O'Connell": ["Q44738511", "Q4964892", "Q4964893", "Q4964895", "Q7143847"], "David Oliver": ["Q16214119", "Q20127971", "Q20732875", "Q5238212", "Q5238216", "Q5238217", "Q9162"]}, "date": "2017-03-17", "url": "http://money.usnews.com/investing/news/articles/2017-03-17/g20-to-jointly-fight-bank-sector-hacking", "content": "A general view shows the G20 Finance Ministers and Central Bank Governors Meeting in Baden-Baden, Germany, March 17, 2017. REUTERS/Kai Pfaffenbach Reuters By Balazs Koranyi BADEN-BADEN, Germany (Reuters) - The world's biggest economies will pledge to jointly fight cyber attacks on the global banking system, one of the biggest coordinated efforts yet to protect lenders since an $81 million heist of the Bangladesh central bank's account last year. Meeting in the German resort town of Baden-Baden, G20 finance chiefs will agree to fight attacks regardless of their origin and promise cross-border cooperation to maintain financial stability, according to a draft document seen by Reuters. \"We will promote the resilience of financial services and institutions in G20 jurisdictions against malicious use of information and communication technologies, including from countries outside the G20,\" it said. However, it dropped an earlier reference for enhanced security requirements for financial services. Cyber crime became a top priority after an elaborate heist on the Bangladesh central bank's account at the Federal Reserve Bank of New York last year, an unprecedented theft that exposed the vulnerabilities of the system. The agreement, set to be finalised on Saturday, will come just days after the United States charged two intelligence agents from Russia, another G20 member, with masterminding the 2014 theft of 500 million Yahoo accounts. The indictment was the first time U.S. authorities have criminally charged Russian spies for cyber offences including for computer fraud, economic espionage, theft of trade secrets, and wire fraud. The charges came amid a swirl of controversies relating to alleged Kremlin-backed hacking of the 2016 U.S. presidential election and possible links between Russian figures and associates of U.S. President Donald Trump. In the banking world, attacks through the global SWIFT bank transfer system have continued to increase with the network recording a \"meaningful\" number of attacks with about a fifth of them resulting in stolen funds since the Bangladesh heist, the firm said late last year. In other highly publicized attacks, retailer Tesco Plc's banking arm said 2.5 million pounds ($3 million) had been stolen from 9,000 customers last year while hackers also stole more than 2 billion rubles ($34 million) from correspondent accounts at the Russian central bank and from accounts in commercial banks. The European Union is considering testing banks' defenses against cyber attacks with concerns growing about the industry's vulnerability to hacking. (Editing by Julia Glover) Copyright 2017 Thomson Reuters. Recommended Articles Valeant Stock Gets a Vote of Confidence Wayne Duggan | March 17, 2017 An activist investor with long ties to the pharmaceutical firm buys stock for less than $11 per share. 3 Ways to Avoid Undercutting Your Retirement Strategy Rebecca Lake | March 17, 2017 When it comes to your retirement future, you can't afford to sell yourself short. Pros and Cons of Taking a 401 (k) Loan Matt Whittaker | March 17, 2017 Disadvantages and risks outweigh the benefits when it comes to tapping your retirement account for cash. Gaming Stocks Are Worth a Gamble <mark>Brian O'Connell</mark> | March 17, 2017 The stock market has been sky-high, but gaming stocks, so far, are lagging in the Trump years. GoPro Shares Rise on Restructuring Wayne Duggan | March 17, 2017 GPRO stock climbed more than 15 percent. Driverless Cars May Be Bad for Sirius XM Wayne Duggan | March 16, 2017 More entertainment options are seen as a challenge for SIRI stock. 7 of the Best Cheap Stocks to Buy Under $10 John Divine | March 16, 2017 Cheap stocks are a dime a dozen but cheap stocks worth buying? Those are harder to come by. 3 Things to Know About the March Interest Rate Hike John Divine | March 16, 2017 A quick rundown of the major takeaways from the Fed's most recent rate hike. McDonald's Calls Trump \"Disgusting' <mark>David Oliver</mark> | March 16, 2017 The fast food chain later deleted the post and said the account had been\" compromised .' Avoid These 5 Common Tax-Filing Errors Debbie Carlson | March 16, 2017 Typos and claiming dependents are some of the common mistakes. Load More"}, {"articleID": "2009110304_00086153_W", "names": {"Michael Steele": ["Q331838", "Q443813", "Q51709680"], "Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2009-11-03", "url": "http://hotair.com/archives/2009/11/02/audio-scozzafavas-robocall-for-owens/", "content": "posted at 5:29 pm on november 2, 2009 by allahpundit listen here. this isn't all she's done for him, either: he asked her to swing by an event at the vfw and she where it all went wrong: the top-ranking house republican told reporters on monday that he regrets having supported former gop house candidate dede scozzafava...\"this lady clearly has as agenda that's different than most republicans; she was out there promoting herself,\" house minority leader john boehner (r-ohio) said, noting that he has encouraged all members of the gop conference to support conservative party candidate doug hoffman. way to piece it together, jb. the irony here is that it's moderate republicans who'll end up being the big losers from scozzafava's betrayal. not only does she make them look untrustworthy (or rather, more untrustworthy than before) but increasingly it seems like they're not even going to get hoffman's scalp as a consolation prize. check out this eye-popper from the crosstabs to today's hoffman's favorable rating among scozzafava voters is now 35/41, a 15/57 on saturday). by comparison, owens's favorable rating among them has shifted from 19/50 on saturday to...20/52 now. clearly her supporters are breaking towards the conservative - or were. the question is what her stumping for owens will do to those relative support levels. i'm generally fine with the big tent approach, but no tent would've been big enough to cover dede. he is a weak, feckless leader that is incapable of articulating conservative principles. he supported scuzzy from the beginning, not hoffman. blarg the destroyer on november 2, 2009 at 6:23 pm apparently you haven't been keeping up with what jb has been doing in the house lately. he's the strongest voice we have against the lefty obamabots and their agenda. but that is what is wrong and just what i said. he (boehner) chose party over principle. big orange on november 2, 2009 at 6:21 pm jb did not \"choose party over principle\" ...remember, before all the hoopla, no one knew a \"ny-23 † ³ even existed, much less who was running. boehner didn't knowingly endorse scozzy...he simply didn't back hoffman, since he wasn't running on the gop ticket. jb realizes hoffman is the right choice, and endorses him now. don't see the problem with that. * oops.... quote fail...jetboy on november 2, 2009 at p.s. i predict a hoffman/scuzzo rematch in november 2010. buzzcrutcher on november 2, 2009 at 5:55 pm no way. scuzzofalafel is toast. no one will trust a turncoat. you can buy her off for a while if it serves your purpose but she won't win your affection for a betrayal - even if you're the beneficiary. ironically, her best response would've been to support hoffman, hope he loses and then she becomes a viable candidate for 2010; but she's a loser and has no future in politics. boehner endorsed scuzzyfever. but he was redeemed by sarah, and is now on the sarah/hoffman bandwagon. i am willing to forgive boehner, but not newt. norwegian on november 2, 2009 at 6:23 pm john boehner does not need redemption from sarah palin. as rush limbaugh said...she's guilty of wide-spread bestiality. she has screwed all rinos, current and future. and that's a good thing. enoxo on november 2, 2009 at 5:36 pm so right. and what he said pelosi killing the blue dogs, and how peta should get involved...classis rush. the fact that the republicans chose her over hoffman says volumes about what boehner and other party leaders thought. he has no spine at all. he is a perfect example of what is wrong. he could have gotten behind hoffman from the start but he went with gingrich and <mark>steele</mark>. big orange on november 2, 2009 at 6:00 pm boehnor had absolutely nothing to do with picking her. maybe he should have interfered, but who could have imagined the local gop leaders would be this f * cking stupid? and people generally don't like interference from\" outsiders \"(just ask newt ...) this is part of the bigger problem with republican leadership-that boehner supported her in the first place. should we re-gain of the house, i would not want boehner to be speaker. john boehner does not need redemption from sarah palin. jetboy on november 2, 2009 at 6:38 pm i guess that's why he sent her multiple\" thank you!' - messages over twitter right after sarah gave her blessing for his health care speech. this is part of the bigger problem with republican leadership-that boehner supported her in the first place. should we re-gain of the house, i would not want boehner to be speaker. varnson on november 2, 2009 at 6:40 pm speaker michele bachman has a nice ring to it. joeintx: \"thank goodness the gop leaders have enormous grasp of the obscenely obvious, er, in hindsight .\" only if mike huckabee and mitt romney don't count as gop leaders, since both of them are still in hiding on this. brave, brave sir robins, both of them. and for those who hype their credentials as conservative leaders, compared to sarah palin: heartache. david blue on november 2, 2009 at but that is what is wrong and just what i said. he (boehner) chose party over principle. big orange on november 2, 2009 at 6:21 pm well, he is a party leader, so that may have something to do with it. boehner has his shortcoming, but the decsion to blow a bunch of money on scuzzy was made by the rnc and the rncc, neither of which boehner leads. automated message by conservatives for the 2010 and 2012 elections: (cankles voice in drawn out hiss) \"sssssssscooooooozzzzzzzzzzzzaaaaaaafffffffffaaaaaaaavvvvvvaaaaaa ...!\" i guess that's why he sent her multiple \"thank you!' - messages over twitter right after sarah gave her blessing for his health care speech. norwegian on november 2, 2009 at 6:43 pm oh, dear lawdy...saint sarah must give her blessings...a\" thank you \"for agreeing with boehner's health care speech is hardly\" redemption \". boehner has been working his arse off over health care, not only fighting obamacare, but coming up with a gop proposal to fix what needs fixing, and highlighting what works. palin had nothing to do with it. jetboy on november 2, 2009 at jetboy on november 2, 2009 at 6:36 pm and that is a problem. he is a weak leader. he threw his support behind a pro-choice, pro-gay marriage, pro-card check, tax raising democrat running as a republican. you say he is the strongest voice we have right now. i agree with you, and that is the problem. he, along with <mark>michael steele</mark>, need to submit their resignations on wednesday and let real conservatives run the show. blarg the destroyer on november 2, 2009 at who cares about principles? neither of the two parties! all they care about is maintaining their power and the 2 party system. i'm generally fine with the big tent approach, but no tent would've been big enough to cover dede. packerbronco on november 2, 2009 at 6:33 pm if you've ever been to africa, it's hard to throw a tent over a rino. but scooooooooooozafava is the moderate republican who can win election for republican, right? like snowe collins etc. moderates are acids to conservative image. not the other way around. oh, dear lawdy...saint sarah must give her blessings...a\" thank you \"for agreeing with boehner's health care speech is hardly\" redemption \". boehner has been working his arse off over health care, not only fighting obamacare, but coming up with a gop proposal to fix what needs fixing, and highlighting what works. palin had nothing to do with it. jetboy on november 2, 2009 at 6:46 pm are you a catholic? americannodash on november 2, 2009 at wow, hoffman's numbers are really moving. i hope he wins this thing by a big margin. what do you want to bet that she shows up on odumbo's guest list? are you a catholic? americannodash on november 2, 2009 at 6:54 pm yep...not sure what that has to do with anything tho...john boehner: scuzzyfever has my full support eh, it wasn't for sarah, boehner would be a dead man walking right now. norwegian on november 2, 2009 at 6:58 pm that doesn't show that boehner was campaigning for her...only that fort drum, in her district, would be of importance. that's why he would put her on the asc if she won. scozzafava said fort drum, which encompasses a large part of the congressional district, is vitally important to her constituents, and said boehner's desire to put her on the committee shows he recognizes its importance. he'll do the same for hoffman i presume. jetboy on november 2, 2009 at 7:08 pm and some people call us the stupid party...get a grip man. boehner blew it. he failed conservatives and conservatism with his support of scuzzwuzzy. how hard is that to see? blarg the destroyer on november 2, 2009 at all boehner does is carry huge stacks of democrat paper around washington, drop them on desks and podiums with a thud, and exclaim about how big they are. what a dunce. yep...not sure what that has to do with anything tho...jetboy on november 2, 2009 at 7:05 pm as a catholic you should know better then to call her a saint. stop calling sarah palin a saint. she is an american who speaks with conviction of the core principles of life, liberty & the pursuit of hapiness. when you call her a saint all it does is weaken any statement provided by you. let's wait for when the pope decides she is worthy. john boner!!! - no duh!! what the hell - leaders who follow instead of lead end up with ny pigeon doo doo all over their camera mugging profiles. time to stop following your rino elites from ny and dc and start heading home to listen to your constituents. maybe you would have backed the right candidate from the start. or start following the lead of the new bloods (palin, phawenty, instead of the country club's ass kissers like newt! the irony here is that it's moderate republicans who'll end up being the big losers from scozzafava's betrayal. not only does she make them look untrustworthy (or rather, more untrustworthy than before) but increasingly it seems like they're not even going to get hoffman's scalp as a consolation prize. consolation prize? every single republican\" moderate \"should be made to stand in the corner with a dunce cap, and write\" i am not a socialist statist \"500 times on the hey newt-see if you can borrow the\" reset button \"from hilary. the irony here is that it's moderate republicans who'll end up being the big losers from scozzafava's betrayal. not only does she make them look untrustworthy (or rather, more untrustworthy than before) but increasingly it seems like they're not even going to get hoffman's scalp as a consolation prize. zackly. lets hope hoffman wins by more than the skin on his teeth, well its not skin, more like a film of bacterial growth or something. boehner would have done a lot better if a couple of weeks ago he spent some time on hotair...we are not a bunch of posters fiddling around. we are the backbone of the conservative movement. many of us have differing opinions...but we can all analyze. he, and others, need to spend a few hours a day, cruising through the posts...we were right on bush, mccain, palin, hoffman. right on the tea party's, right on health care. get you nose out of newt's butt, and read what the real people are saying. question: isn't scuzzy the epitome of what <mark>glenn beck</mark> has been talking about with regard to how there is no difference between the dems and the reps? the parties are one and the same. they want to keep each other in power and keep out anyone who's not in the loop. or else clearly she was a demo dressed as a rep just like snowe and collins are in the northeast. time to clean house and get some new blood in there. amen!! nothing says vote for me! quite as loudly as a 265 pound, butch-haired woman in a pink pantsuit. she's all yours, dnc. jaibones on november 2, 2009 at zackly. lets hope hoffman wins by more than the skin on his teeth, well its not skin, more like a film of bacterial growth or something. geochelone on november 2, 2009 at 8:05 pm ny-23: new york race - chicago rules, and what dede learned from david"}, {"articleID": "2011050708_00067965_W", "names": {"Tom Watson": ["Q263802", "Q532111", "Q7002019", "Q7818002"], "Tom Lehman": ["Q26922239", "Q949710"]}, "date": "2011-05-07", "url": "http://newsok.com/spanish-golf-great-seve-ballesteros-dies-at-54/article/feed/257331?custom_click=rss", "content": "seve ballesteros, a five-time major champion whose passion and gift for imaginative shot-making invigorated european golf and the a statement on ballesteros' website saturday said the golf great died peacefully at 2:10 a.m. local time, surrounded by his family at his home in pedrena, in northern arnold palmer was in america, a handsome figure who feared no shot and often played from where no golfer had ever been. lee westwood, no. 1 in the world rankings, said it was a \"sad day\" for golf. \"lost an inspiration, genius, roll model, hero and friend,\" westwood posted saturday on twitter. \"seve made european golf what it is today. rip seve .\" gonzaga escauriaza said ballesteros, an \"icon\" of spanish golf, transformed the sport. \"severiano ballesteros was a unique, unrepeatable person,\" escauriaza said. \"we have to recognize we are where we are now, that golf is a popular sport...in large part to severiano ballesteros. we all owe him a lot .\" in a long list of spectacular shots, perhaps the most memorable came from a parking lot next to the 16th fairway at british open. leading by two shots in the final round, he drove his ball into the lot, had a car removed to get his free drop, then fired his second shot to 15 feet and made birdie on his way to his first major. \"he was a man who got into trouble. only for seve, there was no such thing as trouble,\" gary player once said. \"he could manufacture shots like a genius .\" his last challenge came from an unbeatable foe - cancer. ballesteros fainted in a madrid airport while waiting to board a flight to germany on oct. 6, 2008, and was subsequently diagnosed with the brain tumor. he underwent four separate operations, including a 6? - hour procedure to remove the tumor and reduce swelling around the brain. after leaving the hospital, his treatment continued with chemotherapy. ballesteros looked thin and pale while making several public appearances in 2009 after being given what he referred to as the \"mulligan of my life .\" he rarely was seen in public since march 2010, when he fell off a golf cart and hit his head on the ground. his few appearances or public statements were usually in connection with his seve ballesteros foundation to fight cancer. he wanted but was unable to take part in a champions exhibition at st. andrews in the british open. such was his stature, even out of the public eye, that european players celebrated his most recent birthday - the saturday of the masters - as if it was a national holiday. for such greatness, his career was relatively short because of back injuries. ballesteros won a record 50 times on the european tour, his first as a 19-year-old in the dutch open, his last when he was 38 at the 1995 peugeot open in his native spain. that also was his last year playing in the ryder cup, where he had a 20-12-5 record in eight appearances. he was captain in 1997 when europe won at valderrama. ballesteros was the reason the ryder cup was expanded in 1979 to include continental europe, and it finally beat the united states in 1985 to begin more than two decades of dominance. while others have played in more matches and won more points, no player better represents the spirit and desire of europe than ballesteros. he announced his retirement in a tearful press conference at carnoustie before the 2007 british open. ballesteros had returned to augusta national that year to play the masters one last time, but shot 86-80 to finish last. after turning 50, he tried one champions tour event, but again came in last. his back was ailing, his eyes were no longer as lively, and his best game had left him years earlier. \"i don't have the desire,\" ballesteros said. that desire was as big a part of his game as any shot he manufactured from the trees, the sand - just about anywhere. born april 9, 1957 in the tiny town of pedrena, spain, he learned golf with only one club - a 3-iron - that forced him to create shots most players could never imagine. ballesteros first gained major notoriety at 19 in the final round of the british open at royal birkdale, where he threaded a shot through the bunkers and onto the green at the 18th hole, finishing second to jack nicklaus. \"he invented shots around the green,\" nicklaus said in the weeks before ballesteros was inducted into the world golf hall of fame in 1999. \"you don't find many big hitters like him with that kind of imagination and touch around the green. he's been a big inspiration to golf in continental europe, more than anyone has .\" ballesteros went on to win the order of merit on the european tour that year, the first of six such titles. two years later, he won the first time he teed it up in america, a one-shot victory at the greater greensboro open. partly because of his humble roots, partly because of his spanish blood, ballesteros always played as though he had something to prove. even after some called him \"car park champion\" for his shot at lytham when he won the 1979 british open, the spaniard showed that was no fluke when he arrived at augusta national the next year. he obliterated the field in the 1980 masters, much like tiger woods did in 1997. applying his genius to a course built for imagination, ballesteros took a seven-shot lead into the final round and led by 10 at one point until he started spraying tee shots and won by four. even so, at 23 he was the youngest masters champion until woods won at age 21. ballesteros won the masters again in 1983, and he was equally dominant in golf's oldest championship. he won the british open in 1984 at st. andrews over <mark>tom watson</mark>, then won again at lytham in 1988 by closing with a 65 - the best score of the tournament - to beat nick faldo. his career was marked by nasty disputes with european tour officials and pga tour officials. he quit the european tour in 1981 in a disagreement over appearance money, the only year he missed the ryder cup. he became angry with pga tour commissioner deane beman in 1985 for not playing the required 15 events for membership. despite his five majors and 87 titles around the world, ballesteros forever will be linked to the ryder cup. he developed an \"us against them\" attitude that became infectious with what had been an inferior european team. he made his teammates believe. pga national, his ball beneath the lip of a bunker, some 245 yards from the green, when he lashed a 3-wood to the fringe and escape with a halve against fuzzy zoeller. the americans narrowly won, but the ryder cup was never the same after that year - and perhaps after that shot. \"his desire to beat the americans was paramount, and probably the reason they beat us,\" <mark>watson</mark> said. \"the ryder cup became the focus of world golf, and seve was right there as the leader .\" jose maria olazabal to become the most formidable partnership in ryder cup history, producing an 11-2-2 record. in his final ryder cup, at oak hill in 1995, he was playing a singles match against <mark>tom lehman</mark> when ballesteros drove wildly to the right. a tv commentator said his only two choices were to pitch back to the fairway or play a big hook around a massive tree. ballesteros studied his options, then hit over the green to the front of the green. such was the unpredictable nature of ballesteros. there have not been many like him, if any at all. \"seve is a genius, one of the few geniuses in the game,\" ben crenshaw once said. \"the thing is, seve is never in trouble. he's in the trees quite a lot, but that's not trouble for him. that's normal .\" ballesteros and wife carmen divorced in 2004. they had three children. the spaniard stayed active in golf after he stopped playing regularly, mainly through golf course design. thank you for joining our conversation on newsok.com. we encourage your discussion but ask that you stay within the bounds of our commenting and posting policy. please help by flagging comments that violate these guidelines. posts that contain obscene or vulgar language will be immediately flagged and not posted. hyatt? rewards program earn 10,000 gold passport points when you stay 5 nights. join today. class 3a girls state golf tournament photos from thursday's competition at the class 3a state golf tournament at dornick hills in ardmore. prep golf: 2011 class 3a girls state tournament okc thunder vs. memphis grizzlies playoff photos game 2: may 3, 2011 okc thunder vs. memphis grizzlies photos: view photos from the thunder's western conference semifinal second playoff game against the grizzlies inside the oklahoma city arena. the thunder defeated memphis 111-102 to even the series 101. okc thunder vs. memphis grizzlies: may 1, 2011 thunder practice: preparing to hit the road to memphis may 5 after evening things at one game a piece, kevin durant and his teammates know things will only get more difficult as the series shifts to memphis for the next two games. press row: the thunder's key vs. memphis"}, {"articleID": "2010101416_00434268_W", "names": {"Greg Abbott": ["Q5605224", "Q5605225"], "David Wallace": ["Q16239427", "Q313246", "Q41969013", "Q434427", "Q5233962", "Q5238850", "Q5238878", "Q5240793", "Q5240794", "Q5240795", "Q5240796", "Q5240797", "Q5240798"]}, "date": "2010-10-14", "url": "http://istockanalyst.com/article/viewarticle/articleid/4582882", "content": "stay ahead of the market. signup for our free newsletter!!! oct. 14, 2010 (united press international)--a federal appeals court says the phrase \"under god\" inserted into the texas pledge of allegiance is not a first amendment violation. the 5th u.s. circuit court of appeals upheld the constitutionality of the texas pledge, and texas attorney general <mark>greg abbott</mark> called the ruling \"a victory for all texas' constitutionally protected rights and freedoms,\" the dallas morning news reported. a dallas-area couple, <mark>david wallace</mark> croft and his wife, shannon, with two other people, filed a suit in 2007, claiming the inclusion of \"under god\" caused their children harm and violated their first amendment rights. the plaintiffs lost a federal district court ruling in 2009 and appealed to the 5th u.s. circuit court. the ruling also denied the plaintiffs' argument the pledge endorses a particular religious belief. texas lawmakers inserted the words \"under god\" into the texas pledge to mirror the u.s. pledge of allegiance, the report said. the appeals court made its latest ruling wednesday. fed should go, google sees deflation, why blockbuster failed, and stocks looking tired copryright 2010 all rights reserved"}, {"articleID": "2017092414_00582305_W", "names": {"David Carter": ["Q1173943", "Q20193403", "Q23304159", "Q28454933", "Q5232204", "Q5232205", "Q5232207", "Q5232208", "Q5232209", "Q5232211", "Q5232212", "Q5232213", "Q58062269", "Q6128819"]}, "date": "2017-09-24", "url": "http://www.newcastlestar.com.au/story/4944997/loan-rules-should-apply-only-in-sydney-melbourne/?cs=9", "content": "The major banks' main domestic rivals are calling for an overhaul of the prudential regulator's caps on property investor and interest-only mortgages, claiming the curbs are stifling competition. The major banks' main domestic rivals are calling for an overhaul of the prudential regulator's caps on property investor and interest-only mortgages, claiming the curbs are stifling competition. View More Local Business List Your Business Here Proposals from the second-tier lenders include clamping down on mortgages only in the hottest property markets such as Melbourne and Sydney, or putting tighter speed limits on the big four than the rest of the industry. For almost three years, banks have faced a 10 per cent annual growth cap in their housing investor loan portfolios, enforced by the Australian Prudential Regulation Authority (APRA). In March this year, APRA imposed a further restriction, capping interest-only lending at 30 per cent of new loans. As big banks sell peripheral businesses to zero in on the housing market, regional banks say these \"macroprudential\" policies are having unhealthy side-effects for competition. Banks including Suncorp, Bank of Queensland, and industry super-owned ME are calling on APRA to consider redesigning the rules, which they say are effectively locking in the big four banks' market share. \"The macroprudential rules, while well-intentioned, have the effect of effectively maintaining status quo from a competition point of view,\" said Suncorp's chief executive of banking and wealth, <mark>David Carter</mark>. He acknowledged the policy was intended to prevent a \"credit bubble\" in real estate, but said the caps could be redesigned, such as only focusing on the cities at the greatest risk of overheating. \"If we're really concerned about house prices getting away from everyone in Sydney and Melbourne, then maybe the focus point should be Sydney and Melbourne,\" Mr <mark>Carter</mark> said. He noted the precedent in New Zealand, where regulators have targeted \"macroprudential\" policies at Auckland, where price growth had been most rapid. Bank of Queensland chief Jon Sutton said the caps could also be changed so some banks had higher speed limits than others - which would allow smaller banks to increase their share. \"These changes basically just lock in the market share for everybody at the current level,\" Mr Sutton said. ME chief executive Jamie McPhee said the 30 per cent cap on interest-only lending also skewed how different banks could grow. Banks that were able to compete strongly in principal and interest lending were also given scope by the cap to pick up a strong share of interest-only lending, he said. \"It just makes it harder for challenger brands or smaller [authorised deposit-taking institutions] to get any shift in market share,\" he said. The regional banks called for the change in tack by APRA as part of a submission to the Productivity Commission's inquiry into competition in financial services. Larger banks, however, have maintained in their submissions that the mortgage market remains highly competitive. Westpac said that in the four years to June, non-major banks had grown their lending at an average page of 9.5 per cent a year, faster than the 7.7 per cent average pace for the big four. Another key concern identified by the regional banks was the funding cost advantage that the big four receive from being considered \"too big to fail\" , and the big banks' more favourable capital treatment. The big four are able to set aside less shareholder capital than the regional banks for every dollar lent, which makes the same loans more profitable for the big four. The smaller banks argue the government's bank levy helped to address the advantage the big four receive from an \"implicit\" guarantee by the taxpayer, but it has not gone far enough. The story Loan rules should apply only in Sydney, Melbourne first appeared on The Sydney Morning Herald."}, {"articleID": "2011041214_00162617_W", "names": {"Jamie Coleman": ["Q17485000", "Q19519883", "Q37837669"]}, "date": "2011-04-12", "url": "http://forexlive.com/179986/all/us-feds-dudley-growth-could-disappoint-in-first-quarter", "content": "hong kong (mni) - u.s. growth could disappoint in the first quarter but the outlook remains better than it was a year ago, new york federal reserve president william dudley said tuesday. he said the recent earthquake in japan and rising oil prices have lowered the outlook over the last couple of months but still, \"the outlook for growth is better than it was last summer .\" \"it looks like first quarter growth will be somewhat disappointing, compared with a few months ago, and come in at 3% or a bit less. i think there is some question about how oil prices will play with consumer confidence,\" he said at a discussion hosted by institute of regulation and risk north asia. and he said it is premature at this point to talk about exiting from quantitative easing. \"we can exit and will exit when time comes but that doesn't mean that exit is close at hand .\" dudley said inflation should peak at 2.5% to 3.0% and so far there are no signs of second-round inflationary effects. on the dollar, he said authorities are not concerned about absolute levels of currencies, but rather their volatility. \"the level is not the issue, the issue is volatility and markets have been very orderly with the exception of yen after the earthquake,\" bjorn: aud doing the same? big sudden drop in gold hey. mephistos: this article has a few weeks, but the content is not dated. they too say, commodities shock may even be a reason for more acomodative monetary policy. in...khalys: anyone else feeling totally lost in this market? john: i've had quitie a bit of luck with these two pairs over the last 24 hours. shorted both for about 80 pips profit lastnight and went long aud/usd for 100...<mark>jamie coleman</mark>: sharp fall in us yields? very dovish fed talk dampening hopes for fed hike late this year, early next mephistos: hi <mark>jamie</mark>, do you know where to listen to hoenig speaking? any online radio or something? high risk warning: foreign exchange trading carries a high level of risk that may not be suitable for all investors. leverage creates additional risk and loss exposure. before you decide to trade foreign exchange, carefully consider your investment objectives, experience level, and risk tolerance. you could lose some or all of your initial investment; do not invest money that you cannot afford to lose. educate yourself on the risks associated with foreign exchange trading, and seek advice from an independent financial or tax advisor if you have any questions."}, {"articleID": "2015091422_00080681_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}, "date": "2015-09-14", "url": "http://www.news-mail.com.au/news/demi-lovato-nick-jonas-deserves-best/2774656/", "content": "BANG Showbiz Related Items Robert Pattinson only reads bad reviews <mark>Chris Brown</mark> forced into drug test during custody hearing Elle Fanning's transgender inspiration Zayn Malik sends naked pictures to Lily Allen Taylor Swift celebrates Emmy win for 360 degree video Schwarzenegger \"honoured' to host Celebrity Apprentice Show More Local Real Estate Cars For Sale DEMI Lovato thinks Nick Jonas\" deserves the best \". The\" Cool for the Summer' hitmaker would happily play matchmaker and \"hook\" her close pal up with someone if she thought they'd suit. She explained: \"People joke, but I also, like, I don't really take it seriously because sometimes the people that are joking just don't really have a chance .\" But if somebody actually was like \"hey,' and I thought he would be into them, I'd hook them up. He deserves the best .\" And regarding rumours about a possible romance between the 22-year-old singer and \"Good For You' hitmaker Selena Gomez, Demi refused to comment. She told Capital FM:\" I'm Switzerland! I have no opinion on that! Listen, if I have an opinion on something, I would say it. I want him to be happy. \"Meanwhile, Nick - who split from beauty queen Olivia Culpo in June - recently admitted he is still\" adjusting \"to single life. When asked how it feels to be single, he said:\" Interesting. It's still an adjustment, getting use to my life on my own is an interesting thing. \"I'm in a good place of being young and grow and do what I need to do right now .\" bang showbiz Read More Login to follow demi lovato Read More Login to follow nick jonas Read More Login to follow Topics: bang showbiz, demi lovato, nick jonas 0 0 PRINT Have your say Top Stories LNP toss Tony, turn to Malcolm amid poll fears Estranged husband of Sharon Edwards jailed' I was dying on the table': Chappy Dave tells of near death Join the Community. Get your local news, your way. Sign Up Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now"}, {"articleID": "2010032118_00112817_W", "names": {"Barry Nelson": ["Q3635239", "Q4864560"]}, "date": "2010-03-21", "url": "http://daytondailynews.com/business/enviros-growers-agree-on-farmland-reuse-for-solar-611696.html?cxtype=rss_business", "content": "smaller type by tracie cone, the associated press lemoore, calif. - cash-strapped farmers in california's agricultural heartland and environmentalists at odds over water rights and wildlife protections finally agree on something: that thousands of acres of cracked, salty farmland is the perfect site for a sprawling utility-scale solar farm. the 47 square-miles of land proposed for the westlands solar park in remote kings and fresno counties is just one of dozens of unfinished solar projects in california, but renewable energy analysts say it is a rare one that enjoys the broad support of environmental groups such as the sierra club, powerful agriculture interests and state government. thousands of solar panels would be located on and near the salty-white, fallowed farm land, most of which is owned by the westlands water district, the largest such district in the country comprised of 600,000 acres of san joaquin valley farmland. once completed, the first chunk of solar proposed for the site - the total size of which is roughly that of san francisco - could generate up to 1 gigawatt of power, or enough to energize up to one million homes. \"i think a better fit (for the land) is farming, but we have what we have and you go from there,\" westlands spokesman sarah woolf said. the embrace of solar power as a new cash crop comes at a time when the district is struggling with mounting debt. a decade ago, westlands floated a bond to buy 100,000 acres of farm land where poor drainage had created a salt buildup called selenium, making the land unusable for growers. but with the salty land came water rights, so westlands bought it so it could divert the water allocations to more productive farms. since then, drought and environmental issues have cut revenue to westlands by reducing the amount of water it can sell to members, who range from corporate giant harris farms to family farming operations. over the past two years, westlands has tripled farmers' assessmentsto repay bonds when they can least afford it. westlands now sees solar power as a way to put the land back to work. \"(solar is) a natural fit, it works,\" woolf said. \"but the underlying motivation is we need to figure out a way to repay the debt .\" now, with mojave desert solar projects shrinking in number because of recent proposed legislation by u.s. sen. dianne feinstein, d-calif., that would create two new national monuments there, woolf said the valley has become \"the prime location for solar .\" the district has said it is also open to other types of energy development, including nuclear. environmentalists like the site for solar panels because it had been intensively farmed for decades, so it does not contain habitat for endangered species, an issue that has stalled projects in the sunnier mojave. \"in this part of the world it's not often you find common ground between the water district, landowners and environmentalists, and this is a project that seems to have this potential,\" <mark>barry nelson</mark>, senior policy analyst at the natural resources defense council, said. another plus is the project's proximity to transmission lines and substations that could deliver energy produced at the site to homes throughout the state, said daniel kim, principal partner at westside holdings, the private investment group that has a lease contract with westlands and neighboring farmers. also, as utilities seek renewable energy to meet the state's goal of getting one-third of its power from renewable sources by 2020, the california energy commission has identified a number of zones where large-scale projects can be developed. the land that would be used by westlands solar park is included in these identified areas, which means some regulatory hurdles already have been met. despite the positive reaction to the project from disparate groups, the solar park has a number of hurdles to overcome, including getting through the regulatory hurdles associated with getting built new power lines and substations that will be needed to deliver the power. kim's group is working on negotiations with utility companies, who would need to build the transmission infrastructure upgrades before the site's potential can be realized. still, renewable energy experts say the project is promising, partly because landowner westlands is a public agency operating under state authority, so many of the regulatory issues bogging down other large-scale solar projects do not apply. the path to the finish line is more clearly defined here than perhaps any other project in the state right now, said carl zichella, sierra club's director of western renewable programs. \"this particular idea of using retired agricultural land for large scale renewable energy development...has a lot of interest,\" he said. despite the area's sun potential, large-scale solar projects had largely failed to gain traction in the san joaquin valley because of westlands' disinterest and a focus by developers on the more sunny mojave. \"the whole idea of farmers letting go of these farms is not easy,\" kim said. \"when you're a third generation farmer, it's not a decision taken lightly .\" but with the more sunny desert sites mired in a political, regulatory and environmental morass, the valley's solar value has increased. \"lo and behold, three years later (desert sites) are far less desirable because the desert has tremendous ecological diversity and a lot of stake holders who don't want to see desert with a lot of solar panels,\" kim said. entering them helps digitize old texts."}, {"articleID": "2013022200_00012376_W", "names": {"Tom Walsh": ["Q16886418", "Q19586386", "Q19664158", "Q20984602", "Q21061744", "Q2440190", "Q37380700", "Q55362473", "Q7817978", "Q7817979", "Q7817980"]}, "date": "2013-02-21", "url": "http://freep.com/article/20130221/COL06/130221080/1001/news", "content": "rape kits net another arrest; southfield man, 29, charged in 2003, '04 sexual assaults jerrod desean allen is accused of sexually assaulting the women in 2003 and 2004 and was given a.. . u-m researchers stand to lose $40m in funding if sequester cuts occur u-m vice president for research stephen forrest told the board of regents today that the deep,...kilpatrick jury ends 3rd day of deliberations, no sign when verdict may arrive there's no telling how many of the 45 counts the jurors have made it through yet. statue honoring civil rights giant rosa parks will stand 9 feet tall in u.s. capitol tigers announce starting lineup for exhibition opener vs. braves manager jim leyland provided his standard reminder to not read anything into spring lineups. <mark>tom walsh</mark>: the big question on detroit's mess that snyder can't answer (with raw video) detroit's fiscal crisis is \"solvable, in my view,\" gov. rick snyder insisted today. the detroit bakery's new 50,000-square-foot facility at 4731 bellevue, at east forrest, will be...compuware stock momentarily surges on reports of talks with buyout firms compuware shares jumped from about $11.54 to $12.74 shortly after 2 p.m. oscar best-actress race: jennifer lawrence and jessica chastain to duke it out the stars of \"silver linings playbook\" and \"zero dark thirty\" are the front-runners in a category...the singer, 26, posted on her blog late wednesday that she had hip surgery and it \"happened so fast .\" denzel washington might have a small chance to upset daniel day-lewis free press test kitchen recipe: sesame lamb chops with honey-raisin sauce lamb loin chops cook quickly making them an easy choice for a weeknight meal. for people under 65, getting vaccinated this season reduced the need to go to the doctor for the...brad garmon: legislation redefining conservation puts michigan's diversity of nature at risk legislation completely redefining \"conservation\" and restricting or removing the ability of the...as a jewish white woman who grew up in the shadow of the holocaust, lynchings down south, and the...maura corrigan: state program aims to break poverty's grip on children beginning march 1, thousands of schoolchildren in detroit, flint, pontiac and saginaw will find...blog replay: snyder to decide on emergency financial manager for detroit next week blog replay: snyder to decide on emergency financial manager for detroit next week \"we need to grow detroit': gov. snyder mum on emergency financial manager detroit mayor dave bing challenges report: city has a plan to fix financial mess detroit city council approves 10% pay cut through furloughs for union workers detroit regional chamber ceo sandy baruah: business leaders\" ready to accept' efm what it would mean for detroit: questions, answers on emergency financial managers detroit's fiscal crisis is \"solvable, in my view,\" gov. rick snyder insisted today. but how, when the city's population and tax base keep shrinking, can detroit possibly stabilize and improve services to its citizens anytime soon? snyder's answer was sketchy when i asked him about how to reverse the city's plunging revenues. he talked about growing the city, about quicken loans adding jobs, about chrysler and blue cross blue shield of michigan moving workers to downtown from the suburbs. ok, there are some bright spots, but snyder, the nerdy numbers guy, knows full well that city tax revenues lag a few years behind any recovery in jobs or property values that might be germinating. here's what the state's detroit financial review team reported about the money flowing into city coffers in the last five fiscal years: incoming revenue to the city's general fund from taxes, fees, fines and other sources was $1.49 billion in fiscal 2006-07. five years later it was $1.1 billion. that's a decline of 26%, or nearly $400 million, in the funding available for police, fire, streetlights, parks and other services. going forward, any rescue plan for detroit must include more cost-cutting, a serious restructuring of long-term debt and retiree obligations, and - in snyder's own words - \"growing the city .\" the financial review team has produced reams of data on the expense issues, but virtually nothing in terms of a credible scenario for growing detroit's revenue base. snyder told me that he and state treasurer andy dillon have studied the fiscal rescues of new york in the 1970s and washington, d.c., in the late 1990s, as well as the bailouts and bankruptcies of general motors and chrysler in recent years. no single one of those cases is a perfect model for detroit's challenge, he said, but there are instructive lessons in all of them. perhaps the most impressive tough love during the auto bailouts was the federal government's rejection of a series of so-called \"viability plans\" from gm and chrysler, until the companies came up with realistic projections for what brands and products they could save and grow. today gm and chrysler are stable and profitable as a result. snyder repeated thursday that he has not yet decided to install an emergency manager, and said he would listen to mayor bing and the detroit city council's ideas during the next week or so. but after hearing the governor tick off a list of the delays, lawsuits and stumbles during the past year of dealing with the city, it's hard to imagine his settling now for a tweaking of the consent agreement. whoever's on the governor's short list to become detroit's fiscal taskmaster, they'd better be as forceful as the feds were with the auto companies; extremely sensitive to detroit's political and cultural fault lines; and thick-skinned as rhinoceroses. drew sharp: lions need to develop draft picks, not make splashy signings detroit financial crisis: court is owed millions...but how to get it? jamie samuelsen's blog: three tigers who could have a disappointing season <mark>tom walsh</mark>: the big question on detroit's mess that snyder can't answer detroit's fiscal crisis is \"solvable, in my view,\" gov. rick snyder insisted today. but how, when the city's population and tax base keep shrinking, can detroit possibly stabilize and improve drew sharp: lions need to develop draft picks, not make splashy signings detroit financial crisis: court is owed millions...but how to get it? jamie samuelsen's blog: three tigers who could have a disappointing season tigers' nick castellanos doing what he can to catch on in outfield <mark>tom walsh</mark>: the big question on detroit's mess that snyder can't answer (with raw video) u-m researchers stand to lose $40m in funding if sequester cuts occur recruiting: msu football offers two players; local prospect impresses feb. 20 roundup: chandler park boys, madison girls among winners recruiting: several top state recruits visiting u-m this weekend mick mccabe: detroit consortium roars in first game after coach's death"}]