[{"articleID": "2018121117_00979467_W", "names": {"David Keane": ["Q25172044", "Q52815831", "Q56260413"]}, "date": "2018-12-11", "url": "http://brentwoodweeklynews.co.uk/news/national/17291082.350000-police-misconduct-hearing-should-have-been-avoided/", "content": "Police signage Police misconduct proceedings against a chief constable which cost almost £ 350,000 of public money \"could--and should--have been avoided\" , a panel has ruled. Simon Byrne was suspended as chief constable of Cheshire Constabulary last year after being accused of breaching standards of professional behaviour in respect of authority, respect and courtesy and discreditable conduct. At a hearing at Warrington Town Hall on Tuesday, police and crime commissioner <mark>David Keane</mark> said the panel, led by Rachel Crasnow QC, had found no allegations of misconduct or gross misconduct were proved against Mr Byrne. No misconduct allegations against Simon Byrne were proved (Cheshire Constabulary/PA) The 55-year-old, whose contract with the force has expired since his suspension, said he was pleased to have been \"totally exonerated\" following the allegations he bullied and belittled staff after moving from the Met Police to take up the top role at the Cheshire force in 2014. In its report, the panel said: \"This misconduct panel has been an unfortunate experience for all concerned and our overriding conclusion is that it could--and should--have been avoided .\" We have reflected at length on the circumstances which led to such a time consuming (and costly) process being used to try and resolve what was essentially a clash of cultures, personalities and attitudes within Cheshire Constabulary following Mr Byrne's arrival. \"The panel, which found a number of the 74 allegations were exaggerated by witnesses, said guidance and mentoring for chief constables should be welcomed by police forces to prevent a similar situation. The misconduct hearing in July was told Mr Byrne had a reputation for being like Darth Vader and treated junior officers and staff like\" roadkill \". The panel heard he handed pictures of Dad's Army characters to officers after he became angry when flooding made him late for work. However in its report, it found the incident was an example of Mr Byrne's\" approach to leadership \"and it was wrong to attribute\" malevolent intent \"to it. Speaking after the hearing, Mr Byrne said:\" This whole affair has been an ordeal for all parties that has gone on too long and wasted precious public money scrutinising my conduct when leading what Mr <mark>Keane</mark> has described himself as a high performance force. \"He added:\" In some ways, it still feels like upside down justice as I have lost my vocation after 35 years of public service. \"I have today released the Independent Panel's report in the gross misconduct proceedings against former Chief Constable Simon Byrne. My statement is below and you can read the full report here ➡ ️ https: //t.co/oidcnDDgxM pic.twitter.com/NBE6BxseX3--<mark>David Keane</mark> (@ CheshirePCC) December 11, 2018 Mr <mark>Keane</mark> said the proceedings had cost just under £ 350,000 but his office had made savings much greater than that amount over the past couple of years. He said:\" What's really important to me is that we followed a statutory, laid down procedure with the Police (Conduct) Regulations, that we have had an open, transparent hearing and that we have had accountability within policing. \"That's my job as police and crime commissioner, to ensure we have an open and transparent police service and that I ensure the police service is accountable to everybody it serves .\" Joanne Moorcroft, secretary of the Cheshire Police branch of Unison, said the branch was \"extremely disappointed\" by the outcome of the hearing. She said: \"A number of our members have shown immense courage and bravery to come forward with their concerns about the behaviour of Mr Byrne .\" Every one of them genuinely believed and still believes that they were the victim of bullying and inappropriate behaviour. \""}, {"articleID": "2018110619_00391034_W", "names": {"John Alexander": ["Q1281683", "Q15130097", "Q15485788", "Q17984377", "Q18637103", "Q23580725", "Q30314318", "Q30610836", "Q3180874", "Q3180876", "Q43126666", "Q43396031", "Q43913359", "Q6105197", "Q6218537", "Q6218545", "Q6218548"]}, "date": "2018-11-06", "url": "http://harrowtimes.co.uk/news/national/17205552.michelin-to-consider-scottish-government-proposals-to-prevent-plant-closure/", "content": "Michelin factory closure 0 comments Michelin has agreed to consider Scottish Government proposals that could save its closure-threatened Dundee tyre plant, MSPs have been told. Scottish Economy Secretary Derek Mackay said an action group, which he will chair, has been established to develop the proposition and it will meet in the city on Monday. Mr Mackay said: \"We're aware that this task is not easy one, and there are significant challenges to be faced .\" But we are, as a government, determined to do everything within our power, to prevent this closure. \"Economy Secretary Derek Mackay met workers at the plant on Tuesday (Andrew Milligan/PA) The developments emerged after the company announced that the tyre factory, which has 845 workers, will cease production within two years. Dundee City Council leader <mark>John Alexander</mark> has described the proposed shutdown as a\" body blow \"for all of the staff. A meeting was held on Tuesday at the plant, while production has been suspended until Thursday to allow employees to digest the news. Mr Mackay, who was in Dundee on Tuesday to meet representatives from Michelin, the Unite union and Dundee City Council, later returned to the Scottish Parliament to update MSPs on the situation. He said he met Michelin group executives on Sunday with Scottish Enterprise and\" they have agreed to consider a proposition we will bring forward to secure a sustainable future for the plant \". The Michelin plant will remain closed until Thursday morning (Andrew Milligan/PA) Mr Mackay told the chamber that\" good will \"between unions and Michelin was part of the reason Michelin is willing to listen to the proposition. He said:\" Michelin's announcement that it intends to close its plant in Dundee is devastating, not just for those who work at the plant but their families and the whole of the city of Dundee and the wider area. \"The Scottish Government will do all we can to secure a future for the plant and the workforce .\" Let me be clear--we will leave no stone unturned in our efforts to keep this plant operation in Dundee. \"Our top priority is to pursue options for the site to continue with commercial production .\" Potential options include \"repurposing\" the factory to do other work for Michelin. The market for premium smaller tyres such as those produced at the Tayside factory has dropped significantly due to an increase in cheap imports from Asia and a shift to larger car tyres, according to the French firm. It says it is not economically viable to produce small, low-cost tyres at the Dundee site or switch to the production of larger tyres. The plant opened in 1972 is due to cease operations by mid-2020. Unite said it had been working on a \"flexibility agreement\" involving voluntary redundancies and changes to the shift patterns over the last two months to secure the factory's future. It said it was given no notice of Monday evening's announcement. Many workers said they found out via the news and social media. Marc Jackson, Unite Michelin convener, said: \"It is important to stress to the workforce and the wider community in Dundee that Unite has a viable plan on the table .\" The flexibility agreement, which we believed would be signed-off this week, takes into consideration the current challenging market conditions but we have a plan in place to manage this situation over the coming years. \"The workforce can be assured that Unite will work tirelessly to ensure that this flexibility agreement is reconsidered by the Michelin Group and that the factory can stay open .\" Marc Jackson, Unite Michelin convenor said: \"To stress to the workforce and the wider community in Dundee, Unite has a viable plan on the table. It is a plan that can work for the workforce and the company .\" pic.twitter.com/T8gAfiJ4kX--Unite Scotland (@ UniteScotland) November 6, 2018 Dundee East MSP Shona Robison said all options would be looked at. She said: \"It's not going to be easy but one thing that really comes through is just how strong the workforce is .\" Dundee is part of a £ 350 million Tay Cities Deal aimed at boosting economic growth in the region through investment from both the Scottish and UK Governments. Mr Mackay has called on the UK Government to bring forward additional measures and investment in light of Michelin's announcement. Labour MSP Jenny Marra told the Scottish Parliament the proposed £ 350 million for the Tay Cities deal \"will not now touch the sides, especially as investments will go to other parts of the region\". Michelin said it would provide a personalised support package for each worker, with the opportunity to train in new skills and the possibility of being redeployed within the company or elsewhere. It will begin a consultation with employees and trade unions on the closure plan over the next fortnight. 0 comments"}, {"articleID": "2019060217_00201203_W", "names": {"John Roberts": ["Q11153", "Q14949621", "Q16196671", "Q19325651", "Q20895752", "Q21542199", "Q2913257", "Q320178", "Q41805076", "Q44155502", "Q47430963", "Q54610143", "Q56187938", "Q56253587", "Q56597924", "Q6255164", "Q6255170", "Q6255174", "Q6255177", "Q6255184", "Q6255195", "Q6255202"]}, "date": "2019-06-02", "url": "http://wboc.com/story/40578763/protest-in-hungary-over-govt-plan-to-seize-research-network", "content": "Protest in Hungary over govt plan to seize research network - WBOC-TV 16, Delmarvas News Leader, FOX 21 - Protest in Hungary over govt plan to seize research network - WBOC-TV 16, Delmarvas News Leader, FOX 21 - Member Center: Protest in Hungary over govt plan to seize research network Posted: Friday, May 31 2019 6:11 PM EDT 2019-05-31 22:11:21 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:42 GMT Scientists tasked with reviewing the government's plans to lift protections for gray wolves across most of the U.S. say the proposal has numerous factual errors and other problems. More Scientists tasked with reviewing the government's plans to lift protections for gray wolves across most of the U.S. say the proposal has numerous factual errors and other problems. More Friday, May 31 2019 2:51 PM EDT 2019-05-31 18:51:17 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:41 GMT (Summit County Solid Waste Collection Office via AP). This undated photo provided by the Summit County Solid Waste Collection Office on Friday, May 24, 2019, shows deer near a landfill at the Three Mile Canyon Landfill in Coalville, Utah. The Division...(Summit County Solid Waste Collection Office via AP). This undated photo provided by the Summit County Solid Waste Collection Office on Friday, May 24, 2019, shows deer near a landfill at the Three Mile Canyon Landfill in Coalville, Utah. The Division...The Division of Wildlife Resources has announced their findings from their investigation into the cause of death for more than 30 deer near a landfill in northeast Utah. More The Division of Wildlife Resources has announced their findings from their investigation into the cause of death for more than 30 deer near a landfill in northeast Utah. More Sunday, June 2 2019 9:11 AM EDT 2019-06-02 13:11:10 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:28 GMT President Donald Trump claims Mexico has taken advantage of the United States for decades but that the abuse will end when he slaps tariffs on Mexican imports next week in a dispute over illegal immigration. More President Donald Trump claims Mexico has taken advantage of the United States for decades but that the abuse will end when he slaps tariffs on Mexican imports next week in a dispute over illegal immigration. More Sunday, June 2 2019 7:31 AM EDT 2019-06-02 11:31:14 GMT Updated: Sunday, June 2 2019 1:31 PM EDT 2019-06-02 17:31:26 GMT (Courtesy City of Virginia Beach via AP). This combination of photos provided by the City of Virginia Beach on Saturday, June 1, 2019 shows victims of Friday's shooting at a municipal building in Virginia Beach, Va.. Top row from left are Laquita C. Bro...(Courtesy City of Virginia Beach via AP). This combination of photos provided by the City of Virginia Beach on Saturday, June 1, 2019 shows victims of Friday's shooting at a municipal building in Virginia Beach, Va.. Top row from left are Laquita C. Bro...The 11 city employees among the 12 people killed by a gunman at a Virginia Beach government building had worked for the community for a total of more than 150 years. More The 11 city employees among the 12 people killed by a gunman at a Virginia Beach government building had worked for the community for a total of more than 150 years. More More BUDAPEST, Hungary (AP) - A few thousand mostly academics and students held a protest march against a plan by Prime Minister Viktor Orban's government to seize control of the research network of the Hungarian Academy of Sciences. Critics say the government plan threatens academic freedom and autonomous scientific research in Hungary, a \"de facto nationalization of the academy's property\" which would put scientific research under close government scrutiny. The government, which held several rounds of unsuccessful talks with the academy, says its wants to improve innovation in scientific research and have publicly funded research projects that create \"direct economic profit .\" Viktor Oliver Lorincz, a junior research fellow attending Sunday's march, said \"we don't want to belong to the government because we are afraid that the government will decide what we should research .\" Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Sunday, June 2 2019 1:31 PM EDT 2019-06-02 17:31:18 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:41 GMT A few thousand mostly academics and students held a protest march against a plan by Prime Minister Viktor Orban's government to seize control of the research network of the Hungarian Academy of Sciences. More A few thousand mostly academics and students held a protest march against a plan by Prime Minister Viktor Orban's government to seize control of the research network of the Hungarian Academy of Sciences. More Sunday, June 2 2019 5:41 AM EDT 2019-06-02 09:41:03 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:15 GMT (Peter Klaunzer/Keystone via AP). U.S. Secretary of State Mike Pompeo, front left, and his wife Suzan, front center, listen to a tourist guide during a sightseeing walk as part of Pompeo's visit in Bern, Switzerland, Saturday, June 1, 2019. (Peter Klaunzer/Keystone via AP). U.S. Secretary of State Mike Pompeo, front left, and his wife Suzan, front center, listen to a tourist guide during a sightseeing walk as part of Pompeo's visit in Bern, Switzerland, Saturday, June 1, 2019. U.S. Secretary of State Mike Pompeo is holding talks with his Swiss counterpart expected to focus on Iran. More U.S. Secretary of State Mike Pompeo is holding talks with his Swiss counterpart expected to focus on Iran. More Sunday, June 2 2019 4:31 AM EDT 2019-06-02 08:31:01 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:08 GMT (AP Photo/Michael Sohn, file). FILE--In this Monday, May 27, 2019 photo taken with a long time expsure Andrea Nahles, chairwomen of the German Social Democratic Party (SPD), leaves after a press conference following a party's board meeting in Berlin,...(AP Photo/Michael Sohn, file). FILE--In this Monday, May 27, 2019 photo taken with a long time expsure Andrea Nahles, chairwomen of the German Social Democratic Party (SPD), leaves after a press conference following a party's board meeting in Berlin,...The leader of Germany's center-left Social Democrats, a junior party in Chancellor Angela Merkel's governing coalition, is resigning after poor elections results. More The leader of Germany's center-left Social Democrats, a junior party in Chancellor Angela Merkel's governing coalition, is resigning after poor elections results. More Sunday, June 2 2019 1:11 PM EDT 2019-06-02 17:11:15 GMT Updated: Sunday, June 2 2019 1:32 PM EDT 2019-06-02 17:32:07 GMT (Kirsty O'Connor / PA via AP). Veteran <mark>John Roberts</mark>, 95, in a jeep as he arrives to the cruise terminal to board the MV Boudicca, seen behind, ahead of its departure from the port of Dover, England, Sunday June 2, 2019, for a trip to France arranged by t.. . (Kirsty O'Connor / PA via AP). Veteran <mark>John Roberts</mark>, 95, in a jeep as he arrives to the cruise terminal to board the MV Boudicca, seen behind, ahead of its departure from the port of Dover, England, Sunday June 2, 2019, for a trip to France arranged by t.. . About 300 veterans of the Normandy invasion have left Dover, England for a six-day trip that will take them back to the landing beaches on the 75th anniversary of D-Day. More About 300 veterans of the Normandy invasion have left Dover, England for a six-day trip that will take them back to the landing beaches on the 75th anniversary of D-Day. More"}, {"articleID": "2014012720_00034842_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}, "date": "2014-01-27", "url": "http://www.jewishpress.com/news/breaking-news/largest-knesset-delegation-ever-tours-auschwitz/2014/01/27/?utm_source=rss&utm_medium=rss&utm_campaign=largest-knesset-delegation-ever-tours-auschwitz", "content": "tell a friend Dozens of lawmakers from Israel, the United States and Europe convened at the former Nazi death camp of Auschwitz-Birkenau for ceremonies commemorating its liberation 69 years ago. The largest foreign parliamentary delegation landed in Poland from Israel on Monday, Jan. 27 - the day that the United Nations in 2005 designated as International Holocaust Remembrance Day - and consisted of 58 Knesset members. Constituting nearly half of the Israeli parliament, it is the largest Knesset delegation ever to have visited the Auschwitz compound, organizers said. Several Knesset members, including Economy Minister Naftali Bennett, attended a solemn prayer led by Israel's Chief Ashkenazi rabbi, David Lau, near the famous \"Arbeit macht frei\" (\"Work will make you free\" ) sign at the entrance to the Auschwitz camp. The U.S. delegation is headed by Rep. Eric Cantor, a Virginia Republican and first Jewish majority leader of Congress. With Cantor are Reps. Darrell Issa (R-Calif .) and Carolyn Maloney (D-N.Y.). They are scheduled to be joined by 23 lawmakers from 10 European Union member states who came with European Friends of Israel and the Israeli-Jewish Congress. In Krakow, the Knesset delegation is scheduled to hold a ceremonial inter-parliamentary session with the Polish parliament, the Sejm. \"When we say\" Never Again,' we can say it because there is a Jewish state and a Jewish army, \"the event's Israeli initiator, Johnny Daniels, told JTA on Monday .\" The presence of half the Israeli parliament in Auschwitz is a powerful symbol for that reason. \"Daniels, a 28-year-old Britton who immigrated to Israel 10 years ago, began producing the event six months ago as executive director of From the Depths, a nongovernmental organization dedicated to Holocaust education .\" Holocaust survivors are dying fast and it was important for us to create a platform where their voice will be heard, \"he said. The ceremony at Auschwitz will be attended by 24 Holocaust survivors. He also said that the attendance of Sejm lawmakers signifies their government's dedication to commemorating the Holocaust and that\" Poles, too, have been victimized by Nazi Germany. \"tell a friend About the Author: If you don't see your comment after publishing it, refresh the page .\" If we prohibit it [circumcision], we must also address the issue of the Christian ritual of baptism. \"Any permanent agreement with Iran\" cannot succeed if its President Hassan Rouhani acts according to its words, Prime Minister Binyamin Netanyahu told the weekly Cabinet meeting Sunday in his report on conversations at last week's World Economic Forum at Davos. \"Rouhani said that Iran was against international involvement in Syria, but Iran is the country [...] Bill de Blasio, New York's newly installed mayor said,\" Part of my job description is to be a defender of Israel \"while speaking at a private New York event of the American Israel Public Affairs Committee (AIPAC).\" There's no greater ally on earth, and that's something we should say proudly, \"he said last Thursday, as [...] Israeli negotiators are discussing a series of limited withdrawals linked to progress by the Palestinian Authority in maintaining security, a senior Palestinian official said. The withdrawals are part of a plan for a peace agreement being brokered by U.S. Secretary of State <mark>John Kerry</mark>, according to an interview with Yasser Abed Rabbo published in the [...] Secretary of State <mark>John Kerry</mark> is obsessed with forcing a\" Peace Process \"on Israel because...He has no clue how to deal with serious problems, such as Syria. He thinks it will win him a Nobel Prize. He doesn't understand how dangerous what he is doing is. He just wants the frequent flyer miles. He wants Hamas and Islamic Jihad to take over the Palestinian Authority, and needs Israel out of Judea & Samaria to accomplish that. The Jewish Press. All rights reserved. No portion of this website may be copied without the express written permission of JewishPress.com."}, {"articleID": "2015081116_00139331_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"], "Andy Hunter": ["Q1854083", "Q4207488", "Q526207"]}, "date": "2015-08-11", "url": "http://www.thisisanfield.com/2015/08/skrtel-and-lovren-are-rodgers-preferred-pairing-at-centre-half/", "content": "Share Tweet Martin Skrtel and Dejan Lovren linked up alongside each other for Liverpool's opening fixture against Stoke City on Sunday and are set to become <mark>Brendan Rodgers</mark> \"preferred centre-back pairing. It may not be the pairing that most supporters would go for--last week a poll on This Is Anfield suggested over 90% favoured a partnership of Skrtel and Mamadou Sakho--but it now looks like <mark>Rodgers</mark> has made his choice. Sakho was absent from the matchday squad on Sunday, but did travel to the Britanna Stadium. His absence was attributed to the fact he missed three days of training in the build up to the game after the birth of his second child. However, reports claim <mark>Rodgers</mark> had chosen Lovren ahead of Sakho regardless:\" <mark>Rodgers</mark> had already decided to start the season with Dejan Lovren alongside Martin Skrtel in central defence and the Croatia international responded with an assured display in the 1-0 victory, \"writes <mark>Andy Hunter</mark> in the Guardian. Despite most thinking the Frenchman is a far superior option to Lovren, he is now to be considered a back-up option by the manager. The Telegraph\" s Chris Bascombe explains in Tuesday's paper: \"Sakho must wait for his opportunity after <mark>Rodgers</mark> made it clear Dejan Lovren and Martin Skrtel are his preferred pairing at centre-half. Lovren responded to that show of faith with his most accomplished performance since joining Liverpool .\" Given that <mark>Rodgers</mark> had spoke in pre-season of wanting consistency in defence this season, it leaves Sakho's Liverpool future in doubt. Sakho joined Liverpool for & pound; 18 million from PSG in 2013, heralded at the time by <mark>Rodgers</mark> as the future of the Reds' defence, along with Tiago Ilori--who is yet to make a senior appearance for the club. \"Centre-halves are so hard to find. You look at some teams and they have ageing centre-halves because it's a struggle to get a really good one. We were fortunate in that two became available,\" said <mark>Rodgers</mark>. On Ilori, <mark>Rodgers</mark> said: \"He is 6ft 3ins tall, super quick, powerful and can jump. He just needs to adapt to the pace and physicality of the Premier League. He is one for the future, but he can be a really big talent .\" Sakho, the manager described: \"Sakho is also young, but he is an experienced player. He has senior international caps for France and looks an absolute monster in training. He's one who is ready for now and that's what we want .\" We had a chance to do that and protect the club for maybe the next 10 years and that is what we've done. \"Two years later and neither appear to have a future at the club. RELATED: Sakho is\" the best defender we have \", says former Liverpool striker ARCHIVE: Dispelling the myth that Sakho is clumsy (Part 2) Share Tweet More: <mark>Brendan Rodgers</mark>, Dejan Lovren, Mamadou Sakho, Martin Skrtel"}, {"articleID": "2017113002_00043849_W", "names": {"David Duke": ["Q163042", "Q5233100"]}, "date": "2017-11-30", "url": "https://indaily.com.au/news/2017/11/30/uk-slams-trumps-anti-muslim-tweets/", "content": "President Trump sparked conflict with the UK over retweeting material from a fringe British political group. EPA photo The tweets drew a sharp condemnation from British Prime Minister Theresa May's office, which said it was \"wrong for the president to have done this .\" Brushing off the criticism in an evening tweet, Trump said May instead of focusing on him should \"focus on the destructive Radical Islamic Terrorism that is taking place within the United Kingdom .\" Trump had turned away from taxes, North Korea and other issues facing his administration to share the three videos tweeted by Jayda Fransen, deputy leader of the British group. It was not clear what drew him to the videos, though one had been shared by conservative commentator Ann Coulter the day before. Advertisement White House spokeswoman Sarah Huckabee Sanders said Trump was simply promoting border security and suggested that verifying the content was not a top concern. \"Whether it's a real video, the threat is real and that is what the president is talking about,\" she said. The tweets read: \"VIDEO: Islamist mob pushes teenage boy off roof and beats him to death!\" and \"VIDEO: Muslim Destroys a Statue of Virgin Mary!\" and \"VIDEO: Muslim migrant beats up Dutch boy on crutches!\" His promotion of the videos came two days after he mocked Senator Elizabeth Warren as \"Pocahontas\" during an Oval Office event with Native American veterans, drawing criticism from of Native American war veterans and politicians of both major parties. Trump's retweets have given a wide platform to the previously obscure group. The videos were each shared more than 10,000 times, and Fransen picked up nearly 10,000 Twitter followers in the hours following Trump's retweets. She thanked him on Twitter, saying \"GOD BLESS YOU TRUMP!\" Former Ku Klux Klan leader <mark>David Duke</mark> also welcomed the videos, tweeting that Trump was being \"condemned for showing us what the fake news media WON'T. Thank God for Trump! That's why we love him!\" --AP We value local independent journalism. We hope you do too. InDaily provides valuable, local independent journalism in South Australia. As a news organisation it offers an alternative to The Advertiser, a different voice and a closer look at what is happening in our city and state for free. Any contribution to help fund our work is appreciated. Please click below to become an InDaily supporter. Powered by PressPatron Advertisement Jump to next article"}, {"articleID": "2014091114_00088610_W", "names": {"Peter Cooper": ["Q2075218", "Q22003710", "Q39078607", "Q7173381"], "Steve Earle": ["Q17542895", "Q7612450", "Q781634"]}, "date": "2014-09-11", "url": "http://sj-r.com/article/20140911/ENTERTAINMENTLIFE/140919988/10295/ENTERTAINMENT", "content": "There's often room in the day for the music of the British invasion, or electronic dance music from the European continent, or quirky pop from Down Under. This weekend, however, is not that time. The American Music Show on Friday and Saturday at Donnie's Homespun, 107 W. Cook St. at the Vinegar Hill Mall, celebrates roots music - kind of folky, a little twangy, but very definitely American-made. Scheduled to perform are longtime St. Louis band the Bottle Rockets (\"Radar Gun\" ), Texas duo The Mastersons, and several central Illinois acts. The Sangamon Valley Roots Revival and WUIS-FM are hosting the show. (The original concert lineup had Grammy Award nominees Eric Brace and <mark>Peter Cooper</mark> scheduled to perform Friday. However, late Tuesday, American Music Show producer Sean Burns announced that a back injury means Brace and <mark>Cooper</mark> have to reschedule their performance. Burns did not specify if it was Brace or <mark>Cooper</mark> who was hurt .) The Bottle Rockets had a minor hit in the mid-1990s with \"Radar Gun,\" and their 2011 album \"Not So Loud: An Acoustic Evening with the Bottle Rockets\" landed on the Billboard magazine charts. The Mastersons - a Texas husband-and-wife duo of Chris Masterson (guitar) and Eleanor Whitmore (fiddle) - will fill the Brace and <mark>Cooper</mark> slot on Friday. The duo performs in <mark>Steve Earle</mark>'s band in addition to writing and recording their own music. Tickets cost $20 per day, or $30 for a two-day pass. Tickets are available online at www.bedrock66.com, or via BrownPaperTickets.com. The music festival schedule follows: FRIDAY 6:30 p.m.: The Whistle Pigs 7:45 p.m.: The Mastersons 9:30 p.m.: The Chris Casello Trio SATURDAY (outdoor and indoor stages) 3 p.m.: Big Storm 4:15 p.m.: Owen and Dooley Present...5:30 p.m.: Wolf Crick Boys 6:45 p.m.: Crankshaft & The Gear Grinders 8 p.m.: The Blue Ribbon Revival 8:15 p.m.: JP Harris & The Tough Choices 10 p.m.: The Bottle Rockets"}, {"articleID": "2019061603_00232819_W", "names": {"Carrie Lam": ["Q19217", "Q5046264"]}, "date": "2019-06-15", "url": "http://www.newcastlestar.com.au/story/6219240/hk-readies-for-new-protests-by-residents/?cs=7314", "content": "HK readies for new protests by residents whatsapp Hong Kong's Chief Executive <mark>Carrie Lam</mark> has sidestepped questions over whether she should quit. Thousands of Hong Kong residents are expected to return to the streets on Sunday to protest a controversial extradition bill, which the government has decided to suspend under pressure from massive protests in the past week. Protesters said on Saturday afternoon that Hong Kong leader <mark>Carrie Lam</mark>'s about-face decision to put the bill on ice did not appease them. \"I think the majority of Hong Kong people will not accept temporary suspension,\" said protester Thomas Hong, who was participating in a 10-person hunger strike outside government offices. <mark>Lam</mark> said she decided to suspend the proposed legislation, which is controversial because it would allow extraditions to China, as much of the public still has \"concerns and doubts about the bill .\" She emphasised the bill would not be revoked but simply suspended for further consultation. Protest organiser Civil Human Rights Front said Sunday's rally will serve to condemn the excessive use of force against demonstrators in the past week. Police used tear gas, pepper spray and rubber bullets against protesters on Wednesday, injuring 81 people. The organisers say they wanted to see the bill fully revoked and for <mark>Lam</mark> to step down. They were also asking the government to reclassify Wednesday's rally from riot to protest and release and not prosecute those arrested. Anger at the bill has united Hong Kong in a way not seen since major pro-democracy protests in 2014, as many fear it is a sign that the city is losing its autonomy to China. Australian Associated Press"}, {"articleID": "2011092903_00065455_W", "names": {"Jose Reyes": ["Q220096", "Q282400", "Q6293856"], "Ryan Braun": ["Q1207567", "Q3453746"], "Miguel Cabrera": ["Q51612870", "Q735354"], "Michael Young": ["Q1046185", "Q15459736", "Q16192997", "Q1623168", "Q1929672", "Q21544347", "Q27995845", "Q30316180", "Q3856305", "Q51589256", "Q55361215", "Q6835494", "Q6835498", "Q6835499", "Q6835500"], "Jose Bautista": ["Q1346122", "Q32406"], "Mark Reynolds": ["Q1047714", "Q1265875", "Q16223397", "Q26936702", "Q928463"], "Ichiro Suzuki": ["Q27997082", "Q57064719", "Q5986296", "Q600"], "Randy Johnson": ["Q11347558", "Q123682", "Q17627788", "Q7292262", "Q7292263", "Q7292264"], "Ian Kennedy": ["Q1057322", "Q5981957", "Q5981959"], "James Shields": ["Q1150839", "Q6201270"], "Cliff Lee": ["Q5132668", "Q57413517", "Q978930"]}, "date": "2011-09-29", "url": "http://uk.news.yahoo.com/reyes-wins-batting-title-cabrera-nears-al-crown-030540297.html", "content": "new york (ap) - <mark>jose reyes</mark> became the first player in the new york mets' half-century history to win a national league batting title, edging milwaukee's <mark>ryan braun</mark> by five percentage points in a controversial finish wednesday. perhaps playing his final game for the mets, <mark>reyes</mark> led <mark>braun</mark>.336 to .335 at the start of the day. <mark>reyes</mark> bunted for a hit in the first inning of new york's game against cincinnati and then left the game with a .337 average. that led <mark>braun</mark> needing to go 3 for 4 or better in milwaukee's regular-season finale against pittsburgh, but <mark>braun</mark> had an 0-for-4 night and wound up at .332. detroit's <mark>miguel cabrera</mark> was pretty much assured of the al batting crown when he finished with a .344 average, with boston's adrian gonzalez and the texas rangers' <mark>michael young</mark> at .338. while <mark>young</mark> was done for the regular season, the red sox were in a seventh-inning rain delay when the tigers game ended. fans at citi field booed when <mark>reyes</mark> came out. \"it was kind of tough,\" said <mark>reyes</mark>, who can become a free agent after the world series. \"i want to stay in the game. they have to understand, too, what's going on. they have to feel happy about it if i win the battling title .\" that he did, about 9? hours after taking his final swing of the year. \"i'm not going to judge him,\" <mark>braun</mark> said. \"i respect whatever decision he decided to make and ultimately, he left the door open for me .\" toronto's <mark>jose bautista</mark> won his second straight major league home run title with 43, while the brewers' prince fielder and the dodgers' matt kemp were tied for the nl lead with 38, with kemp still having a few innings to add. after threatening to become the first triple crown winner since boston's carl yastrzemski in 1967, kemp faded from the batting race and had a .324 average entering the final day. kemp led the nl with 124 rbis, and the yankees' curtis granderson topped the al with 119, one more than teammate robinson cano and two in front of boston's adrian gonzalez. cincinnati's drew stubbs struck out 205 times, ending <mark>mark reynolds</mark> three-year run as strikeout king. adam dunn of the white sox hit just .159, but didn't play wednesday and finished with 496 plate appearances, six shy of qualifying. the post-1900 record low among qualifiers was set by rob deer at .179 in 1991. eugenio velez of the dodgers entered his last game 0 for 36, a record for at-bats by a position player without a hit, topping hal finney's 0 for 35 with pittsburgh in 1936. hitless in 45 at-bats since may 2010, velez tied the modern record for non-pitchers shared by pittsburgh's bill bergen (1909), dave campbell of san diego and st. louis (1973) and milwaukee's craig counsell (this season). seattle's <mark>ichiro suzuki</mark> started the night with 184 hits, ending his record streak of 10 consecutive 200-hit seasons. while starlin castro (206) was assured of the nl hits title, <mark>young</mark> led the al with 213, one ahead of gonzalez and red sox teammate jacoby ellsbury. <mark>bautista</mark> (.608) and <mark>braun</mark> (.597) led in slugging percentage, and <mark>bautista</mark> (.447) and cincinnati's joey votto (.416) topped on-base percentage, with votto on track to head the nl for the second straight season. atlanta's michael bourn swiped two bases and his 61 steals and will lead the nl for the third straight year, while oakland's coco crisp and the yankees' brett gardner shared the al lead with 49. among pitchers, detroit's justin verlander at 24-5 had the most wins in the majors since arizona's <mark>randy johnson</mark> in 2002. verlander also won the al era (2.40) and strikeouts (250) titles, becoming the first winner of a pitching triple crown since san diego's jake peavy in 2007. clayton kershaw of the dodgers led the nl in era (2.28) and strikeouts (248) and tied arizona's <mark>ian kennedy</mark> for the lead in wins (21). tampa bay's <mark>james shields</mark> had 11 complete games, the first in double digits since <mark>johnson</mark>'s 12 in 1999, and philadelphia's <mark>cliff lee</mark> became the first pitcher with six shutouts since tim belcher's eight for the dodgers in 1989. copyright 2011 the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2014082201_00007695_W", "names": {"Craig Thomas": ["Q3002075", "Q979098"], "Ben Cameron": ["Q23796181", "Q4885386"]}, "date": "2014-08-21", "url": "http://www.queenslandcountrylife.com.au/news/agriculture/sheep/general-news/spring-lamb-set-for-a-leap/2709189.aspx?src=rss", "content": "Not only have yardings fluctuated considerably between weeks, but the quality hahas also varied MORE new season lambs may be on the market than normal for this time of year in some districts, but they certainly aren't helping to keep indicator prices high. Lower old season lamb prices weighed down the Eastern States Trade Lamb Indicator (ESTLI) last week resulting in a slip of about 20 cents a kilogram to 472c/kg. Mecardo market analyst Augusto Semmelroth said lamb markets had been relatively volatile during the past few weeks. He said weekly saleyard numbers had varied some 20 to 30 per cent week-on-week. \"Not only have yardings fluctuated considerably between weeks, but the quality of animals on offer has also varied, adding some extra volatility to Meat and Livestock Australia's National Livestock Reporting Service (NLRS) State indicators,\" Mr Semmelroth said. \"Despite the increasing number of new season lambs being consigned, they are still the minority of total yardings .\" As a result, the lower prices paid for old season lambs in plain condition continues to impact negatively on the overall performance of most indicators. \"Mr Semmelroth said the past week's rain might entice some producers to hold stock to heavier weights or restrict numbers of stock in plain condition from reaching the market .\" This could give some support for prices this week, \"he said. Although lamb supply at Cowra was reduced, the number of new season lambs dominated the yarding last Friday. Of the 6000 lambs offered, about 4000 of those were new season lambs. NLRS reported competition was good resulting in a firm to slightly dearer market. As a result, medium and heavy trade weight new season lambs were firm and averaged about 515c/kg. About 40pc of the yarding were young lambs from 22kg to 24kg and they topped at $128 a head. Old lamb of similar weight, by comparison, topped at $112 a head. Forbes Livestock and Agency Company director Tim Mackay said at Forbes on Tuesday the new season lambs made up about 50 per cent of the lamb yarding .\" There seems to be plenty of them about from the traditional supply areas and in the next few weeks I expect they will really start to flow into the market, \"he said. In the north of the State, Colin Say and Company agent <mark>Craig Thomas</mark> said the supply of new season lambs would be about three months away .\" The (dry) season has really had a big influence on the supply of lambs in this region, \"he said .\" Lots of lambs were sold into the south earlier in the year so we have few lambs being offered on the Northern Tablelands at the moment, \"he said. In the Tamworth district, Davidson <mark>Cameron</mark> McCulloch and Company branch manager Daniel McCulloch said there would be a gap in supply between the old lambs and new spring lambs .\" We are almost at the end of the old lambs and many people are choosing to send them into the sales at 19kg to 20kg rather than try to put more weight on them at this stage in the season, \"he said .\" The new season lambs are probably going to be a bit later than normal so I expect we will start to see the bulk of them starting to flow in late September and into October. \"Meanwhile, over-the-hooks lamb rates slipped another 10c/kg. Processors claim they have reduced price grids due to the number of new season lambs on the market. The 20kg to 22kg lambs have averaged 488c/kg, while the 24kg to 26kg category was on about 485c/kg. Wagga suckers limited but season shapes up well WITH plenty of old season lambs still on the market, the prime lamb sale at Wagga Wagga last week was as much as $10 a head cheaper. G.J. Hulm and Company agent Tyler Pendergast, Tumut, said it could be another month before new season lambs dominated the yardings at Wagga .\" At the sale last Thursday the suckers would have been about $10 a head cheaper, while the plainer, old lambs sold for even less, \"he said. To put supply into perspective, Mr Pendergast said in a yarding of about 30,000 lambs last week only 8000 were new season .\" By the middle of September there should be a few more spring lambs being offered and from what I've seen in clients' paddocks they are growing very well, \"he said .\" The mild winter and good feed mean the lambs are coming along really well and I expect when they are ready for market there will be some top lines being offered. \"Mr Pendergast, (pictured with colleague Mal Vogan, Tumbarumba, at last week's lamb sale) said sucker lambs were on par with previous years .\" I wouldn't say they are any earlier or later than past years, \"he said .\" We didn't get a lot of rain during the weekend like some of the northern areas of State did, but I expect it might mean the flow of lambs in the north will steady up. \"AgForce's Stacey Milner talks rural finance with Bentley's managing director <mark>Ben Cameron</mark>. Well the farmers and country people think labour are a bad party. however Labour have always SEVEN young beef producers travel to Canberra next week to participate in the Beef Industry Rising Champions Initiative. MORE new season lambs may be on the market than normal for this time of year in some districts, but they certainly aren't helping to keep indicator prices high. FRESH from setting up a new bulk grain port terminal in Bunbury, WA, Bunge Australia has announced plans for a new export facility in Geelong, Victoria. Connecting Livestock Buyers & Sellers: Your one-stop shop for livestock news, reports and sale listings."}]