[{"articleID": "2012022815_00044277_W", "names": {"Thomas Gardner": ["Q1617711", "Q27902488", "Q27924881"]}, "date": "2012-02-28", "url": "http://xconomy.com/new-york/2012/02/28/keyview-launches-with-plan-to-fund-health-startups/", "content": "keyview partners-headed up by veterans of ernst & young, deloitte & touche, and johnson & johnson-is set to open its doors next month in new york, with a plan to fund medical-technology startups. according to its website, the company's goal is to \"bring together capital, operational expertise, and strategic planning.\" keyview's ceo, david shrier, was an entrepreneur in residence at ernst & young, and prior to that, he led innovation initiatives at walt disney, nbc universal, and other companies. chairman <mark>thomas gardner</mark> is a turnaround specialist who worked at procter & gamble, simon & schuster, and ims health, and was vice president of j & j's mcneil consumer products co. vice chairman richard shanley spent 25 years as an audit partner at deloitte, where he worked with a range of private and public companies. shrier told venturewire that keyview is finalizing its first investment and seeks to make as many as 10 more in the next year. the firm plans to invest in health it, pharmaceuticals, and medical device startups. the initial pool of capital will come from the founders and high net worth individuals, shrier told venturewire, and the company may eventually launch a formal fund worth $250 million to $300 million. you will have 10 minutes to edit your post after you press publish. comments may be edited for clarity and length, rejected, or deleted. fashion tech startups emerging from harvard b-school runway in droves rss business, life sciences, and technology news - covering boston, seattle, san diego, detroit, san francisco, new york and beyond."}, {"articleID": "2010012409_00051564_W", "names": {"Matt Shaw": ["Q1344750", "Q6789321"]}, "date": "2010-01-24", "url": "http://feeds.bignewsnetwork.com/?rid=31600245&cat=1e0899715fbc2697", "content": "willis, stanback stay hot as unlv scorches tcu, 79-70 red-hot duo scores 21 of rebels' final 22 points as team improves to 7-1 in true road games ron jenkins / ap unlv's tre \"von willis celebrates after hitting a three-point basket in the second half of saturday's game against tcu at daniel-meyer coliseum in fort worth, texas. notebook: competition for time bringing out the best in unlv bigs assets_url media_url story willis, stanback stay hot as unlv scorches tcu, 79-70 media_url fort worth, texas - unlv coach lon kruger admits he'd like to see some more consistent scoring threats establish themselves behind junior guard tre\" von willis and sophomore forward chace stanback. but in the meantime, boy, are those two becoming pretty fun to watch. on saturday, with tcu threatening midway through the second half, the duo combined to score 21 of the team's final 22 points, helping the rebels pull away for a 79-70 victory at daniel-meyer coliseum. willis's 30 points went in the books as a new career high, while stanback's 19 matched his career best, which was set just three days earlier at colorado state. \"defenses have to pick their poison a little bit,\" willis said. \"they've either got to focus on me or they've got to focus on chace. when they focus on me, chace steps up and knocks down shots. that's what we need. he's stepping up and playing very well right now.\" added stanback: \"when he gets the ball, i know he's gonna attack, and if he doesn't have anything, i know he's gonna look for me. we kind of feed off of each other out there.\" the two showcased their wide array of offensive abilities when things really got tense for the first time all afternoon in front of 4,270 fans in fort worth. unlv (16-4 overall, 4-2 mountain west) thoroughly controlled every aspect of the game in the first half, taking a 38-30 lead in the break. it could have easily been much larger, but tcu (10-10, 2-3) kept itself afloat by hitting a handful of timely 3-pointers. the horned frogs were just close enough that one little push could completely change things, and that happened roughly five minutes into the second half, when a quick 7-0 spurt made it a one-point game at 53-52. \"we knew we couldn't panic,\" willis said. \"we did get a little sloppy when they came back. they made that nice little run. they were at home and we knew they were going to make a run at some point. we told each other we had to take the blow, turn it on them, buckle down and finish the game.\" willis and stanback really kicked it into gear when tcu ultimately came back to tie the game at 60-60 with 8:35 left, when ronnie moss hit a layup in transition and was fouled in the process. on the heels of the old-fashioned three-point play, stanback took tcu's zvonko buljan to the rack from the left corner and dropped in a tough bucket. the next time down, he head-faked, drawing buljan into mid-air. he took a dribble and a step in, calmly cashing a 17-foot jumper. \"he's a great 16-to-18-foot shooter,\" tcu coach jim christian said. \"they ran one screen play for him that we got beat on four times that we ran through 1,000 times. maybe we should have run through it 1,004 times, i don't know.\" then it was willis's turn. on back-to-back possessions, he took advantage of a one-on-one match-up with moss. first, he backed him down off of the right wing, ultimately turning around and hitting a fading jumper off of the glass from 15 feet out. then, off of a steal, he pulled up and hit a 3-pointer in moss's face from the left wing. as he ran back down the floor, he skipped a bit, curled his lip to sneer at the crushed tcu bench and threw up three fingers on each of his hands. \"the thing i love about him from watching all the games is that he plays the game simply, and i mean that as a compliment,\" christian said. \"he understands how to catch the ball, where to catch the ball, what to do with it. he's such a hard matchup because he's got great size, he can post, he can shoot threes, he can drive the ball, he's hard to foul.\" to this point, with what i've seen, he's the best player in the league. \"that trey capped a 9-0 run put together by the pair, and in the final four minutes of the game, they simply sprinkled on some more. no other rebel scored until derrick jasper hit a free throw with 1.2 seconds left and the game already in hand. in all, willis totaled his 30 points on 9-of-14 shooting, adding six rebounds and four assists to his stat line. it was the first time in exactly two years since a unlv player reached the 30-point mark, with wink adams having last done it in a 78-71 victory over wyoming on jan. 23, 2008, with a 33-point outburst. stanback was 8-of-12 from the floor, also grabbing four defensive rebounds in 26 minutes. in reality, it was just more of the same from what is quickly emerging as the the mountain west's most deadly one-two combo on the offensive end. in six conference games, willis is averaging 24.2 points per game and is shooting 51 percent from the floor. he's scored at least 20 points now in six consecutive games. in that same stretch, stanback is averaging 14.5 points per contest on 50 percent shooting, having clearly found his groove after sitting out a year following his transfer from ucla.\" they both made big shots, played with great pace and great poise, \"kruger said.\" and we needed them all, and that's what made them more impressive. they all came at critical times, and they gave us a little bit of a cushion. \"complementing willis and stanback were the rebels' big men, who responded well across the board to a shuffle in the lineup by kruger. brice massamba started in place of <mark>matt shaw</mark> inside for the first time since dec. 12, responding with six points early in the second half. meanwhile, <mark>shaw</mark>, who turned 22 on saturday, scored 10 points off of the bench, including a pair of first half 3-pointers. darris santee, playing in his home state, scored six first half points and also grabbed two rebounds in 14 minutes of play. freshman forward nikola cerina led four horned frogs in double figures with 14 points, scoring 12 of them in the second half. the rebels joyfully left the arena and returned to las vegas after spending five days on the extended road trip having improved to 7-1 this season in true road games. they'll play league cellar dweller air force (8-10, 0-5) at at 7:30 p.m. tuesday at the thomas & mack center before an eight-day layoff. growing more and more confident on the road as the games go by, the rebels still see areas needing improvement. but for now, the league's hottest offensive combo is commanding all of the attention. great win. they were cashing 3's all day and we withstood it. next up. trap game vs. air force. let's head into the 8 day break strong! i know who was wrong! i know. i know. maybe he'll redeem himself with an air force prediction. can we get some information on the following. a) the recruitment progress of cory joseph. willis is becoming my favorite rebel since marcus banks. i love this kid's confidence and style of play. registration. comments are moderated by las vegas sun editors. our goal is not to limit the discussion, but rather to elevate it. comments should be relevant and contain no abusive language. comments that are off-topic, vulgar, profane or include personal attacks will be removed. full coverage of the international consumer electronics show full coverage of new year's eve 2009 the definitive guide to mgm mirage's newest property a collection of our favorite images that didn't run in 2009 carrot top's stage act a mask of contradictions never can get enough unlv analysis and chatter? then this is the stop for you. join the sun sports staff in the rebel room for your fix. can't make it to the game but want to know the score? our reporters on the scene will send you text messages (up to four times a game) for rebels football and basketball contests with the scores and stats you need to know. those exhausting walks in high-altitude arenas (5 comments) tarkanian: ncaa is\" the crookedest organization in our society \"unlv 1990 championship ring for sale...on ebay (10 comments) our rivalry with new mexico and playing at the pit (18 comments) projecting the mountain west's 2010 preseason football rankings"}, {"articleID": "2011121718_00031265_W", "names": {"Chris Leslie": ["Q2521367", "Q749759"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"]}, "date": "2011-12-17", "url": "http://chesterchronicle.co.uk/chester-news/uk-world-news/2011/12/17/nao-to-probe-northern-rock-sale-59067-29970719/", "content": "dec 17 2011 the controversial sale of state-owned bank northern rock will be investigated by the public spending watchdog, it has been confirmed. amyas morse, the head of the national audit office (nao), said he would examine the deal to sell the bank to sir richard branson's virgin money for? 747 million. labour has questioned the timing and value for money of the agreement, which leaves taxpayers facing a potential? 400 million-plus loss. shadow financial secretary <mark>chris leslie</mark>, to whom mr morse confirmed the probe in a letter, called for the sell-off to be delayed so that it could be pre-assessed by the nao. but the watchdog said that its role confined it to auditing a completed sale and it could not intervene in the process. chancellor <mark>george osborne</mark> insists the sell-off represents good value for money and blames labour for pushing him into a rapid disposal of the bailed-out institution. an unpublished agreement with the eu meant the government was bound to dispose of at least half of the bank, which was nationalised three years ago, by the end of 2013, he complained. in the letter, mr morse told mr <mark>leslie</mark>: \"i can confirm that i have decided to conduct a value for money study in relation to the creation and sale of northern rock plc.\" my team will certainly consider the points which you raise when conducting the study. \"however, my role in conducting value for money studies is to act as an auditor, in this case of the completed sale transaction.\" keep up to date with the news. sign up for"}, {"articleID": "2019080709_00234786_W", "names": {"Susan Walsh": ["Q23139575", "Q47927124", "Q55360631", "Q7648501", "Q7648503"], "Mike Turner": ["Q16095910", "Q16231999", "Q505722", "Q6834994", "Q6849105", "Q6849107", "Q6849108"], "Susan Collins": ["Q22279", "Q7647692"], "Adam Kinzinger": ["Q22773917", "Q349955"]}, "date": "2019-08-07", "url": "https://www.wuwm.com/post/signs-republican-movement-support-gun-bills-new-restrictions", "content": "Signs Of Republican Movement To Support Gun Bills With New Restrictions By Deirdre <mark>Walsh</mark> • 36 minutes ago Share Tweet Email Ohio Republican Rep. <mark>Mike Turner</mark> represents Dayton, the scene of one of two mass shootings over the weekend. He opposed a House bill expanding background checks but came out in favor of measures to ban assault style weapons and proposals for red flag bills. <mark>Susan Walsh</mark> / AP Democratic efforts to pressure Senate Majority Leader Mitch McConnell to call the Senate back to vote on gun legislation to expand background checks following back to back mass shootings are being ignored by the top GOP leader. But there is some movement among some Republican lawmakers, who are calling for action on some gun-control measures. Ohio GOP Rep <mark>Mike Turner</mark>, who represents Dayton, where a gunman used an assault-style weapon to kill nine people and injure at least 27, announced on Twitter on Tuesday that he now backs proposals to enact new limits and on firearms. \"I will support legislation that prevents the sale of military-style weapons to civilians, a magazine limit, and red-flag legislation,\" he said. \"The carnage these military-style weapons are able to produce when available to the wrong people is intolerable.\" He added that he also backs so-called red-flag bills that make it so that it's easier to identify people who could harm others. \"Too often after mass shootings,\" he said, \"we hear there were early warning signs that were ignored.\" <mark>Turner</mark>'s statement is stunning, considering the National Rifle Association endorsed him ahead of the 2018 midterm elections. Ohio Republican Sen. Rob Portman, who voted against a bipartisan bill to expand background checks in 2013, told Roll Call in the Capitol on Tuesday, \"I think we should look at everything.\" Portman also pointed to the need to press ahead with proposals to enact red-flag laws, noting that there were reports about the shooter in Dayton preparing lists of people he wanted to kill. <mark>Turner</mark> did not mention any change in his position on proposals to expand background-check requirements for gun purchases. He voted against the bipartisan bill that the House approved in February. Only eight House GOP members voted with the vast majority of Democrats to pass it. President Trump tweeted Monday morning that parties needed to work together for \"stronger background checks,\" but he omitted that push when he stepped in front of television cameras hours later. We cannot let those killed in El Paso, Texas, and Dayton, Ohio, die in vain. Likewise for those so seriously wounded. We can never forget them, and those many who came before them. Republicans and Democrats must come together and get strong background checks, perhaps marrying ...--Donald J. Trump (@ realDonaldTrump) August 5, 2019 Instead, the president called for red-flag laws, said it was time to reform mental-health laws (but gave few details) and said, \"Mental illness and hatred pulls the trigger, not the gun.\" The real test for any significant action on gun laws is in the GOP-controlled Senate, where McConnell has acted as a one-man blockade against the House-passed background-check bill. He is, however, open to some other proposals. McConnell hasn't spoken publicly since the shootings, but he released a statement noting that he talked with three key committee chairs about pursuing items that Trump mentioned. \"Only serious, bipartisan, bicameral efforts will enable us to continue this important work and produce further legislation that can pass the Senate, pass the House, and earn the president's signature,\" McConnell said. Sen. Lindsey Graham, R-S.C., a key Trump ally, is developing a bipartisan bill with Sen. Richard Blumenthal, D-Conn, that would give grants to states to adopt red-flag laws, so they can hire mental-health experts to work through which cases need to be reviewed. McConnell has also been in touch with the bipartisan sponsors of a compromise addressing background checks that Pennsylvania GOP Sen. Pat Toomey and West Virginia Democratic Sen. Joe Manchin crafted after the Sandy Hook massacre in 2012. That vote fell six votes short in 2013, and only two GOP senators who backed it remain in the Senate--Toomey and Maine Sen. <mark>Susan Collins</mark>. Toomey, in an interview on CNN Tuesday, said there were a lot of new senators elected since his background-check bill failed, and he hoped that legislation would get another vote. He maintained there was \"broad support\" for a red-flag bill in the Senate. \"As usual, Mitch McConnell wants an actual outcome, and there needs to be bipartisan support in both chambers,\" Toomey said, stressing that he and Manchin are still working toward that goal and communicating with the president. The challenge for Toomey and other Republicans considering backing new gun controls is the president's inconsistent position on the issue. After a mass shooting in Parkland, Fla. killed 17 students and faculty in 2018, Trump publicly endorsed some proposals opposed by the NRA only to reverse course later. As the 2020 elections near, few Republicans will want to vote for any bill unless there is a strong message from the president that he will sign it. There is some evidence lawmakers who are home talking to constituents for an extended summer break are feeling some pressure to do something. Illinois Rep <mark>Adam Kinzinger</mark>, a former Iraq war veteran who voted against the bipartisan House bill on background checks penned an essay on Medium, saying he is in favor of red-flag laws and now supports universal background checks, raising the age to purchase a firearm fro 18 to 21 and \"banning certain high capacity magazines, like the 100-round drum the Dayton shooter used this weekend.\" He added, \"We have a gun violence epidemic, and to address it, we need to change some laws and change some hearts.\" Pressed Tuesday about Republican reluctance to vote for gun-control measures, Toomey, who said he was a gun owner and supporter of Second Amendment rights said, \"Yes, you can get reelected.\" But he also admitted, \"There's a lot of heat I can assure you, as well.\" Copyright 2019 NPR. To see more, visit https: //www.npr.org. Share Tweet Email"}, {"articleID": "2017050316_00883983_W", "names": {"Jimmy Harris": ["Q14951984", "Q6200296", "Q6200299"]}, "date": "2017-05-03", "url": "http://jacksonsun.com/story/news/local/2017/05/03/breaking-cycle-inmates-graduate-penal-farm/101214166/", "content": "Buy Photo Madison County Mayor <mark>Jimmy Harris</mark> congratulates men who have graduated from the Southwest Human Resource Agency and West Tennessee Workforce Development Board's Inside/Out Program, Tuesday, May 2, 2017. (Photo: KENNETH CUMMINGS/The Jackson Sun) Buy Photo CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Tenica Dickerson patted her boyfriend on the back as he stood up to get his diploma, showing he successfully passed the 14-class course to be a better dad. Kenneth Hodges, Dickerson's boyfriend of more than 20 years, wore a gray T-shirt reading \"24/7 dad\" over his jail shirt. Hodges is an inmate at the Madison County Penal Farm, and Dickerson expects he'll be released in August after serving a year sentence. \"Talking to him, he's more enthused. He's more positive, when he's always doubted,\" Dickerson said. \"Now he sees things in a brighter light, and he's better at communicating. I really profited from this also because we can communicate now, when we couldn't even communicate at first.\" Hodges is one of three men who graduated from the Inside/Out program run through Southwest Human Resources Agency. The program teaches inmates how to be a better dad once they're released from custody, and to work on communication with their wives, girlfriends and kids. \"Communication is a whole lot better, but he's also got a little bit of a drive behind him. He has plans, he wants to make a future,\" said Barbara Lents, whose husband Austin is in custody at the Penal Farm. \"It's a big deal.\" Buy Photo Kenneth Hodges thanks his support team after succesfully completing the Southwest Human Resource Agency and West Tennessee Workforce Development Board's Inside/Out Program (Photo: KENNETH CUMMINGS/The Jackson Sun) Dickerson said she and Hodges have a 16-year-old son together, and Barbara and Austin Lents have a 5-year-old daughter together. \"They need their fathers,\" Dickerson said. \"Here, they're missing out.\" \"It's painful,\" Hodges said. \"I grew up on the wrong side of the law.\" Hodges said he's trying to guide his kids in a different direction than he went growing up, but he hopes this program will give him skills he needs to teach his children. \"I want to teach my daughters and my sons the right way to go so they don't go down the path I went,\" Hodges said. \"I didn't have to go the way I did. I had both of my parents, I just made bad decisions. Now I'm older and I've learned to really do the right things.\" Buy Photo Bradley Washington thanks his support team after succesfully completing the Southwest Human Resource Agency and West Tennessee Workforce Development Board's Inside/Out Program (Photo: KENNETH CUMMINGS/The Jackson Sun) Tim Carothers, the re-entry coordinator for Southwest, said they want the graduation to mark a milestone for men who successfully finish the class. \"As much as anything, it is to let them know how much support they have from, not only our organization, but the Sheriff's Department, other people in the county who are willing to help them,\" Carothers said. \"If we do the same things, we're going to get the same results, and we're trying to get them to change the way they think.\" Reach Maranda at (731) 425-9657 or at mfaris2 @ jacksonsun.com. Follow her on Twitter: @ MarandaFaris Buy Photo Austin Lents thanks his support team after succesfully completing the Southwest Human Resource Agency and West Tennessee Workforce Development Board's Inside/Out Program (Photo: KENNETH CUMMINGS/The Jackson Sun) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http: //www.jacksonsun.com/story/news/local/2017/05/03/breaking-cycle-inmates-graduate-penal-farm/101214166/"}, {"articleID": "2019101109_00222765_W", "names": {"Stephen Barclay": ["Q20200819", "Q260546", "Q40131775"]}, "date": "2019-10-11", "url": "http://www.eveningtimes.co.uk/news/17961409.tusk-welcomes-promising-signals-barclay-meets-barnier-brexit-talks/", "content": "News Tusk welcomes \"promising signals' as <mark>Barclay</mark> meets Barnier for Brexit talks By Press Association 2019 Brexit Secretary <mark>Stephen Barclay</mark> greets EU chief Brexit negotiator Michel Barnier 0 comment Donald Tusk has welcomed\" promising signals \"from Leo Varadkar that a new deal may be possible, as Brexit Secretary <mark>Stephen Barclay</mark> held key talks with the EU's chief negotiator Michel Barnier. European Council president Mr Tusk offered Boris Johnson lukewarm hope that progress could be made, but warned that the UK has still not presented\" a workable, realistic proposal \". Mr <mark>Barclay</mark> and Mr Barnier met in Brussels on Friday morning as chances of a breakthrough appeared to rise after face-to-face talks between the Prime Minister and Irish Taoiseach Mr Varadkar. The UK has still not come forward with a workable, realistic proposal. But I have received promising signals from Taoiseach @ LeoVaradkar that a deal is possible. Even the slightest chance must be used. A no deal #Brexit will never be the choice of the EU .--Donald Tusk (@ eucopresident) October 11, 2019 The two leaders released a joint statement saying they could\" see a pathway \"to a possible agreement. Mr <mark>Barclay</mark>'s talks should give the clearest indication on whether there has been a significant thawing of relations between London and Brussels after a week of abrupt exchanges. As the meeting got under way, Mr Tusk tweeted:\" The UK has still not come forward with a workable, realistic proposal. But I have received promising signals from Taoiseach @ LeoVaradkar that a deal is possible. \"Even the slightest chance must be used. A no deal #Brexit will never be the choice of the EU.\" Dramatic progress could lead to the start of so-called intensive \"tunnel\" negotiations in the coming days ahead of the crunch EU heads of government summit on October 17 and 18. The unexpectedly cordial atmosphere of the meeting between the two prime ministers led to speculation of a possible compromise on the contentious issue of the Northern Ireland border backstop. Sterling rose sharply on international money markets in the wake of the talks. Prime Minister @ BorisJohnson meets Irish Taoiseach @ LeoVaradkar to discuss the UK's Brexit proposals. pic.twitter.com/k33tVhNX3U--UK Prime Minister (@ 10DowningStreet) October 10, 2019 Education Secretary Gavin Williamson said that the Cabinet had been briefed on the meeting, but would not explain what concessions may have prompted the surprise optimism. \"It does not benefit anyone to have a running commentary on live negotiations,\" he told BBC Radio 4's Today programme. After more than two hours of \"detailed and constructive\" discussions at a country manor on the Wirral on Thursday, the two leaders said it was in \"everybody's interest\" to get an agreement which would allow the UK to leave with a deal. Mr Varadkar said he hoped the progress they had made would be \"sufficient\" to enable intensive negotiations to resume in Brussels ahead of next week's crucial EU summit. The Taoiseach said: \"I think it is possible for us to come to an agreement, to have a treaty to allow the UK to leave the EU in an orderly fashion, and to have that done by the end of October, but there's many a slip between cup and lip,\" he said. \"In terms of how long it will take, I can't predict that with any certainty, but I think all sides would like there to be an agreement next week at the council if possible.\" Obviously there's a further deadline after that which is October 31, so I would say a short pathway rather than a long one, but it's impossible to predict that for sure. \"Mr Varadkar refused to be drawn on any\" concessions \"made by either side, while UK Government sources refused to be drawn on Irish press reports suggesting\" significant movement \"by the UK. Tory former chancellor and arch-Brexiteer Lord Norman Lamont said he wanted to know what any UK concessions were. He told the BBC:\" No, I am not worried. I have to know what the concessions are. \"It does look as though there is a change of mood.\" He added: \"Maybe there is some change on the mechanism whereby the deal is approved by the Northern Ireland Assembly and Executive.\" Maybe there will be an opting-out mechanism rather than an opting-in mechanism. \"The softer mood music after Mr Johnson's meeting with the Taoiseach followed an intensive few days which saw an acrimonious war of words explode between London, Dublin and Brussels in which the talks appeared close to collapse. Briefings by anonymous Downing Street sources had accused Mr Varadkar of backtracking on previous commitments to try to find a deal, and of refusing to negotiate. And following a heated telephone call between Mr Johnson and German Chancellor Angela Merkel on Tuesday, Number 10 sources claimed the EU was making it\" essentially impossible \"for Britain to leave with a deal. On Wednesday, Mr Barnier told the European Parliament there was still no basis for a fresh agreement. He said the UK had yet to put forward an\" operational, legally binding solution \"to replace the Northern Ireland backstop--intended to prevent the return of a hard border with the Republic. Without a deal, Mr Johnson will face demands from opposition parties to comply with the so-called Benn Act which would require him to request a three-month Brexit delay if there is no agreement by October 19. The PM has said while he will abide by the law, he is determined to leave on the Halloween deadline of October 31 come what may. Government sources have said ministers are preparing to hold an emergency Saturday sitting of Parliament on October 19. Many MPs believe if he cannot get a deal, Mr Johnson will use the occasion to push for a\" people versus Parliament \"general election, possibly as early as next month. If a deal did emerge, Mr Johnson would also need the backing of the DUP and Eurosceptic Tories to have any chance of getting it through without opposition support. Lord Lamont said he thought Labour MPs were wary of an early election. He said:\" Backbench Labour MPs, I understand, are really very nervous about it. \"I think they don't want it, and I wouldn't be at all surprised if we didn't slide into next year.\" Lord Lamont said the Tories would choose to fight any election on a no-deal stance if they failed to achieve an agreement with Brussels. 0 comment"}, {"articleID": "2015042507_00001764_W", "names": {"King Abdullah": ["Q57298", "Q57464"]}, "date": "2015-04-25", "url": "http://tradearabia.com/news/OGN_280433.html", "content": "Saudi Arabia's government is increasing its focus to explore alternate sources for power generation. Saudi Arabia to see big growth in solar power BURNABY, Canada, 2 days ago Increasing government focus on renewable energy programme coupled with rising power demand will drive Saudi Arabia's solar power market to experience robust growth rate through 2020, a report said. Being located on the equatorial Sun Belt with high solar radiation and vast stretches of empty desert with clear skies, makes the country an ideal location for solar power generation, added the report \"Saudi Arabia Solar Power Market Forecast & Opportunities, 2020\" published by TechSci Research, a global market research and consulting company. According to the BP Statistical Review of World Energy 2014, Saudi Arabia was the largest producer of crude oil in the world and the country consumes a large amount of crude oil for electricity production. Continuing increase in population growth rate, urbanization and industrial development have resulted in rise in consumption of crude oil so as to meet the country's growing energy demand. As a result of increasing domestic consumption of crude oil for power generation, Saudi Arabia's government is increasing its focus to explore alternate sources for power generation. <mark>King Abdullah</mark> City for Atomic and Renewable Energy (K ACARE) has already introduced a renewable energy programme for adding 54 GW additional power generation capacity from renewable sources with an investment of $109 billion by 2032. Solar power is expected to contribute around 41 GW of overall power capacity additions by 2032. \"K A CARE renewable energy programme would be a major driving factor for solar power industry in Saudi Arabia in coming years. The country is more focussed towards generating solar power from concentrated solar power technology,\" said Karan Chechi, research director with TechSci Research. The report analyses the future growth potential of solar power market in Saudi Arabia and provides statistics and information on market size and solar power industry. Libya's official government has no luck selling oil bypassing Tripoli Iran wants Opec to pave way for its extra oil production when sanctions lifted Libyan oil port Hariga shuts down due to strike by security guards"}, {"articleID": "2018050518_00065502_W", "names": {"Matthew Young": ["Q19921862", "Q3299822", "Q58209744", "Q58234510", "Q6791459"]}, "date": "2018-05-05", "url": "http://baynews9.com/fl/tampa/news/2018/05/05/new-pinellas-park-soccer-fields-open-to-all-at-a-low-price", "content": "New Pinellas Park soccer fields open to all at a low price By Tim Wronka | May 5, 2018 @ 1:54 PM SHARE It's a favorite sport for many kids but the cost keeps many of them from playing it. Now, youth soccer players in the Bay Area have a new alternative: soccer fields that anyone can use for a low price. New Pinellas Park soccer fields open to all at a low price BT Sports Academy on 49th Street More info on BT Sports Academy Bruce To invested his own money to build new soccer fields in Pinellas Park. He wants them open to everyone. \"I've come across a lot of kids who couldn't afford to play, especially travel clubs,\" To said. He and volunteers cleared out a junkyard on 49th Street, turning it into BT Sports Academy. It's a place where anyone can play a pickup game of soccer. \"Our goal is to have a place where kids, or adults even, can come play the game and not have to worry about being asked to leave,\" To said. The fields are a hit. They consistently fill up with parents and some smaller leagues who can't pay thousands for a soccer club. \"We want parents to be able to get good coaching without paying an arm and a leg for it,\" said parent and soccer coach <mark>Matthew Young</mark>. To has plans to build even more, including some indoor fields and even a restaurant. It's part of a lifelong dream to see no child turned away from a game. \"Every time I watch kids, dads, moms playing, kids versus coach, it's a great feeling,\" To said. BT Sports Academy does charge a small fee, sometimes as low as $5 for a pickup game. To says that is lower than what many public parks charge. Plus, To says many public parks are usually occupied by bigger leagues. READ MORE"}, {"articleID": "2012091519_00000424_W", "names": {"Joe Frazier": ["Q102301", "Q6209921"]}, "date": "2012-09-15", "url": "http://koamtv.com/story/19551472/large-anti-austerity-protests-in-spain-portugal", "content": "mssu women's basketball adds junior college transfer for 2012-13 tulsa metro player of the year porter signs with pitt state basketball lions baseball end season with 9-6 loss to fort hays at miaa tournament miaa inducts 1992 ncaa d-ii softball national champions into hall of fame allen, moore, 1991 psu football team enshrined in miaa hall of fame former auburn running back confirms he's not transferring to pittsburg state no. 24 lions complete the series sweep with two wins against fort hays miaa baseball: kolkmeyer, stalcup named student-athletes of the week no. 19 lions earn second-straight bid to division ii men's basketball tournament missouri southern baseball ranked no. 24 in latest division ii coaches poll late rally not enough as gorillas fall in miaa tournament championship fed unveils bold, open-ended steps to aid economy fed to buy mortgage bonds, plans to keep rates ultra-low into 2015, says more action may come romney trying to shift back to economy romney says federal reserve move undercuts obama argument on the economy nyc bans big, sugary drinks at restaurants nyc bans supersized sodas at restaurants, theaters and concession stands apple says new iphone 5 is thinner, lighter obama, romney trade tough words over attacks us sends marines to libya after mob kills us ambassador, 3 other americans mob kills us ambassador, 3 other americans us sends marines to libya after mob kills us ambassador, 3 other americans teacher evaluations at center of chicago strike chicago teachers strike the latest fight about judging teachers by their students' performance philly mayor kicks off campaign for <mark>frazier</mark> statue philadelphia mayor kicks off campaign for statue honoring hometown boxer smokin' <mark>joe frazier</mark> chicago teachers strike grinds into third day in chicago, teachers strike grinds into third day with no hint of imminent deal partisan jibes on hold for 9/11 - but not politics for 9/11: presidential campaigns suspend partisan digs, but politics continues on anniversary associated press madrid (ap) - tens of thousands of people from all over spain rallied in the capital saturday against punishing austerity measures enacted by the government, which is trying to save the country from financial collapse. large anti-austerity protests also took place in neighboring portugal. demonstrators in lisbon threw tomatoes and fireworks at the portuguese headquarters of the international monetary fund. two protesters were arrested, but otherwise the rally was peaceful. spain is stuck in a double-dip recession with unemployment close to 25 percent. the conservative government of prime minister mariano rajoy has introduced stinging cuts and raised taxes in a bid to reduce the deficit and to reassure investors and officials from the 17-nation eurozone. the marchers in madrid unfurled banners with slogans such as \"let's go! they are ruining the country and we have to stop them.\" \"this government's policies are causing too much pain,\" union chief ignacio fernandez toxo said. \"it's a lie that there isn't another way to restore the economy.\" the situation looks set to get worse in coming weeks. at a meeting of eurozone finance ministers in cyprus on friday, spain revealed it would present a new set of economic reforms by the end of the month. it's a move that raises expectations that spain might soon ask for financial help. the economic reform plan will be unveiled by sept. 27. it is expected to be the launch-pad to spain's tapping of a new european central bank bond-buying plan. just before saturday's march began, buses transporting protesters blocked several major roads in the spanish capital. the main organizers were social summit, an association of more than 150 organizations, and the workers' commissions and general workers trade unions. the interior ministry's regional office said it had expected more than 500,000 people to reach a central madrid square, but later said 65,000 had attended to listen to speeches made by protest leaders. toxo called for a referendum on the government's austerity and bailout plans, saying the measures were so different from the ruling popular party's election pledges that spaniards should have the right to express an opinion on them. rajoy was swept to power with a large majority in november elections, having said \"i have no plans to raise taxes.\" the madrid protest comes four days after another anti-government gathering in the northeastern city of barcelona that attracted about 1.5 million demonstrators, according to police estimates. \"we've had our pay cut. we don't get the firefighting training and equipment we need. there are more students and fewer teachers in our children's classrooms, and health care is also being cut,\" firefighter carlos melgaves said, while marching in a group of about 50 firefighters. \"we can't take it anymore.\" spain's economy minister, luis de guindos, said his government is aware it is asking citizens to make sacrifices. they \"are absolutely unavoidable if we are to correct the difficult economic climate we are experiencing,\" he said in cyprus, where europe's finance ministers were meeting saturday. \"we are laying the foundations for a recovery.\" rajoy has accepted a loan of up to? 100 billion ($127billion) to help ailing banks reeling from a collapse of the country's real estate and construction industries. his government also has faced punishingly high interest rates while raising money on bond markets to keep the economy in liquidity. the country is widely expected to ask to sell its bonds to the european central bank, but the conditions attached have been the subject of ongoing negotiations. in portugal, another package of recently announced government austerity measures could turn the nation's sullen acceptance of belt-tightening into an explosion of anger similar to that seen in greece over the past two years. more than 50,000 people said on facebook they would attend a large protest in lisbon and organizers called smaller demonstrations in 40 other portuguese cities. last week, portuguese prime minister pedro passos coelho announced an increase in workers' social security contributions to 18 percent of their monthly salary from 11 percent. the cut is equivalent to a net monthly wage. portuguese finance minister vitor gaspar said income taxes will go up next year and public employees will lose either their christmas or vacation bonus, roughly equivalent to a month's income. many pensioners will lose both. protester magda alves said the austerity measures being applied to overcome the eurozone financial crisis were not working. \"what is being done in portugal now was done in greece, it is being done in spain, and was also applied in other countries on other continents,\" alves said. \"the result was always the same: disaster.\" ___ associated press writers barry hatton and yesica fisch in lisbon, portugal, and alan clendenning in madrid, contributed to this report. meta itemprop = \"datepublished\" content = \"2012-09-15 11:37:24\" > topless kate pix published in ireland, italy next topless kate pix published in ireland, italy next an italian gossip magazine owned by former premier silvio berlusconi says it plans to publish topless photos of prince william's wife kate. the british royal family faced a multinational battle to contain the spread of topless photos of prince william's wife kate, as an irish tabloid published them saturday and an italian gossip magazine planned to do the...meta itemprop = \"datepublished\" content = \"2012-09-15 16:17:56\" > nhl says no bargaining with union saturday nhl says no bargaining with union saturday with only hours until a threatened nhl lockout, the league and the players' union appear no closer to a deal. the nhl says there will be no bargaining with the players' union saturday, leaving nothing to stop a lockout. meta itemprop = \"datepublished\" content = \"2012-09-15 12:27:44\" > large anti-austerity protests in spain, portugal large anti-austerity protests in spain, portugal tens of thousands of people from all over the country converged on spain's capital to hold a large anti-austerity demonstration on saturday. tens of thousands of people from all over spain rallied in the capital saturday against punishing austerity measures enacted by the government, which is trying to save the country from financial collapse. meta itemprop = \"datepublished\" content = \"2012-09-15 17:37:38\" > famu holds first home game without famed band famu holds first home game without famed band florida a & m university is trying to fill the void left by the absence of its famed marching band. as florida a & m's marching 100 quick-stepped across the grass, the stadium announcer's voice would boom through the speakers to remind those in the stands that no one could match the show they were watching:...meta itemprop = \"datepublished\" content = \"2012-09-15 05:57:17\" > 2 nato soldiers killed in afghan insider attack 2 nato soldiers killed in afghan insider attack the u.s.-led nato military coalition says it is assessing damage to a sprawling british base in southern afghanistan that was attacked by insurgents, killing two u.s. marines and wounding several other troops. an afghan local policeman killed two soldiers with the nato military coalition in southern afghanistan on saturday, the latest in a surge of insider attacks that are fracturing trust between afghan forces and their...meta itemprop = \"datepublished\" content = \"2012-09-15 08:57:17\" > thousands of striking teachers rally in chicago thousands of striking teachers rally in chicago negotiators seeking an end to chicago's teachers strike sound more hopeful than they have in weeks, announcing they have achieved a \"framework\" that could bring students back to the classroom by monday. thousands of striking chicago public school teachers are rallying at a city park in a show of force as union leaders try to work out details of a tentative agreement with the school district to end a week-long walkout. meta itemprop = \"datepublished\" content = \"2012-09-15 17:37:38\" > ohio police officers cited after man's death ohio police officers cited after man's death authorities in central ohio say three law enforcement officers face charges in the death of an allegedly drunk man they dropped off at a taco bell. authorities in central ohio say three law enforcement officers face charges in the death of an allegedly drunk man they dropped off at a taco bell. meta itemprop = \"datepublished\" content = \"2012-09-15 16:27:34\" > amish shunning is central to ohio hate crime trial amish shunning is central to ohio hate crime trial in the stern, self-regulating world of the amish, those who act out time and again by wearing the wrong clothing, going to movies or otherwise flaunting the church's doctrine can find themselves utterly alone. in the stern, self-regulating world of the amish, those who act out time and again by wearing the wrong clothing, going to movies or otherwise flouting the church's doctrine can find themselves utterly alone. meta itemprop = \"datepublished\" content = \"2012-09-15 09:27:18\" > la sheriff: feds interview calif. filmmaker la sheriff: feds interview calif. filmmaker authorities say federal probation officers interviewed have a southern california filmmaker linked to an anti-islamic movie inflaming protests across the middle east. a southern california filmmaker linked to an anti-islamic movie inflaming protests across the middle east was interviewed by federal probation officers at a los angeles sheriff's station but was not arrested or detained,...meta itemprop = \"datepublished\" content = \"2012-09-15 15:37:32\" > macdonald goes to court in \"fatal vision' case macdonald goes to court in\" fatal vision' case jeffrey macdonald, a clean-cut green beret and doctor convicted of killing of his pregnant wife and their two daughters, is getting another chance at trying to prove his innocence - more than four decades after the ..."}, {"articleID": "2014053000_00034626_W", "names": {"Jack Ramsay": ["Q1677183", "Q6114740"], "Steve Kelley": ["Q7613000", "Q7613003"]}, "date": "2014-05-29", "url": "http://www.oregonlive.com/blazers/index.ssf/2014/05/you_be_the_gm_trail_blazers_center_victor_claver.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to Portland Trail Blazers season wrapped, we evaluate the roster player-by-player, giving the fans the power of who should stay and who should go. Height/Weight: 6-10/235 NBA experience: Two seasons 2013-14 salary: $1,330,000 Contract status: Claver will enter the third year of his rookie deal, worth $1.37 million next season. 2013-14 season notables: Grabbed four rebounds in his first career playoff game on May 10 vs. San Antonio...Recorded 12 points, six rebounds and four assists on April 16 vs. L.A. Clippers...Scored a career high 13 points on 5-for-7 shooting on Feb. 26 vs. Brooklyn...Recorded five points and five rebounds in 24 minutes on Feb. 24 against Minnesota. Victor Claver's second NBA season will likely be paired - fair or not - with the dreaded \"sophomore slump\" label. One of six second-year players on the 2013-14 Trail Blazers, Claver saw the least action (184 minutes total) of his fellow sophomores--the byproduct of an upgraded roster. He appeared in just 21 games this season, spending 45 of the other 61 games on the inactive list. Despite seeing limited playing time, the 25-year-old Claver said being a member of a playoff team provided him with plenty of learning experience to take forward. \"It has been a tough season for me, being inactive most of the games,\" Claver said in his exit interview with the media. \"I'm lucky that that team was doing so well and I was in the routine with everybody, working out every day with the coaches, and that's what I'm going to take from this season.\" The heady Claver, while naturally a small forward, will also take away the experience of playing both at three and stretch-four this year. \"I know that's something good for me, playing both positions,\" Claver said. \"I think as a three I can do a lot of things, not only shoot. As a four it's easier for my body, because I don't have to (chase around faster small forwards). I know how I need to improve and I know what I need to improve and I know what kind of player I want to be.\" Trail Blazers forward Victor Claver talks about a frustrating season, the summer and the future. \"I want to rest and work out on the things I need to improve and get ready for the national team this summer, because it's very important for me for the team to play well this summer,\" he said. With a year left on his current contract, Claver remains committed to playing in the NBA - whether in Portland or somewhere more minutes may be available. \"I have one more year on my contract,\" Claver said. \"I want to play one more year (in the NBA).\" I need to play. I don't know where. I don't know if they're gonna give me the opportunity here or I'll have to go to another team but I need to play because it's my last year and it's very important for me. \"Trail Blazers' Hall of Fame coach dies at 89 <mark>Jack Ramsay</mark>, the legendary coach who led the Portland Trail Blazers to the NBA championship in 1977, died Monday in Naples, Florida, after a 15-year battle with cancer. He was 89. Covering <mark>Jack Ramsay</mark>'s Trail Blazers was a daunting, educational dream: <mark>Steve Kelley</mark> column Registration on or use of this site constitutes acceptance of our Privacy Policy? 2014 Oregon Live LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Oregon Live LLC."}]