[{"articleID": "2012121708_00064321_W", "names": {"James Baker": ["Q103854", "Q18671532", "Q21284586", "Q21456471", "Q223151", "Q28916440", "Q49481016", "Q6129263", "Q6129269"]}, "date": "2012-12-17", "url": "http://israelnationalnews.com/Articles/Article.aspx/12598", "content": "early in president obama's administration, he sent his good friend and arafat's bosom buddy, robert malley, to the younger assad with the same offer president george h. w. bush's secretary of state, <mark>james baker</mark> iii, offered to his father--a complete israeli withdrawal from the heights in return for some nice gestures towards america and others, but not israel."}, {"articleID": "2010032600_00009318_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2010-03-26", "url": "http://news.com.au/adelaidenow/story/0,22606,26901522-5006301,00.html?from=public_rss", "content": "that seems to be the conclusion backers and critics of opposition leader <mark>tony abbott</mark>'s lycra and \"budgie smuggler\" obsession are reaching after he said he again will appear in them in public.\nmr <mark>abbott</mark> will take part in an ironman triathlon, raising money for breast cancer research, and a 10-day \"pollie pedal\" charity ride between sydney and melbourne.\nthey will be the ninth and tenth times mr <mark>abbott</mark> has stripped to body-hugging costumes since he was elected opposition leader last december - once a fortnight.\nsenior liberals reportedly have questioned the behaviour and finance minister lindsay tanner pilloried mr <mark>abbott</mark> in parliament, saying: \"there is one part of his body that does not get much exercise and that is the brain."}, {"articleID": "2018041110_00203994_W", "names": {"Artem R. Oganov": ["Q18406571", "Q42879486"]}, "date": "2018-04-11", "url": "https://phys.org/news/2018-04-scientists-link-superconductivity-periodic-table.html", "content": "A group of chemists led by <mark>Artem R. Oganov</mark>, professor at the Moscow Institute of Physics and Technology and Skoltech, discovered that certain elements capable of forming superconducting compounds are arranged in a specific pattern in the periodic table."}, {"articleID": "2013011013_00086213_W", "names": {"Henry Ford": ["Q19865736", "Q52439758", "Q5721389"]}, "date": "2013-01-10", "url": "http://hometownlife.com/article/20130110/NEWS15/130110010/Culinary-carving-Ice-sculptors-carved-revival-Plymouth-Ice-festival-s-support?odyssey=nav|head", "content": "franklin village police are investigating a home invasion on helmandale street that occurred...novi's mayor preparing a positive message in state of city address he may not have it completely finished yet, but novi mayor bob gatt knows what the gist of his...reps to add ymca programs the reps youth and community center is planning to close its doors soon and reopen in a new...buyer of most of <mark>ford</mark>'s plant site envisions mixed-use development wingstop, a 540-unit restaurant chain headquartered in richardson, texas, opened a restaurant in...shaping up <mark>henry</mark> blickle's only 17, but he can definitely tell older people with new year's weight loss...get up and move ruth rickard of novi was working out on a recent monday morning at anytime fitness.\npurchase image richard teeple, who is retired from <mark>henry ford</mark> community college (here judging a recent carving competition with doug ganhs of oakland community college) said the annual plymouth ice festival has helped revive the art of ice carving in michigan.\nrichard teeple, who recently retired from <mark>henry ford</mark> community college, where he taught in the culinary arts program for more than 30 years, said \"there's no question\" the festival has been a boost to his school and to ice carving in general.\n\"it was one of the reasons why <mark>henry ford</mark> has invested so much time and money into developing an ice program, was because of the ice festival,\" teeple said."}, {"articleID": "2018111223_00329645_W", "names": {"Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"]}, "date": "2018-11-12", "url": "http://www.wvtf.org/post/close-elections-fla-judge-calls-out-fraud-rhetoric-ariz-democrat-extends-lead", "content": "Rick Scott, who's challenging Democratic Sen. <mark>Bill Nelson</mark>, and former GOP Rep. Ron DeSantis in his bid for governor over Tallahassee Mayor Andrew Gillum .\""}, {"articleID": "2014120809_00033520_W", "names": {"Robert Mcdonald": ["Q41948618", "Q7347500"]}, "date": "2014-12-08", "url": "http://digitaljournal.com/news/politics/report-thousands-of-homeless-vets-unable-to-reach-va-call-center/article/419458", "content": "New VA Secretary <mark>Robert McDonald</mark> is following up with this, and the goal is to completely eliminate veteran homelessness by 2015, The Fiscal Times reports."}, {"articleID": "2016071015_00657922_W", "names": {"John Prescott": ["Q332393", "Q58166586", "Q58166598"]}, "date": "2016-07-10", "url": "http://www.newsweek.com/deputy-pm-prescott-iraq-war-illegal-479186", "content": "Iraq War Was Illegal, Ex-deputy PM <mark>Prescott</mark> Says On 7/10/16 at 11:31 AM Close World Chilcot Report Iraq War Tony Blair British parliament Britain broke international law when it invaded Iraq in 2003, its deputy prime minister at the time, <mark>John Prescott</mark>, said on Sunday in the wake of a critical report on the decision to go to war.\nTry Newsweek for only $1.25 per week <mark>Prescott</mark>, writing in the Sunday Mirror newspaper, said he had now changed his view about the legality of the war and criticized Blair for stopping his ministers from fully discussing in advance whether the war would be legal.\nWith great sadness and anger, I now believe him to be right,\" <mark>Prescott</mark> wrote.\nBritain's former Deputy Prime Minister <mark>John Prescott</mark> arrives for a weekly cabinet meeting at Downing Street in London May 4, 2006.\n\"The Attorney General, Lord Goldsmith, came to the Cabinet, verbally announced it was legal, but provided no documentation,\" <mark>Prescott</mark> said.\n<mark>Prescott</mark> added that he backed the decision by Labour Party leader Jeremy Corbyn--a veteran anti-war campaigner and critic of Blair--to apologize for the war on behalf of the party."}, {"articleID": "2014120801_00038549_W", "names": {"Carol Potter": ["Q242440", "Q5044513"]}, "date": "2014-12-08", "url": "http://www.wxyz.com/news/region/macomb-county/sterling-heights-home-destroyed-after-fire", "content": "\"Fire was coming out, like, the window and I was a little worried because the cars were both in the driveway and our house is next door,\" <mark>Carol Potter</mark>, a neighbor said.\nAt the height of the blaze, the flames were so intense that the heat damaged the <mark>Potter</mark>'s home next door."}, {"articleID": "2014040622_00036074_W", "names": {"Ivan Lopez": ["Q37377397", "Q3804960", "Q5923485", "Q6100103"]}, "date": "2014-04-06", "url": "http://walb.com/story/25174508/south-african-judge-opens-up", "content": "<mark>Ivan Lopez</mark> had an argument before going on a shooting rampage, investigators said they may never determine what compelled the Fort Hood soldier to kill three soldiers and wound...Some Fort Hood victims to be discharged from hospital Fort Hood gunman never saw combat or gave any sign of violence before rampage that killed 3 Fort Hood gunman never saw combat or gave any sign of violence before rampage that killed 3 Republicans like campaign money ruling, Dems don't Supreme Court ruling on campaign donations not seen as favoring one party over another Supreme Court ruling on campaign donations not seen as favoring one party over another Gunman kills 3, wounds 16 at Fort Hood Army base Gunman opens fire at Fort Hood, killing 3 and wounding 16 on base that was attacked in 2009 Gunman opens fire at Fort Hood, killing 3 and wounding 16 on base that was attacked in 2009 Union question looms as Northwestern practices Northwestern football team heads back to practice, union question looming Northwestern football team heads back to practice, union question looming GM, safety agency face Congress over recalls Associated Press JOHANNESBURG (AP) - An openly gay judge on South Africa's Constitutional Court recently hosted a launch for his new book in the foyer of the court, a symbol-laden structure partly built with exposed brick from the apartheid-era prison that once stood on the same hilltop."}, {"articleID": "2014042814_00043225_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2014-04-28", "url": "http://news.yahoo.com/mh370-undersea-search-may-extend-entire-probable-impact-042835835.html", "content": "\"If necessary, of the entire probable impact zone which is roughly 700 kilometres by 80 kilometres,\" Prime Minister <mark>Tony Abbott</mark> told reporters, when asked about the size of the search area.\n<mark>Abbott</mark> also admitted it was \"highly unlikely\" that any surface wreckage will be found from MH370."}, {"articleID": "2018012314_00881424_W", "names": {"Robert Wood": ["Q1265326", "Q15052600", "Q19325396", "Q21165763", "Q22098434", "Q24566698", "Q43915973", "Q51586292", "Q7351216", "Q7351217", "Q7351220", "Q9185475"]}, "date": "2018-01-23", "url": "http://www.koreaherald.com/view.php?ud=20180123001023", "content": "US disarmament ambassador <mark>Robert Wood</mark> said, \"The United States will not recognize North Korea as a nuclear weapon state .\""}, {"articleID": "2020021018_00288206_W", "names": {"Atul Kumar": ["Q41790058", "Q4818789", "Q57090004", "Q58207751"]}, "date": "2020-02-10", "url": "https://www.oneindia.com/india/gargi-college-molestation-case-students-hold-protest-delhi-police-launches-probe-3030751.html?utm_source=/rss/news-india-fb.xml&utm_medium=2.23.97.70&utm_campaign=client-rss", "content": "Deputy Commissioner of Police (South) <mark>Atul Kumar</mark> Thakur said appropriate action will be taken in the matter .\""}, {"articleID": "2015111715_00038218_W", "names": {"Thomas Dittrich": ["Q41446983", "Q998839"]}, "date": "2015-11-17", "url": "http://www.epmag.com/swiss-pumpmaker-sulzer-appoints-greg-poux-guillaume-ceo-827796", "content": "He will take over from interim CEO <mark>Thomas Dittrich</mark> who will return full-time to his role as finance chief after taking temporary charge in August following the departure of Klaus Stahlmann."}, {"articleID": "2019040114_00450996_W", "names": {"Mark Fuller": ["Q50326821", "Q6767691", "Q6767692"]}, "date": "2019-04-01", "url": "http://www.nbcconnecticut.com/entertainment/entertainment-news/Game-of-Thrones-Takes-Over-Bellagio-Fountains-in-Las-Vegas-507943121.html", "content": "\"We didn't just want to portray literally scenes from\" Game of Thrones' here, not like a teaser or a preview of season eight, \"said <mark>Mark Fuller</mark>, CEO of WET Design, the company that created the fountains and show .\""}, {"articleID": "2016050310_00441503_W", "names": {"Anil Joshi": ["Q16148280", "Q2722277"]}, "date": "2016-05-02", "url": "http://www.rediff.com/news/special/did-the-timber-mafia-cause-the-forest-fires/20160502.htm", "content": "Dr <mark>Anil Joshi</mark>, who heads the Himalayan Environmental Studies and Conservation Organisation, believes the time has come to revoke the Forest Conservation Act 1980 .\"\nEarlier, the local communities in a spirit of collective responsibility were in the forefront of controlling the fires, \"Dr <mark>Joshi</mark> said .\"\n\"The MoEF, Dr <mark>Joshi</mark> maintained, lacks the resources to handle the situation on the ground .\"\n\"Dr <mark>Joshi</mark> did concede that the cause of these devastating forest fires could be the handiwork of either the timber mafia or the lack of rain during two successive winters, which have resulted in a lack of moisture both in the soil and in the air."}, {"articleID": "2019013120_00597528_W", "names": {"John C. Anderson": ["Q47539904", "Q48743453"]}, "date": "2019-01-31", "url": "https://www.thegardenisland.com/2019/01/31/news/the-latest-michigan-man-found-dead-outside-in-frigid-cold/", "content": "The Latest: Michigan man found dead outside in frigid cold By Bill Buley The Garden Island | Thursday, January 31, 2019, 7:59 a.m. Share this story <mark>John C. Anderson</mark>, 74, of Silvis, braves minus 27 windchill to do shirtless pull-ups on a tree branch outside Warren Tower Wednesday, Jan. 30, 2019, in Silvis, Ill. \"It's going to be a historically cold day and I wanted to do something nobody else dare do,\" said <mark>Anderson</mark>, who is known for his fitness stunts.\n\"A lot of people think all old people are cold, they got cold blood...I wanted to show them not all old people are that cold blooded, certainly I'm not,\" said <mark>Anderson</mark>."}, {"articleID": "2016092900_00321004_W", "names": {"Michael Powell": ["Q11778385", "Q1562548", "Q1928927", "Q47459798", "Q49943329", "Q588371"]}, "date": "2016-09-29", "url": "http://www.cablefax.com/distribution/intx-exit-ncta-shuttering-annual-tradeshow", "content": "\"We are now exploring new and better ways to tell our story, to gather our community, to advance our growth and present our vision of the future,\" NCTA chief wrote in a blog post Wed.. <mark>Michael Powell</mark> Given that these events must be booked more than a year out, NCTA will lose deposits, but <mark>Powell</mark> argues that large trade show floors with exhibit booths and artificial schedules are an \"anachronism .\"\nEnding INTX gives us a clean slate and we are excited to explore presenting our industry in new and different ways,\" <mark>Powell</mark> wrote."}, {"articleID": "2010022613_00111423_W", "names": {"Rob Smith": ["Q16847100", "Q16931899", "Q17198726", "Q21151369", "Q28868156", "Q3434235", "Q5206244", "Q7340559", "Q7340561", "Q7340562", "Q7340564"]}, "date": "2010-02-26", "url": "http://hertsad.co.uk/content/herts/news/story.aspx?brand=HADOnline&category=News&tBrand=HertsCambsOnline&tCategory=newslatestHAD&itemid=WEED26%20Feb%202010%2011%3A44%3A59%3A010", "content": "during a lengthy presentation on the future of thameslink, network rail spokesmen graham goodwin and <mark>rob smith</mark> failed to make any reference to the potential impact of complex rail pathings and rail possessions which are expected to result from the park street proposal if it is approved."}, {"articleID": "2018090402_00128299_W", "names": {"Jody Williams": ["Q211239", "Q27949760", "Q3179955", "Q36337023", "Q6208173", "Q6208175"]}, "date": "2018-09-03", "url": "http://kstp.com/politics/group-us-russia-block-consensus-at-killer-robots-meeting-/5056597/?cat=12510", "content": "Group: US, Russia Block Consensus at \"Killer Robots' Meeting Photo: AP Photo/Jamey Keaten, file In this Monday, Aug. 27, 2018 file photo, Peter Asaro, left, of the International Committee for Robot Arms Control, and <mark>Jody Williams</mark> of the Nobel Women's Initiative speak to reporters at a news conference in Geneva, Switzerland."}, {"articleID": "2017022022_00369412_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-02-09", "url": "http://rare.us/rare-politics/issues/foreign-policy/rand-paul-it-would-be-a-really-rotten-no-good-bad-idea-to-have-ground-troops-in-syria/", "content": "A year ago during the campaign, <mark>Donald Trump</mark> said he would consider sending up to 30,000 U.S. troops to Syria.\nYet <mark>Trump</mark> also has stressed that the U.S. should get out of the business of nation building.\nWatching the 2016 presidential primaries where most Republican candidates seemed eager to commit American troops abroad, with the exception of Paul and in some ways <mark>Trump</mark>, I wrote, \"Our foreign policy is run by crazy people.\nRELATED: No, <mark>Donald Trump</mark>, torture doesn't work, and we're not going down that road again <mark>Donald Trump</mark> won the election saying sane things about the futility of the Iraq war and the folly of nation building, combined with some less sane and belligerent things."}, {"articleID": "2011091207_00029290_W", "names": {"Abdul Razaq": ["Q4665685", "Q59552812"]}, "date": "2011-09-12", "url": "http://risingkashmir.com/news/poor-bsnl-services-irk-city-residents-15277.aspx", "content": "while making or receiving calls the connectivity drops suddenly and one has to make repeated calls,\" said <mark>abdul razaq</mark> of abi guzar."}, {"articleID": "2009052604_00008823_W", "names": {"Colin Campbell": ["Q1108386", "Q1108388", "Q1108411", "Q1108531", "Q19414277", "Q22323626", "Q27345368", "Q43911673", "Q5144955", "Q5144956", "Q5144961", "Q55469116", "Q5601509", "Q5601513", "Q56380383", "Q56524218"]}, "date": "2009-05-26", "url": "http://article.nationalreview.com/?q=NDRkNjQxMDMwNGM3MjlkZGY4YTRlODdmOTU4NTZkZWM=", "content": "just days after <mark>colin campbell</mark> informed us that the american people were willing to pay higher taxes in order to get government services - and that republicans therefore needed to stop their opposition to taxes - california voters resoundingly defeated a bill to raise taxes in order to pay for the many government services in that liberal state."}, {"articleID": "2019031319_00154629_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-03-13", "url": "http://www.gamereactor.eu/games/11063/CounterStrike", "content": "Written by <mark>Sam Bishop</mark> on the 11th of March 2019 at 07 We also know the week one bracket for the competition as it kicks off this week, featuring big names in the world of CS: GO.\nWritten by <mark>Sam Bishop</mark> on the 8th of March 2019 at 09 Bodyy has been moved to the bench to make way for this new addition, and G2 hopes to improve results with the signing.\nWritten by <mark>Sam Bishop</mark> on the 6th of March 2019 at 09 The North American squad has just parted ways with Zellsis, and now a new report indicates the Mousesports player might be coming on board.\nWritten by <mark>Sam Bishop</mark> on the 5th of March 2019 at 10 In partnership with OMEN by HP and Elgiganten, the biggest and best teams in the Nordics will battle it out."}, {"articleID": "2014121406_00031147_W", "names": {"Lee Adams": ["Q6512930", "Q6512934"]}, "date": "2014-12-14", "url": "http://wzzm13.com/story/news/2014/12/13/scott-flahive-memorial/20376479", "content": "\"Even though I didn't know him personally, I feel like I did know him,\" said Sergeant <mark>Lee Adams</mark>, Grand Haven Department of Public Safety.\n<mark>Adams</mark> said Flahive was the first officer in Ottawa County to be shot and killed while on service."}, {"articleID": "2010021914_00122013_W", "names": {"Joe Carr": ["Q10514943", "Q16240985", "Q17612171", "Q19949576"]}, "date": "2010-02-19", "url": "http://webwpmu.ume.maine.edu/news/blog/2010/02/19/winter-road-clearing-costs-in-maine-total-98-million-annually-umaine-report-summarizes-findings-and-recommends-goals/", "content": "winter road clearing costs in maine total $98 million annually; umaine report summarizes findings and recommends goals february 19th, 2010 contact: jonathan rubin at (207) 581-1528 <mark>joe carr</mark> at (207) 581-3571 orono - an exhaustive year-long study of economic, safety and environmental issues related to clearing maine's roads has yielded a report from the university of maine's margaret chase smith policy center."}, {"articleID": "2019090621_00039004_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"]}, "date": "2019-09-06", "url": "http://ctpost.com/entertainment/article/President-Sharpie-14419977.php", "content": "\"He really must think we're a bunch of idiots,\" <mark>Jimmy Kimmel</mark> remarked."}, {"articleID": "2018091700_00014315_W", "names": {"Roy Cooper": ["Q16106910", "Q7372694", "Q7372695"]}, "date": "2018-09-16", "url": "http://abc11.com/risk-to-life-is-rising-with-florences-floodwaters-governor-says/4257798/", "content": "<mark>Roy Cooper</mark> said at a midday news conference.\nSome parts of the state were getting 2 to 3 inches an hour, <mark>Cooper</mark> said .\"\nThat's enough to cause flooding in areas that have never flooded before until now, \"<mark>Cooper</mark> said."}, {"articleID": "2009101612_00094212_W", "names": {"Paul Mckeever": ["Q16190809", "Q7152380"]}, "date": "2009-10-16", "url": "http://mirror.co.uk/news/latest/2009/10/16/wpc-s-killers-known-for-25-years-115875-21751875/", "content": "\"advertisement - article continues below\" <mark>paul mckeever</mark>, chair of police federation of england and wales, said more must be done to bring the suspects to justice."}, {"articleID": "2016051707_00663517_W", "names": {"Joshua Wong": ["Q12688635", "Q56320576", "Q9455382"]}, "date": "2016-05-17", "url": "http://skynews.com.au/news/world/asiapacific/2016/05/17/top-chinese-official-to-hear-hk-demands.html", "content": "<mark>Joshua Wong</mark>, another prominent young activist who launched a new political party called Demosisto this year, wouldn't rule out taking an independence line in upcoming campaigns."}, {"articleID": "2016091005_00478380_W", "names": {"Harsha De Silva": ["Q56254066", "Q5673820"]}, "date": "2016-09-10", "url": "https://politicslk.wordpress.com/2016/09/10/ban-ki-moons-lament/", "content": "Be that as it may, disputing the JO Leader Dinesh Gunwardena interpretation of Ban's remarks, Acting Foreign Minister Dr <mark>Harsha de Silva</mark> opinionated in Parliament that Ban's visit and remarks improved Sri Lanka's image overseas."}, {"articleID": "2019033008_00398687_W", "names": {"Jack Daniels": ["Q6111998", "Q981415"]}, "date": "2019-03-28", "url": "http://crainscleveland.com/legal/licata-law-group-bridges-ne-ohio-china", "content": "There, he has assisted CEO Tom Lix to sell product in a country packed with stiff liquor competition (<mark>Jack Daniels</mark>, for instance, has its own facility for distribution capabilities there)."}, {"articleID": "2019120302_00152044_W", "names": {"George Lucas": ["Q1507803", "Q38222"]}, "date": "2019-12-02", "url": "http://screenrant.com/star-wars-new-hope-alec-guinness-hated-dialogue/", "content": "Back when <mark>George Lucas</mark> was first creating the now iconic franchise, no one knew what it would become.\nIn many ways, his presence in the film helped bring a sense of believability to this new mythology <mark>Lucas</mark> created - but Guinness was not a fan.\nRelated: Star Wars: Every Change <mark>George Lucas</mark> Made To Han Killing Greedo Guinness made for a great Obi-Wan in the original trilogy but did not enjoy his experience with A New Hope.\nAs discussed in the latest Screen Rant video, Guinness hated working on the film and his chief complaint was <mark>Lucas</mark>' dialogue.\nWhile Guinness may have helped make <mark>Lucas</mark>' dialogue work, his complaint about the quality of it has been shared by other actors in the franchise.\nIt's also no secret that dialogue is not <mark>Lucas</mark>' strong suit.\nWhile <mark>Lucas</mark> wrote all on his own, Lawrence Kasdan was brought aboard to help fine-tune the sequels with <mark>Lucas</mark> passing directing duties to others."}, {"articleID": "2017022418_01171951_W", "names": {"Mehdi Hosseini": ["Q21621496", "Q452959"]}, "date": "2017-02-24", "url": "http://www.investors.com/news/technology/oled-tech-firm-universal-display-shines-bright-after-q4-beat/", "content": "Susquehanna Financial Group analyst <mark>Mehdi Hosseini</mark> reiterated his positive rating on UDC stock and raised his price target to 105 from 100.\n\"UDC should be viewed as a core holding in a small-cap portfolio, benefiting from multiyear, secular trends in display technology,\" <mark>Hosseini</mark> said in a report."}, {"articleID": "2013111101_00033483_W", "names": {"Chad Smith": ["Q1058609", "Q17303653", "Q269500", "Q5066355", "Q5066356", "Q5066358"]}, "date": "2013-11-10", "url": "http://feeds.theguardian.com/c/34708/f/663860/s/3384abd9/sc/38/l/0L0Stheguardian0N0Cfootball0C20A130Cnov0C10A0Cred0Ehot0Echili0Epeppers0Edrummer0Ewiping0Eflamengo0Eshirt/story01.htm", "content": "Red Hot Chili Peppers drummer sorry for wiping backside on Flamengo shirt <mark>Chad Smith</mark>, the drummer for the US rock band Flamengo fans after he caused outrage in Brazil by wiping his backside with the club's shirt.\n<mark>Smith</mark> made the gesture - which was filmed and went viral on the internet - at a drum clinic in Belo Horizonte last week.\nFans of Flamengo, who claim to be the best-supported club in Brazil with more than 30m fans, were outraged by the incident and forced <mark>Smith</mark> to quickly backtrack.\n\"I want to apologise for my inappropriate antics at the drum clinic, my joke about team rivalries went too far,\" <mark>Smith</mark> said on twitter."}, {"articleID": "2010120713_00040239_W", "names": {"Mike Hill": ["Q1498629", "Q16192754", "Q27043626", "Q30164739", "Q484948", "Q5805741", "Q6847237"]}, "date": "2010-12-07", "url": "http://record-eagle.com/local/x1199047916/Slippery-walk-for-schools-staff", "content": "tbaisd superintendent <mark>mike hill</mark> could not be reached monday afternoon for more information."}, {"articleID": "2015120212_00025883_W", "names": {"Katie Holmes": ["Q174346", "Q6377464"]}, "date": "2015-12-02", "url": "http://parentherald.com/articles/13504/20151202/tom-cruise-katie-holmes-divorce-actress-reveals-she-has-no-regrets-talks-about-inspiration-your-children-are-what-drives-you.htm", "content": "Tom Cruise, <mark>Katie Holmes</mark> Divorce: Actress Reveals She Has No Regrets, Talks About Inspiration \"Your Children Are What Drives You' By Staff Reporter / Dec 02, 2015 07:00 AM EST Tags: <mark>Katie Holmes</mark>, Tom Cruise, divorce, Suri Cruise (Photo: Credit: Theo Wargo / Staff / Getty Images) Three years after her divorce with actor Tom Cruise, <mark>Katie Holmes</mark> said in an interview that she does not regret anything about her past.\nI don't really regret anything that I've done, \"<mark>Holmes</mark>, who will turn 37 next month, confessed in a recent interview with Ocean Drive .\"\n<mark>Holmes</mark> will also be the magazine's cover girl this December.\nHowever, according to a report relayed by US Weekly, <mark>Holmes</mark> said that her life these days is nothing but normal and added that she walks around New York with a cracked iPhone .\"\nI have a very normal life, and I happen to work in an industry that is abnormal, \"<mark>Holmes</mark> said .\"\n<mark>Holmes</mark> said that her daughter with Cruise has been her motivation to work hard.\nSuri, who remains in <mark>Holmes</mark>' custody after the marriage, has been her driving force .\"\nIf you're having a bad day, you just take a walk, and it's not only that you see people who are having a worse day than you, it's just that you're in life, \"<mark>Holmes</mark> told Ocean Drive .\"\n\"<mark>Holmes</mark> divorced Cruise in August 2012 after being married for five years."}, {"articleID": "2015032515_00068687_W", "names": {"Barbara Jordan": ["Q4859035", "Q4859322", "Q53570"]}, "date": "2015-03-25", "url": "http://southfloridagaynews.com/Community/gay-history-101-women-s-history-month.html", "content": "<mark>Barbara</mark> Gittings (1932 -2007) was an early gay and lesbian rights activist and was instrumental in the forming of Daughters of Bilitis, one of the first lesbian organizations in the U.S. <mark>Barbara</mark> Gittings helped organize gay rights demonstrations in front of the White House and in front of Independence Hall in Philadelphia in 1965 to protest federal employment discrimination.\n<mark>Barbara Jordan</mark> (1936-1996) was an accomplished U.S. congressional representative from Texas and was the first African American congresswoman to come from the Deep South."}, {"articleID": "2019062203_00095188_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-06-22", "url": "http://www.gamereactor.eu/rainbow-six-siege/?sid=73e2bf64f660c0e49878502aab593b70", "content": "Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 11 This includes hardware, giveaways, promotions, in-game challenges, and plenty more, starting this month with Season X of the Pro League.\nWritten by <mark>Sam Bishop</mark> on the 7th of June 2019 at 10 Lion is coming back after extensive reworks, alongside changes to the schedule, map pool, operator pool, and more.\nWritten by <mark>Sam Bishop</mark> on the 4th of June 2019 at 09 They'll be joined by streamers, all of which will be competing for a charity prize pool of $50,000 USD."}, {"articleID": "2012030404_00064194_W", "names": {"Mel Gibson": ["Q3854066", "Q42229"]}, "date": "2012-03-04", "url": "http://thetimesnews.com/articles/election-53082-season-surving.html", "content": "and my third response is to take a deepbreath and remember that somewhere in the back rooms of toilet paper manufacturers around the nation there are legions of similarly dedicated people endlessly watching fox news and preparing their own exclamation point-laden mailers from the left with photos of house speaker john boehner with his arm around <mark>mel gibson</mark>."}, {"articleID": "2012050810_00102304_W", "names": {"Greg Abbott": ["Q5605224", "Q5605225"]}, "date": "2012-05-08", "url": "http://bbc.co.uk/sport/0/football/17991140", "content": "\"they leave with our very best wishes,\" boss <mark>greg abbott</mark> told the club website."}, {"articleID": "2019061722_00089012_W", "names": {"Chris Martin": ["Q16724461", "Q17744566", "Q21020921", "Q21663261", "Q25171658", "Q28678811", "Q30122010", "Q43133913", "Q48589106", "Q5107345", "Q5107346", "Q5107348", "Q5107349", "Q5107350", "Q5107353", "Q5107354", "Q5107355", "Q5107356", "Q519982", "Q712860"]}, "date": "2019-06-18", "url": "http://home.nzcity.co.nz/news/article.aspx?id=292244&fm=psp,tst", "content": "Home> News> Entertainment <mark>Chris Martin</mark> has reportedly split from Dakota Johnson The 42-year-old musician - who was previously married to Gwyneth Paltrow - has told friends that he's no longer in a relationship with Dakota, who is best-known for starring in the \"Fifty Shades' movies 18 June 2019 A source told The Sun newspaper:\" <mark>Chris</mark> and Dakota were very easygoing and always seemed really happy together.\n<mark>Chris</mark> (likes that) she doesn't thrive on the spotlight and is very understated.\nThe Oscar-winning actress - who is now married to Brad Falchuk - went through a divorce from the Coldplay frontman in 2016 and she now wants to pen a tome about her experiences with <mark>Chris</mark>, because she thinks their bond is special.\nGwyneth - who has kids Apple, 15, and Moses, 13, with <mark>Chris</mark> - said:\" Both <mark>Chris</mark> and I have made a commitment to continue to love the things about each other that we've always loved and to really continue to develop our friendship and to find ways to continue to communicate."}, {"articleID": "2017112801_00298181_W", "names": {"Stephen Roberts": ["Q2026194", "Q22280061", "Q43197539", "Q7610381", "Q7610382", "Q7610383", "Q7610384"]}, "date": "2017-11-27", "url": "http://www.nydailynews.com/newswires/sports/georgia-faces-auburn-rematch-avenge-23-point-loss-article-1.3661197", "content": "Auburn linebacker Robert Muschamp, left, and Auburn defensive back <mark>Stephen Roberts</mark>, celebrate during the second half of the Iron Bowl NCAA college football game, Saturday, Nov. 25, 2017, in Auburn, Ala. (AP Photo/Brynn Anderson) Indeed, the winner of the rematch will almost certainly land a spot in the four-team playoff."}, {"articleID": "2015120123_00057331_W", "names": {"Michael Mayer": ["Q1611585", "Q1689106", "Q1928565", "Q1928566", "Q19964005", "Q2094087", "Q21458849", "Q47948992", "Q70378", "Q99282"]}, "date": "2015-12-01", "url": "http://www.startribune.com/local/south/358974031.html", "content": "Rucki sisters headed to reunification program after shunning dad South Metro 358974031 Rucki sisters headed to family reunification program Saying the girls' \"life has become a circus,\" Judge <mark>Michael Mayer</mark> had to choose among three competing arguments of where Gianna, 16, and Samantha, 17, should go.\nSaying the girls' \"life has become a circus,\" Judge <mark>Michael Mayer</mark> had to choose among three competing arguments of where Gianna, 16, and Samantha, 17, should go.\n<mark>Mayer</mark>'s decision gave full parental rights back to Rucki, who said he will put them in a reunification program.\nAt the hearing, <mark>Mayer</mark> said he agreed with sending them to the program, which he described as lasting six to eight hours a day for about six to 10 weeks .\"\nThe girls have indicated to me that they would run, \"<mark>Mayer</mark> said .\"\n\"Rucki said after the hearing that he was\" elated \"by <mark>Mayer</mark>'s decision .\"\n<mark>Mayer</mark> noted that there were \"ongoing criminal investigations\" against the Dahlens."}, {"articleID": "2010121000_00116596_W", "names": {"Roberto Mancini": ["Q23289352", "Q48330", "Q55466310"]}, "date": "2010-12-10", "url": "http://independent.co.uk/sport/football/premier-league/mancini-calls-on-city-to-prove-they-can-thrive-without-tevez-2155743.html", "content": "manchester city manager <mark>roberto mancini</mark> believes that carlos tevez will remain at the club for' a long time' enlarge <mark>roberto mancini</mark> may have to do without carlos tevez this weekend, but the manchester city manager believes the argentine will be at eastlands for the long term, despite the pair's very public disagreement last saturday after tevez was substituted late on against bolton.\n\"i think we can talk about this situation every week,\" said <mark>mancini</mark> yesterday.\nthe statistics simply don't make easy viewing, with <mark>mancini</mark>'s side winning just once since january when tevez has failed to find his way on to the scoresheet.\naccording to <mark>mancini</mark> that is about to change given the rich talent in the expensive squad that has been assembled at eastlands.\n\"i think that this is a time when we can try to win without carlos,\" said <mark>mancini</mark>.\nbut tevez remains the vital cog in <mark>mancini</mark>'s wheel.\nyet given the number of talented players in <mark>mancini</mark>'s squad, the defensive, safety-first approach may have to be put on the back burner if manchester city are to go joint top of the premier league tomorrow afternoon."}, {"articleID": "2018113006_00324230_W", "names": {"James Burke": ["Q16206040", "Q16229909", "Q6130497", "Q6130509", "Q6130510", "Q778787"]}, "date": "2018-11-29", "url": "http://www.bcdemocrat.com/2018/11/29/us-sexual-misconduct-weinstein-2/", "content": "The only reasonably prudent decision would be to stop this chaos now, \"Brafman wrote, urging Judge <mark>James Burke</mark> to dismiss the case at a Dec. 20 court hearing."}, {"articleID": "2019010620_00561565_W", "names": {"Julie Davis": ["Q1712168", "Q5954191"]}, "date": "2019-01-06", "url": "http://newsok.com/seminars-prove-need-for-education-about-senior-living/article/5619370?custom_click=rss", "content": "It's either complete truth or nothing to be said at all, \"said <mark>Julie Davis</mark>, marketing director for Concordia Life Care Community."}, {"articleID": "2013011817_00012750_W", "names": {"Neeraj Kumar": ["Q20684424", "Q57081351", "Q6986927"]}, "date": "2013-01-18", "url": "http://zeenews.india.com/news/delhi/unplanned-colonies-fuelling-capital-crime-delhi-police_823723.html", "content": "new delhi: there has been a small 1.75 percent increase in the national capital's crime graph in 2012 in comparison to 2011, delhi police commissioner <mark>neeraj kumar</mark> said here on friday but attributed city crimes largely to the growth of \"unplanned colonies\".\na total of 54,287 cases were registered under indian penal code (ipc) in 2012. in 2011, the number of cases was lower at 53,353, <mark>kumar</mark> said, adding that it was a rise of 1.75 percent.\nabout 11.7 percent live in rural or urban villages while only 23.7 percent people staying in planned colonies, which is an important causative factor for crime in delhi,\" said <mark>kumar</mark>.\n<mark>kumar</mark> said that the number of cases per lakh of the population declined from 392.64 cases in 2001 to 318.98 in 2012. in 2012, 521 cases of murder were registered as against 543 cases in 2011, a decline of 4.05 percent."}, {"articleID": "2016050609_00091886_W", "names": {"Phil Simmons": ["Q47434073", "Q6827914"]}, "date": "2016-05-06", "url": "http://antiguaobserver.com/lara-says-return-of-bravo-pollard-vital-for-tri-nations/#respond", "content": "The non-selection of Pollard and Bravo have resulted in controversy over the last year, and was at the heart of an outburst by West Indies coach <mark>Phil Simmons</mark>, who claimed there was \"outside influence\" on selectors, in keeping them out of the squad.\nI'm hoping that <mark>Phil Simmons</mark> is doing his homework [and] getting his players ready to play good Test cricket .\""}, {"articleID": "2016051616_00447608_W", "names": {"Gareth Jones": ["Q15990091", "Q16194126", "Q25189125", "Q28766870", "Q304629", "Q30505322", "Q5522881", "Q5522882", "Q5522883", "Q5522885", "Q5522889", "Q57245256"]}, "date": "2016-05-16", "url": "http://uk.reuters.com/article/us-health-who-glyphosate-idUKKCN0Y71HR", "content": "(Editing by <mark>Gareth Jones</mark>) More from Reuters Newsletters | Mobile Apps News and Media Division of Thomson Reuters Thomson Reuters is the world's largest international multimedia news agency, providing investing news, world news, business news, technology news, headline news, small business news, news alerts, personal finance, stock market, and mutual funds information available on Reuters.com, video, mobile, and interactive television platforms."}, {"articleID": "2018011422_00112923_W", "names": {"Dan Johnson": ["Q16193666", "Q16730344", "Q27917138", "Q3013125", "Q45409991", "Q5213759", "Q5213760", "Q5213762"]}, "date": "2018-01-14", "url": "http://www.kxlf.com/story/37263271/ex-idaho-lawmaker-kills-himself-amid-sex-abuse-investigation", "content": "Hixon's death follows the December death of Kentucky state Rep. <mark>Dan Johnson</mark>, also a Republican, who had been accused of sexually assaulting a teenage girl in 2013.\n<mark>Johnson</mark> died a day after denying the allegations, and the Bullitt County, Kentucky, coroner ruled the death a suicide."}, {"articleID": "2013091506_00005669_W", "names": {"Antonio Lopez": ["Q1257924", "Q299360", "Q3619770"]}, "date": "2013-09-14", "url": "http://www.wwd.com/fashion-news/fashion-scoops/rare-antonio-lopez-drawings-go-on-show-7154279?src=rss/recentstories/20130914", "content": "Rare <mark>Antonio Lopez</mark> Drawings Go on Show CHANNEL CROSSING: Janina Joffe, founder of the online fashion illustration gallery East of Mayfair, has teamed with Roland Mouret to showcase rare and previously unseen drawings by the late fashion illustrator <mark>Antonio Lopez</mark> at Mouret's Mayfair townhouse, marking the 70th anniversary of <mark>Lopez</mark>'s birth.\n\"When I was a young person, <mark>Antonio</mark> was one of the people who made you dream about fashion,\" Mouret said during an event to kick off the exhibition on Friday night.\nHe said he remembers seeing <mark>Lopez</mark> arriving with his entourage at La Coupole in Paris, but was too shy to approach him: \"There are some people you think' I want to be like them,' and <mark>Antonio</mark> was one of those people,\" said Mouret."}, {"articleID": "2011122316_00001677_W", "names": {"Jennifer Carroll": ["Q16206281", "Q3177037", "Q4942091"]}, "date": "2011-12-23", "url": "http://politic365.com/2011/12/23/payroll-taxes-get-cut-what-about-social-security/?utm_source=rss&utm_medium=rss&utm_campaign=payroll-taxes-get-cut-what-about-social-security", "content": "charles d. ellison, managing editor for politic365.com, washington correspondent for <mark>jennifer carroll</mark> sworn in as florida's first black lt. governor"}, {"articleID": "2011091710_00022079_W", "names": {"Tim Burgess": ["Q2433840", "Q7803247"]}, "date": "2011-09-16", "url": "http://overheadbin.msnbc.msn.com/_news/2011/09/16/7781454-seattle-hotels-step-up-to-fund-tourism-promotion", "content": "seattle city councilman <mark>tim burgess</mark>, who first proposed the idea, said that it's anticipated that $6 million would be raised the first full year of the tax in 2012.\n\"if invested in the (tourism) promotion of seattle, according to most estimates of economists, it would mean about $30 to $33 million in economic gain,\" <mark>burgess</mark> said."}, {"articleID": "2013102819_00045353_W", "names": {"Colin Evans": ["Q16210795", "Q5145074"]}, "date": "2013-10-28", "url": "http://www.4barsrest.com/news/detail.asp?id=17704", "content": "Wide open <mark>Colin Evans</mark>, Secretary of the South East Wales Brass Band Association, who is organising the contest, told 4BR: \"This year, more than ever, the situation is wide open and it is not possible to predict - except, possibly in one Section, who will end the year as Champion Bands .\""}, {"articleID": "2020013112_00142751_W", "names": {"Daniel Salmon": ["Q47471836", "Q9201431"]}, "date": "2020-01-31", "url": "http://www.msn.com/en-us/news/other/amazon-value-set-to-top-dollar1-trillion-and-wall-street-says-more-to-come/ar-BBZvXMv?srcref=rss", "content": "BMO, <mark>Daniel Salmon</mark> (Outperform, price target raised to $2,450 from $2,150) One-day shipping costs were lower than expected while volume acceleration remained robust and downside margin risk is now considerably lower."}, {"articleID": "2014111020_00064482_W", "names": {"King Abdullah": ["Q57298", "Q57464"]}, "date": "2014-11-10", "url": "http://jordantimes.com/delicate-issue-under-scrutiny", "content": "His Majesty <mark>King Abdullah</mark> told an Italian newspaper in 2005 that, \"in coordination with the European Union, we would like to modify our Penal Code."}, {"articleID": "2014111319_00059119_W", "names": {"Jim Bell": ["Q557294", "Q6193618"]}, "date": "2014-11-13", "url": "http://www.istockanalyst.com/article/viewarticle/articleid/7078338", "content": "<mark>Bell</mark> Investment Advisors Announces Event: Making a Good Life Happen (R)--The Lunch <mark>Bell</mark> Investment Advisors Announces Event: Making a Good Life Happen (R)--The Lunch OAKLAND, CA--(Marketwired - Nov 13, 2014) - <mark>Bell</mark> Investment Advisors, www.bellinvest.com, a Bay Area registered investment advisory firm, announced today that they will be hosting an event, \"Making a Good Life Happen ®--The Lunch\" on Wednesday, November 19, 2014, 12 - 1:30 PM at the firm's Oakland office.\nThe event will be hosted by <mark>Jim Bell</mark>, CFP ®, President & Founder, and Bonnie <mark>Bell</mark>, MA, MDiv ., Principal, and Director of Career/Life Coaching, who will discuss the firm's philosophy, \"Making a Good Life Happen .\"\nsays Bonnie <mark>Bell</mark>.\nhttp: //www.bellinvest.com/news-events/events/november-making-a-good-life-happen-lunch <mark>Bell</mark> Investment Advisors is a privately-owned, registered investment advisory firm, managing over $500 million in assets.\nFor more information, visit MEDIA CONTACT: Nancy Isaacs <mark>Bell</mark> Investment Advisors Canadian Paralympic Committee congratulates Sochi 2014 flag bearer and para-alpine ski champion Josh Dueck on career Morgan & Morgan Reminds Investors That a Class Action Lawsuit Has Been Filed Against Retrophin, Inc.--RTRX 5N Plus Winner in Multiple Categories in the 2014 Deloitte Technology Fast 50 (TM) Awards for a Fifth Consecutive Year Telenav Announces New Features for Scout?, Offering a More Social, Personalized and Intuitive Navigation Experience Zacks Investment Research, and Commentary, news and Press Releases provided by YellowBrix and Quotemedia."}, {"articleID": "2018043001_00189722_W", "names": {"David Reed": ["Q10514791", "Q1176289", "Q20737746", "Q3018673", "Q5238951", "Q5238952"]}, "date": "2018-04-27", "url": "http://chronicleonline.com/news/local/hospital-physical-rehabilitation-focuses-on-bettering-golf-swing/article_7e553af2-4a43-11e8-ad15-0be1d2dc7b3d.html", "content": "<mark>David Reed</mark> is the YMCA's operations director and an avid golfer.\n\"Golf is a sport; a community,\" <mark>Reed</mark> said."}, {"articleID": "2014110121_00021601_W", "names": {"Mike Tyson": ["Q30122587", "Q6849116", "Q79031"]}, "date": "2014-11-01", "url": "http://granitefallsnews.com/article/ZZ/20141101/NEWS/311019998/10063/ENTERTAINMENT", "content": "Local real estate broker, Edman, opens Exit Realty Scenic Valley Morning Jolt: At least 3,000 UNC student-athletes may have cheated <mark>Mike Tyson</mark> says he was sexually abused by an older man as a child.\nIn an interview with Opie Radio this week, <mark>Tyson</mark> said that at age 7, an older man \"bullied me, sexually abused me and stuff...snatched me off the street .\"\n<mark>Tyson</mark>, 48, claims he ran away and never saw the man again.\n<mark>Tyson</mark> was doing the interview to promote his new show <mark>Mike Tyson</mark> Mysteries.\nIn 1992, <mark>Tyson</mark> himself was convicted of raping a woman and was sentenced to six years in prison."}, {"articleID": "2014060322_00012365_W", "names": {"John Wise": ["Q1702197", "Q18385590", "Q21988583", "Q6218000", "Q6264668"]}, "date": "2014-06-03", "url": "http://insiderlouisville.com/lifestyle_culture/kentucky-mans-comic-book-bonanza/", "content": "Superman features prominently in the <mark>John Wise</mark> collection.\nPaducah, Ky. insurance exec <mark>John Wise</mark> is about to see a lot of green from the sale of his astonishing!)\nWe're talking cash, obvs, and Murray State-grad <mark>Wise</mark>, 62, may soon see $1 million, if not more, from the online auction of his great collection of Golden Age comics, says Vincent Zurzolo, the chief operating officer of Comicconnect.com, the online site auctioning <mark>Wise</mark>'s collection.\nThe online auction is ongoing, and concludes thisÂ evening at 7 p.m. <mark>Wise</mark>'s collection of 175 choice books includes Action Comics No.\n<mark>Wise</mark> really focused on high-quality books from the late '30s through the '50s, when many of the key heroes listed above were introduced.\n<mark>Wise</mark>'s Action No.\n<mark>Wise</mark>'s book is not in that kind of condition, and condition is everything with comics, but even now it's got an $80,000 bid with time left on the auction clock.\n<mark>Wise</mark> bought many of his books in the 1990s, when they traded for a fraction of what they go for now."}, {"articleID": "2009031123_00002657_W", "names": {"Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2009-03-11", "url": "http://vueweekly.com/article.php?id=11316", "content": "beyond the obvious retro touchstones and \"old soul\" rhapsodizing people typically afford him, rault actually reminded me a lot of <mark>michael jackson</mark>.\nthe first song played after his set was \"black and white\" by <mark>michael jackson</mark>."}, {"articleID": "2013090902_00027186_W", "names": {"Sunil Kumar": ["Q47153923", "Q56060895", "Q56440858", "Q57039297", "Q7640314"]}, "date": "2013-09-08", "url": "http://www.dailyexcelsior.com/probe-into-tbs-irregularities-nsf-urges-panel-to-submit-early-report/", "content": "Among those who were present in the press-conference included, Balveer <mark>Kumar</mark>, <mark>Sunil Kumar</mark>, Vikram Madhyal and Akshey Sharma."}, {"articleID": "2019091620_00173836_W", "names": {"Jim Barber": ["Q6129350", "Q6193534"]}, "date": "2019-09-16", "url": "https://pittsburgh.cbslocal.com/2019/09/16/ups-hiring-for-the-holidays-770-workers-needed-in-new-stanton/", "content": "\"We expect another record peak season this year, with daily package deliveries nearly doubling compared to our average of 20 million per day,\" said <mark>Jim Barber</mark>, chief operating officer in a press release."}, {"articleID": "2019090915_00198372_W", "names": {"Martin Griffiths": ["Q21457259", "Q59281930"]}, "date": "2019-09-09", "url": "https://www.standard.co.uk/news/uk/doctors-to-teach-london-pupils-how-to-give-stabbing-victims-first-aid-a4232321.html", "content": "The move is part of a Barts Health violence reduction initiative, running alongside a NHS programme to tackle youth violence in the capital, led by its first clinical director for violence reduction, Royal London trauma surgeon <mark>Martin Griffiths</mark>."}, {"articleID": "2016123004_00407773_W", "names": {"Todd Fisher": ["Q7812365", "Q7812366"]}, "date": "2016-12-29", "url": "http://eonline.com/news/818767/carrie-fisher-s-autopsy-on-hold-as-family-begins-planning-funerals-for-debbie-reynolds-and-star-wars-actress", "content": "According to <mark>Todd Fisher</mark>, a joint funeral has been discussed but is not official.\nPhotos Debbie Reynolds & Carrie Fisher's Mother-Daughter Moments Kevork Djansezian/Getty Images While the premiere day has yet to be announced, <mark>Todd</mark> revealed to E!\n\"Remarkably enough, the [Bright Lights] documentary is the greatest tribute you can imagine to both of them,\" <mark>Todd</mark> shared.\nAs the tributes continue pouring in from fans and celebrities alike, <mark>Todd</mark> revealed that many of Carrie's Star Wars co-stars have reached out.\n\"This is a beautiful love story to witness in my 58 years,\" <mark>Todd</mark> wrote on Twitter with a drawing of a mother and daughter."}, {"articleID": "2012121708_00064321_W", "names": {"James Baker": ["Q103854", "Q18671532", "Q21284586", "Q21456471", "Q223151", "Q28916440", "Q49481016", "Q6129263", "Q6129269"]}, "date": "2012-12-17", "url": "http://israelnationalnews.com/Articles/Article.aspx/12598", "content": "early in president obama's administration, he sent his good friend and arafat's bosom buddy, robert malley, to the younger assad with the same offer president george h. w. bush's secretary of state, <mark>james baker</mark> iii, offered to his father--a complete israeli withdrawal from the heights in return for some nice gestures towards america and others, but not israel."}, {"articleID": "2011050413_00100194_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2011-05-04", "url": "http://business-standard.com/india/news/inflation-fight-may-keep-gdp-growth-around-85-pranab/134039/on", "content": "slower economic growth would be another political headache for prime minister <mark>manmohan singh</mark>."}, {"articleID": "2018042400_00243502_W", "names": {"Mark Saunders": ["Q20006905", "Q4428797", "Q56724352", "Q6769597"]}, "date": "2018-04-24", "url": "http://www.nationalobserver.com/2018/04/23/news/richmond-hill-resident-bombarded-calls-after-media-and-police-misidentify-him", "content": "Toronto Police Service Chief <mark>Mark Saunders</mark> is updating media."}, {"articleID": "2019101013_00172478_W", "names": {"Al Murray": ["Q4704500", "Q6000623"]}, "date": "2019-10-10", "url": "http://www.eppingforestguardian.co.uk/news/national/17960435.13-unknown-first-world-war-soldiers-buried-belgium/", "content": "Dig Hill 80 was highly publicised at the time, attracting international media attention and celebrity patronage from comedian <mark>Al Murray</mark> and support from military historian Dan Snow."}, {"articleID": "2016092917_00086772_W", "names": {"Chris Green": ["Q18686459", "Q19957945", "Q2048639", "Q5106713", "Q5106714", "Q5106715", "Q5106716", "Q5106717", "Q5106718", "Q59162298"]}, "date": "2016-09-29", "url": "http://www.star-telegram.com/news/local/community/weatherford-star-telegram/wt-news/article104893256.html#storylink=rss", "content": "\"I appreciate Chief <mark>Chris Green</mark> for his leadership during this interim period."}, {"articleID": "2018102117_00108215_W", "names": {"James Matthews": ["Q16215416", "Q29643199", "Q30512782", "Q5979722"]}, "date": "2018-10-21", "url": "http://www.harpersbazaar.com/celebrity/latest/a24021080/pippa-middleton-new-baby-boy-photos-kate-middleton-sister/", "content": "And now, the is reporting that Pippa and her husband, <mark>James Matthews</mark>, have stepped out for the first time with their newborn baby.\nSharing a series of photos of Pippa walking the couple's dog, while <mark>Matthews</mark> pushed their baby in a pram, the reports that Kate's sister was wearing a Kate Spade dress for the outing."}, {"articleID": "2016071919_00818371_W", "names": {"James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}, "date": "2016-07-19", "url": "http://atimes.com/2016/07/travel-hallelujah-mountains-on-earth/", "content": "You're also probably familiar with \"Pandora\" and \"unobtanium\" by now and were blown away by the hallucinatory floating mountains of the <mark>James Cameron</mark> film.\nA Daily Mail report had stated that the Hallelujah (floating) mountains were inspired from such Chinese mountains and <mark>James Cameron</mark>'s film came after a Hollywood photographer spent time shooting in Southern Hunan in 2008."}, {"articleID": "2011032401_00009152_W", "names": {"Brad Wall": ["Q2923492", "Q437816"]}, "date": "2011-03-23", "url": "http://theglobeandmail.com/news/politics/saskatchewan-tables-surplus-budget/article1953891/?utm_medium=Feeds%3A%20RSS%2FAtom&utm_source=Prairies&utm_content=1953891", "content": "however, premier <mark>brad wall</mark> said the government is not priming people for the vote.\nit's constructed to be a budget that keeps our promises and builds on the saskatchewan advantage,\" said mr. <mark>wall</mark>."}, {"articleID": "2017071119_01173176_W", "names": {"Stefan Huber": ["Q2336572", "Q25415666", "Q50021147", "Q670225"]}, "date": "2017-07-11", "url": "http://www.pokernews.com/news/2017/07/world-series-of-poker-donates-bracelet-to-reg-charity-28477.htm", "content": "Every cent from the eventual sale will go to the REG charity which was co-founded by Boeree and Kurganov, along with fellow poker players Philipp Gruissem and <mark>Stefan Huber</mark>."}, {"articleID": "2019111102_00068158_W", "names": {"Frances Fitzgerald": ["Q540812", "Q5478653"]}, "date": "2019-11-11", "url": "https://www.herald.ie/news/dail-hopeful-sorry-for-tweets-as-she-hits-out-at-smear-campaign-38678925.html", "content": "There is also a by-election in Dublin Mid-West caused by former tanaiste <mark>Frances Fitzgerald</mark> becoming an MEP in the same election."}, {"articleID": "2014071911_00012341_W", "names": {"Jimmy Rollins": ["Q15059522", "Q601982"]}, "date": "2014-07-19", "url": "http://bostonherald.com/sports/red_sox_mlb/mlb_coverage/2014/07/burnett_cant_solve_braves_in_messy_start", "content": "<mark>Jimmy Rollins</mark> reached on first baseman Freddie Freeman's fielding error and moved to third on Chase Utley's double.\n<mark>Rollins</mark> led off the eighth with a walk against Jordan Walden, the third Atlanta pitcher, but he was thrown out at second base on Utley's strikeout."}, {"articleID": "2019061406_00222656_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-06-14", "url": "http://www.gamereactor.eu/call-of-duty-black-ops-4/?sid=81f7318c7e544211aa9393726529dd2e", "content": "Written by <mark>Sam Bishop</mark> on the 7th of June 2019 at 10 See how the action will unfold between the biggest and best Call of Duty teams in California this month.\nWritten by <mark>Sam Bishop</mark> on the 5th of June 2019 at 12:13 This has introduced plenty for PS4 players to see, including changes to Blackout's map, new weaponry, and more.\nWritten by <mark>Sam Bishop</mark> on the 4th of June 2019 at 08 As the CWL Pro League goes on, Nolson is coming into the main roster as Accuracy becomes a substitute.\nWritten by <mark>Sam Bishop</mark> on the 23rd of May 2019 at 09 The player might have had a lot of success in the past, but he's moving to a substitute role as Ricky comes into the roster."}, {"articleID": "2018041123_00103632_W", "names": {"Marc Jacobs": ["Q2986077", "Q313108", "Q45789717"]}, "date": "2018-04-11", "url": "https://pagesix.com/2018/04/11/saint-laurent-heir-may-not-be-happy-with-new-book/", "content": "Cox's friends were unable to put the kibosh on the book's Tuesday launch at <mark>Marc Jacobs</mark>' Bookmarc store on Bleecker Street, or on Petkanas' talk with Fern Mallis the following night at the 92nd Street Y on a panel with Pat Cleveland and Simon Doonan."}, {"articleID": "2019120315_00260125_W", "names": {"Dan Reynolds": ["Q5214274", "Q5214275"]}, "date": "2019-12-03", "url": "http://daijiworld.com/news/newsDisplay.aspx?newsID=649837", "content": "<mark>Reynolds</mark>' tweets praise over clipping of girl students singing \"Believer' <mark>Reynolds</mark>' tweets praise over clipping of girl students singing\" Believer' Tue, Dec 3 2019 09:03:12 PM New Delhi, Dec 3 (IANS): A video clipping of a group of schoolchildren rendering Imagine Dragon's popular song Believer has created quite a buzz on social media.\nThe band's lead singer <mark>Dan Reynolds</mark> also tweeted his praise.\n<mark>Reynolds</mark> wrote on @ DanReynolds: \"So beautiful."}, {"articleID": "2012101709_00095179_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2012-10-17", "url": "http://siasat.com/english/news/rahul-gandhi-meets-pm", "content": "congress general secretary rahul gandhi met prime minister <mark>manmohan singh</mark> wednesday for a \"routine meeting\" , party sources said.\non tuesday, <mark>manmohan singh</mark> and congress party chief sonia gandhi met president pranab mukherjee, sparking talk of a cabinet reshuffle that has been on the cards for some time."}, {"articleID": "2017080210_00219211_W", "names": {"Chris Scott": ["Q1077730", "Q18217980", "Q18631749", "Q5108004", "Q5108005", "Q5108006", "Q5108007", "Q57894195"]}, "date": "2017-08-02", "url": "http://www.fleetwoodtoday.co.uk/news/business/fresh-fish-provided-to-the-open-1-8681832", "content": "<mark>Chris Scott</mark>, Sodexo Account Manager at Neve Fleetwood, said: \"The Open proved a very busy but enjoyable time for us and it was a pleasure to supply such a prestigious event .\""}, {"articleID": "2015062819_00011649_W", "names": {"Phil Jackson": ["Q16197662", "Q21464447", "Q2342953", "Q316246", "Q7182034"]}, "date": "2015-06-26", "url": "http://www.thescore.com/news/786308", "content": "New York Knicks president of basketball operations <mark>Phil Jackson</mark> turned heads Thursday when he selected 7-foot-1, 230-pound Latvian center Kristaps Porzingis with the No.\nCarmelo, according to source, called Tim Hardaway Jr. late Thursday to express his displeasure with <mark>Phil Jackson</mark>'s draft night moves.\nDrama may be brewing in the Big Apple in the wake of the Porzingis pick, but <mark>Jackson</mark> is resolute in his decision.\nSpeaking with ESPN's Chris Broussard, <mark>Jackson</mark> justified tabbing Porzingis as their new prized rookie.\nHas a great attitude, good family, working at the game,\" <mark>Jackson</mark> said.\n<mark>Jackson</mark> intends to surround his rookies (the Knicks also traded for the draft rights to Notre Dame's Jerian Grant) with veterans in order to relieve them of overwhelming pressure in their first year."}, {"articleID": "2019081704_00015697_W", "names": {"Ian Ward": ["Q19670167", "Q45316198", "Q5983200", "Q5983207"]}, "date": "2019-08-17", "url": "http://www.thetelegraphandargus.co.uk/news/17840424.bradford-39-s-west-end-suffers-another-blow-flares-announces-closure/", "content": "<mark>Ian Ward</mark>, chairman of Bradford BID, said:\" It's always sad to see a venue close and we hope a beneficial new use for this building can be found soon."}, {"articleID": "2018101314_00258290_W", "names": {"Dino Rossi": ["Q3707956", "Q5278544"]}, "date": "2018-10-13", "url": "https://www.seattletimes.com/seattle-news/politics/i-1634-campaign-with-millions-from-soda-industry-aims-to-block-local-sweet-beverage-taxes/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all", "content": "Most Read Local Stories Federal jury awarded $5 million to man fired from Mercedes-Benz of Seattle after cancer surgery Tales from the road: How I survived decades of Skagit-to-Seattle commuting \"The Property': A family's getaway cabin defined its dreams, until a tragic Sunday morning VIEW Kim Schrier ad ties opponent to fugitive developer;\" sleazy garbage,' answers <mark>Dino Rossi</mark> campaign Truck driver arrested in crash at Tiger Mountain summit that killed 2 Unlimited Digital Access."}, {"articleID": "2012110811_00043480_W", "names": {"Thomas Day": ["Q21166189", "Q3525032", "Q42325085"]}, "date": "2012-11-08", "url": "http://thetimesnews.com/lifestyles/lifestyles-home/luncheon-lecture-with-thomas-day-scholar-planned-for-nov-15-1.45752", "content": "\"<mark>thomas day</mark>: man in the middle,\" a luncheon and lecture with laurel sneed, a <mark>thomas day</mark> scholar, will be at 11:30 a.m. nov. 15 at alamance country club, 2402 pineway drive, burlington.\nsneed is executive director of the apprend foundation and serves as director of the <mark>thomas day</mark> education project, which she co-founded in 1994. in 1995, sneed conducted the research that discovered <mark>thomas day</mark>'s origins and her work continues today."}, {"articleID": "2018042210_00190108_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-04-22", "url": "http://abc7.com/presidents-trump-macron-solidify-political-bromance-with-state-visit/3377883/", "content": "Emmanuel Macron had reportedly studied <mark>Donald Trump</mark>'s style of domineering power-grabbing handshakes, apparently prepared to avoid being outdone by his counterpart."}, {"articleID": "2013021312_00096687_W", "names": {"Ron Erickson": ["Q16106250", "Q7363743"]}, "date": "2013-02-13", "url": "http://capitolhillblue.com/node/46422", "content": "<mark>ron erickson</mark>, whose house is only about quarter mile away, said officers interrogated him to make sure he wasn't being held hostage.\n<mark>erickson</mark> himself had been keeping a nervous watch on his neighborhood, but he never saw the hulking dorner."}, {"articleID": "2017041120_00995216_W", "names": {"Mark Johnson": ["Q1279758", "Q1356869", "Q16189328", "Q16215327", "Q16575072", "Q1727524", "Q28055509", "Q28314503", "Q3294120", "Q47432482", "Q50618258", "Q55013886", "Q59556844", "Q6767862", "Q6768255", "Q6768256", "Q6768258", "Q6768259", "Q6768261", "Q6768262", "Q6768263", "Q6768264", "Q6768265", "Q6768266", "Q6768267"]}, "date": "2017-04-11", "url": "https://flaglerlive.com/106844/bova-threats/", "content": "\"As I understand he's not taking his medication in jail,\" Assistant State Attorney <mark>Mark Johnson</mark> told the judge."}, {"articleID": "2009110915_00124833_W", "names": {"Fu Lu": ["Q45424321", "Q45486808"]}, "date": "2009-11-09", "url": "http://odditycentral.com/tag/architecture", "content": "it is a ten-story high representation of <mark>fu lu</mark> shou (good fortune, prosperity and longevity) that apparently holds the guinness world record for the \"biggest image building\" ...whatever that means."}, {"articleID": "2011121216_00044971_W", "names": {"Sanjay Gupta": ["Q17484165", "Q28419671", "Q510034", "Q644401", "Q7418430"]}, "date": "2011-12-12", "url": "http://darkhorizons.com/news/22607/news-shorts-december-12th-2011", "content": "(full details) \"tnt has ordered a pilot for\" chelsea general \", a new medical series from producer david e. kelley and practicing neurosurgeon and cnn chief medical correspondent dr. <mark>sanjay gupta</mark>, md.\""}, {"articleID": "2019111816_00141720_W", "names": {"Mike Murray": ["Q16091548", "Q6380412"]}, "date": "2019-11-18", "url": "https://www.timesleader.com/news/762936/nanticoke-native-palovchak-named-times-leader-circulation-director", "content": "\"We are extremely lucky to be able to add a person of Lorri's caliber to our team,\" Times Leader Media Group Publisher <mark>Mike Murray</mark> said.\n\"In addition to her general newspaper circulation knowledge, her service and communication expertise will aid us in providing an even better customer experience for our readership,\" <mark>Murray</mark> added."}, {"articleID": "2011112807_00041654_W", "names": {"King Abdullah": ["Q57298", "Q57464"]}, "date": "2011-11-23", "url": "http://mysanantonio.com/opinion/editorials/article/Kuwait-needs-reform-not-more-repression-2292629.php", "content": "in an interview with the bbc last week, <mark>king abdullah</mark> predicted the arab spring was \"not even halfway through .\""}, {"articleID": "2015011517_00011553_W", "names": {"Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"]}, "date": "2015-01-15", "url": "http://www.weau.com/home/headlines/Walker-scheduled-to-give-speech-in-Washington-288698691.html", "content": "<mark>Scott Walker</mark>'s travel schedule is picking up as eyes a possible run for president.\n<mark>Walker</mark> was slated to give the keynote address at the Republican National Committee annual winter meeting Thursday night in San Diego, California.\nAnd on Jan. 30 <mark>Walker</mark> is scheduled to give a speech at a conservative think tank that focuses on the economy in Washington, D.C.."}, {"articleID": "2012031617_00072311_W", "names": {"Ted Stevens": ["Q50599", "Q7693764"]}, "date": "2012-03-16", "url": "http://abajournal.com/news/article/report_blasts_feds_for_systematic_concealment_of_significant_exculpatory_ev/?utm_source=feedburner&utm_medium=feed&utm_campaign=ABA+Journal+Daily+News", "content": "news report blasts feds for \"systematic concealment' of exculpatory evidence in alaskan senator's case in a more than 500-page report filed thursday in federal court in washington, d.c., a court-appointed lawyer tasked with investigating the failed federal prosecution of the late u.s. sen. <mark>ted stevens</mark> of alaska not only sharply criticized the government's handling of the case, citing a lack of supervision and inadequate effort to comply with rules regarding the provision of helpful evidentiary material to the defense, but gave specific examples of wrongdoing .\"\nthe investigation and prosecution of u.s. senator <mark>ted stevens</mark> were permeated by the systematic concealment of significant exculpatory evidence, which would have independently corroborated senator <mark>stevens</mark>'s defense and his testimony, and seriously damaged the testimony and credibility of the government's key witness, \"said special counsel henry schuelke iii in the report.\nabajournal.com:\" inexperience and staffing problems plagued <mark>stevens</mark> prosecutors \"generation y has become\" generation why bother,' stats suggest; are careers affected?"}, {"articleID": "2013031416_00012506_W", "names": {"Jack Payne": ["Q10449107", "Q16236439", "Q21622339"]}, "date": "2013-03-14", "url": "http://nola.com/outdoors/index.ssf/2013/03/pre-katrina_maps_show_where_sp.html#comments", "content": "<mark>jack payne</mark> has been studying satellite maps that predate the 2005 passage of hurricane katrina to learn where the old ponds and small lakes were.\n\"some of the spots we were fishing today were old duck ponds prior to katrina,\" <mark>payne</mark> said after a wednesday-morning trip.\nthe washouts surrounding those old ponds may be a foot or two deep, but the ponds themselves are in 4 - to 5-foot wheelhouse that <mark>payne</mark> said is the magic zone for this time of year.\n\"everybody thinks those trout run out of the area when a front comes through, but they really don't; they just run to the deeper part,\" <mark>payne</mark> said.\n<mark>payne</mark> fishes out of a 23-foot kenner, and he's fearless about exploring."}, {"articleID": "2017050217_00815567_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-05-02", "url": "http://vanityfair.com/news/2017/05/infosys-jobs-donald-trump", "content": "After spending the whole of his campaign and first 100 days in office railing against any company even entertaining the thought of sending jobs overseas or not hiring American workers stateside, <mark>Donald Trump</mark> can claim a victory: Infosys Ltd., Bangalore-based I.T.-services firm, will hire 10,000 Americans within the next two years, as well as open four hubs within the U.S., starting in Indiana this summer.\nAnd unlike with previous press announcements from companies like Sprint and GM, which recycled old jobs plans to flatter the president's ego, it appears Infosys really did respond to <mark>Trump</mark>'s harsh rhetoric.\nAn executive order <mark>Trump</mark> signed last month, initiating a government review that is expected to make it harder for companies to obtain H-1B visas for workers who might undercut American labor.\nWhile tech companies throughout Silicon Valley rely heavily on the H-1B program, which is designed to allow high-skill workers to enter the United States, <mark>Trump</mark>'s directive is expected to focus on restricting visas at the lower end of the skill spectrum, disproportionately affecting call-center companies like Infosys.\nVishal Sikka offered Reuters a comment on the move that sounded like it could have been dictated by <mark>Trump</mark> himself: \"When you think about it from a U.S. point of view, obviously creating more American jobs and opportunities is a good thing .\"\nWhile the move isn't guaranteed to get Infosys out of <mark>Trump</mark>'s crosshairs, it is almost certain to increase the company's labor costs."}, {"articleID": "2017050515_00099368_W", "names": {"Abdul Sattar": ["Q17486434", "Q4409050", "Q59490492"]}, "date": "2017-05-05", "url": "http://www.wbrc.com/story/35351068/pakistan-afghan-border-cross-fire-kills-15-on-both-sides", "content": "Afghan security forces backed by artillery fired without provocation on Pakistani census workers and soldiers escorting them...By <mark>ABDUL SATTAR</mark> and MUNIR AHMEDAssociated Press QUETTA, Pakistan (AP) - Backed by artillery, Afghan security forces fired across the border on Pakistani census workers and troops escorting them on Friday, killing nine and drawing a response from the military, Pakistan said."}, {"articleID": "2018053113_00167729_W", "names": {"Stephen Curry": ["Q352159", "Q43981708", "Q5573861"]}, "date": "2018-05-31", "url": "http://chronicle.northcoastnow.com/browns-notes/2018/05/31/BrownsZone-New-safety-Damarious-Randall-goes-viral-with-tweet-about-Cavs.html", "content": "Randall, the new Browns free safety who's a big fan of Golden State Warriors guard <mark>Stephen Curry</mark>, became one of the most popular subjects on the internet the last couple of days after sending this tweet late Monday night: \"If the Cleveland Cavaliers win the 2018 NBA finals I'll buy everyone who retweet's this a jersey...\"As of 9 p.m. Wednesday, it had been retweeted 892,000 times--about 131,000 more than when Randall met with reporters about seven hours earlier.\n\"Randall is from Pensacola, Fla., and doesn't have ties to the Warriors but started following <mark>Curry</mark> when he came out of college.\nI'm glad the Cavs made it to the finals so I can watch <mark>Curry</mark> light that b * #% $up Game 3 & 4, \"he tweeted.\nOh, just the stadium, I mean the crowd, ’cause obviously <mark>Curry</mark> does shoot a lot of threes and he scores a lot of points, so that would be lighting it up, \"he said .\""}, {"articleID": "2018121117_00979467_W", "names": {"David Keane": ["Q25172044", "Q52815831", "Q56260413"]}, "date": "2018-12-11", "url": "http://brentwoodweeklynews.co.uk/news/national/17291082.350000-police-misconduct-hearing-should-have-been-avoided/", "content": "At a hearing at Warrington Town Hall on Tuesday, police and crime commissioner <mark>David Keane</mark> said the panel, led by Rachel Crasnow QC, had found no allegations of misconduct or gross misconduct were proved against Mr Byrne.\nSpeaking after the hearing, Mr Byrne said:\" This whole affair has been an ordeal for all parties that has gone on too long and wasted precious public money scrutinising my conduct when leading what Mr <mark>Keane</mark> has described himself as a high performance force.\nMy statement is below and you can read the full report here ➡ ️ https: //t.co/oidcnDDgxM pic.twitter.com/NBE6BxseX3--<mark>David Keane</mark> (@ CheshirePCC) December 11, 2018 Mr <mark>Keane</mark> said the proceedings had cost just under £ 350,000 but his office had made savings much greater than that amount over the past couple of years."}, {"articleID": "2012022815_00044277_W", "names": {"Thomas Gardner": ["Q1617711", "Q27902488", "Q27924881"]}, "date": "2012-02-28", "url": "http://xconomy.com/new-york/2012/02/28/keyview-launches-with-plan-to-fund-health-startups/", "content": "chairman <mark>thomas gardner</mark> is a turnaround specialist who worked at procter & gamble, simon & schuster, and ims health, and was vice president of j & j's mcneil consumer products co. vice chairman richard shanley spent 25 years as an audit partner at deloitte, where he worked with a range of private and public companies."}, {"articleID": "2012091811_00030328_W", "names": {"Louis Smith": ["Q445224", "Q639998"]}, "date": "2012-09-18", "url": "http://breakingnews.ie/entertainment/humble-dappy-wants-to-dance-on-strictly-567349.html", "content": "the\" no regrets' singer - whose cousin tulisa contostavlos is a judge on rival show' x factor' - thinks he would be a great competitor on the bbc talent show, which this year features <mark>louis smith</mark>, jerry hall and victoria pendleton, because he is a good mover."}, {"articleID": "2010102804_00253892_W", "names": {"Aaron White": ["Q4662533", "Q4662534"]}, "date": "2010-10-28", "url": "http://dailyherald.com/article/20101027/sports/710289711/", "content": "a long, well-struck free kick from alex bochat forced giants keeper <mark>aaron white</mark> into a save at 10 minutes.\nmoments after the break, the vikings took lead, courtesy a well-played corner sent low on the floor by brian hindle from the near flag to filosa, who on the turn, fired a smash off of <mark>white</mark> and into the net.\nthe vikings stepped up the tempo in search of cutting into the giants' lead, and nearly did so if not for a brilliant save by <mark>white</mark>, who in full stretch to his left somehow stopped a shot by hindle at point-blank range.\nand although it was one-way traffic heading in the direction of <mark>white</mark> and company, the vikings were not able to score again."}, {"articleID": "2013110606_00066259_W", "names": {"Adrian Peterson": ["Q1398352", "Q373983"]}, "date": "2013-11-05", "url": "http://examiner.com/article/missing-mississippi-family-that-disappeared-after-fiery-crash-found-dead", "content": "Entire family mysteriously disappears after Mississippi car crash Baby girl dies after intoxicated mother passes out while breastfeeding Amanda Knox trial: Meredith Kercher DNA not found on knife in new tests LAX shooter, Paul Ciancia, could face death penalty, say authorities Rebecca Sedwick case: Mom of girl accused of bullying faces child abuse charges Rebecca Sedwick suicide: Boyfriend talks, says he didn't know about bullying Man accused of beating <mark>Adrian Peterson</mark>'s son has prior domestic abuse indictment (Photos) Man charged in relation to beating death of NFL star <mark>Adrian Peterson</mark>'s son Baby Kate case: New evidence leads to murder charge against missing girl's dad (Video) Amanda Knox case: Untested evidence on butcher knife may be factor in new trial Bryce Laspisa case: Parents of missing California student plan Illinois vigil 31-year-old woman poses as teen to have sex with 14-year-old boy Baby girl dies after intoxicated mother passes out while breastfeeding A 20-year-old gunman fired shots inside a New Jersey mall before taking his own life The Milky Way could contain billions, yes billions, of habitable planets Roughly 1,500 famous paintings stolen by Nazis have been found in a Munich apartment Dr. Phil hosts Michelle Knight for a powerful tell-all of her 10 year captivity"}, {"articleID": "2019102709_00123898_W", "names": {"Frank Lampard": ["Q41533", "Q461633"]}, "date": "2019-10-27", "url": "http://www.clactonandfrintongazette.co.uk/sport/national/17996243.hat-trick-hero-christian-pusilic-nearly-forgot-match-ball/", "content": "Pulisic's first Chelsea goals arrived in a hurry as he rewarded <mark>Frank Lampard</mark>'s decision to give him a first league start since August with a match-winning performance, scoring in the 21st, 45th and 56th minutes to put them in complete control before Willian added a fourth.\n\"It was a seventh straight win in all competitions for <mark>Lampard</mark>'s youthful side, made all the more special for the manager as it came on the back of arguably their best result yet--a 1-0 Champions League win over Ajax in Amsterdam on Wednesday.\n#BURCHE pic.twitter.com/peMyp0WAuf--Chelsea FC (@ ChelseaFC) October 26, 2019\" It's really pleasing because it's a worry, \"said <mark>Lampard</mark>, who included Pulisic ahead of Callum Hudson-Odoi in the only change from midweek .\"\nWATCH ➡ ️ https: //t.co/kx3AhztEFg pic.twitter.com/IynV1c697s--Burnley FC (@ BurnleyOfficial) October 27, 2019\" We knew it would be a tough match, \"<mark>Lampard</mark> added .\""}, {"articleID": "2016051909_00128466_W", "names": {"Richard Anderson": ["Q3934757", "Q52621684", "Q7323733", "Q932647"]}, "date": "2016-05-19", "url": "http://www.mprnews.org/story/2016/05/19/twin-cities-archdiocese-readies-post-bankruptcy-plan", "content": "At a late March court hearing, archdiocese attorney <mark>Richard Anderson</mark> told a federal judge that a plan would include financial contributions from the archdiocese and insurers."}, {"articleID": "2011042505_00027304_W", "names": {"Mao Li": ["Q45433741", "Q45456423"]}, "date": "2011-04-25", "url": "http://nation.com.pk/pakistan-news-newspaper-daily-english-online/Entertainment/25-Apr-2011/Man-spends-one-year-living-in-a-pipe", "content": "man spends one year living in a pipe this concrete tube has been home to houseproud <mark>mao li</mark> for a year.\n<mark>mao</mark> has installed a wood floor, door, rugs and cushions in the 6ft floodpipe."}, {"articleID": "2017051320_00483408_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-05-14", "url": "http://www.freepressjournal.in/world/donald-trump-may-be-a-poet-without-knowing-it/1067682", "content": "Home / World / <mark>Donald Trump</mark> may be a poet without knowing it!\n<mark>Donald Trump</mark> may be a poet without knowing it!--By | May 14, 2017 12:08 am Agencies FOLLOW US: make poetry great again Oslo: \"I know words...I have the best words,\" <mark>Donald Trump</mark> had once said in his superlative way.\n<mark>Trump</mark> the poet?\n\"What <mark>Trump</mark> says is closer to poetry and fiction than to reality,\" said Chris Felt, the Norwegian man who created the collection.\nThe book's tongue-in-cheek title is \"Make poetry great again'--a play on <mark>Donald Trump</mark>'s campaign slogan\" Make America great again'.\nAmong the choice bits turned to poems in the book are words about his daughter that <mark>Donald Trump</mark> said around 10 years ago.\nReading <mark>Donald Trump</mark>'s words as poetry, Felt said he felt in them \"more despair, more insecurity and perhaps an inferiority complex\".\nAccording to the publisher, Kaggen, the first print run was 2,000 copies--one of which has been sent to <mark>Donald Trump</mark>."}, {"articleID": "2010011917_00083275_W", "names": {"Stephen Baldwin": ["Q310947", "Q42889419"]}, "date": "2010-01-19", "url": "http://cotswoldjournal.co.uk/uk_national_entertainment/4859656.Tougher_regime_for_CBB_housemates/?ref=rss", "content": "actor-turned-preacher <mark>stephen baldwin</mark> shouted: \"the hotter it is, the more you make me feel like jesus, son."}, {"articleID": "2018101306_00048386_W", "names": {"Kevin Schmidt": ["Q10432773", "Q1740247", "Q1740249", "Q26091", "Q3195802"]}, "date": "2018-10-13", "url": "http://www.washingtontimes.com/news/2018/oct/13/old-army-depot-now-teems-with-wildlife-in-iowa/", "content": "As I stepped outside to give photographer <mark>Kevin Schmidt</mark> uninterrupted interior shots, I spotted something on the ground."}, {"articleID": "2009031707_00104090_W", "names": {"Ted Kennedy": ["Q134549", "Q326157"]}, "date": "2009-03-17", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=47884264&blogId=430283436", "content": "(likewise, look up <mark>ted kennedy</mark>'s position on windmills in nantucket sound .)"}, {"articleID": "2015122916_00671781_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2015-12-29", "url": "http://blogs.wsj.com/washwire/2015/12/29/super-pac-backing-jeb-bush-attacks-marco-rubio-in-ad-airing-in-iowa/", "content": "Article Comments (1) 2016 2016 Election Ads Iowa Jeb Bush Marco Rubio Right to Rise PAC By Rebecca Ballhaus @ rebeccaballhaus rebecca.ballhaus @ wsj.com Biography CONNECT @ rebeccaballhaus rebecca.ballhaus @ wsj.com Biography Marco Rubio and <mark>Donald Trump</mark> shake hands as Jeb Bush looks on during the Republican presidential debate in Milwaukee Nov. 10, 2015.\nMore In 2016 5 New Year's Resolutions for <mark>Trump</mark>, Clinton and Other 2016 Campaigns Video: Ted Cruz Is Loathed in Washington but Loved in Iowa For Obama, 2015 Was a Mixed Year in Foreign Policy Capital Journal Daybreak: <mark>Trump</mark>'s Strength Points to New Dynamic in New Hampshire, More Seib Video: Three Things to Watch for Next Year in Politics \"Days after the Paris attacks, senators came together for a top-secret briefing on the terrorist threat,\" the narrator intones, referring to the terrorist attacks in Paris last month that left more than 120 people dead.\nEarlier this month, Right to Rise aired an ad campaign nationally and in four early states knocking Republican front-runner <mark>Donald Trump</mark> as\" impulsive and reckless \"and criticizing votes by Texas Sen. Ted Cruz that it said would\" dramatically weaken counter-terrorism surveillance."}, {"articleID": "2013081923_00073162_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2013-08-19", "url": "http://www.newkerala.com/news/story/56243/indian-army-chief-meets-pm.html", "content": "New Delhi, Aug 19: Indian Army chief General Bikram Singh met Prime Minister <mark>Manmohan Singh</mark> here Monday, official sources said."}, {"articleID": "2018101106_00292433_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2018-10-11", "url": "http://www.gamereactor.eu/esports/?sid=1e4a7620fb124b802eb42fa66dc835b9", "content": "Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 12 Along with PUBG and Blackout.\nWritten by <mark>Sam Bishop</mark> on the 10th of October 2018 at 11 Including video content and workbooks.\nWritten by <mark>Sam Bishop</mark> on the 10th of October 2018 at 10 It's a \"strategic effort to position our organisation for the future .\"\nWritten by <mark>Sam Bishop</mark> on the 10th of October 2018 at 09 They'll have their rematch against Astralis.\nWritten by <mark>Sam Bishop</mark> on the 10th of October 2018 at 08 The Blizzard Arena Los Angeles is hosting 16 top players.\nWritten by <mark>Sam Bishop</mark> on the 9th of October 2018 at 13 Coming to Las Vegas in December.\nWritten by <mark>Sam Bishop</mark> on the 9th of October 2018 at 13 Including Uzi, Svenskeren, and more."}, {"articleID": "2017061707_00294928_W", "names": {"Dustin Johnson": ["Q1002293", "Q30015838"]}, "date": "2017-06-17", "url": "http://www.arkansasonline.com/news/2017/jun/17/how-about-showing-dj-little-respect-201/", "content": "a A Font Size PHOTO BY AP/CHRIS CARLSON Defending U.S. Open champion <mark>Dustin Johnson</mark>, the world's No.\n<mark>Johnson</mark> played the tournament's first eight holes in 3 over in the opening round and never recovered.\nAs <mark>Dustin Johnson</mark> approached his ball buried in the tall grass on the 17th hole at Erin Hills, a fan standing just a few feet away offered a little pick-me-up to the world's No.\nIt was that sort of day for <mark>Johnson</mark>, who either didn't notice the misspeak or didn't care, because by that point the first round in defense of his 2016 U.S. Open title was already headed the wrong direction.\nEven though <mark>Johnson</mark> played even-par golf the rest of the way to finish with a 3-over 75, it still left him 10 strokes back after the first round.\n\"Where I went wrong is when I laid it up in the hay,\" <mark>Johnson</mark> said matter-of-factly after his round, referring to his brutal 14th.\nBy the time <mark>Johnson</mark> walked off the green on his final hole, 44 players were under par."}, {"articleID": "2010032621_00089395_W", "names": {"Darnell Mcdonald": ["Q3016418", "Q5224127"]}, "date": "2010-03-26", "url": "http://fullcount.weei.com/sports/boston/baseball/red-sox/2010/03/26/lowell-suffers-setback-with-knee-contusion/", "content": "mike lowell helped off the field by mike reinold and terry francona after fouling ball off his left knee #redsox option lhp fabio castro to triple-a and reassign of <mark>darnell mcdonald</mark> to the minor."}, {"articleID": "2014091307_00006491_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2014-09-13", "url": "http://www.denverpost.com/rss/ci_26523122?source=rss", "content": "\"Home décor runs the gamut from antique-filled traditionalism to stark modernism,\" Christopher Grubb, president of Arch-Interiors, in <mark>Beverly Hills</mark>, told me."}, {"articleID": "2015120423_00103798_W", "names": {"James Boyd": ["Q16588788", "Q43918632", "Q56421215", "Q6130075"]}, "date": "2015-12-04", "url": "http://www.abqjournal.com/686236/news/ex-officers-charged-in-nm-shooting-death-ask-to-move-trial.html", "content": "Sandy and Perez shot <mark>James Boyd</mark> after an hours-long standoff in March 2014.\nBoth Sandy and Perez have pleaded not guilty to second-degree murder and assault charges in the shooting death of <mark>Boyd</mark>, who authorities say suffered from mental illness.\n<mark>Boyd</mark> had been camping illegally in the foothills on the east side of New Mexico's largest city.\n\"In August, a judge ruled there was probable cause for the officers' case to go to trial after a two-week preliminary hearing in which Special Prosecutor Randi McGinn argued <mark>Boyd</mark> couldn't have posed a threat to officers when he was killed because he was shot in the side and back.\nDefense attorneys contend <mark>Boyd</mark> presented a danger and had threatened officers, leaving them no choice but to shoot as their training had taught them."}, {"articleID": "2013101422_00069235_W", "names": {"Steve Russell": ["Q16195304", "Q2634274", "Q30122065", "Q42277880", "Q43388452"]}, "date": "2013-10-14", "url": "http://www.recyclingtoday.com/Article.aspx?article_id=146726", "content": "\"Many Milwaukee residents already know that they can take back plastic grocery bags to many retail stores for recycling,\" says <mark>Steve Russell</mark>, vice president of plastics for the American Chemistry Council."}, {"articleID": "2011071922_00059924_W", "names": {"Thomas Hill": ["Q2424735", "Q3066250", "Q55361165", "Q733899", "Q7790682"]}, "date": "2011-07-19", "url": "http://sacramentopress.com/headline/53559/Museum_Adventures_for_Mom_Dad_and_Tots", "content": "artist <mark>thomas hill</mark>'s \"sugar loaf peak, el dorado county, 1865\" is one of the featured paintings in \"birdy's\"."}, {"articleID": "2009102314_00003284_W", "names": {"Martin Baker": ["Q19949704", "Q24817439", "Q6774929", "Q6774930"]}, "date": "2009-10-23", "url": "http://carrickfergustimes.co.uk/latest-london-news/Probe-39vindicates39-suspended-Met-officer.5762188.jp", "content": "the senior officer said an inquiry by dorset chief constable <mark>martin baker</mark> found a series of allegations against him were unfounded and baseless."}, {"articleID": "2016050408_00404421_W", "names": {"Mariela Castro": ["Q253736", "Q58031633"]}, "date": "2016-05-04", "url": "http://mysinchew.com/node/113991?tid=10", "content": "Everyone wants to discover it, savor it, enjoy it, explore it,\" said <mark>Mariela Castro</mark>, the daughter of President Raul Castro and a prominent gay-rights activist on the island."}, {"articleID": "2017020615_00165952_W", "names": {"Luis Enrique": ["Q222789", "Q322350"]}, "date": "2017-02-06", "url": "http://www.aol.co.uk/living/2017/02/06/messi-alba-and-umtiti-backed-by-luis-enrique-over-ban-threat/", "content": "Messi, Alba and Umtiti backed by <mark>Luis Enrique</mark> over ban threat By Omnisport Feb 6th 2017 02:46 PM - <mark>Luis Enrique</mark> says Barcelona trio Lionel Messi, Jordi Alba and Samuel Umtiti will play as normal against Atletico Madrid despite being one booking away from missing a potential Copa del Rey final.\n<mark>Luis Enrique</mark>, though, will play Messi, Alba and Umtiti without fear of them receiving a costly ban and does not expect the tense situation to affect their play.\n<mark>Luis Enrique</mark>: My players are experts in big games https: //t.co/WLCx4KWp2I #CopaFCB #ForçaBarça pic.twitter.com/F21IO0LVmN"}, {"articleID": "2011010517_00177618_W", "names": {"Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2011-01-05", "url": "http://gossipcop.com/lindsay-lohan-breathalyzer-betty-ford-rehab-palm-desert-police/", "content": "(update) cell phone butt dial leads to hilarious (for us) 30-person swat team intervention <mark>glenn beck</mark> dropped by new york city radio station for low ratings blake griffin announces he'll be in slam dunk contest, world rejoices airplane fight!"}, {"articleID": "2019021016_00201137_W", "names": {"Jerry Anderson": ["Q14950481", "Q16096792", "Q6183201"]}, "date": "2019-02-10", "url": "https://www.kansas.com/news/business/article226062840.html#storylink=rss", "content": "Lawmakers with conflicts can have general discussions in private that avoid specifics of pending legislation or that aren't used to develop legislation related to their conflict, legislative ethics committee administrator <mark>Jerry Anderson</mark> said.\nThat's a realistic concern, <mark>Anderson</mark> said.\nSenate Democratic Leader Tom Begich, who serves on the ethics committee, cautioned against \"over-interpreting\" the new law and said legislators with questions can check with <mark>Anderson</mark>'s office."}, {"articleID": "2016072715_00239660_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-07-27", "url": "http://feeds.cbsnews.com/~r/CBSNewsMain/~3/qw7sqDmAvkY/", "content": "\"But what the motives were in terms of the leaks and all that, I can't say directly, but what I do know is that <mark>Donald Trump</mark> has repeatedly expressed admiration for Vladimir Putin .\"\nAsked if the president was suggesting that Putin is motivated to prefer <mark>Trump</mark> in the White House, Mr. Obama said, \"I am basing this on what Mr. <mark>Trump</mark> himself has said.\nAnd I think that <mark>Trump</mark>'s gotten pretty favorable coverage back in Russia .\"\nIn an interview with CBS's Miami affiliate, <mark>Trump</mark> denied that he has any ties to Russia and that its government is trying to help him win this election."}, {"articleID": "2017111310_00297922_W", "names": {"John Woo": ["Q16887100", "Q55432"]}, "date": "2017-11-13", "url": "http://www.ibtimes.sg/k-pop-band-got7-member-jackson-wangs-presence-mtv-ema-2017-makes-everyone-go-gaga-over-him-19867", "content": "look at this #mtvema impact jacks gained 10k followers on instagram in one day akssjsjaja pic.twitter.com/sJFXgzsGjx--londonson (@ sseunah) November 13, 2017 Check out GOT7 Jackson Wang speaking English at MTV EMA 2017: Related BTS members tweet in celebration of their official account crossing 10m followers on Twitter Picture of Song Joong ki, Song Hye Kyo showing off director <mark>John Woo</mark>'s wedding gift breaks internet From Song Hye Kyo to Park Shin Hye: Check out 6 naturally beautiful South Korean actresses without plastic surgery Kim Hee Sun, YoonA join Asia Artist Awards 2017 lineup Related BTS members tweet in celebration of their official account crossing 10m followers on Twitter Picture of Song Joong ki, Song Hye Kyo showing off director <mark>John Woo</mark>'s wedding gift breaks internet From Song Hye Kyo to Park Shin Hye: Check out 6 naturally beautiful South Korean actresses without plastic surgery Kim Hee Sun, YoonA join Asia Artist Awards 2017 lineup"}, {"articleID": "2019122701_00054251_W", "names": {"Amit Sharma": ["Q42710044", "Q47150541", "Q4746882", "Q50583295"]}, "date": "2019-12-26", "url": "https://timesofindia.indiatimes.com/city/delhi/businessman-with-bullet-injury-found-dead-in-car/articleshow/72986788.cms", "content": "<mark>Amit Sharma</mark>, deputy commissioner of police, Shahdara, said \"The weapon has been seized."}, {"articleID": "2014041602_00014782_W", "names": {"Bill Brown": ["Q16188871", "Q2667644", "Q27147689", "Q4908278", "Q4908280", "Q4908282", "Q4908284", "Q4908288", "Q4908289", "Q4908293", "Q861987"]}, "date": "2014-04-15", "url": "http://www.independent.com/news/2014/apr/15/morua-pleads-guilty-dui-and-fatal-hit-and-run-char/", "content": "We should all just kill ourselves and let nature take back the earth and it will be like we were...Bottom Line: <mark>Bill Brown</mark> blew it badly by NOT closing down the streets as authorized by the Supes."}, {"articleID": "2019111823_00026745_W", "names": {"Denis Shapovalov": ["Q20979382", "Q4520285"]}, "date": "2019-11-18", "url": "http://www.clactonandfrintongazette.co.uk/sport/national/18044734.new-look-davis-cup-launches-hiccups-madrid/", "content": "Despite being without their number two Felix Auger-Aliassime, who has been sidelined by injury, 150th-ranked Vasek Pospisil upset world number 12 Fabio Fognini 7-6 (5) 7-5 before <mark>Denis Shapovalov</mark> edged a very tight encounter against eighth-ranked Matteo Berrettini 7-6 (5) 6-7 (3) 7-6 (5)."}, {"articleID": "2019030715_00332406_W", "names": {"Jess Phillips": ["Q19979409", "Q6185996"]}, "date": "2019-03-07", "url": "http://www.wiltsglosstandard.co.uk/news/national/17484632.silence-in-the-commons-as-mp-reads-out-names-of-women-killed-by-men/", "content": "Silence in the Commons as MP reads out names of women killed by men By Press Association 2019 The Houses of Parliament, as <mark>Jess Phillips</mark> was speaking during the parliamentary debate marking International Women's Day 0 comment The House of Commons listened in silence as an MP read out the names of some 130 women killed by men in the last year.\nLabour's <mark>Jess Phillips</mark> said she wanted to use the parliamentary debate marking International Women's Day to honour her promise to share the names of those women who had died since the previous debate.\nLabour MP <mark>Jess Phillips</mark> reads out the names of women killed by men in the last 12 months (PA) It took Ms <mark>Phillips</mark> more than four minutes to read out the names and she thanked Karen Ingala Smith, of the Counting Dead Women project, for \"tirelessly\" recording the lives of the women affected.\nMs <mark>Phillips</mark> explained: \"In the first International Women's Day debate I ever attended I promised to read out the names of women killed by men since the last International Women's Day--today I will honour that promise .\"\nTerrible .--Anna Turley MP (@ annaturley) March 7, 2019 After reading out the names, Ms <mark>Phillips</mark> added: \"I could feel the nervousness in the room that I wouldn't finish reading the list within seven minutes and that is how we should feel every single minute of every single day--nervous that one of our constituents will wake up dead .\""}, {"articleID": "2011040719_00068545_W", "names": {"Luis Guzman": ["Q3266716", "Q347395", "Q5679615"]}, "date": "2011-04-07", "url": "http://orlandosentinel.com/entertainment/os-movie-review-arthur,0,7836053.story?track=rss", "content": "we meet him as he and his chauffeur (<mark>luis guzman</mark>) run the batmobile - yes, he's bought it - under the wall street bull statue.\nrussell brand, jennifer garner, helen mirren, nick nolte, greta gerwig, <mark>luis guzman</mark> comments are moderated."}, {"articleID": "2014060909_00001661_W", "names": {"William Scott": ["Q28853025", "Q43390409", "Q43912263"]}, "date": "2014-06-09", "url": "http://lasvegassun.com/news/2014/jun/08/two-officers-shot-cicis-nellis-suspects-run-wal-ma/?utm_source=mostpopular&utm_medium=banner&utm_campaign=mostRead", "content": "<mark>William Scott</mark>, who oversees Bolden Area Command, which is just north of U.S. 95 and abuts the command area where the shootings took place, said tough times would be coming as officers ponder the senseless act."}, {"articleID": "2012091123_00074925_W", "names": {"Ryan Griffin": ["Q14918294", "Q14950701"]}, "date": "2012-09-11", "url": "http://courant.com/sports/uconn-huskies/hc-jacobs-randy-edsall-column-0912-20120912,0,2709610.column?track=rss", "content": "north carolina state, yes, <mark>ryan</mark> wirth did talk about how fired up the team would be to face edsall and maryland.\n\"the wound is healed,\" <mark>ryan griffin</mark> said."}, {"articleID": "2016082811_00663229_W", "names": {"Matteo Renzi": ["Q47563", "Q49661315"]}, "date": "2016-08-28", "url": "http://jg-tc.com/entertainment/italy-probes-to-see-if-criminal-negligence-raised-quake-toll/article_2cc68bc5-4113-502c-af66-9aee98fa8547.html", "content": "As Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake.\nAs Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake.\nAs Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake.\nAs Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake.\nAs Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake.\nAs Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake.\nAs Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake.\nAs Italians observed a day of national mourning, President Sergio Mattarella and Premier <mark>Matteo Renzi</mark> joined grieving family members for a state funeral for some of the victims of Wednesday's quake."}, {"articleID": "2009120411_00294255_W", "names": {"Franc Rode": ["Q468883", "Q5478312"]}, "date": "2009-12-04", "url": "http://bulletin.aarp.org/states/az/2009/48/articles/study_catholic_sisters_focuses_religious_role.html", "content": "a vatican-approved web site on the study (www.apostolic visitation.org) includes information from cardinal <mark>franc rode</mark> on the reasons for the study .\"\nlike other vocations in the church, religious life has passed through challenging times, \"<mark>rode</mark> wrote .\""}, {"articleID": "2019101413_00240695_W", "names": {"Anurag Kashyap": ["Q2839609", "Q56248257"]}, "date": "2019-10-14", "url": "https://www.thehindu.com/entertainment/movies/irfan-pathan-all-set-to-make-cinema-debut/article29682012.ece", "content": "Gnanamuthu has directed the critically acclaimed crime thrillers \"Demonte Colony' and\" Imaikka Nodigal', the latter featuring popular Hindi cinema director <mark>Anurag Kashyap</mark> in a leading role."}, {"articleID": "2009072414_00066303_W", "names": {"Thomas Moore": ["Q16929722", "Q20707242", "Q30122690", "Q3525423", "Q3725484", "Q53770004", "Q57633659", "Q58887370"]}, "date": "2009-07-24", "url": "http://publishersweekly.com/article/CA6672574.html?rssid=192", "content": "new chairman inez tenenbaum, as well as commissioners <mark>thomas moore</mark> and nancy nord, voted on monday to approve the guidelines."}, {"articleID": "2016070817_00858692_W", "names": {"Sunil Shroff": ["Q17074754", "Q57317610"]}, "date": "2016-07-08", "url": "http://www.thehindubusinessline.com/specials/pulse/why-it-is-difficult-to-cut-out-organ-blackmarketers/article8824813.ece?homepage=true", "content": "<mark>Sunil Shroff</mark>, Managing Trustee with Chennai's Mohan Foundation, echoes these views.\nAs a kidney surgeon himself, <mark>Shroff</mark> says, despite having stringent procedures to weed out fraudsters, \"later we (have) realised we were duped\".\nDonor initiatives <mark>Shroff</mark> says that frauds can be plugged if the donor-recipient shortage is addressed, and the number of voluntary organ donations increases substantially.\nBut Iran is set to review it, says <mark>Shroff</mark>."}, {"articleID": "2011070512_00117956_W", "names": {"Barry Cooper": ["Q4864115", "Q4864116", "Q4864118", "Q706646"]}, "date": "2011-07-05", "url": "http://rawstory.com/rs/2011/07/05/greenpeace-ship-rainbow-warrior-iii-debuts/", "content": ": aids' anniversary prompts speculation about the future exclusive: hackers unearth fbi report on \"kopbusters' filmmaker <mark>barry cooper</mark>"}, {"articleID": "2018101208_00104161_W", "names": {"Chris Weston": ["Q27889126", "Q5108451"]}, "date": "2018-10-12", "url": "https://wdef.com/2018/10/12/asian-stock-markets-stem-bleeding-left-behind-by-wall-street-2/#respond", "content": "\"It seems Asia has had a reassessment, and calmer heads have prevailed as we close out the week,\" <mark>Chris Weston</mark> of Pepperstone Group Limited said in a commentary."}, {"articleID": "2014040508_00014126_W", "names": {"Stephanie Bell": ["Q11341858", "Q19802802"]}, "date": "2014-04-04", "url": "http://www.mcclatchydc.com/2014/04/04/223525/miami-woman-arrested-in-connection.html#storylink=rss", "content": "<mark>Stephanie Bell</mark>, director of cruelty cases for PETA, called the arrest \"excellent news.\n<mark>Bell</mark> said the group also had tipped off authorities in Redford's case in Lee County, where she said he had moved.\n<mark>Bell</mark> said such videos, graphically depicting animal torture and death, are illegal under state and federal laws."}, {"articleID": "2011021819_00066948_W", "names": {"Jerry Brown": ["Q152451", "Q717620"]}, "date": "2011-02-18", "url": "http://blogs.sacbee.com/capitolalertlatest/2011/02/jerry-brown-orders-state-to-st.html", "content": "<mark>jerry brown</mark> this morning ordered state agencies to stop buying key chains, coffee mugs and other swag, saying the state spent $7.5 million on such items from 2007 to 2010.\n\"not a cent of taxpayer money should be spent on flashlights, ashtrays or other unnecessary items, most of which likely end up in landfills,\" <mark>brown</mark> said in a prepared statement.\n<mark>brown</mark>, seeking to close a $26.6 billion budget deficit through cuts and tax extensions, faces a budget deadline next month.\n<mark>brown</mark> said in his order that state agencies spent $7.5 million on \"items including key chains, squeeze toys, pens, hats, trinkets, shirts, cups and other gift items known colloquially as's.\n\"<mark>brown</mark>'s office said the majority of spending on swag, $5.1 million, was by the business, transportation and housing agency."}, {"articleID": "2011082513_00056069_W", "names": {"J. Cole": ["Q204018", "Q56604513", "Q6105158"]}, "date": "2011-08-25", "url": "http://celebuzz.com/2011-08-25/rihanna-chalks-up-sex-tape-rumor-to-slow-news-day/", "content": "meanwhile back in the states, rumors have been swirling that there's a sex tape out there that stars riri and <mark>j."}, {"articleID": "2017090616_00644774_W", "names": {"Don Mattingly": ["Q19843097", "Q679120"]}, "date": "2017-09-06", "url": "http://www.foxsports.com/florida/story/washington-nationals-at-miami-marlins-preview-wednesday-september-6-090617", "content": "Marlins manager <mark>Don Mattingly</mark> said he is grateful team owner Jeffrey Loria is picking up the tab to take families of players and coaches on their upcoming seven-day road trip, including four games at Atlanta and three at Philadelphia.\nWatch the Miami Marlins on FOX Sports Florida Marlins Clubhouse \"(The Marlins) are providing a service for our families,\" <mark>Mattingly</mark> said.\n<mark>Mattingly</mark>, though, is not as interested in talking about anything except team goals.\n<mark>Mattingly</mark> also said he likes the expanded playoffs, with a second wild-card berth now available."}, {"articleID": "2019070605_00142585_W", "names": {"Jennifer Brady": ["Q13562450", "Q17612134"]}, "date": "2019-07-06", "url": "https://wwos.nine.com.au/tennis/wimbledon-nick-kyrgios-caught-pub-party-planning/840f085b-3b3a-40ae-a7cf-fc835228c91b", "content": "Kyrgios teamed up with American Desirae Krawczyk but unfortunately the pair were defeated 7-6, 6-7, 5-7 by Marcus Daniell and <mark>Jennifer Brady</mark>."}, {"articleID": "2020020909_00056340_W", "names": {"Susan Rice": ["Q23848423", "Q50612"]}, "date": "2020-02-09", "url": "https://www.onenewspage.com/n/Entertainment/1zlqhn9p4t/Susan-Rice-tells-Snoop-Dogg-to-back-the.htm", "content": "One News Page <mark>Susan Rice</mark> tells Snoop Dogg to \"back the **** off' Gayle King after rapper's profane video; he later denies making threat Sunday, 9 February 2020 (31 minutes ago) Former national security adviser <mark>Susan Rice</mark> Friday told rapper Snoop Dogg to\" back the **** off \"of CBS journalist Gayle King after the rapper slammed her for an interview she did about Kobe Bryant last week.\nfinna #f 4f76412d8e952ceb09ad678f8116f08 #foxnewsentertainmentmedia <mark>Susan Rice</mark> tells Snoop Dogg to\" back the **** off' Gay...https: //t.co/k9lXi632Yc 1 minute ago <mark>SPORTZCODetroit Susan</mark> Rice tells Snoop Dogg to \"back the **** off' Gayle King after rapper's profane video; he later denies making...https: //t.co/bxWt3TBqa8 1 minute ago Drake The Type <mark>To\"</mark> Susan Rice tells Snoop Dogg to \"back the **** off' Gayle King after rapper's profane video; he later denies making...https: //t.co/mPuhFeusp1 3 minutes <mark>ago Andrea</mark> Wells Susan Rice Tells Snoop Dogg to\" Back the **** Off \"Attack on Gayle King for Kobe Bryant Question https: //t.co/dFhwwXGUZY 8 <mark>minutes ago</mark> Nalanda Library Susan Rice tells Snoop Dogg to\" back the f *** off' after he lashed out at Gayle King for Kobe Bryant rape questions...https: //t.co/TkjjiVklRy 50 <mark>minutes ago</mark> Natural Born Sinner Susan Rice Tells Snoop Dogg to \"Back The F ** k Off\" Gayle King https: //t.co/XtrCgmwzYM 3 hours ago Larry Winston = Amigo, this is serious.\nShe bravely stood up for a friend, something we must ALWAYS <mark>do</mark>, plus the fact that Susan b <mark>... https: //t.co/aGX7pVjLxs</mark> 3 hours ago Kaboon_Viper Susan Rice tells snoop dogg to back the f #@ $k off."}, {"articleID": "2020020211_00130795_W", "names": {"Steve Nash": ["Q16137022", "Q192955", "Q42316961"]}, "date": "2020-02-02", "url": "https://sports.inquirer.net/384345/nu-bullpups-near-uaap-juniors-elims-sweep", "content": "<mark>Steve Nash</mark> Enriquez and Terrence Fortea led the defending champions, who hiked their record to 13-0, with 17 points apiece while Gerry Abadiano added 12 points and six assists."}, {"articleID": "2013021216_00024389_W", "names": {"Duncan Williams": ["Q25205747", "Q5314654", "Q57552310"]}, "date": "2013-02-12", "url": "http://modernghana.com/news/445192/1/us-govt-committed-to-africas-peace-pat-alsup.html", "content": "12-02-2013 s.africa opposition predicts anc polls\" hammering' 12-02-2013 somalia arrests second reporter in rape trial case 12-02-2013 lmvca is worthless of attention-mustapha 12-02-2013 u.s gov' t committed to africa's peace - pat alsup 12-02-2013 united nations ghana message on first observance of world radio day in ghana 12-02-2013 united nations ghana congratulates pioneering and present radio producers, presenters and j 12-02-2013 gcpp appoints frederick dadzie as acting general secretary 12-02-2013 removal of fuel subsidy is draconian - afag laments 12-02-2013 woyome case adjourned for 6th time as prosecution fails to produce witness 12-02-2013 doctors' strike is \"an uncivilized act' - labour expert 12-02-2013 angry prophet fires back at <mark>duncan williams</mark>:\" who trained me?"}, {"articleID": "2014071803_00006764_W", "names": {"Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2014-07-17", "url": "http://texasgopvote.com/issues/restore-families/democrats-declare-war-catholic-church-006877", "content": "Palin And West Are Wrong Calling For Impeachment Before November We Will Not Conform LIVE: Making Common Core History-A <mark>Glenn Beck</mark> Event Sen. Cruz: Israel's fight against radical Islamic terrorism, and the Iranian regime that supports it, is our fight as well The Democrats have waged war on the religious liberty, particularly the Catholic Church."}, {"articleID": "2017072413_00543668_W", "names": {"Richard Robinson": ["Q22280073", "Q25711399", "Q28058362", "Q51590316", "Q55713112", "Q7328701"]}, "date": "2017-07-24", "url": "http://www.shropshirestar.com/entertainment/showbiz/2017/07/24/mental-health-crisis-in-music-industry-as-campaign-launched-following-chester-benningtons-death/", "content": "The charity kicked off the funding drive with a $100,000 injection as CEO <mark>Richard Robinson</mark> described the situation as\" urgent \"."}, {"articleID": "2015030507_00003633_W", "names": {"Amy Jackson": ["Q2121695", "Q2121703"]}, "date": "2015-03-05", "url": "http://www.daijiworld.com/news/news_disp.asp?n_id=301698", "content": "Thursday, March 05, 2015 12:25:47 PM (IST) <mark>Amy Jackson</mark>'s near-death experience Chennai, March 5 (IANS): Actress <mark>Amy Jackson</mark>, while shooting for a yet-untitled Tamil action drama, miraculously escaped a fatal fall from a cliff thanks to the timely intervention of her co-star Karunakaran, who saved her.\n\"Udhay and I were on our bike, while <mark>Amy</mark> was driving another two-wheeler.\nAs we started shooting, <mark>Amy</mark> lost control of her vehicle and started drifting towards the edge of the cliff.\n<mark>Amy</mark> was in momentary shock but she eventually completed the shot.\nThe team has successfully completed the first schedule and <mark>Amy</mark> has returned to Mumbai to start working on her Hindi projects."}, {"articleID": "2015031422_00012646_W", "names": {"Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}, "date": "2015-03-14", "url": "http://www.realclearpolitics.com/video/2015/03/14/krauthammer_explains_why_obama_will_have_utterly_defeated_congress_if_he_goes_to_un_over_iran.html", "content": "Gen. Dempsey on Fight Against ISIS: \"Activities Of The Iranians Is A Positive Thing\" <mark>Jon Stewart</mark> Calls Out Hypocrisy of Right And Left For Conducting Foreign Policy Without President FP's Yochi Dreazen: Gulf States Fear An Iran With \"Hegemonic Influence\" Psaki: GOP Letter to Iran \"Brings Into Question Whether They Want To Prevent Iran From Acquiring A Nuclear Weapon\""}, {"articleID": "2012032904_00011792_W", "names": {"Joe Adams": ["Q18612493", "Q27915185", "Q3179959"]}, "date": "2012-03-29", "url": "http://istockanalyst.com/article/viewarticle/articleid/5753208", "content": "post comment--login is required to post message iij announces appointment of three new executive officers and promotion of two executive officers arkansas' <mark>joe adams</mark> to receive \"the jet\" return specialist award box brings new mobile and social capabilities to the post-pc era enterprise zacks investment research, and commentary, news and press releases provided by yellowbrix and quotemedia."}, {"articleID": "2010080523_00076450_W", "names": {"Mark Taylor": ["Q12121376", "Q1646155", "Q16751422", "Q16937410", "Q18331796", "Q1900451", "Q19578043", "Q2735589", "Q30717031", "Q3294253", "Q3294254", "Q4546520", "Q47770287", "Q56149938", "Q58889496", "Q6766958", "Q6769947", "Q6769949", "Q6769950", "Q6769951", "Q6769953", "Q6769954"]}, "date": "2010-08-05", "url": "http://10tv.com/live/content/onnnews/stories/2010/08/05/story-discover-ohio-wakeboarding.html?sid=102", "content": "it's a unique way to stay cool and have fun at the same time at the man-made pond in southwest ohio, reported onn's <mark>mark taylor</mark>."}, {"articleID": "2018012519_00902970_W", "names": {"Jack Campbell": ["Q3029621", "Q3123835", "Q3157139", "Q6111556"]}, "date": "2018-01-25", "url": "https://www.upi.com/Sports_News/College-Football/2018/01/25/Florida-St-QB-Francois-cleared-in-domestic-violence-probe/2671516909448/", "content": "State Attorney <mark>Jack Campbell</mark> told the Orlando Sentinel on Wednesday that Francois will not be charged based on the Tallahassee Police Department's investigation.\n\"Based on the evidence as we understand it and with the conclusions made by the Tallahassee Police Department, I'm in agreement with TPD with insufficient evidence to charge Deondre Francois,\" <mark>Campbell</mark> told the Orlando Sentinel."}, {"articleID": "2016081708_00066480_W", "names": {"Vladimir Nikitin": ["Q15411436", "Q2522628", "Q4319735", "Q4319736"]}, "date": "2016-08-17", "url": "http://www.philstar.com/sports/2016/08/17/1614432/mayweather-rio-roots-us-olympic-boxing-prospect", "content": "Stevenson has Russian fighter <mark>Vladimir Nikitin</mark> up next and the winner goes for gold."}, {"articleID": "2018060100_00159229_W", "names": {"John Cooke": ["Q15637838", "Q19667214", "Q21460847", "Q22958846", "Q28962198", "Q40476653", "Q58049053", "Q6227025", "Q6227029"]}, "date": "2018-05-31", "url": "http://www.reporterherald.com/news/larimer-county/ci_31915359/gov-hickenlooper-signs-transportation-bill-big-thompson-canyon", "content": "Advertisement Sen. <mark>John Cooke</mark>, a Weld County Republican, was one of five sponsors of the bipartisan bill, which he called \"government at its best .\"\n\"We're going to have a wonderful transportation system eventually,\" said <mark>Cooke</mark>."}, {"articleID": "2012092519_00036747_W", "names": {"Julie Brown": ["Q28004983", "Q43184284", "Q454119", "Q524776"]}, "date": "2012-09-25", "url": "http://drugstorenews.com/article/study-most-physicians-support-employer-weight-loss-programs-unhealthy-food-regulations", "content": "\"these results are very important to us and our mission,\" joslin executive director of diabetes innovation and global professional education <mark>julie brown</mark> said."}, {"articleID": "2014112115_00054412_W", "names": {"Christopher Graham": ["Q21165674", "Q5112420"]}, "date": "2014-11-21", "url": "http://upi.com/Top_News/World-News/2014/11/21/Peeping-Tom-Russian-hackers-streaming-stolen-webcam-scenes/9581416549859/?spt=hts&or=20", "content": "We have got to grow up about this sort of thing, \"said British Information Commissioner <mark>Christopher Graham</mark>.\""}, {"articleID": "2012102419_00093328_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2012-10-24", "url": "http://essence.com/2012/10/24/stacey-dash-casts-early-vote-mitt-romney", "content": "<mark>donald trump</mark> will give chicago charity $5 million if obama releases school records (video) hmmm...<mark>trump</mark>'s big announcement: michelle & barack obama's divorce papers?"}, {"articleID": "2015050920_00004547_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}, "date": "2015-05-07", "url": "http://www.pressherald.com/2015/05/07/senate-passes-bipartisan-bill-to-review-iran-nuclear-deal/", "content": "Senate Democratic leader <mark>Harry Reid</mark> of Nevada accused the GOP of trying to undermine the commander in chief while empowering the ayatollahs who lead Iran."}, {"articleID": "2011121306_00049097_W", "names": {"Jerry Brown": ["Q152451", "Q717620"]}, "date": "2011-12-13", "url": "http://vcstar.com/news/2011/dec/12/voters-first-take-on-browns-tax-plan-is-poll/?partner=RSS", "content": "<mark>jerry brown</mark>'s proposal for a five-year increase in sales taxes and income taxes paid by those making more than $250,000 a year.\n<mark>brown</mark> seeks to place the proposal, which would generate an estimated $7 billion a year in revenue, before voters in a ballot initiative next fall.\n<mark>brown</mark>'s approval rating among likely voters remained steady at 46 percent, essentially unchanged from the 47 percent he received in january, even as unemployment has remained high and state services have been pared during his first year in office.\nthe poll also showed strong support for public pension reforms proposed by <mark>brown</mark> this fall.\n<mark>brown</mark>'s proposal calls for a hybrid of the two types of plans."}, {"articleID": "2011081108_00048285_W", "names": {"Nick Hill": ["Q55052343", "Q7027303", "Q7027305"]}, "date": "2011-08-11", "url": "http://lansingstatejournal.com/article/20110811/GW01/108110320/MSU-football-Running-back-battle-fierce-friendly?odyssey=tab|topnews|text|FRONTPAGE", "content": "caper and bell look fit and explosive in camp, and talented redshirt freshman <mark>nick hill</mark> is now in the mix as well."}, {"articleID": "2013041106_00033591_W", "names": {"Jimmy Carter": ["Q23685", "Q6199776"]}, "date": "2013-04-11", "url": "http://jewishpress.com/news/breaking-news/mezuzah-arsonist-busted/2013/04/11/?utm_source=rss&utm_medium=rss&utm_campaign=mezuzah-arsonist-busted", "content": "school kids threatened israeli arab citizen charged with joining syrian jihadists 4 major american jewish orgs rebuke cardozo over <mark>carter</mark> award jews still planning to sue <mark>jimmy carter</mark> over anti-israel book mezuzah arsonist strikes again, evoking familiar jewish fears looking for family of soldier killed in fall of gush etzion, 1948 jewishpress: rt @ jewishpress: new article: portugal to award citizenship to descendants of expelled jews - jewishpress: rt @ jewishpress: new article: five women of the wall and haredi man detained - jewishpress: rt @ jewishpress: new article: gordon, schulman appointed to u.s. holocaust memorial council - jewishpress: @ jewishpress https: //t.co/kaijl5cnnr https: //t.co/b1i2d59ljl https: //t.co/a8b8k9xrfc https: //t.co/w1qjzfmhkb https: //t.co/x7qkhvdv2w rt @ jewishpress: new article: 80 new olim celebrate joining the idf - jewishpress: rt @ jewishpress: new article: sounds israeli: lina makhoul sings \"hallelujah' - jewishpress: rt @ jewishpress: new article: sounds israeli: lina makhoul sings\" hallelujah' - jewishpress: rt @ jewishpress: new article: looking for family of soldier killed in fall of gush etzion, 1948 - jewishpress: @ jewishpress thanks for posting!"}, {"articleID": "2011030519_00061283_W", "names": {"John Locke": ["Q21198546", "Q6245090"]}, "date": "2011-03-05", "url": "http://lostpedia.wikia.com/index.php?title=Official_Lost_Podcast_transcript/February_12th,_2009&diff=1025942&oldid=prev", "content": "kris white: what's going on with <mark>locke</mark>'s body?\n<mark>locke</mark>?\nand that episode as the title may infer, you know, has to do with <mark>locke</mark>.\nbut i, there is probably some good information to get in \"316\" before we get to explaining how was that <mark>locke</mark>?\ndamon lindelof: how <mark>locke</mark> ended up in that coffin.\n\"the\" oceanic 6 \"needs to take <mark>john locke</mark>'s body back with them to the island.\nand if <mark>locke</mark> might not be gone for good, as ben suggested, is resurrection of a sort possible for christian?\nwell, in all seriousness, i think that this is an excellent question and in next episode \"316\" you might find someone is talking about <mark>john locke</mark>'s body in relation to christian shephard's body and the word \"proxy\" might be mentioned.\nand i have no doubt that once <mark>locke</mark> is brought back to the island he will also take zombie form and live again."}, {"articleID": "2017091500_00227343_W", "names": {"James Woods": ["Q193105", "Q2333487", "Q6145792"]}, "date": "2017-09-14", "url": "https://www.click2houston.com/entertainment/fergie-and-josh-duhamel-announce-separation", "content": "More Entertainment Headlines Amber Tamblyn, <mark>James Woods</mark> continue Twitter spat (CNN) - Pop star Fergie and actor Josh Duhamel have announced they are separating after eight years of marriage.\nMore Entertainment Headlines Amber Tamblyn, <mark>James Woods</mark> continue Twitter spat The two married in 2009 and are parents to 4-year-old son, Axl."}, {"articleID": "2018111916_00273944_W", "names": {"Ajit Pai": ["Q3528364", "Q4699790"]}, "date": "2018-11-19", "url": "https://www.knoe.com/content/news/Estimate-Nearly-50-of-cellphone-calls-in-2019-will-be-robocalls-500837212.html", "content": "As FCC chairman <mark>Ajit Pai</mark> told \"CBS This Morning\" in March, \"For those things that are within our authority, we're pursuing them very aggressively .\""}, {"articleID": "2019100304_00129233_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-10-03", "url": "http://wicz.com/story/41133543/kamala-harris-poll-numbers-tumble-in-her-home-state-of-california", "content": "and \"Are you the person who is most likely to defeat <mark>Donald Trump</mark>?\""}, {"articleID": "2017122212_00499138_W", "names": {"Jessica Shaw": ["Q28957221", "Q39061600"]}, "date": "2017-12-22", "url": "http://ew.com/tv/2017/12/22/bingeworthy-best-tv-revivals-2017/", "content": "On the latest edition of Bingeworthy, hosts <mark>Jessica Shaw</mark> and Lola Ogunnaike shared their picks for the year's top revival, with <mark>Shaw</mark> choosing Netflix's One Day at a Time and Ogunnaike selecting Will & Grace."}, {"articleID": "2010073119_00291506_W", "names": {"Jack Doyle": ["Q16233105", "Q39089724"]}, "date": "2010-07-31", "url": "http://digitaljournal.com/article/295360", "content": "the organization contracted <mark>jack doyle</mark> to research and write the report."}, {"articleID": "2017120117_00733484_W", "names": {"Carlos Queiroz": ["Q313209", "Q9697298"]}, "date": "2017-12-01", "url": "http://alpha.supersport.com/football/fifa-world-cup-2018/news/171201/Portugal_clash_concerns_Spain_boss", "content": "Iran's Portuguese coach <mark>Carlos Queiroz</mark>, who also had a brief spell in charge at Real Madrid, was more enthusiastic as he claimed he couldn't have wished for a better draw.\n\"Personally I am very happy because it is a group with two teams from two very special places for me,\" said <mark>Queiroz</mark>."}, {"articleID": "2018041518_00063848_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-04-15", "url": "http://abc11.com/news/comey-says-his-assumption-clinton-would-win-was-a-factor-in-the-email-investigation/3345493/", "content": "LIVE VIDEO Wheelmobile at Streets at Southpoint in Durham Watch Now share tweet share email Comey says his assumption Clinton would win was' a factor' in the email investigation SHARE: share tweet share email SHARE share tweet share email ABCNews LAUREN EFFRON Sunday, April 15, 2018 02:04 PM James Comey said his decision to announce that the FBI was going to look back into the Hillary Clinton email investigation just days before the election was influenced by his belief that she would beat <mark>Donald Trump</mark> and his desire to make sure that the election results were viewed as legitimate.\n\"I don't remember consciously thinking about that, but it must have been because I was operating in a world where Hillary Clinton was going to beat <mark>Donald Trump</mark>, and so I'm sure that it was a factor,\" Comey told ABC News' chief anchor George Stephanopoulos in an exclusive interview ahead of the April 17 release of his book, \"A Higher Loyalty: Truth, Lies, and Leadership .\"\nThis comment goes further than what Comey wrote in his book, in which he says, \"Like many others, I was surprised when <mark>Donald Trump</mark> was elected president.\nWhen asked if he would still release the letter if he knew that doing so would help elect <mark>Donald Trump</mark>, Comey said, \"I would.\nHe said that on the morning that they were going to release the letter, a colleague asked him if he should consider how the letter could help <mark>Trump</mark>."}, {"articleID": "2010030501_00127967_W", "names": {"Richard Neal": ["Q1464697", "Q7328011"]}, "date": "2010-03-05", "url": "http://ktnv.com/global/story.asp?s=12083002", "content": "\"what we need to do is to take the temperature of what's happened in the committee and at least proceed with some discussions and give the interim chairman some room to make some suggestions,\" said rep. <mark>richard neal</mark> of massachusetts, a senior democrat on the committee."}, {"articleID": "2020033123_00029844_W", "names": {"Joseph Cohen": ["Q19629750", "Q28703566"]}, "date": "2020-03-31", "url": "http://ctpost.com/news/education/article/Marshall-held-boot-camp-for-faculty-for-online-15167961.php", "content": "\"From a real practical standpoint it's hard to imagine how they would enforce this order without violating the Fourth Amendment,\" <mark>Joseph Cohen</mark>, executive director of the ACLU chapter, said in an interview."}, {"articleID": "2011070713_00121109_W", "names": {"Willie Nelson": ["Q206112", "Q8021739"]}, "date": "2011-07-07", "url": "http://waff.com/story/15040164/romanian-prince-and-actor-dead-at-70", "content": "hacking costs tabloid more ads, link to vets group taylor swift postpones georgia, nc concerts regis philbin selling greenwich, conn., house apnewsbreak: woman drops \"three cups of tea' suit\" elliot \"writer opera back on after homophobia row us music sales rise for first time since 2004 donnie yen calls film fight with wang a milestone judge rejects <mark>willie nelson</mark> plea deal in pot case malfoy actors talk good, evil as potter saga ends bucharest, romania (ap) - serban cantacuzino, a romanian prince and actor who starred in films, musicals and children's serials, has died."}, {"articleID": "2019061315_00273145_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}, "date": "2019-06-13", "url": "http://www.surreycomet.co.uk/news/national/17704953.uk-ready-to-assist-over-suspected-attacks-on-tankers-in-gulf-of-oman/", "content": "<mark>Theresa May</mark>'s official spokesman told a Westminster briefing: \"Attacks on civilian vessels like these are completely unacceptable .\""}, {"articleID": "2015112801_00009694_W", "names": {"Michael Murphy": ["Q15460198", "Q21170748", "Q2746614", "Q47451216", "Q492789", "Q55086802", "Q600339", "Q6832969", "Q6832970", "Q6832974", "Q6832977", "Q6832985", "Q6832986", "Q7484818"]}, "date": "2015-11-28", "url": "http://www.irishexaminer.com/lifestyle/features/celebrities-pick-the-book-that-had-the-most-impact-on-their-lives-367295.html", "content": "\"<mark>MICHAEL MURPHY</mark> The book for me is Walt Whitman's Leaves Of Grass, the poetry collection on which he worked all his life .\"\n* <mark>Michael Murphy</mark> is a psychoanalyst, poet and RTÉ television producer/director and newscaster."}, {"articleID": "2012010318_00056621_W", "names": {"Derek Dooley": ["Q5261924", "Q5261925"]}, "date": "2012-01-03", "url": "http://wtvq.com/sports/story/Vols-WR-Arnett-granted-release/kXkA7vAeZkSyIE4AqdXr7g.cspx", "content": "tennessee wide receiver deanthony arnett has been granted his release from the football program, head coach <mark>derek dooley</mark> said tuesday.\nbut <mark>dooley</mark> said tuesday that he was \"very comfortable carving out an exception for [arnett]\" to get back to his father.\n\"the most important concern for me is the welfare of our student-athletes,\" <mark>dooley</mark> said."}, {"articleID": "2011032301_00043737_W", "names": {"Ian Smith": ["Q19879108", "Q2066705", "Q20706233", "Q21165143", "Q21455125", "Q27915041", "Q29877016", "Q3147321", "Q3147322", "Q3348235", "Q43137658", "Q57247212", "Q57904183", "Q59452659", "Q5980715", "Q5982927", "Q5982930", "Q5982932", "Q5982934", "Q5982935", "Q5982945"]}, "date": "2011-03-23", "url": "http://scoop.co.nz/stories/BU1103/S00707/unisys-signs-it-support-services-agreement-with-alphawest.htm", "content": "we selected unisys as they complement our skill-set and have adopted industry-leading standards to ensure our clients receive the consistently high level of support and service they have come to expect from alphawest,\" said mr <mark>ian smith</mark>, acting ceo, alphawest."}, {"articleID": "2012103005_00006460_W", "names": {"Robbie Williams": ["Q2156159", "Q2156168", "Q47875", "Q7341022", "Q7341023", "Q7341027"]}, "date": "2012-10-30", "url": "http://music-news.com/ShowNews.asp?nItemID=58776", "content": "news <mark>robbie williams</mark>: i'd take mila kunis to a hotel printable version <mark>robbie williams</mark> says he would take mila kunis to \"the nearest hotel' if he was single and had the opportunity.\nthe take that singer and his wife ayda field welcomed daughter theodora into the world on september 18. but when <mark>robbie</mark> was asked if he would be up for\" privately entertaining the star' by uk newspaper the sun he gave the idea some thought.\n\"i'm married and i respect and love my wife too much,' <mark>robbie</mark> proclaimed .\"\n<mark>robbie</mark> made no mention of the black swan star's boyfriend, ashton kutcher."}, {"articleID": "2020040620_00057894_W", "names": {"Shane Lowry": ["Q2067337", "Q2736966"]}, "date": "2020-04-06", "url": "https://www.krwg.org/post/golf-reshuffles-its-schedule-all-4-majors-canceled-or-postponed", "content": "Last year, <mark>Shane Lowry</mark> (right) celebrated winning that championship."}, {"articleID": "2010071507_00161713_W", "names": {"Neil Patel": ["Q6989128", "Q6989132"]}, "date": "2010-07-14", "url": "http://dailycaller.com/2010/07/14/the-daily-caller-acquires-keitholbermann-com-2/", "content": "\"\"this is part of our long-term growth strategy,\" added publisher and ceo <mark>neil patel</mark>."}, {"articleID": "2014092502_00046218_W", "names": {"Frank Jackson": ["Q21621551", "Q5487508"]}, "date": "2014-09-25", "url": "http://newsnet5.com/news/local-news/oh-cuyahoga/spirit-airlines-to-begin-offering-service-at-cleveland-hopkins", "content": "Mayor <mark>Frank Jackson</mark> says the move will potentially bring in new traffic to the city from places like Dallas, Las Vegas and a handful of spots in Florida including Spirit's hub in Fort Lauderdale.\n\"Anytime you can make it inexpensive or cheaper for people to travel to some places and they make choices, maybe they'll pick Cleveland,\" <mark>Jackson</mark> said."}, {"articleID": "2019120502_01295754_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-12-05", "url": "http://www.gamereactor.eu/?system=3ds&sid=9ce0e3f8e1d233b69dc109bb4450e466", "content": "GRTV Vatican priest sets up a Minecraft server for players to join Written by <mark>Sam Bishop</mark> on the 3rd of December 2019 at 11:36 Nothing ungodly will be going on here, as it's \"about getting people together who can then maybe move those relationships to the real world\".\nWe explore Layton's Mystery Journey on today's stream Written by <mark>Sam Bishop</mark> on the 14th of November 2019 at 11:56 Katrielle and the Millionaires' Conspiracy might be a mouthful, but we're ready to chew on the various puzzles inside.\nWritten by <mark>Sam Bishop</mark> on the 12th of October 2019 at 10:41 The series is over 30 years old, and they've shared some little tidbits of information with fans.\nMario & Luigi developer AlphaDream files for bankruptcy Written by <mark>Sam Bishop</mark> on the 3rd of October 2019 at 09:25 The filing took place this week with the Tokyo District Court, and they were responsible for many Mario & Luigi games.\nMinecraft is getting a Nether Update Written by <mark>Sam Bishop</mark> on the 30th of September 2019 at 11:36 This adds new biomes, increased accessibility, Piglins, and more to the game, since Mojang wants you to explore more of the Nether.\nMinecraft has 112 million players each month Written by <mark>Sam Bishop</mark> on the 16th of September 2019 at 13:00 Studio head Helen Chiang revealed the colossal number, and says it's a game people always come back to.\nShovel Knight Showdown offers \"robust experience\" Written by <mark>Sam Bishop</mark> on the 4th of September 2019 at 14:50 Yacht Club Games' Sandy Gordon ran us through all of the content coming here and with the King of Cards DLC.\nDragon Quest XI S is getting a demo Written by <mark>Sam Bishop</mark> on the 5th of August 2019 at 13:00 The Switch version lands next month, but Square Enix has revealed a demo that has certain incentives attached.\nA sponge mod in Minecraft can absorb the ocean itself Written by <mark>Sam Bishop</mark> on the 9th of July 2019 at 13:25 Sponges don't pack that much of a punch, so one user took to Reddit to share a much more enhanced version.\nUbisoft giving away Rayman Origins for speedrun viewers Written by <mark>Sam Bishop</mark> on the 5th of June 2019 at 12:45 Next week Glackum will try to break the record for Rayman 2, and those who watch can get Origins for nothing."}, {"articleID": "2016092817_00882588_W", "names": {"Tim Evans": ["Q7803475", "Q7803476"]}, "date": "2016-09-28", "url": "http://www.bloomberg.com/news/articles/2016-09-28/gold-holds-losses-as-u-s-consumer-confidence-boosts-dollar", "content": "\"Some of the data that we've seen from an industrial standpoint has been relatively decent,\" <mark>Tim Evans</mark>, the chief market strategist at Long Leaf Trading Group Inc. in Chicago, said in a telephone interview."}, {"articleID": "2016080123_00359263_W", "names": {"Thomas Falk": ["Q7789507", "Q7791054"]}, "date": "2016-08-01", "url": "http://www.fool.com/investing/2016/08/01/forex-dents-kimberly-clark-corp-earnings.aspx?source=iedfolrf0000001", "content": "What management had to say \"We delivered a good quarter of results in a challenging environment while we continue to execute our long-term Global Business Plan strategies,\" said chairman and CEO <mark>Thomas Falk</mark> in a press release.\n\"Cash flow was strong in the quarter and we continued to allocate capital in shareholder-friendly ways,\" added <mark>Falk</mark>."}, {"articleID": "2009022708_00005691_W", "names": {"Adam Mckay": ["Q350405", "Q41538972"]}, "date": "2009-02-27", "url": "http://ksl.com/?nid=156&sid=5703692", "content": "it's a similar approach of recommendations from well-known personalities like you see on will ferrell and <mark>adam mckay</mark>'s funnyordie.com _ albeit with a wider purview."}, {"articleID": "2013060211_00003638_W", "names": {"David Thompson": ["Q1176843", "Q14950372", "Q15378706", "Q16499854", "Q16830995", "Q18924157", "Q20710001", "Q28434580", "Q310082", "Q5236246", "Q5240375", "Q5240378", "Q5240379", "Q5240380", "Q5240381", "Q5240382", "Q5240383", "Q56192238", "Q58065993", "Q718669"]}, "date": "2013-06-02", "url": "http://www.nationnews.com/articles/view/just-wait-people/", "content": "This is a policy position articulated by late Prime Minister <mark>David Thompson</mark> and reiterated by Prime Minister Freundel Stuart and reinforced by the minister, even in the face of recent suggestions by one trade unionist that Government was preparing the \"turf\" for a wave of dismissals."}, {"articleID": "2012011018_00091043_W", "names": {"Jillian Michaels": ["Q2971799", "Q6193168"]}, "date": "2012-01-10", "url": "http://blisstree.com/move/6-quick-at-home-workouts-on-youtube-218/", "content": "here are 6 great boot camp, pilates, yoga, and cardio workouts, ranging from 5 minutes to 25 minutes and featuring instructors like <mark>jillian michaels</mark>, to get you started."}, {"articleID": "2019020518_00161199_W", "names": {"Matthew Whitaker": ["Q48847394", "Q6790538"]}, "date": "2019-02-05", "url": "https://www.washingtonexaminer.com/news/alexandria-ocasio-cortez-fires-back-at-dan-crenshaw-over-super-bowl-tax-tweet", "content": "Caitlin Yilek Tuesday February 05, 2019 The top Democrat on the House Judiciary Committee said Tuesday he plans to have a subpoena prepared out of an \"abundance of caution\" in case acting Attorney General <mark>Matthew Whitaker</mark> tries to \"dodge uncomfortable questions .\""}, {"articleID": "2012020223_00023211_W", "names": {"David Johnson": ["Q124853", "Q15990087", "Q16213577", "Q16237771", "Q18222359", "Q18719509", "Q20670771", "Q211868", "Q27973830", "Q34925897", "Q36911873", "Q41788582", "Q5235690", "Q5235692", "Q5235693", "Q5235694", "Q5235697", "Q5235701", "Q5235702", "Q5235704", "Q5235707", "Q5235708", "Q56478702", "Q56648512", "Q56650740", "Q56754483"]}, "date": "2012-02-02", "url": "http://wbay.com/story/16664541/2012/02/02/motorcade-brings-fallen-soldiers-body-home-on-friday", "content": "the defense department said 1st lieutenant <mark>david johnson</mark> was killed by a roadside bomb while walking on patrol in the kandahar province.\nfriday, <mark>johnson</mark>'s body will arrive at milwaukee's airport and taken by motorcade through horicon to mayville, where an honor guard will give <mark>johnson</mark> a rifle volley salute.\non saturday there will be visitation for <mark>johnson</mark> at mayville high school from 1 to 7 p.m., and continue sunday from noon to 2 p.m. a memorial service immediately follows at 2 p.m., before military rites and honors are performed at 4. lawmaker wants to lift statute of limitations for violent crimes \"the monsters that commit these crimes should live with the fear of being prosecuted until they draw their last breath,\" an outagamie county lawmaker says.\nmotorcade brings fallen soldier's body home on friday memorial arrangements are set for 1lt <mark>david johnson</mark> of mayville."}, {"articleID": "2019082518_00070016_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-08-25", "url": "http://www.gamereactor.eu/?system=ps4&sid=706662a1fc6716df908954a4dc5e0d58", "content": "0 Katsuki Bakugo and Majin Buu land in Jump Force next week Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 15:46 Character Pack 2 will usher in two fresh characters, and a new trailer shows off the Valley of the End stage as well.\n0 Dragon Quest Builders director leaves Square Enix Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 15:11 Kazuya Niinou is moving on from the company, and says he \"wanted to try out a development cycle different from Square Enix\".\n0 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 14:40 Missiles, dash velocity, and more are in the firing line, addressing plenty of complaints from the community.\n0 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 14:09 We get another insight into CD Projekt Red's RPG ahead of the gameplay stream happening next week.\n0 Battlefield V no longer getting 5v5 competitive mode Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 13:52 This has been scrapped in order to focus on other areas, although DICE still wants a \"competitive gaming experience\".\n0 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:50 These are coming in December, although the September update is focused on getting newcomers on board.\n0 Brenda Romero on board game design influencing Empire of Sin Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:14 The team even held a sort of \"pseudo-D & D session\" when coming up with the ideas for a game in 1920s Chicago.\n0 Black Desert Online's PS4 launch trailer features Megan Fox Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 11:10 There are several editions of the game to choose from, and a Partner Program available for content creators as well.\n0 Empire of Sin's goal is \"to put you in the shoes of a 1920s boss\" Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 10:17 Brenda Romero breaks down all of the moving parts within Empire of Sin during our interview at Gamescom this year.\n0 New Nioh 2 images show us our \"half-breed\" hero Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 09:40 We're half human and half Yokai in this game, and we'll get another look at the sequel next month during the Tokyo Game Show.\n0 Celeste and Inside free with Epic Games Store next week Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 09:14 The two acclaimed titles are free at the same time, following on from Fez which is available now.\n0 Oninaki releases with a shiny new launch trailer Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 08:44 Tokyo RPG Factory and Square Enix's game is here for PC, PS4, and Switch, and there's also a demo too.\n0 Kingdom Under Fire 2 lands in November Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 15:43 A new trailer reveals the release date and gives a look at what we can expect as we head into winter."}, {"articleID": "2014012309_00024593_W", "names": {"Paul Lee": ["Q16210380", "Q20740130", "Q27924830", "Q27924831", "Q50129828", "Q57422067", "Q7151993", "Q7151994", "Q7151996", "Q7151997", "Q9196154"]}, "date": "2014-01-23", "url": "http://www.sanluisobispo.com/2014/01/22/2888500/alabama-house-approves-tax-credit.html#storylink=rss", "content": "The bill's sponsor, Republican Rep. <mark>Paul Lee</mark> of Dothan, told the House about adopting a daughter and the expense involved.\n<mark>Lee</mark> said the bill would also save the state about $5,400 a year for each foster child adopted."}, {"articleID": "2017062217_00363232_W", "names": {"Bill Walsh": ["Q15993626", "Q2903384", "Q4911274", "Q4911275", "Q4911277"]}, "date": "2017-06-22", "url": "http://m.nzherald.co.nz/fisher-funds/news/article.cfm?c_id=1503733&objectid=11880516", "content": "In a Stanford University class on start-up companies, he posted a slide quoting NFL coach <mark>Bill Walsh</mark>:\" How to tell if you're doing the job: If you're up at 3am every night, have a knot in your stomach, a rash on your skin and you're losing touch with your wife and kids."}, {"articleID": "2015031715_00059534_W", "names": {"Olli Heinonen": ["Q11885409", "Q16298772", "Q7088295"]}, "date": "2015-03-17", "url": "http://nationalinterest.org/node/12433", "content": "The current discussions would allow for Iran to operate around 6,500 centrifuges, but according to the IAEA former deputy director-general, <mark>Olli Heinonen</mark>, that number goes well beyond what is needed for civilian applications."}, {"articleID": "2011041302_00055306_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2011-04-13", "url": "http://minnesota.publicradio.org/display/web/2011/04/12/pawlenty-is-running/?refid=0", "content": "morgan asked pawlenty whether he would consider running as a vice presidential candidate with <mark>donald trump</mark>."}, {"articleID": "2018090512_00181202_W", "names": {"Patrick Osborne": ["Q17521924", "Q7147434"]}, "date": "2018-09-05", "url": "https://www.prnewswire.com:443/news-releases/scality-ring-brings-public-cloud-private-with-hpe-greenlake-flex-capacity-300705228.html", "content": "In the context of today's massive growth in unstructured data, elastic consumption combined with infinitely-scalable HPE Scalable Object Storage with Scality RING clearly makes good sense, \"said <mark>Patrick Osborne</mark>, HPE's VP & GM for Big Data and Secondary Storage .\""}, {"articleID": "2019080205_00089801_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2019-08-02", "url": "http://www.thedailystar.net/world/news/north-korea-increases-pressure-latest-missile-launches-1780696", "content": "The North has been testing missiles despite Trump's June 30 meeting with North Korean leader <mark>Kim Jong Un</mark>, where they agreed to revive the talks.\nNorth Korean state media said <mark>Kim</mark> oversaw the firing of what it described as a new large-calibre, multiple-launch guided rocket system on Wednesday.\n<mark>Kim</mark>'s government was not only signalling negotiating demands with the tests, it was assiduously improving military capabilities, said Leif-Eric Easley, an international relations professor at Seoul's Ewha University.\nTrump was asked at the White House before he set off for a campaign trip to Ohio if he thought <mark>Kim</mark> was testing him and said the launches did not violate the North Korean leader's promises to him.\nThe <mark>UN</mark> Security Council met behind closed doors in New York on Thursday to discuss the latest missile launches."}, {"articleID": "2017101315_00482639_W", "names": {"Mark Campbell": ["Q18631520", "Q3849456", "Q41212795", "Q54858776", "Q56073254", "Q6766977", "Q6766978"]}, "date": "2017-10-13", "url": "http://www.bucksfreepress.co.uk/news/15595861.Rock_legend_Ozzy_Osbourne_sends_message_of_support_ahead_of_charity_concert/", "content": "\"The concert, mainly featuring bands from the school, has been arranged by Pipers Corner's guitar teacher <mark>Mark Campbell</mark>--whose terminally ill father Ian has been treated by the hospice at Butterfly House, High Wycombe.\n<mark>Mark</mark>, whose own acoustic band Luna Sees will also play on the night, said:\" I wanted to give something back because The South Bucks Community Hospice has done a really wonderful job looking after my father.\n<mark>Mark</mark>'s father Ian, 62, suffers from Motor Neurone Disease.\nTo book tickets for the Pipers Corner concert, email http: //www.piperscorner.co.uk/our-school/box-office or to bid in advance for the guitar, email <mark>Mark</mark> at mcampbell @ piperscorner.co.uk."}, {"articleID": "2009020503_00041304_W", "names": {"Charles Reed": ["Q22106118", "Q5081968", "Q57412767"]}, "date": "2009-02-05", "url": "http://feeds.sfgate.com/click.phdo?i=bb663b1d1444cb127deadb94aad1042f", "content": "he emphasized that he had talked to legislators, california state university chief <mark>charles reed</mark> and community college leaders."}, {"articleID": "2017051116_00525742_W", "names": {"Nick Evans": ["Q3339740", "Q7025358", "Q7027082", "Q723355", "Q981527"]}, "date": "2017-05-11", "url": "http://www.breitbart.com/news/massive-snake-slowly-slithers-across-south-africa-golf-course/", "content": "Conservation staff member, <mark>Nick Evans</mark>, said the giant snake was likely a Southern African Python measuring about 11 feet long and \"made of pure muscle .\"\n\"Notice how, at first, it appears to move a bit like a slug, moving in a straight line,\" <mark>Evans</mark> said.\n<mark>Evans</mark> said the golfers were lucky to witness one of South Africa's largest snake species, which have faced dwindling numbers due to poaching.\n<mark>Evans</mark> said."}, {"articleID": "2013082119_00057637_W", "names": {"Peter Chou": ["Q16336639", "Q7173267"]}, "date": "2013-08-21", "url": "http://tech2.in.com/news/general/peter-chou-htcs-savior-or-obstacle-to-revival/911756", "content": "N ow in his tenth year as CEO of HTC, <mark>Peter Chou</mark> is lauded as the architect of the Taiwanese firm's award-winning smartphones.\nReuters interviewed a dozen former and current HTC executives who said <mark>Chou</mark>'s abrasive management style and weak strategic vision play their part in the company's decline, which has coincided with the success of Apple's iPhone and Samsung's Galaxy phones.\n<mark>Chou</mark> has said publicly he has no intention to stand down, and executives - none of whom wanted to be named because of the sensitive nature of the issue - said HTC has no clear internal successor.\n<mark>Chou</mark> declined to be interviewed for this article, but in response to Reuters queries, the company said, \"HTC's board and broad employee base remain committed to <mark>Peter Chou</mark>'s leadership.\nThe (flagship) HTC One product family - which has been met with accolades by media and consumers alike - was a result of <mark>Peter</mark>'s vision and leadership, and speaks for itself .\"\nHTC CEO <mark>Peter Chou</mark> may be an obstacle in the company's recovery Born in Myanmar but educated as an electrical engineer in Taiwan, <mark>Chou</mark> joined HTC from Digital Equipment in 1997.\nThat attention to detail and <mark>Chou</mark>'s willingness to make decisions on the fly helped build a culture within HTC of moving quickly to address market demands.\n<mark>Chou</mark> quickly drew some sketches on a whiteboard, recalled one of those present, and soon had the outlines of a device, its price point, and a launch date - just three months away.\nThat's <mark>Peter</mark>,\" said another former senior foreign executive.\nJust three years ago, HTC was shipping 25 million smartphones a year and <mark>Chou</mark> led a huge expansion, bringing in foreign executives from Sony Ericsson, Apple, Motorola and Microsoft as he sought to take on Apple by doubling HTC's shipments.\n<mark>Chou</mark> ordered champagne to celebrate.\nExecutives say HTC's failure to hit sales targets was at least partly down to <mark>Chou</mark>'s management style.\n<mark>Chou</mark> kept his sales, product, marketing and design executives separate and, in some cases, created parallel teams doing the same thing.\n\"<mark>Chou</mark>'s difficulty in developing a durable global brand of handsets and building an ecosystem of apps and services around it raise questions about how HTC can recover under his leadership at a time when high-end smartphone sales growth is slowing .\"\n\"Even his fiercest critics agree <mark>Chou</mark> remains the heart of the company and say it's hard to imagine HTC coming up with great devices without him."}, {"articleID": "2018101101_00100780_W", "names": {"Derek Dooley": ["Q5261924", "Q5261925"]}, "date": "2018-10-10", "url": "https://eu.montgomeryadvertiser.com/story/sports/2018/10/10/how-arkansas-surprised-alabama-defense/1592899002/", "content": "Of course, with Missouri (3-2, 0-2 SEC) and preseason Heisman Trophy contender Drew Lock bringing the Tigers' own innovative offense to town this Saturday, and senior receivers Nate Brown and Emanuel Hall still out with injuries, it's a safe bet first-year Tigers offensive coordinator <mark>Derek Dooley</mark> will try and find different ways to move the ball against No."}, {"articleID": "2012032907_00060828_W", "names": {"Jack White": ["Q10539822", "Q24073723", "Q272031", "Q6115762", "Q70713"]}, "date": "2012-03-29", "url": "http://tennessean.com/article/20120329/BUSINESS01/303290061/2275/RSS05", "content": "annie thurman is a 15-year-old nashville girl who is one of the tributes killed in \"the hunger...i'm not exactly part of the target market, but there's no denying the nostalgic fun of too old for...celebrity column: taylor swift to receive award from michelle obama i love the beginning of spring for the flowers bursting into pastel blooms, the beautifully budding...food is the star in food stylist <mark>jack white</mark>'s world."}, {"articleID": "2018071907_00161277_W", "names": {"John Glenn": ["Q16230701", "Q182642", "Q6235502"]}, "date": "2018-07-19", "url": "http://hardenexpress.com.au/story/5537037/bezos-launches-spacecraft-higher-than-ever/", "content": "Those missions will rely on the bigger, more powerful New <mark>Glenn</mark> rocket still under development.\nHe has named his rockets after NASA's original Mercury astronauts Alan Shepard, the first American in space, and <mark>John Glenn</mark>, the first American to orbit the Earth."}, {"articleID": "2009031300_00029393_W", "names": {"Martin Bryant": ["Q6775074", "Q970560"]}, "date": "2009-03-13", "url": "http://watoday.com.au/national/reforms-target-youth-mental-health-problems-20090313-8wrw.html", "content": "a youth mental health expert welcomed the strategy as potentially the biggest step forward since the kennett government scrapped asylums, but warned that the rest of the plan must be put into effect urgently or victoria could miss treating a young \"potential <mark>martin bryant</mark>\" (the port arthur gunman)."}, {"articleID": "2017102106_00051087_W", "names": {"Cristian Garcia": ["Q5186193", "Q5186194"]}, "date": "2017-10-21", "url": "http://registerguard.com/rg/sports/preps/36070696-79/head-goes-right-hereyy-hereyyyyy.html.csp#civil-comments", "content": "Monroe boasts one of the biggest offensive lines in the state at the 2A level, featuring 6-foot-4, 320-pound <mark>Cristian Garcia</mark> and 6-1, 280-pound Jorge Sanchez, among others."}, {"articleID": "2017112119_00777989_W", "names": {"Charlie Rose": ["Q1064593", "Q715515"]}, "date": "2017-11-21", "url": "http://6abc.com/charlie-rose-fired-from-cbs-amid-sexual-misconduct-allegations/2678671/", "content": "BREAKING NEWS Shots fired at New Castle County police Full Story Email share share tweet email <mark>Charlie Rose</mark> fired from CBS amid sexual misconduct allegations Email share share tweet email ABCNews TARA FOWLER Tuesday, November 21, 2017 02:48 PM CBS has fired veteran journalist <mark>Charlie Rose</mark> after multiple women accused him of sexual misconduct.\nIn a statement to staff posted on Twitter, CBS said <mark>Rose</mark> was terminated \"effective immediately .\"\n\"Despite <mark>Charlie</mark>'s important journalistic contribution to our news division, there is absolutely nothing more important, in this or any organization, than ensuring a safe, professional workplace .\"\nShortly thereafter, PBS released a statement of its own: \"In light of yesterday's revelations, PBS has terminated its relationship with <mark>Charlie Rose</mark> and canceled distribution of his programs.\n<mark>Rose</mark>'s dismissal came after multiple women shared their personal stories with The Washington Post and Business Insider.\nThe Post reported that <mark>Rose</mark>'s accusers either worked with or aspired to work with him on his PBS show, \"<mark>Charlie Rose</mark>,\" from the late 1990s to 2011.\nBusiness Insider featured three women, all former \"<mark>Charlie Rose</mark>\" interns, who also accused <mark>Rose</mark> of inappropriate behavior, speaking to the site on the condition of anonymity.\nBefore being fired on Tuesday, <mark>Rose</mark>'s \"CBS This Morning\" co-anchors Gayle King and Norah O'Donnell addressed the situation, calling for an end to the alleged behavior from <mark>Rose</mark> or anyone else in a position of power.\n<mark>Rose</mark> issued an apology to the Post after the allegations first broke and later shared it on Twitter Monday night.\nTop Stories Shots fired at New Castle County police Granddaughter arrested in Port Richmond stabbing CBS, PBS fire <mark>Charlie Rose</mark> following sexual misconduct allegations Police arrest suspect in fatal shooting of Pa. officer Bank bandit caught on camera in Center City Video shows moments before, after Plymouth Twp."}, {"articleID": "2014082122_00070249_W", "names": {"Ian Read": ["Q1655624", "Q20797619"]}, "date": "2014-08-21", "url": "http://fiercepharma.com/story/pfizer-eyes-actavis-back-plan-another-astrazeneca-bid/2014-08-21", "content": "That pretty well echoes what CEO <mark>Ian Read</mark> said during the company's Q2 earnings call."}, {"articleID": "2019061816_00408990_W", "names": {"Sir John": ["Q28124344", "Q45996744"]}, "date": "2019-06-18", "url": "http://www.ledburyreporter.co.uk/news/national/17714422.hyponatraemia-whistleblower-was-failed-inquiry-says/", "content": "Hyponatraemia whistleblower was failed, inquiry says By Press Association 2019 <mark>Sir John</mark> O'Hara 0 comment The wrong conclusions were reached following an investigation into how a whistleblower's hyponatraemia concerns were handled by officials, an inquiry said.\nChairman <mark>Sir John</mark> O’Hara QC scrutinised the deaths of five children from the condition last year and heavily criticised a \"cover-up\" by some consultants, accusing some doctors of behaving \"inadequately, evasively, dishonestly and ineptly\".\n<mark>Sir John</mark> identified a failure at leadership level after the whistleblower raised concerns in the public interest.\n\"The Health and Social Care Board welcomed the fact that no amendment to the\" essential findings \"of <mark>Sir John</mark>'s report as published in January 2018 is required."}, {"articleID": "2012010920_00019152_W", "names": {"Pargat Singh": ["Q21622901", "Q7136959"]}, "date": "2012-01-10", "url": "http://news.in.msn.com/national/article.aspx?cp-documentid=5738257", "content": "akali dal fields olympian <mark>pargat singh</mark>, sukhbir badal files nomination the ruling shiromani akali dal in punjab monday announced that former indian hockey captain <mark>pargat singh</mark> will be the party's candidate for the jalandhar cantt seat in the jan 30 assembly poll."}, {"articleID": "2013070405_00078616_W", "names": {"Glenn Lewis": ["Q38255975", "Q5568951"]}, "date": "2013-07-03", "url": "http://journalrecord.com/2013/07/03/msc-plan-b-for-moore-real-estate/", "content": "MOORE - Even though the Moore City Council tabled three ordinances that would have changed building codes and required storm shelters in single-family and multifamily dwellings, Mayor <mark>Glenn Lewis</mark> said the effort will continue.\nThe ordinances, <mark>Lewis</mark> said, will be back.\nThe new rules didn't fly, <mark>Lewis</mark> said, because several members of the City Council felt the ordinances were rushed.\n\"We're borrowing from Joplin,\" <mark>Lewis</mark> said.\n<mark>Lewis</mark> wants to see that attitude change.\nAfter the City Council meeting, <mark>Lewis</mark> said city officials formed a working group that includes representatives from the homebuilding industries, policy experts, city officials and others to develop an ordinance that would better protect residents but reflect concerns about costs, too.\nAnd <mark>Lewis</mark>, who has served as mayor during all three of Moore's EF-5 tornadoes, said he expects city's building code to change."}, {"articleID": "2015110214_00181439_W", "names": {"Keith Jackson": ["Q6384543", "Q6384545", "Q6384546"]}, "date": "2015-11-02", "url": "http://marinij.com/general-news/20151102/fbi-and-shrimp-boy-chow-set-to-clash-in-epic-sf-trial", "content": "But it is expected to touch on the origins of the investigation, which only stumbled upon Yee as the FBI probe into Chow's dealings connected the ex-legislator with a number of figures, including San Francisco political consultant <mark>Keith Jackson</mark>, who also has pleaded guilty to racketeering.\nThe direct ties between Yee and Chow in the indictment are tenuous, other than an allegation the legislator agreed to back a resolution praising the Ghee Kung Tong organization for campaign cash, but <mark>Jackson</mark>'s involvement with Chow led the FBI to the senator--and the pursuit of the bribery aspect of the probe.\n\"A workable strategy' James Brosnahan, <mark>Jackson</mark>'s lawyer, said the Chow trial can shine a light on what he considers a wayward investigation that should be reviewed by the Justice Department."}, {"articleID": "2020021903_00094723_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2020-02-18", "url": "http://www.gamereactor.eu/mafia-tactics-game-empire-of-sin-held-back-until-autumn/?sid=9819c80aabbe905ad51e1f0eef2c9473", "content": "2020-02-18 12:03 <mark>Mike Holmes</mark> We've just heard that Empire of Sin, the Prohibition-era strategy game by Romero Games, has been delayed, with the planned spring launch window now looking more like autumn 2020."}, {"articleID": "2011100709_00116407_W", "names": {"John Walters": ["Q24809760", "Q27728521", "Q47452334", "Q6262934"]}, "date": "2011-10-07", "url": "http://walesonline.co.uk/news/south-wales-news/merthyr/2011/10/07/heroes-of-coal-generations-of-one-mining-family-were-saved-by-a-cry-of-a-baby-girl-91466-29556806/", "content": "freelance documentary filmmaker andrew gough used his own family history to retell the events of that fateful day when his great grandfather <mark>john walters</mark> missed the start of his shift, and the explosion which ensued, because he was kept awake all night by his baby daughter's crying.\nandrew's idea was then brought to life through a short 15 minute docu-drama he filmed with university colleagues paris palmer, ian morley, 23, james earing and <mark>john</mark> shand, both 22, earning them a first class honours in a documentary, film and tv degree.\nandrew, 21, who still lives in the close knit community of aber valley, said: \"i grew up learning about my great grandfather <mark>john walters</mark> as my mother sandra regularly talked about the senghenydd pit disaster .\"\nandrew and his colleagues spent months recruiting local actors like aled herbert, who played the part of <mark>john walters</mark>, cari barley and pobol y cwm's phillip harries who re-enacted the family drama part of the short film."}, {"articleID": "2017062711_00324347_W", "names": {"Imtiaz Ali": ["Q16224409", "Q3149575", "Q51735857", "Q6008453"]}, "date": "2017-06-27", "url": "http://www.kollytalk.com/hindi1/bolly/srk-thanks-fans-clocking-25-years-bollywood-579537.html", "content": "Shah Rukh is now gearing up for his upcoming film \"Jab Harry Met Sejal\" , which is directed by <mark>Imtiaz Ali</mark>."}, {"articleID": "2018011614_00753321_W", "names": {"Jake Elliott": ["Q22004199", "Q22277691", "Q27928464"]}, "date": "2018-01-16", "url": "http://www.nbcsports.com/philadelphia/eagles/stefen-wisniewski-was-blocking-machine-first-playoff-game", "content": "This 32-yard screen pass got the Eagles across midfield and they eventually got close enough for <mark>Jake Elliott</mark> to kick a 21-yard field goal to put them up 15-10."}, {"articleID": "2019032214_00347250_W", "names": {"Ron Morgan": ["Q16745423", "Q20273714"]}, "date": "2019-03-21", "url": "http://ktvl.com/news/local/portlands-dovelewis-animal-hospital-to-be-featured-on-new-tv-show-animal-er-live", "content": "It's gonna be groundbreaking television that's gonna allow us to pull back the curtain a little bit and show people what happens live in an animal ER on a busy Saturday and Sunday night, \"said <mark>Ron Morgan</mark>, President and CEO of DoveLewis The show runs for two hours and is completely live."}, {"articleID": "2018081719_00177767_W", "names": {"Earl Jones": ["Q1628498", "Q2899402", "Q5325944", "Q55610368", "Q969854"]}, "date": "2018-08-17", "url": "http://www.newsobserver.com/news/local/counties/wake-county/article216897850.html#storylink=latest_side", "content": "There is a piano up here, \"<mark>Earl Jones</mark> said as he walked along the street.\n<mark>Jones</mark> plays guitar, bass and keyboard and sometimes performs downtown for free."}, {"articleID": "2017111708_00005979_W", "names": {"Paul Humphreys": ["Q368348", "Q7151427"]}, "date": "2017-11-17", "url": "http://www.yorkpress.co.uk/news/15667295.From___32_guitar_and_cheap_Electricity_to_The_Punishment_Of_Luxury__the_journey_of_OMD/", "content": "OMD's Andy McCluskey and <mark>Paul Humphreys</mark> 0 comments THE Punishment Of Luxury Tour brings OMD, or Orchestral Manoeuvres In The Dark in old money, to York Barbican on Saturday night.\nThe sold-out 8pm gig forms part of an 18-date autumn tour to back up the September release of OMD's 13th studio album of a career stretching back almost 40 years to when two teenage Kraftwerk fans from the Wirral, Andy McCluskey and <mark>Paul Humphreys</mark>, formed their synth-pop duo.\nNow McCluskey and <mark>Humphreys</mark> return with The Punishment Of Luxury, their first studio set since 2013's English Electric, creating a \"daring collection of stylish synth pop and masterful song craft that sees OMD edge out of their comfort zone without compromising their integrity\".\nReflective and sanguine in mood, the album was recorded in McCluskey and <mark>Humphreys</mark>' respective studios in Merseyside and London, with the final mixes being handled by both at <mark>Paul</mark>'s place."}, {"articleID": "2017061414_00904466_W", "names": {"Jim Whelan": ["Q21459473", "Q6198889"]}, "date": "2017-06-14", "url": "http://www.mycentraljersey.com/story/news/environment/2017/06/14/bringing-balloons-down-earth-bill-would-end-mass-release/375533001/", "content": "Representatives for the balloon lobby plan to meet with the bill's sponsor--Sen. <mark>Jim Whelan</mark>, D-Atlantic--to persuade him to drop the measure.\n<mark>Whelan</mark>'s bill is similar to those bans.\n\"Having it town by town is spotty,\" <mark>Whelan</mark> said.\n(Photo: File photo) <mark>Whelan</mark>, who introduced the bill on May 15, said he has already been contacted by lobbyists for the council and said he will entertain a meeting with them to discuss the bill."}, {"articleID": "2014111705_00012548_W", "names": {"Andrew Harrison": ["Q14469654", "Q47339436", "Q4757245", "Q4757246"]}, "date": "2014-11-17", "url": "http://buffalonews.com/feed/ub-makes-statement-in-loss-to-kentucky-20141116", "content": "On UB's second possession, freshman point guard Lamonte Bearden drove hard down the lane and drew a foul from 6-6 <mark>Andrew Harrison</mark>, the all-Southeastern Conference guard."}, {"articleID": "2013082622_00022382_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2013-08-26", "url": "http://money.cnn.com/2013/08/26/news/companies/trump-university/index.html?section=money_mostpopular", "content": "@ Jose_Pagliery August 26, 2013: 9:56 AM ET NEW YORK (CNNMoney) <mark>Donald Trump</mark>'s real estate school is under attack by New York's top prosecutor, and both sides took to the airwaves Monday to elaborate on the upcoming legal battle.\nNew Day, \"New York State Attorney General Eric Schneiderman called the school a\" bait-and-switch scheme, \"and <mark>Trump</mark> accused the prosecutor of actions akin to extortion.\nStill, <mark>Trump</mark> dismissed the importance of the matter .\"\nHe's a lightweight, \"<mark>Trump</mark> said of the state's attorney general.\nIt's the aftermath of a $40 million civil lawsuit Schneiderman filed against <mark>Trump</mark> on Saturday, accusing <mark>Trump</mark> of defrauding students who attended the billionaire's for-profit school.\nRelated: N.Y. attorney general suing <mark>Trump</mark>'s school for fraud The lawsuit claims <mark>Trump</mark> used his celebrity status to lure students into a school that over-promised and under-delivered.\nIn the school's commercials, <mark>Trump</mark> tells viewers,\" We're going to teach you better than the business schools are going to teach you.\n\"\"At <mark>Trump</mark> University, we teach success.\nHe noted <mark>Trump</mark> University isn't even a university, which is defined as a collection of colleges.\nAnd although students were promised an in-person meeting with <mark>Trump</mark>, \"all they got was the chance to stand next to a life-sized poster,\" Schneiderman said.\nSchneiderman said his lawsuit partly relies on the sworn testimony of <mark>Trump</mark> University's former president, who explained that <mark>Trump</mark> maintained a close eye on the school and read all of its promotional material.\nWhen <mark>Trump</mark> appeared on \"New Day\" by phone later in the morning, he defended his program by noting the school had received stellar evaluations by students.\n\"We didn't think we were going to get sued because we have a 98% approval rating,\" <mark>Trump</mark> said.\nRelated: Morgan Stanley escapes federal dragnet <mark>Trump</mark> then turned his attention to the prosecutor, saying that Schneiderman approached <mark>Trump</mark> for political donations--and when <mark>Trump</mark> refused, Scheiderman followed with a lawsuit as revenge.\n\"They solicited us during the investigation for campaign contributions,\" <mark>Trump</mark> said.\nBut <mark>Trump</mark> cast the legal challenge as a power battle between an overreaching government and a private powerhouse--himself.\nI chose not to,\" <mark>Trump</mark> said."}, {"articleID": "2010072901_00135124_W", "names": {"Brian Scott": ["Q27070266", "Q4965241", "Q58918564", "Q9179287"]}, "date": "2010-07-29", "url": "http://paddocktalk.com/news/html/modules.php?op=modload&name=News&file=article&sid=141332&newlang=&topic=11&catid=33", "content": "posted by: msulka on jul 28, 2010 - 08:00 pm 2010 iowa: <mark>brian scott</mark> nascar nationwide race preview <mark>scott</mark> will make his first nascar nationwide series start at iowa speedway <mark>scott</mark> has one start at iowa in the camping world truck series, starting 18th and finishing ninth.\n<mark>scott</mark> has completed 200 of 200 (100%) attempted laps at iowa.\n(cwts) <mark>scott</mark> currently leads raybestos rookie of the year standings by 20 points (189-169) over ricky stenhouse jr. this weekend's kroger 200 will mark the 10th time that <mark>scott</mark> will drive the accudoc solutions toyota camry this season.\n<mark>scott</mark> talks iowa speedway \"iowa is an excellent facility, i'm glad nascar added it to the nationwide series schedule.\n<mark>scott</mark> on expectations \"we're looking forward to putting last week behind us.\n<mark>scott</mark> on off-track antics \"i've been keeping pretty busy off the racetrack here lately too."}, {"articleID": "2011022420_00031016_W", "names": {"James Mitchell": ["Q11309444", "Q20055487", "Q22020369", "Q27443240", "Q27831114", "Q39070569", "Q40231072", "Q6133446", "Q6139843", "Q955098"]}, "date": "2011-02-24", "url": "http://eurekalert.org/pub_releases/2011-02/miot-mss022411.php", "content": "in addition to seymour, who is now a research fellow at the university of technology sydney, other co-authors on the paper are marcos, luhar and durham; professor <mark>james mitchell</mark> of flinders university in adelaide, australia; and professor andreas macke of the leibniz institute for tropospheric research in germany.\nsource: \"microbial alignment in flow changes ocean light climate,\" by marcos, justin seymour, mitul luhar, william durham, <mark>james mitchell</mark>, andreas macke and roman stocker, in pnas early edition online feb. 21, 2011."}, {"articleID": "2019092519_00059278_W", "names": {"Michael Goodwin": ["Q11778342", "Q6830683"]}, "date": "2019-09-25", "url": "https://www.foxnews.com/media/trump-ukraine-failed-oust-attempt-kimberley-strassel", "content": "close Video <mark>Michael Goodwin</mark>: Democrats botched impeachment push New York Post columnist <mark>Michael Goodwin</mark> said the move will result in Democrats hitting a \"dead end .\""}, {"articleID": "2015012320_00044789_W", "names": {"Bill Johnson": ["Q16204402", "Q17385655", "Q17626755", "Q21585452", "Q24817767", "Q2903258", "Q30717048", "Q3366808", "Q339036", "Q48645040", "Q4909622", "Q4909623", "Q4909624", "Q4909626", "Q56558077", "Q720797", "Q862215", "Q862229"]}, "date": "2015-01-23", "url": "http://tampabay.com/blogs/the-buzz-florida-politics/scott-recommends-money-for-individuals-with-disabilities/2214899", "content": "Scott proposes Bright Futures expansion but doesn't address criticisms Enterprise Florida picks new CEO: <mark>Bill Johnson</mark>, Miami-Dade's longtime port chief Editorial: The $1 billion cost of not taking Medicaid expansion money The Buzz From the staff of the Tampa Bay Times Scott recommends money for individuals with disabilities Gov.\nAnalysis: What the House GOP's abortion <mark>bill</mark> about-face really means Tampa Bay Times 490 First Avenue South"}, {"articleID": "2016083000_00763083_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-08-29", "url": "http://cnbc.com/2016/08/29/clinton-camp-dismisses-trump-challenge-on-health-records.html", "content": "<mark>Donald Trump</mark> on Sunday challenged Hillary Clinton to release more detailed medical records, but a Clinton aide said the Republican nominee should provide a \"legitimate\" and \"detailed\" letter beyond the brief note he has previously released.\n<mark>Trump</mark> Sunday afternoon Tweeted: \"I think that both candidates, Crooked Hillary and myself, should release detailed medical records.\nThe Clinton campaign points out that the letter Clinton released has much more detail and specifics, like cholesterol levels, medical history and medications, and they argue there is no comparison to the letter <mark>Trump</mark> released and that <mark>Trump</mark> has not disclosed any meaningful medical information.\nMore from NBC News: Clinton's \"right-wing conspiracy' comes full circle with <mark>Trump</mark> shake up <mark>Trump</mark> ad credits tax plan he doesn't support Wasserman Schultz looks to hold line in Sanders proxy war <mark>Trump</mark> in December released a four-paragraph letter from Dr. Harold Bornstein that called <mark>Trump</mark>'s health\" astonishingly excellent \"and claimed the 70-year-old would be\" the healthiest individual ever elected to the presidency.\n\"Bornstein--who says he has been <mark>Trump</mark>'s physician since 1980--told NBC News Friday that he wrote the letter in just 5 minutes while a limo waited outside his office, but the doctor said he had been thinking about the letter all day.\n<mark>Trump</mark>'s challenge Sunday mirrors the response from his campaign spokesman on Friday after the NBC interview with Bornstein aired.\n<mark>Trump</mark> has claimed Clinton\" lacks the mental and physical stamina \"to be president."}, {"articleID": "2013072117_00041038_W", "names": {"Rachel Martin": ["Q16211141", "Q7279321"]}, "date": "2013-07-21", "url": "http://kuer.org/post/woman-among-men-female-firefighter-blazed-trail", "content": "\"Little boys always hear about it - they get little fire trucks as toys - and girls never really get that kind of introduction,\" she tells <mark>Rachel Martin</mark>, host of Weekend Edition Sunday."}, {"articleID": "2014070922_00102662_W", "names": {"Qui Nguyen": ["Q27831085", "Q7271625"]}, "date": "2014-07-09", "url": "http://azcentral.com/story/entertainment/arts/2014/07/09/brelby-theatre-gets-geek-kills-monsters/12374789", "content": "Written by New York playwright and fight director <mark>Qui Nguyen</mark>, \"She Kills Monsters\" is inspired by Dungeons & Dragons, the role-playing game from the 1970s that has spawned countless imitators, from old-school dice-and-paper play to mega-popular online RPGs such as World of Warcraft."}, {"articleID": "2010122419_00085616_W", "names": {"Tom Brady": ["Q2376327", "Q313381", "Q7815037"]}, "date": "2010-12-24", "url": "http://philly.com/r?19=961&43=356979&44=112433384&32=3796&7=368304&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fblogs%2Finq-eagles%2FVick_reflects_on_holidays_Would_pick_self_as_MVP.html", "content": "many see vick and patriots quarterback <mark>tom brady</mark> as the two leading candidates."}, {"articleID": "2018040519_00085490_W", "names": {"Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}, "date": "2018-04-05", "url": "https://www.thestar.com/news/world/2018/04/05/number-of-palestinians-killed-by-israel-this-week-rises-to-21-after-gaza-airstrike.html", "content": "Meanwhile, Egyptian intelligence chief <mark>Abbas</mark> Kamel held separate meetings this week with Israeli officials and with Palestinian President <mark>Mahmoud Abbas</mark>, the West Bank-based rival of Hamas, in hopes of preventing an escalation on the Gaza border.\nIn recent months, Egypt had tried to broker a deal that would have enabled <mark>Abbas</mark> to take back control in the Gaza Strip, more than a decade after Hamas seized the territory from forces loyal to him.\nHamas, in turn, had hoped that Israel and Egypt would end their blockade of Gaza if the group handed the reins of government to <mark>Abbas</mark>.\n<mark>Abbas</mark> told the Egyptian intelligence this week that he would not waste any more time negotiating a deal with Hamas and that he would only assume responsibility for Gaza if Hamas hands over all powers, including control over the security apparatus, according to two Palestinian officials."}, {"articleID": "2019012323_00082684_W", "names": {"Jesus Ramirez": ["Q1688370", "Q553050"]}, "date": "2019-01-23", "url": "https://wtop.com/latin-america/2019/01/many-latin-american-governments-support-venezuelas-guaido/", "content": "\"We maintain our position of neutrality in the Venezuelan conflict,\" <mark>Jesus Ramirez</mark> Cuevas told Mexico's Milenio news television channel."}, {"articleID": "2014102717_00055645_W", "names": {"Tracy Morgan": ["Q14542", "Q27119857"]}, "date": "2014-10-27", "url": "http://www.nola.com/movies/index.ssf/2014/10/chris_rocks_top_five_movie_tra.html", "content": "Below, find the description of the film--which also includes appearances by such Rock pals as Adam Sandler, <mark>Tracy Morgan</mark> and Jerry Seinfeld--that accompanied its Toronto Film Festival run."}, {"articleID": "2015041409_00057982_W", "names": {"David Coates": ["Q25675757", "Q5232435", "Q55996234"]}, "date": "2015-04-14", "url": "http://news.asiaone.com/news/world/clinton-taking-different-tack-new-campaign", "content": "Professor <mark>David Coates</mark>, from the department of politics and international affairs at Wake Forest University, said:\" Hillary looks unbeatable in her pursuit of the Democratic nomination, but all the Democrats I know are worried - they are not enthusiastic."}, {"articleID": "2017050820_00063839_W", "names": {"Mike Richards": ["Q575019", "Q6833845", "Q6848560", "Q6848562", "Q6848563"]}, "date": "2017-05-08", "url": "http://www.echonews.com.au/news/hydro-power-not-a-pipe-dream-for-gladstone/3175517/", "content": "<mark>Mike Richards</mark> GLA080417HYDRO Popular Stories BBC's bizarre Madeleine McCann documentary intro Luxury outback paradise built in western Queensland Man wed to screwdriver killer says he can't divorce Local Real Estate Cars For Sale AS POWER prices continue to rise and the threat of global warming lingers, the need for cheap, clean and reliable energy grows.\n<mark>Mike Richards</mark> GLA080417HYDRO \"We've reached the stage where a lot of our power stations are reaching the end of their useful life and they're talking about replacing them,\" Mr Bridge said."}, {"articleID": "2009111207_00138022_W", "names": {"Mike Rogers": ["Q1933467", "Q970515"]}, "date": "2009-11-12", "url": "http://metroweekly.com/gauge/commentary.php?ak=4638", "content": "but i would love to see someone like <mark>mike rogers</mark> of blogactive.com expose these ministers, whether we call their poison hypocrisy or something else.\nit is important that we aim our salvos accurately, as <mark>rogers</mark> has a record of doing.\ntime, as <mark>rogers</mark> observed last week, is on our side."}, {"articleID": "2010032600_00009318_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2010-03-26", "url": "http://news.com.au/adelaidenow/story/0,22606,26901522-5006301,00.html?from=public_rss", "content": "that seems to be the conclusion backers and critics of opposition leader <mark>tony abbott</mark>'s lycra and \"budgie smuggler\" obsession are reaching after he said he again will appear in them in public.\nmr <mark>abbott</mark> will take part in an ironman triathlon, raising money for breast cancer research, and a 10-day \"pollie pedal\" charity ride between sydney and melbourne.\nthey will be the ninth and tenth times mr <mark>abbott</mark> has stripped to body-hugging costumes since he was elected opposition leader last december - once a fortnight.\nsenior liberals reportedly have questioned the behaviour and finance minister lindsay tanner pilloried mr <mark>abbott</mark> in parliament, saying: \"there is one part of his body that does not get much exercise and that is the brain."}, {"articleID": "2017120621_00117709_W", "names": {"Daniel Benjamin": ["Q1160048", "Q5216534"]}, "date": "2017-12-06", "url": "http://www.dailysabah.com/mideast/2017/12/07/majority-of-americans-oppose-moving-embassy-to-jerusalem-poll-suggests", "content": "Also quoted in the same report, <mark>Daniel Benjamin</mark>, a former U.S. counterterrorism official now at Dartmouth University, had a simple message: \"This is playing with fire .\""}, {"articleID": "2019090503_00125053_W", "names": {"Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"]}, "date": "2019-09-05", "url": "http://www.halesowennews.co.uk/sport/national/17882311.craig-overton-confident-england-can-fight-back-fourth-test/", "content": "Australia ended a windswept and rain-interrupted first day at Old Trafford on 170 for three with the returning <mark>Steve Smith</mark> once again frustrating them on 60 not out.\nRemoving <mark>Smith</mark> will obviously be key to England's hopes.\n<mark>Steve Smith</mark> again proved key for Australia (Mike Egerton/PA) The former Australia captain, who scored twin centuries in the Test at Edgbaston and 92 at Lord's but missed Headingley, took his run tally for the series to 438 in four innings.\nOverton said: \"<mark>Smith</mark> is obviously a world-class player, and he's back as Test number one.\n<mark>Smith</mark>'s battle with Jofra Archer, who bounced him at Lord's, was one of the most eagerly-anticipated aspects of the game.\nHowever, in difficult bowling conditions, <mark>Smith</mark> dealt with the England paceman comfortably."}, {"articleID": "2014080308_00034834_W", "names": {"Brian Banks": ["Q16240818", "Q22079589", "Q4963038", "Q4963043"]}, "date": "2014-08-03", "url": "http://feeds.cbsnews.com/~r/CBSNewsMain/~3/xsczhXU-rnA", "content": "mp4\" }}' data-pid = \"dfVhAk2MAZM8\" > <mark>Brian Banks</mark> was an NFL hopeful several years back, but his career was derailed by a wrongful criminal conviction.\n\"I am honored to say I've taken an amazing position with the front office of the NFL,\" <mark>Banks</mark> wrote on his Facebook page.\n<mark>Banks</mark> had been accused by a high school classmate of a rape that never happened.\nWhen <mark>Banks</mark> was exonerated in 2012, his story gained national attention, including a profile on 60 minutes.\n<mark>Banks</mark> was always realistic about his chances of making it in the NFL and his career on the field, ended with that game .\"\nI just cannot wait to be in New York, working with the NFL, \"said <mark>Banks</mark>.\""}, {"articleID": "2011122113_00025504_W", "names": {"Peter Quinn": ["Q18217890", "Q2077669", "Q23022649", "Q7176491", "Q7176492"]}, "date": "2011-12-21", "url": "http://lfpress.com/news/canada/2011/12/21/19151801.html", "content": "<mark>peter quinn</mark>, executor of glen's estate, described the murder victim as one of the most generous men he has met.\nglen never knew and never suspected who was behind it,\" said <mark>quinn</mark>."}, {"articleID": "2018020613_00028406_W", "names": {"Bill Walker": ["Q18159074", "Q25473882", "Q4911260", "Q4911261", "Q4911262", "Q4911263", "Q4911264", "Q4911267", "Q547758", "Q862635"]}, "date": "2018-02-06", "url": "http://daytondailynews.com/news/national-govt--politics/the-latest-pence-japan-boost-pressure-north-korea/OHy4iBUOLphsN65DRzzueM/", "content": "<mark>Bill Walker</mark> and Gen. Lori J. Robinson, Commander, United States Northern Command and North American Aerospace Defense Command, at Joint Base Elemendord-Richardson, Alaska, Monday, Feb. 5, 2018."}, {"articleID": "2018110210_00450644_W", "names": {"Stephen Kelly": ["Q331908", "Q7609663", "Q7609664", "Q7609665"]}, "date": "2018-11-02", "url": "http://invezz.com/news/equities/32912-Sage-share-price-outperforms-as-group-appoints-finance-chief-as-CEO-", "content": "The move came after <mark>Stephen Kelly</mark> stood down from the top job in August.\nHare joined the board in January 2014 as the group's finance chief, and was subsequently appointed to the additional post of interim chief executive officer on August 31, following the departure of outgoing CEO <mark>Stephen Kelly</mark>."}, {"articleID": "2012042721_00029165_W", "names": {"Andre Brown": ["Q3615433", "Q41617079", "Q4754745", "Q4754746"]}, "date": "2012-04-27", "url": "http://rotoworld.com/content/playerpages/player_main.aspx?sport=NFL&id=3616", "content": "nfl suspended giants rb <mark>andre brown</mark> four games for violating the league's policy against performance enhancers."}, {"articleID": "2019040319_00396488_W", "names": {"Tom Wright": ["Q1335131", "Q14949657", "Q1647937", "Q23418836", "Q5192198", "Q7818105", "Q7818107", "Q7818108", "Q7818109"]}, "date": "2019-04-03", "url": "https://thecourier.com/national-news-latest/2019/04/03/killing-police-k-9s-in-florida-could-earn-longer-prison-term/", "content": "In making his case for the bill, he turned to Republican Sen. <mark>Tom Wright</mark>, a former Rochester, Minnesota, police officer who was assigned a K-9.\n\"Just two examples of I probably wouldn't be here today if it wasn't for this dog,\" <mark>Wright</mark> said."}, {"articleID": "2012072509_00068954_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2012-07-25", "url": "http://thebookseller.com/news/apple-ipad-sales-84-third-quarter.html", "content": "<mark>tim cook</mark> declared himself \"thrilled\" with the \"record\" ipad sales, and said: \"we are also really looking forward to the amazing new products we've got in the pipeline .\""}, {"articleID": "2018062816_00312810_W", "names": {"Liam Bradley": ["Q6539495", "Q6539496"]}, "date": "2018-06-28", "url": "http://www.shropshirestar.com/news/uk-news/2018/06/28/british-second-world-war-pilots-family-visit-scene-of-spitfire-crash-in-ireland/", "content": "Opening on 28th June 2018 and includes a real Spitfire and an anticraft gun outside Monaghan County Museum #MyMonaghan pic.twitter.com/eNNn31roqs <mark>Liam Bradley</mark>, the museum creator, and aviation historian Jonny McNee were instrumental in locating and recovering parts of the RAF Spitfire.\nMr <mark>Bradley</mark> said: \"The Spitfire suffered massive engine failure and the pilot bailed out."}, {"articleID": "2008120118_00006590_W", "names": {"John Waters": ["Q314926", "Q363876", "Q6263167", "Q6263168"]}, "date": "2008-12-01", "url": "http://playbill.com/news/article/123828.html", "content": "original screenwriter <mark>john waters</mark>, according to shankman, has submitted an outline and ideas for the sequel, and writers are currently being sought for the film."}, {"articleID": "2012062423_00058142_W", "names": {"Ashley Young": ["Q10602", "Q4805646"]}, "date": "2012-06-24", "url": "http://theroar.com.au/2012/06/25/italy-beat-england-penalties-euro-2012/", "content": "england's <mark>ashley young</mark> hit the crossbar and ashley cole had his effort saved by gianluigi buffon, as alessandro diamanti scored the final penalty to set the azzurri up for a classic semi-final with germany in warsaw on thursday."}, {"articleID": "2013110219_00017170_W", "names": {"Michael Hooper": ["Q6831231", "Q6831232"]}, "date": "2013-11-02", "url": "http://www.DailyFinance.com/2013/11/02/food-stocks-provide-steady-dividends/", "content": "With this in mind, our analysts sat down to identify the absolute best of the best when it comes to <mark>Michael Hooper</mark> owns shares of J.M."}, {"articleID": "2020021123_00121536_W", "names": {"Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}, "date": "2020-02-11", "url": "http://www.irishnews.com/magazine/entertainment/2020/02/11/news/justin-bieber-gives-explicit-insight-into-marriage-to-hailey-baldwin-1840201/", "content": "\"Asked which famous person he would like to meet, dead or alive, he replied:\" <mark>Muhammad Ali</mark>."}, {"articleID": "2015080415_00075038_W", "names": {"Israel Hernandez": ["Q5802760", "Q6086976"]}, "date": "2015-08-04", "url": "http://juneauempire.com/sports/2015-08-04/weldon-wins-judo-medals", "content": "Weldon then went to a camp in Fort Lauderdale, Florida, from July 14-16, taught by Cuba Olympic Judo members <mark>Israel Hernandez</mark> and Amarilis Savon."}, {"articleID": "2008100305_00019408_W", "names": {"President Bush": ["Q207", "Q23505"]}, "date": "2008-10-03", "url": "http://invogue4.wordpress.com/?p=40", "content": "- to a questioner who asked if he supported president <mark>bush</mark>'s vision for keeping u.s. troops in iraq for 50 years \"you know that old beach boys song, bomb iran?"}, {"articleID": "2010120623_00177795_W", "names": {"Anna Chapman": ["Q232776", "Q46174649"]}, "date": "2010-12-06", "url": "http://nydailynews.com/ny_local/2010/12/06/2010-12-06_woman_who_asked_for_cremation_in_will_is_backed_by_judge_after_relative_said_she.html?r=ny_local", "content": "another <mark>anna chapman</mark>?"}, {"articleID": "2016090807_00095250_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"]}, "date": "2016-09-08", "url": "http://www.canindia.com/n-korea-rejects-un-censure-of-missile-test/", "content": "<mark>Kim Jong-un</mark>'s regime said it \"categorically rejects\" the declaration and considers it \"an intolerable act of encroaching upon its dignity, right to existence, sovereignty and right to self defence\" , EFE news cited KCNA as saying."}, {"articleID": "2016092720_00418166_W", "names": {"Joe Kelly": ["Q14950949", "Q18098357", "Q19519193", "Q22005763", "Q2351168", "Q6210642", "Q6210645", "Q730076"]}, "date": "2016-09-27", "url": "http://comicbook.com/2016/09/27/i-kill-giants-has-started-filming/", "content": "Creator <mark>Joe Kelly</mark> announced the news on Twitter earlier today and even gave a shoutout to co-creator Ken Niimura.\nSo excited, so proud and so lucky I met @ ken_niimura!--<mark>Joe Kelly</mark> (@ JoeKellyMOA) September 27, 2016 \"In other news, [I Kill Giants] has begun principal shooting today.\n<mark>Joe</mark> wrote.\nWhen the film was first announced, <mark>Joe</mark> had the honor of telling fans the good news.\n<mark>Joe</mark> adapted the screenplay for I Kill Giants.\nSpeaking about the project, Chris explained that, \"<mark>Joe Kelly</mark> has written a deeply insightful story about a child using fantasy to navigate through a harsh reality, and I am excited and proud to finally be able to bring this wonderful material to the screen .\"\n<mark>Joe</mark> also talked about his feelings about the theatrical adaptation, saying, \"I'm overwhelmed by the enthusiasm, vision and sheer talent of the team we've assembled.\n<mark>Kelly</mark> created the project with artist J. M. Ken Niimura and pitched the story to Image Comics.\nIf you'd like to hear a bit about the story, <mark>Kelly</mark> provided a very succinct description during an interview he did with Newsarama."}, {"articleID": "2018020714_01031112_W", "names": {"Elisabeth Jensen": ["Q1330023", "Q16202543"]}, "date": "2018-02-07", "url": "https://www.paulickreport.com/news/the-biz/frankfort-host-second-annual-keep-day-feb-15/", "content": "\"KEEP Day is a convenient way for people working in businesses connected to equines, as well as those who show, ride and own horses, to meet with our lawmakers and let them know that every county and district benefits from horses,\" said KEEP executive vice president <mark>Elisabeth Jensen</mark>.\n\"People might be surprised to know how many trail-riding and pleasure horses there are in Kentucky--about 80,000,\" <mark>Jensen</mark> said."}, {"articleID": "2011012216_00101230_W", "names": {"Stephen Ross": ["Q30071164", "Q531857"]}, "date": "2011-01-22", "url": "http://nationalfootballpost.com/Dolphins-sign-Ireland-to-contract-extension.html", "content": "send this january 22, 2011, 11:18 am est with coach tony sparano already signed to a contract extension, now miami dolphins owner <mark>stephen ross</mark> has signed general manager jeff ireland to a multi-year contract extension.\n\"the decision to extend jeff's contract as our general manager was an easy one,\" <mark>ross</mark> said."}, {"articleID": "2017071513_00459615_W", "names": {"Ibrahim Babangida": ["Q333415", "Q35539224", "Q4521833"]}, "date": "2017-07-15", "url": "http://www.dailytrust.com.ng/news/feature/-how-we-survived-biafran-war/205547.html", "content": "<mark>Ibrahim Babangida</mark>, an army General and former military ruler who actively took part in the civil war to keep Nigeria one, recently expressed concern on profuse verbal provocations from certain individuals in the country, saying the pains of that war fraught with death and suffering are still being felt."}, {"articleID": "2011072517_00023371_W", "names": {"Peter Campbell": ["Q16202323", "Q19662638", "Q25413902", "Q3900833", "Q3900834", "Q56708050", "Q7173163"]}, "date": "2011-07-25", "url": "http://therecord.com/news/local/article/568750--guelph-family-hopes-for-closure-after-discovery-of-plane-in-lake-muskoka-for-71-years", "content": "the other aircraft and its pilots - a brit, <mark>peter campbell</mark>, 24, and a guelph native, ted bates, 27 - were never located.\non dec. 13, flight lt. <mark>peter campbell</mark> and leading aircraftsman ted bates climbed into the cockpit of their northrop nomad, the last time anyone saw them.\n<mark>campbell</mark>, from west sussex in england, came to canada in 1940 as part of the successful empire air training scheme to train pilots from the commonwealth countries and other allies for the conflict."}, {"articleID": "2009051821_00042273_W", "names": {"Mike Armstrong": ["Q6845892", "Q6845893"]}, "date": "2009-05-18", "url": "http://nationalpost.com/news/story.html?id=1606807", "content": "<mark>mike armstrong</mark> explains.\n<mark>mike</mark> drolet reports.\n<mark>mike armstrong</mark> explains.\n<mark>mike</mark> drolet reports."}, {"articleID": "2018030517_00351858_W", "names": {"Tom Ford": ["Q19873307", "Q240015", "Q318149", "Q7815834"]}, "date": "2018-03-05", "url": "http://www.cityam.com/281696/focus-victoria-gbp4bn-investment-has-completely-changed", "content": "This makes it the perfect place for a London bolthole, says <mark>Tom</mark> Bond from UK Sotheby's International Realty, who is seeing \"a significant number of buyers from the commuter hotspots including Surrey and Berkshire, who are seeing a convenient second home in the capital .\"\nWith new businesses moving in--Deutsche Bank, <mark>Tom Ford</mark>, Google and the UK's new National Cyber Security Centre--as well as new residents, top names in retail and hospitality have been lured to the area, from Molten Brown to Michelin-starred chef Jason Atherton's latest restaurant Hai Cenato."}, {"articleID": "2015122519_00456809_W", "names": {"Kevin Hart": ["Q1740168", "Q3195712", "Q57439639", "Q618352", "Q6396452"]}, "date": "2015-12-25", "url": "http://www.inquisitr.com/2656933/justin-bieber-could-have-died-bombshell-from-scooter-braun-reveals-biebers-darkest-moment-what-saved-him/", "content": "With <mark>Kevin Hart</mark> taking on the role of host and utilizing his comedic talents, the Comedy Central roast proposed by that intern and embraced as a great idea by Scooter proved to be the turning point that saved Bieber's career by revealing his humility and sense of humor.\n[Photo by <mark>Kevin</mark> Winter/Getty Images] As to what caused those dark times and damaging reports?"}, {"articleID": "2014083005_00010690_W", "names": {"Carmen Gonzalez": ["Q5043478", "Q9697469"]}, "date": "2014-08-29", "url": "http://www.sys-con.com/node/3166218", "content": "<mark>Carmen Gonzalez</mark>, <mark>carmen</mark> (at) sys-con."}, {"articleID": "2011080423_00022779_W", "names": {"Trevor Booker": ["Q2429069", "Q7839072"]}, "date": "2011-08-04", "url": "http://sbnation.com/ncaa-football/2011/8/4/2345144/steve-spurrier-turner-gill-twitter-ban-south-carolina-kansas-players-season", "content": "sb nation ncaaf thu, aug 4, 2011 college football rankings 2011: oklahoma leads top 25, sec looks deep dirk nowitzki will make overseas decision after eurobasket; jordan farmar, <mark>trevor booker</mark> to israel updated throughout the day with quick takes from staff."}, {"articleID": "2017070700_00583351_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-07-06", "url": "http://feeds.nydailynews.com/~r/nydnrss/sports/hockey/islanders/~3/m5Iu8IE8GGs/tough-north-korea-choices-regime-arm-article-1.3306797", "content": "And yet, relying on China's good graces appeared to be <mark>Donald Trump</mark>'s first resort.\n<mark>Trump</mark> himself tweeted out on Wednesday that Chinese trade with North Korea increased by almost 40% in the first quarter, forcing him to acknowledge that the Chinese haven't been helping.\n<mark>Trump</mark> has threatened that if China doesn't help we'll have to go it alone."}, {"articleID": "2014051703_00031081_W", "names": {"David Griffin": ["Q16198682", "Q23769550", "Q2746775", "Q29572809", "Q5234408", "Q5234409"]}, "date": "2014-05-16", "url": "http://www.nba.com/2014/news/05/16/cavs-coaching-search.ap/index.html?rss=true", "content": "Cavs have no timetable for hiring new coach <mark>Griffin</mark> says they \"don't have a real specific timetable\" and doesn't \"anticipate anything happening anytime soon .\"\nBut <mark>Griffin</mark> says \"nothing along those lines\" has happened.\nCombine: <mark>David Griffin</mark> Scott Howard-Cooper talks with Cavaliers new general manager <mark>David Griffin</mark>."}, {"articleID": "2010101600_00044534_W", "names": {"Ali Ahmed": ["Q44749742", "Q4724574", "Q55483636"]}, "date": "2010-10-15", "url": "http://thirdage.com/news/dc9-club-owner-charged-second-degree-murder_10-15-2010", "content": "27-year-old <mark>ali ahmed</mark> mohammed was found severely beaten outside the northwest d.c. club."}, {"articleID": "2011040819_00092519_W", "names": {"Karen Leibovici": ["Q16151822", "Q3193114"]}, "date": "2011-04-08", "url": "http://edmontonsun.com/news/edmonton/2011/04/08/17925006.html", "content": "<mark>karen leibovici</mark> told a news conference friday."}, {"articleID": "2020030516_00029207_W", "names": {"Richard Leonard": ["Q24039896", "Q50365677", "Q7327335"]}, "date": "2020-03-05", "url": "https://www.morningstaronline.co.uk/article/b/scotland-to-reconsider-closure-of-nhs-laundry-services-due-to-coronavirus-spread", "content": "Scottish party leader <mark>Richard Leonard</mark> secured a commitment from First Minister Nicola Sturgeon at Holyrood after he raised concerns about the closure of half of the sites serving hospitals north of the border.\nMr <mark>Leonard</mark> called on Ms Sturgeon to \"give an undertaking to ensure the necessary funding and resources are available to councils and the NHS\" and to \"place a moratorium\" on the plans to reduce the number of laundries.\nMr <mark>Leonard</mark> added that he had spoken to council leaders who were worried about the capacity of social-care services across Scotland."}, {"articleID": "2018011619_00309261_W", "names": {"Mike Ashley": ["Q15454805", "Q554077"]}, "date": "2018-01-16", "url": "http://www1.skysports.com/football/news/11678/11210462/newcastle-takeover-talks-with-amanda-staveley-and-pcp-partners-have-ended", "content": "Newcastle takeover talks with Amanda Staveley and PCP Partners have ended By Sky Sports News Last Updated: 16/01/18 7:12 pm Newcastle owner <mark>Mike Ashley</mark> Talks between <mark>Mike Ashley</mark> and Amanda Staveley's PCP Partners over a potential takeover of Newcastle United have ended for now, Sky Sports News understands.\nA source close to <mark>Ashley</mark> told Sky Sports News: \"It is only right to let the fans know that there is no deal on the table or even under discussion with Amanda Staveley and PCP .\""}, {"articleID": "2017111415_00398221_W", "names": {"Sean Flynn": ["Q461502", "Q7441002"]}, "date": "2017-11-14", "url": "http://www.chicagonow.com/2017/11/whos-your-daddy/", "content": "Tweet By <mark>Sean Flynn</mark>, Monday at 1:28 pm Everyone needs an example, right?\nMeet The Blogger <mark>Sean Flynn</mark> <mark>Sean Flynn</mark> was raised in the West Pullman and Roseland neighborhoods on the Southside of Chicago.\nThe product of a single parent home, Mr. <mark>Flynn</mark> is the youngest of four boys.\nBesides the harsh life experiences sometimes learned in the streets Mr. <mark>Flynn</mark>'s upbringing consisted of family, friends, school or church.\nBeing a parent for Mr. <mark>Flynn</mark> wasn't just limited to his own children; he became a father figure to other young people whom he came in contact with as well.\nMr <mark>Flynn</mark>'s experience has included working for Chicago's Lighthouse for the Blind, THe Harris YMCA, Coaching Girls Basketball at Barnard Elementary, Mentoring youth at By The Hand Club for Kids, in addition to being a youth leader at the Joliet Church of God.\nMr. <mark>Flynn</mark> has had extensive training in youth development; some of which being S.E.L., Mental Health First Aid, Trauma and De Escalation training.\nMr. <mark>Flynn</mark> is a self published author of the book, \"The Manual - From Adolescence to Manhood\".\nWorking in the various southside communities is Mr. <mark>Flynn</mark>'s passion."}, {"articleID": "2012101108_00077909_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2012-10-11", "url": "http://thehindubusinessline.com/industry-and-economy/government-and-policy/article3987588.ece", "content": "the union cabinet, at a meeting chaired by prime minister <mark>manmohan singh</mark>, approved amendments to the indecent representation of women (prohibition) act (irwa), 1986, which also proposes to slap hefty fines on persons found guilty of such acts."}, {"articleID": "2008123014_00029918_W", "names": {"Abdul Razak": ["Q247730", "Q41251943", "Q4665681"]}, "date": "2008-12-30", "url": "http://idrisharon.wordpress.com/2008/12/30/felda-grads-look-ahead/", "content": "from left: mohammad jazlan, ruziana kliwon, rahimah masjan, norzazrina zainuddin and muhammad agus, winners of the dato' sri mohd najib tun <mark>abdul razak</mark> award for creativity and innovation, posing with their plaques.\n\"launched in 2005 by deputy prime minister datuk seri najib tun <mark>abdul razak</mark>, the generasi baru programme is designed to provide the next generation of felda settlers with tertiary education at limkokwing.\nthe connection was further amplified as she was awarded the dato' sri mohd najib tun <mark>abdul razak</mark> award for creativity and innovation .\""}, {"articleID": "2015110403_00113306_W", "names": {"Robert Bruce": ["Q26265218", "Q30604152", "Q43393721", "Q43910743", "Q53475332", "Q7342438", "Q7342439", "Q7342441", "Q7342444", "Q7342446", "Q7342447"]}, "date": "2015-11-03", "url": "http://thedailyjournal.com/story/news/2015/11/03/1st-district-goes-all-democrat/75093702/", "content": "CONNECT TWEET LINKEDIN COMMENTEMAILMORE The 1st Legislative District is moving back to full Democratic Party control as unofficial vote totals for Tuesday's election show Assemblyman <mark>Robert</mark> Andrzejczak and his first-time running mate, <mark>Robert Bruce</mark> Land, finishing in the top two spots."}, {"articleID": "2014122923_00039740_W", "names": {"Tom Russell": ["Q1345526", "Q20984552", "Q21461614", "Q27922619", "Q56696376"]}, "date": "2014-12-29", "url": "http://www.baldwincity.com/news/2014/dec/29/musing-hill-0101/", "content": "I only have to gaze upon <mark>Tom Russell</mark>'s wonderful \"Margaret's High Pasture,\" hanging in my living room."}, {"articleID": "2016081823_00090353_W", "names": {"Steve Green": ["Q16729431", "Q281452", "Q3973339", "Q3973340", "Q41773462", "Q43273454", "Q7612708", "Q7612709"]}, "date": "2016-08-18", "url": "http://www.stuff.co.nz/business/farming/83343715/Overseas-drinkers-quaff-New-Zealand-wines", "content": "New Zealand Winegrowers chairman <mark>Steve Green</mark> said this year marked the 21st in a row that wine exports had grown, and the industry was on target to reach its goal of $2b by 2020.\n\"This continued strong performance is testament to underlying market and consumer demand for our wines in key markets,\" <mark>Green</mark> said."}, {"articleID": "2011110900_00045093_W", "names": {"Robert Jenkins": ["Q38800320", "Q7346083"]}, "date": "2011-11-08", "url": "http://wdsu.com/news/29717047/detail.html", "content": "they knew (he) was my son, \"johnson said.defense attorney <mark>robert jenkins</mark> said johnson's constitutional right to privacy and the right to work may have been violated, and she could have grounds to sue the city of new orleans and serpas for defamation .\"\nif indeed they terminated her based on the comments of the chief of police, i think she does have a case, \"<mark>jenkins</mark> said .\"\n\"<mark>jenkins</mark> said johnson has a right to look into litigation."}, {"articleID": "2012042421_00064320_W", "names": {"Steve James": ["Q1798956", "Q2347045", "Q28857138", "Q3526952", "Q3973356", "Q3973438", "Q7612926", "Q7612927"]}, "date": "2012-04-24", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://finance.yahoo.com/news/u-steel-outlook-disappoints-stock-210313315.html", "content": "by <mark>steve james</mark> (reuters) - u.s. steel corp's (x) flat-rolled business could decline in the second quarter and the european economy is still a challenge, the company said on tuesday in a disappointing outlook that sent its stock down."}, {"articleID": "2011101005_00092557_W", "names": {"Sean Lee": ["Q12603093", "Q3476735", "Q53091300"]}, "date": "2011-10-10", "url": "http://post-gazette.com/pg/11283/1180995-143-0.stm?cmpid=psu.xml", "content": "linebacker khairi fortt had 1 1/2 sacks, defensive tackle devon still and defensive end <mark>sean</mark> stanley each had one and defensive end eric latimore was credited with half a sack.\nhodges eventually would like to play strongside linebacker, following the same path that was paved by former penn state standouts <mark>sean lee</mark> and navorro bowman on their way to the nfl."}, {"articleID": "2019052321_00251936_W", "names": {"Gretchen Peters": ["Q4818845", "Q51799886"]}, "date": "2019-05-23", "url": "http://blogs.houstonpress.com/music/things-to-do-jaimee-harris-will-perform-at-mucky-duck-with-mary-gauthier-11295374", "content": "He's how I got connected eventually to <mark>Gretchen Peters</mark>, Eliza Gilkyson and eventually Mary Gauthier.\nThe two met at a songwriting workshop led by Gauthier, Gilkyson and <mark>Peters</mark>."}, {"articleID": "2014031421_00026151_W", "names": {"Luis Rodriguez": ["Q1232924", "Q3266810", "Q3840413", "Q55092359", "Q6701065"]}, "date": "2014-03-14", "url": "http://thenewcivilrightsmovement.com/1-police-accused-of-pepper-spraying-handcuffing-and-beating-to-death-unarmed-non-violent-man/news/2014/03/14/84362", "content": "In Moore, Oklahoma, the <mark>Rodriguez</mark> family, <mark>Luis</mark>, 44, his wife Nair, and their 19-year old daughter went to the movies, but after a family fight, they left the movie and headed for the family car in the parking lot.\nWhat happened at that point is unclear, but what seems certain is that the mother and daughter had a minor altercation, and three police officers aided by two Oklahoma state game wardens moonlighting as security guards, pepper-sprayed <mark>Luis Rodriguez</mark>, took him down to the ground, handcuffed him, and beat him.\nHe doesn't move!,\" Nair <mark>Rodriguez</mark> in the video she recorded can be heard saying.\nBy the time the assault was over, <mark>Rodriguez</mark>, bloody and battered, was not moving.\nWhy were the cops so intent on beating <mark>Rodriguez</mark>, possibly to death?\nNewsOK notes that \"the family's attorney, Michael Brooks-Jimenez, made public the six-minute video shot by Nair <mark>Rodriguez</mark>.\nIn it, <mark>Luis Rodriguez</mark> doesn't appear to struggle or move while the officers detain him .\"\nNair <mark>Rodriguez</mark> can be heard asking her husband if he's OK while officers attempt to calm her down and repeatedly ask for her and her daughter's ID.\n\"I'm recording because this is too much,\" Nair <mark>Rodriguez</mark> tells them.\nWatch Nair <mark>Rodriguez</mark>'s video, but be warned, it is heartbreaking and extremely disturbing: More Digg Print Share on Tumblr Email Pin It Tagged as: excessive force, killed, <mark>Luis Rodriguez</mark>, Moore, Oklahoma, police brutality Friends: We invite you to sign up for our new mailing list, and subscribe to The New Civil Rights Movement via email or RSS."}, {"articleID": "2017112408_00570191_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"]}, "date": "2017-11-24", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-deal-live-13945677", "content": "Share By Kathryn Riddell Multimedia Journalist Sean Seddon Updated 08:27, 24 NOV 2017 News Share Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Chancellor <mark>Philip Hammond</mark> announced in the Budget on Wednesday that the North of Tyne devolution deal, worth an initial £ 600m and months in the planning, will be officially launched this week.\nChancellor Phillip <mark>Hammond</mark> this week announced a £ 337 million grant for the Tyne and Wear Metro, allowing a new fleet of 84 trains to be delivered by 2021.\nChancellor <mark>Philip Hammond</mark> has announced funding for a new fleet of Metro trains And he also said the Government had agreed with local council leaders to create a\" North of Tyne \"mayor and combined authority, with funding of £ 600 million over 30 years to start with.\n08:04 Kathryn Riddell Devolution deal to be launched this week Chancellor <mark>Philip Hammond</mark> announced in the Budget on Wednesday that the North of Tyne devolution deal, worth an initial £ 600m and months in the planning, will be officially launched this week.\nBudget Recap on key points from the Budget Chancellor Phillip <mark>Hammond</mark> delivered his Autumn 2017 Budget statement on Wednesday."}, {"articleID": "2018090910_00150284_W", "names": {"Carlos Ramos": ["Q19402537", "Q19966735", "Q3476506", "Q3660122", "Q5042526", "Q5042527", "Q57081680"]}, "date": "2018-09-09", "url": "https://www.newkerala.com/news/read/43966/serena-williams-points-at-sexism-in-controversial-defeat-in-us-open-final.html", "content": "Wiliams, who failed to clinch her seventh US Open title and 24th Grand Slam, directly accused the chair umpire, Portuguese <mark>Carlos Ramos</mark>, of sexism during a post-match press conference Saturday, reports Efe news.\n<mark>Ramos</mark> called out three violations against Williams in the second set: the first being a warning about receiving coaching, the second a penalty point for racket destruction and the third another penalty for verbal abuse for calling him a \"thief .\""}, {"articleID": "2018112907_00200051_W", "names": {"Jay Powell": ["Q20640929", "Q6167053"]}, "date": "2018-11-29", "url": "http://www.exchangerates.org.uk/news/23740/exchange-rates-update-today-british-pound-crash-warnings-euro-soft-dollar-mixed-to-soft-vs-g10-currencies.html", "content": "Pound Sterling Special Forecast: Bank of England predicts cumulative GBP Brexit losses of 34% It was a monster day for US stock markets as one of the most important people in global finance, whether it be Equity markets or Forex markets, Governor <mark>Jay Powell</mark> of the US Federal Reserve indicated that the period of FOMC tightening did possibly have an end in sight.\nThe statement that got the reaction was as follows, \"Interest rates are still low by historical standards, and they remain just below the broad range of estimates of the level that would be neutral for the economy ‑ ‑ that is, neither speeding up nor slowing down growth,\" This is what markets have been waiting for, and whether due to the Presidential pressure or some indications of waning inflation it appears that <mark>Powell</mark> is now taking his foot off the accelerator."}, {"articleID": "2017122121_00165968_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}, "date": "2017-12-21", "url": "http://www.newsmax.com/us/donald-trump-walter-reed-visit-soldiers/2017/12/21/id/833201/", "content": "According to White House Chief of Staff <mark>John Kelly</mark>--a retired Marine general--joined Trump on his visit."}, {"articleID": "2012031903_00068021_W", "names": {"Alex Gordon": ["Q16025008", "Q16136145", "Q25352122", "Q37583452", "Q4717069", "Q4717072", "Q997395"]}, "date": "2012-03-19", "url": "http://ohio.com/news/top-stories/tomlin-shelled-in-loss-to-royals-1.275257", "content": "<mark>alex gordon</mark> homered off tomlin with a runner on base in the first inning, jeff francoeur doubled in the same frame, and alcides escobar tripled home a run in the third.\na few got hit, including <mark>gordon</mark>'s home run, a single and a foul ball."}, {"articleID": "2013111523_00008046_W", "names": {"Cai Yong": ["Q45545953", "Q45575032", "Q45699895", "Q45725682"]}, "date": "2013-11-15", "url": "http://www.lex18.com/news/china-to-ease-one-child-policy-abolish-labor-camps/", "content": "\"It's great, finally the Chinese government is officially acknowledging the demographic challenges it is facing,\" said <mark>Cai Yong</mark>, an assistant professor of sociology at the University of North Carolina, Chapel Hill.\n\"Although this is, relatively speaking, a small step, I think it's a positive step in the right direction and hope that this will be a transition to a more relaxed policy and eventual return of reproductive freedom to the Chinese people,\" <mark>Cai</mark> said."}, {"articleID": "2013061210_00050350_W", "names": {"George Wallace": ["Q3101983", "Q43913855", "Q48817450", "Q5545830", "Q5545832", "Q5545834"]}, "date": "2013-06-12", "url": "http://www.ledger-enquirer.com/2013/06/11/2540957/richard-hyatt-commentary-a-front.html#storylink=rss", "content": "Richard Hyatt: An eventful year for the Muscogee County school board When Forrest Gump nervously peered over the shoulder of a fellow in a federally issued suit standing next to the feisty rooster that was <mark>George Wallace</mark>, Mike Raiford had seen enough.\nOn a day that his home state commemorated the 50th anniversary of <mark>Wallace</mark>'s defiant charade in the schoolhouse door, Raiford talked about a 17-year-old freshman from Phenix City that, on his first day at the University of Alabama, had a front-row seat to history.\n\"Everybody knew <mark>George Wallace</mark> was taking a stand against integration on Tuesday.\n\"Little <mark>George</mark>' took up his position to stand against the federal government--at least that's what they told us.\nAs his car crept past Raiford and his friends, <mark>Wallace</mark> waved and they waved back.\n<mark>Wallace</mark> went on to run for president three times, and at one campaign stop, he was seriously wounded, relegating him to a wheelchair for the last 26 years of his life."}, {"articleID": "2018092517_00197983_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2018-09-25", "url": "https://forums.macrumors.com/threads/apples-bud-tribble-to-offer-support-for-comprehensive-federal-privacy-legislation-at-senate-hearing-on-wednesday.2142912/", "content": "Back in June, Apple CEO <mark>Tim Cook</mark> said in an interview that privacy\" from an American point of view \"is one of the\" key civil liberties \"defining what it means to be American.\n<mark>Cook</mark> has also said multiple times that Apple's customers are not its product .\"\nWe could make a ton of money if we monetized our customers, \"<mark>Cook</mark> said in March .\""}, {"articleID": "2019041608_00541235_W", "names": {"Alexander Mcqueen": ["Q207939", "Q21014274"]}, "date": "2019-04-16", "url": "http://www.westerntelegraph.co.uk/news/national/17576445.francois-henri-pinault-the-fashion-mogul-married-to-the-hollywood-star/", "content": "Under his leadership the group sold off its retail assets including La Redoute and Printemps and merged with the Gucci Group, which oversees luxury brands including Gucci, Yves Saint Laurent and <mark>Alexander McQueen</mark>, to become one of the biggest players in high-end fashion."}, {"articleID": "2018082604_00109843_W", "names": {"Adam Brooks": ["Q28445574", "Q348885", "Q4678785"]}, "date": "2018-08-26", "url": "http://www.theadvocate.com.au/story/5607462/work-begins-on-godfreys-beach-penguin-platform/?src=rss", "content": "Braddon Liberal MHA <mark>Adam Brooks</mark> said the Tasmanian Government had provided $450,000 over two years and the Tourism Infrastructure in Parks project has funded $75,000 for project planning."}, {"articleID": "2014061817_00054060_W", "names": {"Michael Schumacher": ["Q1929281", "Q19707089", "Q9671"]}, "date": "2014-06-18", "url": "http://www.channelnewsasia.com/news/world/schumacher-was-awake-for/1174538.html", "content": "Seven-time F1 world champion <mark>Michael Schumacher</mark>.\n(AFP/File/Giuseppe Cacace) GENEVA: Formula One champion <mark>Michael Schumacher</mark> was conscious and had his eyes open during his top-secret transfer from a French hospital to a facility in Switzerland, Swiss newspaper Blick reported.\n<mark>Schumacher</mark> was moved on Monday after emerging from a coma following his devastating ski accident in December.\n<mark>Schumacher</mark> did not speak, but he communicated by nodding his head during the 200-kilometre (125-mile) journey, the paper said.\nThe paper said <mark>Schumacher</mark> had lost a lot of weight during his 170 days in hospital in the French city of Grenoble.\nIt is in the city of Lausanne, near where <mark>Schumacher</mark>'s wife Corinna and their two children live."}, {"articleID": "2016090412_00384483_W", "names": {"John Ross": ["Q11727979", "Q1701610", "Q19661432", "Q21063323", "Q27925053", "Q43380308", "Q43911093", "Q56254622", "Q6255678", "Q6255693", "Q6255697", "Q7252813"]}, "date": "2016-09-04", "url": "http://mysanantonio.com/news/article/3M-snow-melt-system-an-option-for-downtown-9202264.php", "content": "The Next Story Hawaii tourists salvage vacations during hurricane threats Texans activate J.J. Watt Rick Porcello tosses gem, Red Sox rout Athletics once again Last-minute touchdown lifts Western to season-opening victory Oak Ridge outlasts Elkins State court hands Houston cop killer a stay weeks before...Conner stars in return from cancer, Pitt tops Villanova 28-7 3 & out: Takeaways as Jake Browning, <mark>John Ross</mark> lead Huskies'...Astros' Brady Rodgers has rough outing in MLB debut UTSA notepad: Wilson impressed by Spirit Walk Today's Deals Powered by SHOP NOW Ozark Trail 10x10-Foot Gazebo w /...WalmartPosted 1 day 13 hr ago SHOP NOW Mainstays Essential True Colors Wash.. ."}, {"articleID": "2017030203_00391133_W", "names": {"Michelle Martin": ["Q2145289", "Q547953"]}, "date": "2017-03-02", "url": "http://stuff.co.nz/timaru-herald/sport/89916581/south-canterbury-rugby-union-returns-to-the-black", "content": "SCRU board: Ray Teahen (chairman), Brent Isbister, Steve McCoy, Grant Norton, <mark>Michelle Martin</mark>, Vaughan O'Shaughnessy, Jeremy Sutherland and Murray Roberts."}, {"articleID": "2010100813_00165036_W", "names": {"Graham Smith": ["Q17388770", "Q18737089", "Q20685584", "Q20873054", "Q28600236", "Q42575935", "Q43380296", "Q47498831", "Q55362421", "Q5593246", "Q5593247", "Q5593248", "Q5593249", "Q5593251", "Q5593252", "Q5593253", "Q5593254", "Q59478591", "Q640289"]}, "date": "2010-10-08", "url": "http://times-series.co.uk/news/topstories/8440951.Council_being_monitored_over_handling_of_FOI_requests/?ref=rss", "content": "ico deputy commissioner <mark>graham smith</mark> said:\" we will monitor the authorities for three months, but may take action during this timeframe if an authority's standard of compliance is revealed to be particularly poor, or if it is unwilling to make the improvements necessary."}, {"articleID": "2020010800_00114213_W", "names": {"Ben Wallace": ["Q263166", "Q295364"]}, "date": "2020-01-08", "url": "http://www.expressandstar.com/news/uk-news/2020/01/08/boris-johnson-to-face-questions-from-mps-on-deepening-crisis-in-gulf/", "content": "The PM came under fire for his failure to address the Commons on the Iran situation on Tuesday, with Jeremy Corbyn accusing him of\" hiding behind \"the Defence Secretary <mark>Ben Wallace</mark>.\nMr <mark>Wallace</mark> said non-essential personnel had been moved out of Baghdad while Royal Navy warships and military helicopters were on heightened readiness to assist if needed.\nBritish forces in the Middle East (PA Graphics) Mr <mark>Wallace</mark> said the safety and security of UK nationals and interests in the region were of\" paramount concern \"."}, {"articleID": "2015101519_00104699_W", "names": {"Travis Brown": ["Q7836210", "Q7836211", "Q7836212"]}, "date": "2015-10-15", "url": "http://kulr8.com/story/30270240/tester-introduces-new-bill-supporting-rural-education", "content": "For beef producers like <mark>Travis Brown</mark>, fall is both the busiest and most exciting time of year.\nHere's how <mark>Brown</mark> expects the beef industry to react after new USDA rules this year regarding beef trade and labels.\nFor beef producers like <mark>Travis Brown</mark>, fall is both the busiest and most exciting time of year.\nHere's how <mark>Brown</mark> expects the beef industry to react after new USDA rules this year regarding beef trade and labels."}, {"articleID": "2019012916_00141238_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}, "date": "2019-01-29", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/may-urges-mps-to-give-her-strong-mandate-to-renegotiate-brexit-37761521.html", "content": "Northern Ireland <mark>May</mark> urges MPs to give her strong mandate to renegotiate Brexit The Prime Minister was addressing the House of Commons ahead of a crucial set of votes on the way ahead for EU withdrawal.\n<mark>May</mark> urges MPs to give her strong mandate to renegotiate Brexit BelfastTelegraph.\nco. uk <mark>Theresa May</mark> has urged MPs to give her \"the clearest possible mandate\" to go back to Brussels and reopen Brexit negotiations with the aim of replacing the controversial backstop.\nhttps: //www.belfasttelegraph.co.uk/news/northern-ireland/may-urges-mps-to-give-her-strong-mandate-to-renegotiate-brexit-37761521.html Email <mark>Theresa May</mark> has urged MPs to give her \"the clearest possible mandate\" to go back to Brussels and reopen Brexit negotiations with the aim of replacing the controversial backstop.\nOpening a crucial day of debate in the House of Commons, Mrs <mark>May</mark> said MPs had made clear what they did not want when they rejected her Withdrawal Agreement by a 230-vote margin earlier this month, but now it was time for them to tell Brussels what they do want.\nThe Commons chamber was packed as the day's debate on Brexit began (PA) In an attempt to fend off possible rebellion by Tories seeking to avoid a no-deal departure, Mrs <mark>May</mark> promised that Tuesday's votes would not be MPs' final chance to pass judgment on EU withdrawal.\nMrs <mark>May</mark> acknowledged that the Commons defeat of the Withdrawal Agreement she agreed with EU leaders last November had been \"decisive\".\nA cross-party amendment tabled by Yvette Cooper was selected for debate (PA) Mrs <mark>May</mark> said it was time for Parliament to \"speak as one\".\n\"Mrs <mark>May</mark>'s hopes of securing a majority for the Brady amendment were boosted when former foreign secretary and Brexit figurehead Boris Johnson said he would\" gladly \"vote for it, if it meant legally binding changes to the backstop.\nMrs <mark>May</mark> is expected to have phone discussions with key EU leaders over the course of the day, with votes taking place in the early evening.\n\"But Mrs <mark>May</mark>'s official spokesman said:\" There is a very clear message from the EU's leaders that they want the UK to leave with a deal and that they understand this is in the best interests of the EU as well as the UK.\n\"(PA Graphics) Tory MPs were told at a meeting with Mrs <mark>May</mark> on Monday evening that they would be whipped to support the Brady amendment.\nBut it was far from clear whether this instruction would be followed by enough of the 118 Conservatives who rebelled against Mrs <mark>May</mark>'s deal on January 15.\nRemain-backing Tories <mark>may</mark> rally behind the Cooper-Boles amendment, while other proposals <mark>may</mark> gain cross-party support, including a plan by Conservative Caroline Spelman and Labour's Jack Dromey to rule out a no-deal Brexit.\nMPs rejected <mark>Theresa May</mark>'s EU withdrawal deal by a record margin of 230 votes earlier this month (Mark Duffy/UK Parliament/PA) Meanwhile, a compromise drafted by Conservative MPs from both the Remain and Leave sides of the party won the crucial backing of the Democratic Unionist Party."}, {"articleID": "2015100512_00084155_W", "names": {"Clive Barker": ["Q298761", "Q3680861", "Q5134490"]}, "date": "2015-10-05", "url": "http://kickoff.com/news/59432/clive-barker-gives-abia-nale-another-trial-at-maritzburg-united", "content": "<mark>Clive Barker</mark> gives Abia Nale another trial at Maritzburg United Posted: 5 October 2015 Time: 14:25 Print this article New Maritzburg United coach <mark>Clive Barker</mark> has handed Abia Nale another trial at the club.\nprioritised hiring a replacement for sacked coach Mandla Ncikazi However, <mark>Barker</mark> has now requested a second look at Nale, who he previously worked with at Mpumalanga Black Aces.\n\"I love Nale, he's a terrific player and he can play wide,\" says <mark>Barker</mark>.\n<mark>Barker</mark> is currently reliant on the likes of Kurt Lentjies and on-loan midfielder Siyabulela Shai for creativity in the final third."}, {"articleID": "2010091107_00131116_W", "names": {"Mohammed Ali": ["Q16002506", "Q6854083"]}, "date": "2010-09-11", "url": "http://topnews.in/dhobi-ghat-wows-toronto-film-festival-2274236", "content": "recalling her most difficult moments during the shooting, she said filming the crowded eid scene on <mark>mohammed ali</mark> road during ramadan last year was one of those tough moments."}, {"articleID": "2015101318_00071739_W", "names": {"Kevin James": ["Q22278351", "Q44561", "Q6396595", "Q6396597", "Q6396599", "Q6396601"]}, "date": "2015-10-13", "url": "http://www.publicopiniononline.com/nation-world/ci_28962814/man-convicted-dallas-officers-2001-death-faces-execution", "content": "Licho Escamilla's bullets twice struck Christopher <mark>Kevin James</mark>, among four uniformed Dallas officers working off-duty security that 2001 Thanksgiving weekend, knocking him to the ground.\nEscamilla then calmly walked up to <mark>James</mark> and pumped three more shots into the back of his head before running and exchanging shots with other officers, witnesses said.\nAdvertisement A warrant had been issued for Escamilla in the shooting death of a West Dallas neighbor nearly three weeks before <mark>James</mark>' death on Nov. 25, 2001.\nEscamilla's trial attorneys told jurors he was responsible for <mark>James</mark>' slaying but argued it didn't merit a death sentence because <mark>James</mark> was not officially on duty, meaning the crime didn't qualify as a capital murder.\n<mark>James</mark>, 34, had earned dozens of commendations during his nearly seven years on the Dallas police force after graduating at the top of his cadet class."}, {"articleID": "2010021504_00090364_W", "names": {"Karan Singh": ["Q1234662", "Q16887704", "Q18921535"]}, "date": "2010-02-15", "url": "http://blog.taragana.com/health/2010/02/14/indian-data-on-swine-flu-shamefully-inadequate-virologist-19406/", "content": "inaugurated by iccr president <mark>karan singh</mark> and malaysia's human resource minister s. january 19th, 2010 new delhi - the indian capital wednesday reported eight new swine flu cases, taking the total number in the city to 9,608, an official said .\""}, {"articleID": "2012111303_00007245_W", "names": {"Justin Hawkins": ["Q3190452", "Q552608"]}, "date": "2012-11-13", "url": "http://blogs.siliconindia.com/beatsbydre08/Corruption/beats-by-dre-solo-hd-cheap-bid-6K9uY21z43420838.html", "content": "these will come in handy in and around the campground.the darkness's <mark>justin hawkins</mark> is one of the top rock songwriters of the 2000s, not only penning such darkness classics as\" love on the rocks with no ice, \"diamond rings melds elements of pop, rock, electro, indie and punk beats by dre tours with deep, sinister vocals that can be as earnest as they are evil."}, {"articleID": "2013061211_00034921_W", "names": {"Stephen King": ["Q25183273", "Q27983592", "Q2832846", "Q39829", "Q7609688", "Q7609689", "Q7609690"]}, "date": "2013-06-12", "url": "http://www.timesfreepress.com/news/2013/jun/12/stephen-king-john-mellencamp-break-rules-ghost-bro/", "content": "<mark>Stephen King</mark>, T Bone Burnett and John Mellencamp, from left, collaborated on the musical \"Ghost Brothers of Darkland County .\"\n<mark>Stephen King</mark> and John Mellencamp had a simple problem when they started the long odyssey to create a musical.\n<mark>King</mark> says he might have given up long ago had Mellencamp not kept rolling things forward.\n\"This morning when I went over to my office there was a big stack of the box sets and I looked at that thing and said,\" We actually have a product here,' \"<mark>King</mark> says .\"\nThe agent suggested the ghost story could serve as the basis for that musical, and suggested they contact mutual client <mark>King</mark> to help write it.\n<mark>King</mark> and Mellencamp had met a few times over the years, and to Mellencamp's surprise the idea quickly took root.\nIt was just the kind of challenge <mark>King</mark> likes .\"\nOnce you get to a certain age - I'm in my 60s now - you've got to try to keep expanding your field, \"<mark>King</mark> says .\"\nI just feasted on that because I'm a big rock music fan and country music fan and alt-rock fan and all that stuff, and I thought, that's what music does, \"<mark>King</mark> says .\"\n\"<mark>King</mark> roughed out the story about two generations of brothers in fictional Lake Belle Reve, Miss., caught in a tragic tape loop and marked out spaces for songs, sometimes including a little rhyme to give Mellencamp cues.\nThey're real powerful tunes, and real stripped down, of-the-earth type tunes ....John and <mark>Stephen</mark> work a lot of the same turf, the legends of small-town America, that stuff."}, {"articleID": "2011051310_00082131_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2011-05-13", "url": "http://wcyb.com/health/27873895/detail.html", "content": "romney insisted that his reform would \"share some of the objectives\" of the plan proposed by house budget committee chair <mark>paul ryan</mark>, which he touted as including choice, inserting market dynamics, and keeping medicare solvent."}, {"articleID": "2019090216_00143420_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2019-09-02", "url": "https://thelincolnite.co.uk/2019/09/punish-a-muslim-letter-lincoln-white-supremacist-faces-jail/", "content": "As previously reported, <mark>David</mark> Parnham, 36, of St Andrews Close in Lincoln was arrested by Counter Terrorism Policing North East, supported by Lincolnshire Police in June 2018.\nThis also contained white power and made an apparent reference to reports of attacks by people dressed as clowns Parnham also sent \"Punish a Muslim Day\" hate mail urging people to earn points by attacking and killing muslims Letters full of white powder were also sent addressed to former PM <mark>David Cameron</mark> and the Tory peer Lord Ahmed of Wimbledon, as well as a number of mosques.\nThe letter to <mark>Cameron</mark> contained the phrase \"Allah is great\"."}, {"articleID": "2015112902_00057766_W", "names": {"Mark Jones": ["Q15072754", "Q15222722", "Q17523860", "Q22005690", "Q3294123", "Q3849506", "Q3849511", "Q6768275", "Q6768277", "Q6768278", "Q6768280", "Q6768281", "Q6768282", "Q6768283", "Q6768284", "Q6768285", "Q6768286", "Q6768287", "Q6768289", "Q934587"]}, "date": "2015-11-29", "url": "http://www.sandiegouniontribune.com/news/2015/nov/28/back-story-community-policing/", "content": "Back story: Going deep on community policing By Union-Tribune | 6:11 p.m. Nov. 28, 2015 Assistant Police Chief <mark>Mark Jones</mark> (left) and other officers support Special Olympics qualifiers in Rancho Bernardo this month .--Charlie Neuman Assistant Police Chief <mark>Mark Jones</mark> (left) and other officers support Special Olympics qualifiers in Rancho Bernardo this month .--Charlie Neuman Share Photo ✉ Q: What was the origin for this story?"}, {"articleID": "2019102813_00196098_W", "names": {"John Collins": ["Q10387544", "Q20645386", "Q20984420", "Q22979302", "Q26254380", "Q28935742", "Q29438451", "Q30122510", "Q47504584", "Q51586365", "Q52154681", "Q57413181", "Q57437992", "Q6111740", "Q6226714", "Q6226717", "Q6226721", "Q6226723", "Q6226726", "Q6226733", "Q720921", "Q961079"]}, "date": "2019-10-28", "url": "http://www.wsbtv.com/sports/trae-young-wanted-to-start-the-season-off-strong-hes-done-that-and-more/1002277577?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Sure, <mark>John Collins</mark> had missed the first 15 games of last season with an ankle injury, and the chemistry he and Young developed upon his return was key for the Hawks, but Young wasn't buying that as an excuse."}, {"articleID": "2017071911_00111666_W", "names": {"Marcus Jones": ["Q16214908", "Q56946668", "Q6758258", "Q6758259", "Q750398"]}, "date": "2017-07-19", "url": "http://www.kwqc.com/content/news/Mother-of-slain-Davenport-teen-to-hold-Justice-for-Marcus-Jones-event-435360083.html", "content": "DAVENPORT, Iowa (KWQC) - Anthony \"<mark>Marcus</mark>\" <mark>Jones</mark>, 17, was murdered in August of 2014.\nFor the third year, <mark>Jones</mark>' mother Kerri Nunn will host an annual outdoor event at Cork Hill Park.\nJustice for <mark>Marcus Jones</mark> will have guest speakers on addiction, suicide prevention, bullying and gun violence.\n\"The event is to keep <mark>Marcus</mark>' name out in the public because his killer has never been found,\" said Nunn.\nT-shirts saying \"Justice for <mark>Marcus</mark>\" and \"Stop the Violence\" will be sold--helping to fund future events.\nJustice for <mark>Marcus Jones</mark> is happening at 5 p.m. on Thursday, August 10 at Cork Hill Park."}, {"articleID": "2012070213_00087197_W", "names": {"Hiroshi Sato": ["Q1313589", "Q3244916"]}, "date": "2012-07-02", "url": "http://avatar.wikia.com/wiki/Talk:Shipping/@comment-72.80.90.63-20120701152715/@comment-82.154.36.209-20120702132934", "content": "days later, bolin aided asami to defeat <mark>hiroshi sato</mark> by sending earth boulders to <mark>hiroshi sato</mark>'s mecha tank.\nafter korra and mako left to fight amon, iroh and asami, along with bolin, naga, and pabu, went to attack the equalist's airfield, but were captured by <mark>hiroshi</mark>."}, {"articleID": "2012082414_00093211_W", "names": {"Scott Daniels": ["Q1719941", "Q7436212", "Q7436213"]}, "date": "2012-08-24", "url": "http://futuresmag.com/2012/08/24/apple-counts-on-iphone-being-too-cool-for-us-to-ba?ref=rss", "content": "\"neat' products\" the commission is under some political pressure not to keep \"neat' products out of the country,\" said <mark>scott daniels</mark> of westerman hattori in washington, who does itc cases."}, {"articleID": "2012083114_00082196_W", "names": {"Ross Taylor": ["Q19325418", "Q26820844", "Q7369657", "Q7369663"]}, "date": "2012-08-31", "url": "http://zeenews.india.com/sports/cricket/india-vs-new-zealand-2012/we-ll-look-to-score-450-and-take-early-wickets-guptill_748235.html", "content": "\"<mark>ross</mark> (<mark>taylor</mark>) showed some excellent footwork,\" he added.\nguptill also praised his captain <mark>ross taylor</mark> for scoring a brisk 113 and said he is a class player and his presence in the middle makes things a lot easier for the next batsmen."}, {"articleID": "2018050101_00197576_W", "names": {"Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}, "date": "2018-04-30", "url": "http://triblive.com/usworld/world/13600551-74/jhoon-rhee-father-of-american-taekwondo-dies-at-age-86", "content": "\"He also befriended boxer <mark>Muhammad Ali</mark>.\nChun Rhee said that during a 1976 sports awards ceremony, his father jokingly challenged <mark>Ali</mark> and basketball legend Wilt Chamberlain to a fight to settle which one of them was\" the greatest \"athlete .\""}, {"articleID": "2018010409_00071074_W", "names": {"Kate Hudson": ["Q169946", "Q6375550"]}, "date": "2018-01-04", "url": "http://www.fashion.ie/fabletics-demi-lovato-new-collaboration/", "content": "The \"Confident' beauty has teamed up with <mark>Kate Hudson</mark>'s label for the third time, and her latest range includes footwear and two athletic bags for the first time."}, {"articleID": "2018120622_00477024_W", "names": {"James Stewart": ["Q16214641", "Q16236569", "Q21457696", "Q23618352", "Q2706595", "Q43394132", "Q43395260", "Q43911566", "Q4444819", "Q4444825", "Q6137399", "Q6143635", "Q6143644", "Q6143657", "Q6143663"]}, "date": "2018-12-06", "url": "https://www.cbc.ca/news/canada/windsor/local-444-women-violence-massacre-anniversary-1.4935681?cmp=rss", "content": "(Dale Molnar/CBC) Those names they're remembering are only several\" out of thousands \"who have faced violence, said <mark>James Stewart</mark>, secretary-treasurer at Local 444.\nIt starts with building a culture that's equitable, that's when violence will stop, \"said <mark>Stewart</mark>."}, {"articleID": "2019111615_00127480_W", "names": {"Abdul Hamid": ["Q3246667", "Q4665391", "Q46996242", "Q47118441", "Q938136"]}, "date": "2019-11-16", "url": "http://bernama.com/en/news.php?id=1790463", "content": "Central Seberang Perai district police chief (ACP) Nik Ros Azhan Nik <mark>Abdul Hamid</mark> said the theft was only discovered at about 9am, after the 33-year-old houseowner and his family members returned from the Bukit Mertajam market to find the maid gone."}, {"articleID": "2008090919_00011655_W", "names": {"Francis Harvey": ["Q3081481", "Q5481239"]}, "date": "2008-09-09", "url": "http://blog.myspace.com/index.cfm?fuseaction=blog.view&friendID=45627880&blogID=431544820", "content": "that means that they are relieved of the obligation to [give] cost and purchasing data to military auditors,\" sen. mccain told army secretary <mark>francis harvey</mark> during a march 3, 2006 senate armed services committee hearing."}, {"articleID": "2010041107_00069643_W", "names": {"Zhao Yue": ["Q21017044", "Q45407237", "Q45453748", "Q45468296", "Q45470855", "Q45472212", "Q45473689", "Q45475462", "Q45507264", "Q45523835", "Q45528284", "Q45555514", "Q45573666", "Q45592285", "Q45596062", "Q45596786", "Q45606751", "Q45608807", "Q45612186", "Q45648080", "Q45653293", "Q45669953", "Q45672330", "Q45725796"]}, "date": "2010-04-11", "url": "http://in.news.yahoo.com/32/20100411/1067/twl-behind-the-bamboo-dome.html", "content": "\"most chinese people have never been abroad but now they can see the world in their home,\" <mark>zhao yue</mark> ting, a senior engineer of the state-owned china jingye engineering corporation building india's pavilion, told the hindustan times, quoting a shanghai government propaganda line."}, {"articleID": "2018031209_00054183_W", "names": {"Sophie Turner": ["Q240573", "Q735034"]}, "date": "2018-03-12", "url": "https://geektyrant.com/news/x-men-dark-phoenix-set-photo-shows-us-the-team-in-their-comic-accurate-costumes", "content": "A new photo from the set includes Cyclops (Tye Sheridan), Jean Grey (<mark>Sophie Turner</mark>), Quicksilver (Evan Peters), Storm (Alexandra Shipp), Nightcrawler (Kodi Smit-McPhee), Beast (Nicholas Hoult) and Mystique (Jennifer Lawrence)."}, {"articleID": "2016093004_00581256_W", "names": {"Anthony Steen": ["Q14202166", "Q4773519"]}, "date": "2016-09-30", "url": "http://www.usatoday.com/story/sports/nfl/2016/09/30/dolphins-depleted-offensive-line-pushed-around-in-22-7-loss/91309300/", "content": "Left tackle Branden Albert and center <mark>Anthony Steen</mark> were inactive with sprained ankles suffered during the win over Cleveland."}, {"articleID": "2018060605_00077363_W", "names": {"Doug Parker": ["Q5300803", "Q5300806"]}, "date": "2018-06-06", "url": "http://www.chinchillanews.com.au/news/airfares-could-get-more-expensive-due-to-rising-fu/3434722/", "content": "With fuel making up around 25 per cent of an airline's costs, they will be forced to drive up the price of their fares to cope, American Airlines chief executive officer <mark>Doug Parker</mark> warned.\nIt's not the first time Mr <mark>Parker</mark>, who leads the world's largest airline, has warned about having to pass on the rising cost of fuel to passengers."}, {"articleID": "2019032921_00859881_W", "names": {"Colin Wilson": ["Q1108757", "Q1708464", "Q20018732", "Q21465762", "Q358746", "Q368831", "Q505667", "Q5145685", "Q5145686", "Q5145687"]}, "date": "2019-03-29", "url": "https://denver.cbslocal.com/2019/03/29/colorado-avalanche-gabriel-landeskog-2/", "content": "(Photo by Bruce Bennett/Getty Images) Landeskog will lineup with Carl Soderberg and <mark>Colin Wilson</mark> against the Arizona Coyotes."}, {"articleID": "2014042009_00036209_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}, "date": "2014-04-20", "url": "http://wabi.tv/2014/04/19/record-store-day-popular-bangor/?utm_source=rss&utm_medium=rss&utm_campaign=record-store-day-popular-bangor", "content": "The event was an idea from a Bull Moose employee, <mark>Chris Brown</mark>."}, {"articleID": "2019100717_00408405_W", "names": {"Mr. Mike": ["Q16214090", "Q1951427"]}, "date": "2019-10-07", "url": "http://www.keyt.com/lifestyle/south-african-student-fights-animal-poaching-using-wildlife-photos/1129828096", "content": "<mark>Mike</mark> Kendrick, director of Wild Shots Outreach met with a school group led by Ngomane in 2018 and taught them to shoot videos and stilt photos for free.\n\"At first I didn't want to share my photos but <mark>Mr."}, {"articleID": "2018110106_00013516_W", "names": {"Marco Silva": ["Q20118419", "Q57025699", "Q6757714"]}, "date": "2018-10-31", "url": "http://www.msn.com/en-gb/lifestyle/style/this-is-the-real-reason-your-jeans-have-those-studs-on-the-pockets/vi-BBPchHb?srcref=rss", "content": "Chocolate fashion show opens Salon du Chocolat in Paris Dailymotion Royal Blue: Can <mark>Marco Silva</mark> afford to give Kevin Mirallas another chance?"}, {"articleID": "2014012111_00002265_W", "names": {"Jack Sanders": ["Q11977805", "Q31280199"]}, "date": "2014-01-20", "url": "http://whattheythink.com/news/66944-sonoco-dedicates-75-million-biomass-boiler-facility/?utm_source=whattheythink&utm_medium=rss&utm_campaign=rss", "content": "\"A key part of Sonoco's culture is our commitment to sustainability, including our dedication to improving the environment and our contributions to the future of the communities in which we operate,\" said Sonoco President and Chief Executive Officer <mark>Jack Sanders</mark>."}, {"articleID": "2014051005_00038930_W", "names": {"Dan Jones": ["Q16730398", "Q16730399", "Q20127891", "Q21466301", "Q21621611", "Q5213766", "Q5213767", "Q5213769"]}, "date": "2014-05-09", "url": "http://www.cleveland.com/metro/index.ssf/2014/05/cleveland_metroparks_zoos_caro.html", "content": "<mark>Dan Jones</mark>, co-founder of the company, said the zoo insisted that no animal could have a traditional saddle.\n<mark>Jones</mark> said each figure takes up to a month, but there are enough in the production pipeline that five to seven are ready to go each week.\n<mark>Jones</mark> said the company made one for the Bronx Zoo and all of the critters were bugs."}, {"articleID": "2015012907_00026041_W", "names": {"Larry Jones": ["Q16227670", "Q16730409", "Q6490591", "Q6490592", "Q742049"]}, "date": "2015-01-28", "url": "http://www.multihousingnews.com/cities/indianapolis/teagan-development-to-redevelop-historic-industrial-complex-in-indianapolis-2/1004114107.html", "content": "\"This building and this location have the bones for what I call the next overnight sensation,\" <mark>Larry Jones</mark>, the company president, told the newspaper."}]